[
  {
    "url": "https://bdjobs.com/h/details/1458924?ln=1",
    "company_name": "Institute of Applied Health Sciences Hospital(IAHS-H) USTC Complex, Foy’ Lake, Khulshi, Chattogram",
    "job_title": "Assistant Director",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "5 to 6 years",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "Assistant Director : Institute of Applied Health Sciences Hospital(IAHS-H) USTC Complex, Foy’ Lake, Khulshi, Chattogram Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Institute of Applied Health Sciences Hospital(IAHS-H) USTC Complex, Foy’ Lake, Khulshi, Chattogram Assistant Director Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Location: Chattogram Salary: Negotiable Experience: 5 to 6 years Published: 12 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Master Degree/MBA from recognised university. The incumbent must have at least 5-6 years of experience in HealthCare Industry. Experience 5 to 6 years The applicants should have experience in the following business area(s): Hospital Additional Requirements Good managerial and organizational skills, as well as excellent medical knowledge and training, Responsibilities & Context Applications are invited from energetic, self-motivated and experienced candidates for the position of Assistant Director, IAHS-H on the prevailing terms and conditions. Job Responsibilities Supporting the Hospital Director/Dy Director in ensuring smooth day-to-day operations of the hospital. Assisting in planning, organizing, and directing overall hospital operations to achieve strategic and operational objectives. Contributing to the development, implementation, and review of hospital policies, procedures, and protocols. Monitoring and evaluating hospital performance metrics (e.g., patient flow, efficiency, costs). Facilitating effective cross-departmental coordination to optimize patient care and resource utilization. Assistng in resolving interdepartmental issues and promoting a collaborative work environment. Serving as a liaison between hospital leadership and external stakeholders, including government agencies, vendors, and partners. Supporting recruitment, onboarding, training, and performance evaluation of hospital staff in coordination with HR department. Assisting in budgeting, financial planning, and cost control initiatives. Ensuring compliance with healthcare regulations, safety standards, and accreditation requirements. Participating in quality improvement programs, audits, and performance reviews. Monitoring infection control practices and patient safety initiatives to maintain high standards of care. Contributing to short-term and long-term strategic planning of hospital services and infrastructure. Monitoring patient feedback and satisfaction levels to identify areas for improvement. Working closely with clinical teams to address and resolve patient concerns. Promoting and upholding a culture of patient-centered care and service excellence. Executing any other duties assigned by the authority. Workplace Work at office Employment Status Full Time Job Location Chattogram Read Before Apply Application in plain paper al"
  },
  {
    "url": "https://bdjobs.com/h/details/1458915?ln=1",
    "company_name": "Megamind",
    "job_title": "Executive",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Executive : Megamind Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Megamind Executive Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 20 to 28 years Location: Dhaka (Banasree) Salary: Tk. 13000 - 18000 (Monthly) Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Additional Requirements Age 20 to 28 years Responsibilities & Context Education Bachelor/Honors Minimum undergraduate completed Additional Requirements Age 20 to 28 years Good English writing Moderate English speaking Good computer skills (MS Office, email, online work) Willing to go outside office for B2B programs/events Responsibilities & Context Office Time: 11:00 AM – 8:00 PM Working Days: 6 days/week Probation Period: 3–6 months (adjustable) Role: Assist students with study abroad processes Handle applications, emails, and documentation Support counselling and coordination tasks Skills & Expertise Communication in English Data Entry (Both English & Bengali) Microsoft Office Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Banasree) Company Information Megamind Follow Address: House#11, Main Road, Block-B, Banasree, Rampura, Dhaka-1219 Skills & Expertise Data Entry (Both English & Bengali) Good English communication skills (verbal and Written) Microsoft Office Compensation & Other Benefits Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Banasree) Company Information Megamind Follow Address: House#11, Main Road, Block-B, Banasree, Rampura, Dhaka-1219 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করু"
  },
  {
    "url": "https://bdjobs.com/h/details/1458906?ln=1",
    "company_name": "US-Bangla Medical College Hospital.",
    "job_title": "Asst. Manager/ Sr. Executive (Customer Care)",
    "location": "Narayanganj (Rupganj)",
    "salary": null,
    "experience": "2 to 5 years",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Asst. Manager/ Sr. Executive (Customer Care) : US-Bangla Medical College Hospital. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List US-Bangla Medical College Hospital. Asst. Manager/ Sr. Executive (Customer Care) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 06 Age: 25 to 35 years Location: Narayanganj (Rupganj) Salary: Negotiable Experience: 2 to 5 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Additional Training or Qualifications in the relevant discipline will be given preference. Experience 2 to 5 years The applicants should have experience in the following business area(s): Hospital Additional Requirements Age 25 to 35 years Should have sound updated knowledge and latest information about Health care system, medical college hospitals, corporate hospitals, pharmaceuticals sector. Candidate should be proficient in using Microsoft Office. Should have a good command of both English & Bangla with good speaking and writing skills. Should be enthusiastic, pro-active, dedicated, punctual, hard-working, and well fit. Should have good interpersonal & presentation skills. Responsibilities & Context The US-Bangla Medical College Hospital is seeking energetic, dynamic, skilled, professional & well-experienced personnel for the position of Assistant. Manager/ Sr. Executive (Customer Care). Skills & Expertise Customer Service Customer Relations Patient management Customer Relationship Management Customer Handling Compensation & Other Benefits Over time allowance,Medical allowance,Mobile bill Lunch Facilities: Partially Subsidize Festival Bonus: 2 Employment Status Full Time Job Location Narayanganj (Rupganj) Read Before Apply Express your interest with a complete RESUME with two recent photographs along with a cover letter addressed to The Director, US-Bangla Medical College Hospital, 17, Kornogop, Rupshi, Rupganj, Narayanganj, on or before February 25, 2026. Candidates may also send their Resume by post or e-mail to career@usbmch.com Company Information US-Bangla Medical College Hospital. Follow Address: 17,Kornogop,Rupshi,Rupganj,Narayanganj Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now"
  },
  {
    "url": "https://bdjobs.com/h/details/1458922?ln=1",
    "company_name": "Studio Click House Ltd.",
    "job_title": "Creative Graphic Designer & Video Editor",
    "location": "Dhaka (Demra)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Creative Graphic Designer & Video Editor : Studio Click House Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Studio Click House Ltd. Creative Graphic Designer & Video Editor Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 12 Age: 18 to 30 years Location: Dhaka (Demra) Salary: Negotiable Experience: 1 to 3 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education HSC Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Advertising Agency, Design/Printing/Publishing, IT Enabled Service, Web Media/Blog, Professional Photographers, DTP House, E-commerce Freshers are also encouraged to apply. Additional Requirements Age 18 to 30 years Responsibilities & Context Create engaging video and image advertisements Design 3D mockups and motion graphics. Perform Clipping Path, Masking, Retouching, Color Correction, and Jewelry Retouching. Ensure high-quality work while meeting deadlines. Follow instructions and maintain accuracy. Ensure all final ads meet client specifications and formatting guidelines. Software Skills Required: Adobe Photoshop Adobe Illustrator Adobe InDesign Adobe After Effects Other relevant design and video editing tools Skills & Expertise Graphices Desiner Quality Control Video Editor Compensation & Other Benefits Provident fund,Tour allowance,Over time allowance,Performance bonus Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Salary: Negotiable (based on education, experience, skills, and interview performance) Career growth and professional development opportunities. Other facilities as per industry standards. Workplace Work at office Employment Status Full Time Job Location Dhaka (Demra) Job Highlights HSC Bachelor/Honors Educational qualifications can be relaxed if you are an expert in the graphics industry. Apply Procedure Email Your CV Send your CV to the given email hr@studioclickhouse.com or Email your CV from My Bdjobs account Company Information Studio Click House Ltd. Follow Address: AB Tower, Holding: 112/11, West Boxnagar, Word: 67, Demra, Dhaka-1361 Website: https://studioclickhouse.com/ Business: LET’S INTRODUCE OURSELVES\n\nHey there! Welcome to Studio Click House, your go-to spot for top-notch image post-production. We consider ourselves the House of Experienced Graphic Designers! Since our launch in 2022, we’ve specialized in image editing, aiming to provide high-quality design services at affordable prices—all while saving you time.\n\nWe pride ourselves on our efficient work and focus on meeting our clients' needs. We embrace challenges and strive for complete client satisfaction. Our clients range from photographers and agencies to online shops and retaile"
  },
  {
    "url": "https://bdjobs.com/h/details/1458911?ln=1",
    "company_name": "Emami Bangladesh Ltd.",
    "job_title": "Data Analytics and Digital Transformation Lead",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 8 years",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Data Analytics and Digital Transformation Lead : Emami Bangladesh Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Emami Bangladesh Ltd. Data Analytics and Digital Transformation Lead Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Experience: At least 8 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 8 years The applicants should have experience in the following business area(s): Manufacturing (FMCG), Multinational Companies, Cosmetics/Toiletries/Personal Care Responsibilities & Context Ensure seamless integration with existing systems. Develop predictive models and dashboards for forecasting, pipeline management, and performance tracking. Implement advanced analytics tools (e.g., Tableau, Power BI, SQL, Python) to support decision-making. Design and execute transformation strategies to modernize processes, tools, and methodologies. Assess current automation systems and AI adoption in sales operations for efficiency and scalability. Collaborate with marketing, finance, and operations to align analytics and transformation initiatives with business objectives. Provide actionable insights to leadership for strategic decision-making. Collaborate with cross-functional teams to implement best practices in current processes. Develop training programs and communication plans to ensure smooth adoption of new processes and tools. Skills & Expertise Data analysis Transformational Leadership Data Visualization Innovative Strategic Decision Making Compensation & Other Benefits Annual CTC BDT 13-15 Lac Employment Status Full Time Job Location Dhaka Company Information Emami Bangladesh Ltd. Follow Address: Emami Bangladesh Ltd, Aqua Tower (Level-6), 43, Mohakhali C/A, Dhaka-1212, Bangladesh. Business: Emami Bangladesh ltd. is one of the leading personal & health care manufacturing company with an enviable portfolio of household name such as Navratna, Fair & Handsome, Boro plus & so on. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ"
  },
  {
    "url": "https://bdjobs.com/h/details/1458578?ln=1",
    "company_name": "Lab Four General Hospital",
    "job_title": "মেডিকেল টেকনোলজিস্ট",
    "location": "Dhaka (Keraniganj)",
    "salary": "Tk. 15000 (Monthly)",
    "experience": "2 to 3 years",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "মেডিকেল টেকনোলজিস্ট : Lab Four General Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Lab Four General Hospital মেডিকেল টেকনোলজিস্ট Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka (Keraniganj) Salary: Tk. 15000 (Monthly) Experience: 2 to 3 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma in Medical Technology ডিপ্লমা ইন মেডিকেল টেকনোলজি। Experience 2 to 3 years The applicants should have experience in the following business area(s): Hospital Additional Requirements কমপক্ষে ২/৩ বছরের অভিজ্ঞতা থাকতে হবে। Responsibilities & Context অফিস টাইম: ১২ ঘন্টা। Skills & Expertise Suggested by Medical Technology Health/ Medical patients Care Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Keraniganj) Company Information Lab Four General Hospital Follow Address: Ati Bazar, Russell Building, Hanif Medical, Keraniganj, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458575?ln=1",
    "company_name": "Lab Four General Hospital",
    "job_title": "মেডিকেল এ্যাসিস্টেন্ট",
    "location": "Dhaka (Keraniganj)",
    "salary": "Tk. 18000 (Monthly)",
    "experience": "2 to 3 years",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "মেডিকেল এ্যাসিস্টেন্ট : Lab Four General Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Lab Four General Hospital মেডিকেল এ্যাসিস্টেন্ট Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka (Keraniganj) Salary: Tk. 18000 (Monthly) Experience: 2 to 3 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma in Medical Technology ডিপ্লমা ইন মেডিকেল ফেকাল্টি। Experience 2 to 3 years The applicants should have experience in the following business area(s): Hospital Additional Requirements কমপক্ষে ২/৩ বছরের অভিজ্ঞতা থাকতে হবে ও.টি  এ্যাসিস্টে পারদর্শি হতে হবে নরমাল ডেলিভারি তে অভিজ্ঞ হতে হবে। Responsibilities & Context অফিস টাইম: ১২ ঘন্টা (ইমার্জেন্সি প্রয়োজনে ডিইটি করতে হবে) Skills & Expertise Suggested by Medical Assistance Health/ Medical patients Care Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Keraniganj) Company Information Lab Four General Hospital Follow Address: Ati Bazar, Russell Building, Hanif Medical, Keraniganj, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458523?ln=1",
    "company_name": "Lumero",
    "job_title": "Appointment Setter (Remote) | Lead Generation | US Market",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "At least 1 year",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Appointment Setter (Remote) | Lead Generation | US Market : Lumero Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Lumero Appointment Setter (Remote) | Lead Generation | US Market Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 18 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 16500 (Monthly) Experience: At least 1 year Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education A Level in English Sales Training (Cold Calling / Appointment Setting) English Language (Speaking / Listening) Experience At least 1 year The applicants should have experience in the following business area(s): Business-to-Business (B2B) Software and Services Startup, Direct Selling/Marketing Service Company Additional Requirements Age 18 to 40 years Responsibilities & Context Please NOTE: Clear, neutral English accent preferred. We are an Artificial Intelligence consultancy selling AI-powered solutions to small and mid-sized businesses in the US and UK. Our offers include AI agents (customer support and sales), business automations, AI chatbots, lead capture systems, integrations, and modern websites when needed. Your role is to source prospects, cold call decision makers, and book qualified appointments for our closers. Job Responsibilities • Build your own daily lead list using Google Maps and other online directories • Identify businesses with weak online presence or operational gaps (no website, outdated website, no booking system, missed calls, slow follow-up, manual admin, no lead tracking) • Collect accurate contact details where possible (owner/manager name, phone, email, location) • Cold call business owners and managers and use a short script to start conversations • Qualify prospects quickly (need, decision maker, urgency, and basic budget fit) • Book qualified appointments on our calendar for a demo or strategy call • Keep clean notes and update the CRM or Google Sheet after every call • Follow up to confirm appointments and reduce no-shows (calls and messages) • Hit daily activity and performance targets (leads built, dials, bookings, and show-up rate) This vacancy is for English-speaking candidates only. Stable internet for VoIP: 20 Mbps down / 10 Mbps up, wired connection preferred. Skills & Expertise Cold Calling Sales Sales & Marketing Sales Executive B2B Sales Appointment Setting lead generation Google Maps Customer Handling Fluent in English Speaking Compensation & Other Benefits Bonus: 300 BDT per qualified appointment booked Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Job Highlights Please NOTE: Clear, neutral English accent preferred. WFH appointment setter for AI solutions (agents, automations, chatbots, websites). Use"
  },
  {
    "url": "https://bdjobs.com/h/details/1458891?ln=1",
    "company_name": "University of Science and Technology Chittagong (USTC)",
    "job_title": "Senior Admission Executive",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "At least 5 years",
    "education": null,
    "deadline": "13 Mar 2026",
    "job_description": "Senior Admission Executive : University of Science and Technology Chittagong (USTC) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List University of Science and Technology Chittagong (USTC) Senior Admission Executive Application Deadline : 13 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Location: Chattogram Salary: Negotiable Experience: At least 5 years Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education MBA/Masters in any discipline Experience At least 5 years The applicants should have experience in the following business area(s): University Additional Requirements Strong communication skills in English and Bangla (oral and written). Pleasant personality, honest, hardworking. Ability to work well under strict deadlines. Proficiency in MS Office. Responsibilities & Context The Admissions Office serves as the office, responsible for leading, planning, and managing all student admissions and enrolment activities. The role ensures that admissions strategies align with the university’s vision, mission, academic priorities, financial sustainability goals, and regulatory requirements. Talented, Energetic, Self-motivated and Experienced candidates are invited to apply for the position of Senior Admission Executive, USTC under the prevailing terms and conditions of USTC. Job Responsibilities To assist the Director,  Admissions Office in planning and executing the University’s admissions strategy to achieve enrolment targets. To manage the end-to-end admissions process, including: application receipt and verification, eligibility assessment, coordination of entrance tests and interviews, and enrolment confirmation. To ensure all admissions activities comply with accreditation requirements, UGC and other regulatory requirements and University policies. To maintain accurate and secure records of applicants. To provide accurate information and guidance to prospective students and parents regarding programs, admission criteria, scholarships, and enrolment procedures. To coordinate with the authority and academic departments to verify eligibility, seat availability, and program-specific requirements. To support the preparation and timely publication of admission schedules, brochures, prospectuses, and website content. To assist in organising and participating in admission campaigns, admission fairs and promotional events. To build and maintain relationships with feeder institutions, educational counselors and recruitment partners. To ensure transparent, fair, and merit-based handling of applications in accordance with institutional policies. To monitor daily admission statistics and prepare regular reports on application trends and enrolment status. To handle admission-related student matters including re-admission, repeat cases, cancellation, migration and record updates as per Univers"
  },
  {
    "url": "https://bdjobs.com/h/details/1458895?ln=1",
    "company_name": "Knowledge Share",
    "job_title": "Programme Instructor  (Academic & Administration)",
    "location": "Cox`s Bazar",
    "salary": "Tk. 45000 - 50000 (Monthly)",
    "experience": "",
    "education": "Education and Training",
    "deadline": "21 Feb 2026",
    "job_description": "Programme Instructor  (Academic & Administration) : Knowledge Share Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Knowledge Share Programme Instructor  (Academic & Administration) Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Cox`s Bazar Salary: Tk. 45000 - 50000 (Monthly) Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Arts (BA) in English Bachelor/Honors Additional Requirements Minimum Bachelor’s degree in any discipline IELTS band score of 7.0 or above Prior experience in teaching English will be given preference Candidates who are confident in teaching English and classroom delivery are encouraged to apply Responsibilities & Context Delivering classes as per the structured course plan for the EPC English Proficiency Course Developing engaging and effective teaching materials Assessing and evaluating student progress through regular tests and assignments Maintaining student records and managing administrative tasks related to the course Assisting students in improving their reading, writing, speaking, and listening skills Providing feedback and guidance to students on areas of improvement Collaborating with the academic team to ensure the course is delivered effectively Adhering to institutional policies and ensuring a high standard of teaching Skills & Expertise Education Counseling Educational institution Education and Training Administration Education Mangement Suggested by Education Counseling Educational institution Education and Training Administration Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Cox`s Bazar Company Information Knowledge Share Follow More jobs from this company Address: Ga-7/4, Shajadpur, Dhaka-1212 Website: knowledgeshareltd.com Business: Knowledgeshare is a one stop Education Platform who provides all kinds of Educational fcilities including technology to the institutions Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Regi"
  },
  {
    "url": "https://bdjobs.com/h/details/1456793?ln=1",
    "company_name": "Importer",
    "job_title": "Officer - Accounts & Finance",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Officer - Accounts & Finance : Importer Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Importer Officer - Accounts & Finance Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 35 years Location: Dhaka Salary: Tk. 28000 - 32000 (Monthly) Published: 07 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context Major Duties & Responsibilities: Maintain petty cash & prepare all kind of vouchers, cash book, bill register, general ledger & different register related to finance & accounts. Strong and proficient in use of MS office and working experience in accounting Tally Software. Accounts data entry into all level of accounting in the company. Prepare and check all kinds of bill vouchers, Journal entries as per rules and regulation. Prepare monthly salary, bonus sheet preparation. Practical knowledge about TAX & VAT Compliance, SRO, Customs Law. Practical knowledge about banking. VAT, TAX & other Challan preparation. Photo shop, Graphics design, PPT Presentation. Any other tasks assigned by management. Skills & Expertise Accounting Accounting Data Entry Accounts and Finance Computer Literacy Fluency in English speaking and writing General Banking Tally Prime VAT and Tax xero Suggested by Financial Management Financial Reporting Compensation & Other Benefits T/A,Mobile bill,Insurance Salary Review: Yearly Festival Bonus: 3 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights We are looking for a person who is strong and proficient in use of MS office and working experience in accounting Tally Software. Who experience in VAT, TAX, Customs & SRO. Who like to work indoor & outdoor. Company Information Importer Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhur"
  },
  {
    "url": "https://bdjobs.com/h/details/1458903?ln=1",
    "company_name": "Fixelsgraphix Multimedia",
    "job_title": "Advance Video Editor (Project Based)",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Advance Video Editor (Project Based) : Fixelsgraphix Multimedia Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fixelsgraphix Multimedia Advance Video Editor (Project Based) Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Responsibilities & Context We are seeking a highly skilled and creative Advanced Video Editor to join our dynamic production team. You will be responsible for taking raw footage and transforming it into compelling, high-impact visual stories that align with our brand vision and strategic goals. Required Skills & Qualifications: Experience: 5+ years of professional video editing experience with a strong portfolio demonstrating advanced skills. Software Expertise: Mastery of Adobe Creative Suite, specifically Premiere Pro, After Effects, and Audition. Technical Knowledge: Deep understanding of codecs, formats, color spaces, broadcast standards, and compression techniques. Creative Skills: Exceptional storytelling ability, a keen eye for visual composition, and a strong sense of timing and rhythm. Soft Skills: Excellent communication, ability to give and receive constructive feedback, meticulous attention to detail, and the ability to thrive under tight deadlines in a fast-paced environment. Communication: Must speak in english and understand in english very well. Skills & Expertise Video Editing Video Editor Short Video Editing Video Production Video and sound editing Workplace Work from home Employment Status Freelance Job Location Anywhere in Bangladesh Company Information Fixelsgraphix Multimedia Follow Address: Road 3, Block J, South, Dhaka 1219 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন "
  },
  {
    "url": "https://bdjobs.com/h/details/1458897?ln=1",
    "company_name": "Bashundhara Ready Mix & Construction Industries Ltd.",
    "job_title": "Executive/Senior Executive (Sales)-Bashundhara Ready Mix & Construction Industries Ltd.",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Executive/Senior Executive (Sales)-Bashundhara Ready Mix & Construction Industries Ltd. : Bashundhara Ready Mix & Construction Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bashundhara Ready Mix & Construction Industries Ltd. Executive/Senior Executive (Sales)-Bashundhara Ready Mix & Construction Industries Ltd. Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 26 to 40 years Location: Dhaka Salary: Negotiable Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 40 years Preference will be given to candidates who bring solid experience in Ready Mix Concrete sales, and such applicants are highly encouraged to apply. Responsibilities & Context If you`re looking for a role where you can continue to make an impression, take the next step at Bashundhara Ready Mix & Construction Industries Limited where your contributions will always be valued. We are currently seeking an ambitious individual to join this team in the role of Executive/Sr. Executive (Sales) for Bashundhara Ready Mix & Construction Industries Ltd. Job Responsibilities: Achieve monthly, quarterly, and yearly sales targets for ready-mix concrete through effective team coordination and performance management. Identify, pursue, and secure new business opportunities in the construction and infrastructure sector for ready-mix concrete. Build and maintain strong relationships with customers, contractors, developers, engineers, and project managers. Understand client requirements and provide appropriate support and solutions. Conduct regular site visits, client meetings, and follow-up on leads and inquiries. Monitor market trends, competitor activities, and pricing to identify growth opportunities. Collaborate with production, logistics, and technical teams to ensure timely delivery and customer satisfaction. Maintain accurate records of sales activities and customer interactions, queries and solutions. Perform other duties as assigned by management. Skills & Expertise Communication Convincing people Energetic and self-motivated leadership and negotiation MSOffice applications Sales Target Achievement Teamwork Time Management Compensation & Other Benefits Mobile bill,T/A,Gratuity Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Sales incentives others as per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Bashundhara Ready Mix & Construction Industries Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়"
  },
  {
    "url": "https://bdjobs.com/h/details/1458919?ln=1",
    "company_name": "Property Search BD",
    "job_title": "Executive – Sales & Marketing (Female Only)",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Executive – Sales & Marketing (Female Only) : Property Search BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Property Search BD Executive – Sales & Marketing (Female Only) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 35 years Location: Dhaka (DOHS Mirpur) Salary: Negotiable Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At most 35 years Responsibilities & Context 🔎 Job Overview Property Search BD is looking for a smart, presentable, and target-driven Female Executive – Sales & Marketing who will primarily handle tele-sales, client communication, and desk-based sales operations . The ideal candidate should have strong communication skills, be comfortable speaking with clients over the phone, and be capable of converting leads into successful property sales. ✅ Key Responsibilities Tele-Sales & Client Handling Conduct outbound calls to potential buyers from provided databases and generated leads. Respond to inbound inquiries and effectively explain property features, pricing, and benefits. Qualify leads, understand customer requirements, and schedule property presentations or site visits for the sales team. Perform regular follow-ups to nurture prospects and convert them into buyers. Maintain a professional and persuasive tone in all client communications. Sales & Marketing Support Generate and follow up on qualified sales leads for residential and commercial properties through digital channels, referrals, and networking. Conduct market research on new and upcoming properties to identify pricing trends, buyer demand, and opportunities. Promote real estate projects through phone calls, online platforms, and marketing campaigns. Assist in executing sales strategies to achieve monthly and quarterly targets. Client Relationship Management Build and maintain long-term relationships with buyers, investors, and channel partners. Maintain an organized and updated client database and track interactions using CRM or reporting tools. Provide excellent customer service and support throughout the sales process and after-sales when required. Coordination & Reporting Coordinate with internal teams (legal, documentation, and accounts) to ensure smooth transaction completion. Prepare daily and weekly sales reports, lead status updates, and performance summaries. Analyze customer feedback and buyer preferences to improve engagement and sales outcomes. 🎯 Requirements Female candidates only. Bachelor’s degree in Business Administration, Marketing, or a related field (preferred). 1–3 years of experience in tele-sales, sales, marketing, or customer service (real estate experience is a plus). Excellent communication and interperson"
  },
  {
    "url": "https://bdjobs.com/h/details/1458918?ln=1",
    "company_name": "Accszone Tech",
    "job_title": "Data Entry / Computer Operator(Night Shift)",
    "location": "Dhaka (Mirpur 2)",
    "salary": "Tk. 10000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Data Entry / Computer Operator(Night Shift) : Accszone Tech Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Accszone Tech Data Entry / Computer Operator(Night Shift) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 18 to 28 years Location: Dhaka (Mirpur 2) Salary: Tk. 10000 (Monthly) Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 28 years Responsibilities & Context Education HSC Additional Requirements দায়িত্ব ও যোগ্যতা: প্রার্থীদের অবশ্যই অফিসে নাইট শিফটে (রাত ১০:০০টা – সকাল ৮:০০টা) কাজ করতে সক্ষম হতে হবে। বেসিক কম্পিউটার স্কিল থাকতে হবে। Facebook, Instagram, LinkedIn, TikTok, Gmail সহ বিভিন্ন সোশ্যাল মিডিয়া প্ল্যাটফর্ম তৈরি ও ম্যানেজ করার দক্ষতা থাকতে হবে। নির্ধারিত সময়ের মধ্যে প্রতিটি কাজ সম্পন্ন করার জন্য ওয়ার্ক অর্ডার সিডিউল করতে হবে। Excel সম্পর্কে ভালো জ্ঞান থাকতে হবে। সহকর্মীদের সাথে ঘনিষ্ঠ সমন্বয় রেখে কাজ করতে হবে এবং নিয়মিত তথ্য আপডেট করতে হবে। কাজে সূক্ষ্ম বিষয়গুলোর প্রতি উচ্চ মনোযোগ থাকতে হবে। শক্তিশালী ফোকাস ও শেখার আগ্রহ থাকতে হবে। ফ্রেশাররাও আবেদন করতে পারবেন। Skills & Expertise Social Media Management Microsoft Excel COMPUTER OFFICE MANAGEMENT Basic English Microsoft Office Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur 2) Company Information Accszone Tech Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Do"
  }
]