[
  {
    "url": "https://bdjobs.com/h/details/1457451?ln=1",
    "company_name": "One Direction Companies Limited",
    "job_title": "Land Surveyor",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "At least 3 years",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Land Surveyor : One Direction Companies Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List One Direction Companies Limited Land Surveyor Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 30 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: At least 3 years Published: 06 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma Diploma in Engineering Experience At least 3 years The applicants should have experience in the following business area(s): Group of Companies, Engineering Firms Additional Requirements Age 20 to 30 years In-depth knowledge of land registration procedures, land laws, deeds of agreement, Parcha, Mouza maps, and mutation processes. Excellent analytical ability with strong attention to detail and accuracy. Effective communication and coordination skills for dealing with government bodies and legal entities. Proven experience working on land development and construction-related projects. Sound understanding of legal and regulatory compliance related to land surveying. Responsibilities & Context We are looking for a highly skilled, detail-driven, and responsible Land Surveyor to join our growing group of companies. The ideal candidate will play a critical role in ensuring accurate land measurement, legal compliance, and seamless execution of land-related projects. This position requires strong technical expertise, hands-on field experience, and close coordination with internal teams and external authorities. Key Responsibilities: Operate and manage modern digital survey equipment to ensure accurate data collection and analysis. Prepare layout designs, fly-level measurements, plot surveys, topographic surveys, and as-built surveys; compare Mauza maps using digital survey tools. Conduct pre- and post-construction level checks, area calculations, and prepare detailed survey reports. Maintain accurate and comprehensive survey records, including field notes, legal descriptions, maps, and drawings, in compliance with industry standards and regulatory requirements. Coordinate and liaise with government offices, legal professionals, and other stakeholders to ensure smooth project execution and legal compliance. Support land registration and documentation processes, including deeds, Parcha, Mouza maps, mutation records, and agreements. Prepare and present survey findings clearly for project teams and management decision-making. Utilize AutoCAD, MS Word, Excel, and other relevant applications to prepare reports, drawings, and data presentations. Perform any other duties or assignments as assigned by the Department Head or honorable Management Authority. Skills & Expertise AutoCAD Google Maps Land Development Land Law Land Mutation Land Sur"
  },
  {
    "url": "https://bdjobs.com/h/details/1457300?ln=1",
    "company_name": "TBN BD Ltd.",
    "job_title": "Data Entry operator",
    "location": "Dhaka",
    "salary": "",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "10 Feb 2026",
    "job_description": "Data Entry operator : TBN BD Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List TBN BD Ltd. Data Entry operator Application Deadline : 10 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 20 Age: 18 to 35 years Location: Dhaka Experience: 1 to 2 years Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience 1 to 2 years The applicants should have experience in the following business area(s): BPO/ Data Entry Firm Freshers are also encouraged to apply. Additional Requirements Age 18 to 35 years Responsibilities & Context This is to inform all concerned that for Election purposes , applications are invited for the post of Data Entry Operator on a temporary basis. Details are as follows: Duration: 2 (Two) Days Nature of Work: Data Entry (Election purpose) Remuneration: BDT 1,000/- per person per day Food: Provided Skills & Expertise COMPUTER OFFICE MANAGEMENT Data Entry (Both English & Bengali) Workplace Work at office Employment Status Contractual Job Location Dhaka Company Information TBN BD Ltd. Follow More jobs from this company Address: House 43/2 6th Fl Ring Road Shyamoli Mohammadpur Dhaka 1207. Business: TBN24 is a Bangla language live television channel in North America provides content that is informative, educational, socially responsible, entertaining and comparable with world-class television broadcasters. TBN24 is the first Bangla 24x7 live television channel to produce original content here in the USA. This channel is currently available in US, Canada, Europe, Australia, and Middle-East. TBN24 Television is the for non-resident Bangladeshi living across the globe as well as people whose mother tongue is Bangla. Television has become a window on the world and many of us do seem to decide what the world is like because of what is on the television screen. TBN24 television is a window to Bangladesh for Bangladeshis living in North America. TBN24 focuses on positive Bangladesh by reporting on inclusive progress of Bangladesh governments` economic, social and environmental aspects to meet the challenges of the future and to help build a better Bangladesh for all. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্"
  },
  {
    "url": "https://bdjobs.com/h/details/1457447?ln=1",
    "company_name": "ND Global Consulting Services, Inc.",
    "job_title": "Credentialing & Background Screening Coordinator",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Credentialing & Background Screening Coordinator : ND Global Consulting Services, Inc. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ND Global Consulting Services, Inc. Credentialing & Background Screening Coordinator Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 22 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 25000 (Monthly) Experience: At least 2 years Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 2 years The applicants should have experience in the following business area(s): Multinational Companies, Embassies/Foreign Consulate, Market Research Firms, Consulting Firms, Manpower Recruitment, Cosmetics/Toiletries/Personal Care, Overseas Companies, Individual/Personal Recruitment Additional Requirements Age 22 to 40 years Responsibilities & Context Credentialing & Background Screening Coordinator Location: Remote Department: Compliance & Quality Assurance Reports To: Director of Operations Employment Type: Full-time Language : MUST HAVE EXCELENT CONTROL OVER ENGLISH COMMUNICATION. Role Summary As a Credentialing & Background Screening Coordinator, you will be responsible for ensuring that all healthcare professionals and caregivers meet the highest standards of credentialing, licensing, and background verification. You will manage full-cycle credentialing, pre-employment screenings, background investigations, and ongoing compliance checks, ensuring alignment with client, state, federal, and accreditation body requirements. This role is pivotal to maintaining NDGCS’s reputation for quality, speed, and trust with healthcare facilities, MSPs, and VMS platforms. Key Responsibilities Credentialing & Compliance Management Manage end-to-end credentialing for all clinical and non-clinical staff, including: RN, LPN, CNA, Allied Health, and IT professionals Physicians, advanced practice providers, and other caregivers Verify and document: Licenses, certifications, and registrations (e.g., RN licenses, BLS/ACLS cards, CNA certificates) Education credentials (diplomas, degrees, transcripts) Professional references Work history verifications and employment gaps Maintain real-time credentialing files, ensuring all documents are current, compliant, and audit-ready Proactively track expiring credentials and notify employees and managers ahead of deadlines Ensure strict adherence to all compliance standards including JCAHO, NCQA, OSHA, CMS, and state-specific requirements Background Check & Screening Management Coordinate comprehensive background checks including: SSN trace National criminal database search County-level criminal searches Healthcare-specific sanction screenings (OIG, SAM, NPDB, FACIS) Education verification Employment history verification License verification Dru"
  }
]