[
  {
    "url": "https://bdjobs.com/h/details/1464116?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464126?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464123?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464120?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464100?ln=1",
    "company_name": "Ecruise Corporation",
    "job_title": "Accounting Assistant",
    "location": "Dhaka, Dhaka (DOHS Mirpur)",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Accounting Assistant : Ecruise Corporation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ecruise Corporation Accounting Assistant Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 28 to 35 years Location: Dhaka, Dhaka (DOHS Mirpur... Dhaka, Dhaka (DOHS Mirpur) Salary: Tk. 20000 - 25000 (Monthly) Experience: 1 to 3 years Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Master of Business Administration (MBA) in Accounting Master of Business Administration (MBA) in Accounting & Information System Master of Business Administration (MBA) in Cost & Management Accounting Experience 1 to 3 years The applicants should have experience in the following business area(s): Telecommunication, Software Company, IT Enabled Service, Multinational Companies, Group of Companies, Battery, Storage cell, Importer, Industrial Machineries (Generator, Diesel Engine etc.), Motor Vehicle body manufacturer, E-commerce Additional Requirements Age 28 to 35 years Responsibilities & Context ### 1. Daily Financial Recordkeeping * Record all financial transactions (sales, expenses, receipts, payments) * Maintain general ledger and chart of accounts * Reconcile bank accounts, credit cards, and digital payment platforms * Track EV sales (vehicle sales, battery sales, accessories, service revenue) ## 2. Accounts Payable & Receivable * Process vendor invoices (battery suppliers, parts vendors, logistics, charging infrastructure) * Manage payments to suppliers and contractors * Generate and track customer invoices * Monitor outstanding receivables and follow up on overdue payments ### 3. Inventory & Asset Tracking (EV-Specific) * Track inventory of: * EV units * Batteries * Spare parts * Charging equipment * Maintain records of fixed assets (charging stations, machinery, tools, demo vehicles) * Assist in cost tracking per vehicle model ### 4. Payroll Support * Maintain employee payroll records * Track commissions (if applicable to EV sales team) * Process reimbursements * Ensure compliance with tax deductions and statutory payments ### 5. Tax & Compliance Support * Maintain records for GST/VAT (if applicable) * Prepare data for tax filings * Track input/output taxes on EV purchases and sales * Assist auditors with documentation ### 6. Financial Reporting * Prepare monthly financial statements: * Profit & Loss * Balance Sheet * Cash Flow Summary * Track burn rate (especially important for growing EV startups) * Monitor cost of goods sold (COGS) per vehicle ### 7. Expense Monitoring & Cost Control * Track R&D expenses (if developing EV technology) * Monitor marketing campaign spending * Analyze operational costs (warehousing, charging stations, servicing) Skills & Expertise Key Account Management Accounts and Finance Accountability Workp"
  },
  {
    "url": "https://bdjobs.com/h/details/1461748?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464015?ln=1",
    "company_name": "WorldMoz",
    "job_title": "Business Development Executive",
    "location": "Sylhet (Sylhet Sadar)",
    "salary": "Negotiable",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Business Development Executive : WorldMoz Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List WorldMoz Business Development Executive Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: At least 24 years Location: Sylhet (Sylhet Sadar) Salary: Negotiable Experience: At least 1 year Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience At least 1 year The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service, Immigration/Visa Processing Additional Requirements Age At least 24 years Candidates who have skill in Graphics are Preferable. Only Sylhet Sadar Areas Candidates will be selected. Responsibilities & Context Key Responsibilities & Skills Student Engagement & Lead Conversion: Proactively engage students, visitors, and walk-in clients through phone calls, online inquiries, and in-person conversations, converting prospects into confirmed clients. Social Media & Digital Marketing: Plan and execute social media campaigns across Facebook, Instagram, and other platforms to generate quality leads and strengthen the WorldMoz brand presence. Creative Design & Visual Content: Design marketing materials, posts, and ads using Canva, Adobe Photoshop, and Illustrator to support promotional and student outreach activities. Website & WordPress Management: Publish and manage content on the company WordPress website, including blog posts, updates, service pages, and announcements. Content Writing (English): Create clear, persuasive English content for websites, social media, advertisements, and student communication with strong grammar and readability. Local SEO & Online Visibility: Manage and optimize Google Business Profile (GMB) listings, handle reviews, update business information, and support local SEO initiatives to improve visibility. Client Communication & Consultation: Demonstrate strong phone etiquette and conversational skills when advising students and parents about education and immigration options. Market Research & Outreach: Identify new opportunities by analyzing market demand, student trends, and competitor activity. Reporting & Documentation: Maintain accurate records using MS Word, MS Excel , and CRM tools, preparing reports on inquiries, conversions, and performance. Skills & Expertise good comunication Market Research Student Consultancy Workplace Work at office Employment Status Full Time Job Location Sylhet (Sylhet Sadar) Company Information WorldMoz Follow Address: 10th Floor, (Lift-9) Elegant Shopping Mall, Zindabazar, Sylhet, Bangladesh, 3100 Website: https://worldmoz.net/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়"
  },
  {
    "url": "https://bdjobs.com/h/details/1464124?ln=1",
    "company_name": "Cutting Edger",
    "job_title": "Project Manager / Project Coordinator",
    "location": "Dhaka",
    "salary": null,
    "experience": "2 to 5 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Project Manager / Project Coordinator : Cutting Edger Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Cutting Edger Project Manager / Project Coordinator Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 03 Age: 28 to 40 years Location: Dhaka Salary: Negotiable Experience: 2 to 5 years Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) Bachelor of Business Administration (BBA) Bachelor of Arts (BA) Master of Business Administration (MBA) Master of Science (MSc) Experience 2 to 5 years The applicants should have experience in the following business area(s): Software Company, IT Enabled Service, BPO/ Data Entry Firm, DTP House, E-commerce Additional Requirements Age 28 to 40 years Responsibilities & Context Oversee and manage the quality control process for all client projects, ensuring timely and high-quality delivery. Implement and maintain efficient workflows to streamline production processes, including scripting for software like Photoshop and Lightroom (will add advantage). Collaborate with the production team to enhance productivity and optimize quality. Serve as the primary point of contact to understand project requirements, scope, and objectives. Maintain comprehensive project documentation, including status reports, project trackers, and invoicing. Handle all test work received from potential clients, ensuring the highest standards are met before final delivery. Create, maintain, and manage project schedules and deadlines to ensure timely delivery (SLAs) . Propose and implement process improvements to achieve operational efficiency. Identify and address potential risks, ensuring seamless project progress and integrations. Excellent understanding of quality assurance in post-production image editing. Attention to detail and a commitment to excellence in quality control. Identify training needs and based on that prepare & plan training accordingly for team’s performance improvement. Strong leadership and communication skills. Flexible to attend client meetings across various time zones. Have experience working on different project management tools, different file transfer tools. Perform other duties as may be assigned by the line manager or HOD. Skills & Expertise Adobe Photoshop Email Communications Microsoft Excel Tech Savvy Project Management Project Planning Project Implementation Good English proficiency Problem solving and decision making Compensation & Other Benefits T/A,Tour allowance,Performance bonus Salary Review: Yearly Festival Bonus: 2 Snacks provided. Tea / Coffee provided. Weekly 1.5 days holiday. Remote office facility. Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights We are looking for experienced and dedicated Project Coordinators to join our fast-"
  },
  {
    "url": "https://bdjobs.com/h/details/1464095?ln=1",
    "company_name": "Meghna Group of Industries.",
    "job_title": "Executive/ Outlet Incharge, Operation - Fresh Super Mart",
    "location": "Dhaka",
    "salary": "",
    "experience": "At least 5 years",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Executive/ Outlet Incharge, Operation - Fresh Super Mart : Meghna Group of Industries. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Meghna Group of Industries. Executive/ Outlet Incharge, Operation - Fresh Super Mart Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 5 years Published: 26 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Experience At least 5 years The applicants should have experience in the following business area(s): Group of Companies, Retail Store Additional Requirements Solid understanding of retail store operations, including inventory management, merchandising, and sales processes. Proficiency in POS system operations, cash handling, and financial reporting. Ability to supervise and support the team to ensure smooth daily store activities. Strong problem-solving skills with the ability to make quick decisions in a dynamic retail environment. Good knowledge of store hygiene, safety standards, and compliance with SOPs. Effective communication and interpersonal skills to manage staff and interact with customers professionally. Willingness to work flexible hours, including weekends and holidays. Responsibilities & Context Job Context Fresh Super Mart, a retail chain shop of Meghna Group of Industries (MGI), is expanding its footprint by launching new outlets at metro stations. The incumbent will be responsible for ensuring smooth retail operations, driving sales growth, maintaining high customer service standards, and upholding Fresh Super Mart’s brand image. The position requires strong leadership, operational excellence, and the ability to manage a compact, fast-paced retail environment catering to high footfall customers. Job Responsibilities: Oversee daily outlet operations to ensure smooth workflow, optimal staff performance, and effective response to customer demand. Drive sales growth by implementing merchandising strategies, executing promotional campaigns, and enhancing customer engagement initiatives. Maintain product display standards in line with corporate merchandising guidelines to ensure brand visibility, organized shelving, and easy customer navigation. Monitor inventory and stock levels through regular checks, accurate forecasting, and coordination with procurement and warehouse teams to prevent shortages. Supervise and develop outlet staff by assigning duties, evaluating performance, and providing training on customer service, product knowledge, and sales techniques. Ensure compliance with hygiene, safety, and quality standards by enforcing SOPs and conducting routine operational inspections. Manage customer service operations by resolving queries and complaints promptly while maintaining a professional and customer-focused approach. Implement loss prevention and financia"
  },
  {
    "url": "https://bdjobs.com/h/details/1463882?ln=1",
    "company_name": "Heifer International Bangladesh",
    "job_title": "Intern-Administration",
    "location": "Dhaka",
    "salary": "Tk. 20000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "Intern-Administration : Heifer International Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Heifer International Bangladesh Intern-Administration Application Deadline : 04 Mar 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: At most 27 years Location: Dhaka Salary: Tk. 20000 (Monthly) Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor/Honors A Bachelor’s in Business Administration or related field is required. Additional Requirements Age At most 27 years Excellent interpersonal skills, including strong written and verbal communication. Proficient in computer applications, including Microsoft Word, Excel, PowerPoint, and online research. Strong team player with the ability to collaborate effectively with a diverse staff. Capable of performing multiple tasks with minimal supervision. Flexible and willing to work according to varying schedules. Able to maintain strict confidentiality. Responsibilities & Context Heifer International is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with some form of specially-abled. Heifer International Bangladesh is looking for someone who is self-motivated and result oriented and an individual of high integrity and accountability to fill in the position of the Intern-Administration RESPONSIBILITIES AND DELIVERABLES : (including approximate percentage effort) Assist in updating procurement documentation as per requirements. Maintain and update various types of files, including vendor files, agreements, etc. Ensure files are organized, up-to-date, and easily accessible to internal stakeholders. Support in keeping the Stock Register, Assets Register, and other registers updated. Assist in scanning and digitizing documents based on priority. The person should maintain office hour from 8:30am to 5:30pm, Sunday – Thursday May perform other duties as assigned. DURATION 6 months JOB LOCATION Heifer International Bangladesh Country Office, Dhaka Skills & Expertise Suggested by Documentation Reporting Employment Status Full Time Job Location Dhaka Read Before Apply Interested and qualified applicants are requested to submit the following: Curriculum Vitae (CV) Scanned photograph Cover letter addressed to the Country Director Apply Procedure Email Your CV Send your CV to the given email info.bangladesh@heifer.org Company Information Heifer International Bangladesh Follow Address: Heifer International Bangladesh  \r\nGold House   \r\nHouse # 38, Flat # 5B (5th Floor), Road # 11 (New)   \r\nDhanmondi, Dhaka-1209, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে ক"
  },
  {
    "url": "https://bdjobs.com/h/details/1464027?ln=1",
    "company_name": "WorldMoz",
    "job_title": "Receptionist",
    "location": "Sylhet (Sylhet Sadar)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Receptionist : WorldMoz Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List WorldMoz Receptionist Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 20 to 30 years Location: Sylhet (Sylhet Sadar) Salary: Negotiable Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 20 to 30 years Only Female Responsibilities & Context Visitor Management: Greet and welcome visitors, students, and parents warmly, directing them to appropriate counselors or departments. Communication Hub: Answer incoming phone calls, manage emails, and provide basic information regarding educational courses, visas, and consulting services. Administrative Support: Schedule, reschedule, and confirm student appointments; manage student records; and maintain office supplies. Documentation Assistance: Assist with gathering documents for student applications and visa processing. Front Office Maintenance: Ensure the reception area is clean, tidy, and welcoming. Marketing/Social Media: Assist with promotional activities and social media updates. Skills & Expertise Good communication and coordination skills language fluency Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Sylhet (Sylhet Sadar) Company Information WorldMoz Follow Address: 10th Floor, (Lift-9) Elegant Shopping Mall, Zindabazar, Sylhet, Bangladesh, 3100 Website: https://worldmoz.net/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NG"
  },
  {
    "url": "https://bdjobs.com/h/details/1464117?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464092?ln=1",
    "company_name": "bKash Ltd.",
    "job_title": "Assistant Lead Engineer, Database Management",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "5 to 8 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Assistant Lead Engineer, Database Management : bKash Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List bKash Ltd. Assistant Lead Engineer, Database Management Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Experience: 5 to 8 years Published: 26 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Bachelor of Science (BSc) in Electrical & Electronic Engineering Experience 5 to 8 years The applicants should have experience in the following business area(s): Banks, Financial Technology (Fintech) Startup, IT Enabled Service Additional Requirements Strong critical thinking and problem-solving skills. Ability to troubleshoot complex production issues and performance bottlenecks. Experience guiding engineers and managing task assignments. Understanding of operational procedures, security policies, and engineering standards. Ability to balance operational workload with project deliverables. Strong customer service mindset and ability to work independently or in a team. Capacity to learn new platform technologies quickly. Responsibilities & Context Maintain operational stability and daily administration of assigned data platform components. Assign and monitor engineers’ tasks to ensure timely completion of operations and projects. Diagnose and resolve complex incidents; perform L1/L2 investigation and RCA. Address critical production issues impacting system availability. Lead technical workstreams and ensure project deliverables meet standards. Follow security procedures, compliance guidelines, and operational checklists. Engage with internal teams (Data Engineering, SE, RE, IT Governance or PPM) for troubleshooting and delivery. Collaborate with external support from Cloudera, ScyllaDB, MongoDB, Oracle, DataStax, Elasticsearch, etc. Ensure 24x7 functional support and 99.99% uptime commitment. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information bKash Ltd. Follow More jobs from this company Address: Shadhinata Tower, 1, Bir Sreshtha Shaheed Jahangir Gate, Dhaka Cantonment, Dhaka-1206 Business: Mobile financial service Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certif"
  },
  {
    "url": "https://bdjobs.com/h/details/1464110?ln=1",
    "company_name": "Aalok Healthcare & Hospital",
    "job_title": "Pharmacist A, B Grade",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Pharmacist A, B Grade : Aalok Healthcare & Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aalok Healthcare & Hospital Pharmacist A, B Grade Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 45 years Location: Dhaka Salary: Negotiable Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 22 to 45 years Responsibilities & Context Review and dispense medications with precision, screening for interactions and ensuring safe dosing for all patient types. Manage stock levels, cold chain storage, and controlled substances while proactively monitoring expiries and emergency kits. Execute detailed shift handovers and provide real-time drug information to nursing and medical teams. Maintain strict regulatory standards, supervise technical staff, and lead incident reporting to ensure continuous quality improvement. Any assigned job from Management Skills & Expertise Communication and interpersonal skill Computer Literacy Pharmaceutical Product Management Pharmaceuticals Pharmacist Pharmacy Salesman Shift Management Teamwork and Cooperation Compensation & Other Benefits Provident fund,Over time allowance Salary Review: Yearly Festival Bonus: 2 As per Hospital policy Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Looking for A, B Grade with Register License No. staff Dhaka’s most trusted and fastest-growing healthcare networks, with over 30 years of excellence in providing affordable, high-quality medical services. We believe our staff is our greatest asset. Read Before Apply Ready to do shifting duty. Report to Pharmacy Manager / Incharge. Abide by Hospital practice as Management instruction. After interview discussion will confirm duty Hospital as we have General, Mother & Child Care Hospital. hr.aalok@gmail.com Company Information Aalok Healthcare & Hospital Follow More jobs from this company Address: Corporate Office: House# 3, Road # 4, Block # A, Section-06, Mirpur, Dhaka-1216 Website: https://www.aalokhealthcare.com/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trus"
  },
  {
    "url": "https://bdjobs.com/h/details/1464106?ln=1",
    "company_name": "Cross World Group",
    "job_title": "Head of Sourcing",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 10 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Head of Sourcing : Cross World Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Cross World Group Head of Sourcing Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Experience: At least 10 years Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor in Engineering (BEngg) Master of Business Administration (MBA) in Supply Chain Management Qualified Supply Chain Professional (e.g., CSCM, CSCP, CPM) preferred. Experience At least 10 years The applicants should have experience in the following business area(s): Engineering Firms, Technical Infrastructure Additional Requirements Strong background in Engineering, EPC, MEP, or similar technical industries. Must have hands‑on experience sourcing technical materials and engineering products. Strong negotiation skills, market intelligence, and vendor management capabilities. Experience in global procurement and foreign sourcing is essential Exceptional candidates from non‑engineering backgrounds may also apply if they have deep technical sourcing experience. Responsibilities & Context We are seeking a highly capable and technically strong Head of Project Sourcing to lead the sourcing and supply chain operations for our Engineering and EPC business. This role will play a critical part in ensuring timely, cost-effective, and high‑quality sourcing of technical materials required for complex Engineering, MEP, and EPC projects. The ideal candidate must be deeply conversant with engineering products—such as substations, transformers, switchgears, busbar trunking (BBT), generators, cables, panels, and other critical project materials—as well as global sourcing channels and supplier networks. Key Responsibilities Strategic Sourcing Leadership Lead end‑to‑end sourcing operations for all engineering, technical, and project materials. Develop robust sourcing strategies for large EPC and engineering projects. Manage global sourcing across key international markets and technical principals. Project Supply Chain Management Oversee procurement planning, vendor selection, negotiation, and delivery management for EPC projects. Work closely with project teams to forecast material demand, ensure availability, and reduce lead time risks. Ensure cost optimization, quality compliance, and timely delivery of all critical equipment. Technical Product Proficiency Demonstrate strong understanding of engineering products including: Substations Transformers Switchgears Busbar Trunking (BBT) Generators & Power Equipment Electrical Panels & Cables MEP project components Evaluate technical specifications, drawings, and compliance requirements. Vendor & Principal Management Maintain strong working relationships with foreign suppliers, O"
  },
  {
    "url": "https://bdjobs.com/h/details/1464103?ln=1",
    "company_name": "Cross World Group",
    "job_title": "Chief Financial Officer (CFO)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Chief Financial Officer (CFO) : Cross World Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Cross World Group Chief Financial Officer (CFO) Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Location: Dhaka Salary: Negotiable Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Minimum 15+ years of progressive experience in finance leadership roles. Proven experience in large Engineering, Construction, or EPC organizations (mandatory preference). Strong background in project finance and management of long-cycle projects. Qualified accountant: FCA / FCMA/FCCA/CPA (local or international certification). Demonstrated expertise in treasury, corporate finance, and financial operations. Strong leadership capabilities with the ability to lead and develop high-performing teams. Excellent stakeholder management, communication, and strategic thinking skills. Responsibilities & Context We are seeking an accomplished and strategic Chief Financial Officer (CFO) to lead the complete financial management of our organization. The ideal candidate will be a seasoned finance leader with deep experience in Engineering and EPC business finance operations, strong business acumen, and the ability to partner with the executive team to drive organizational growth and financial excellence. This role demands exceptional leadership, project finance expertise, treasury and cash flow mastery, and the ability to steer financial planning, reporting, and governance across a large, complex business portfolio. Key Responsibilities Financial Leadership & Governance Lead and oversee the entire finance function including accounting, reporting, budgeting, and compliance. Strengthen internal controls, statutory governance, and financial discipline across the organization. Ensure timely, accurate preparation of financial statements and management reports. Business Partnering & Strategic Collaboration Act as a key strategic advisor to the CEO, Board, and senior leadership team. Drive financial insights, decision support, and performance management aligned with business strategy. Lead cost optimization initiatives and enhance financial efficiency across business units. Project Finance & Banking Oversee large-scale project finance, including project costing, financial modeling, risk assessment, and fund management. Ensure financial oversight of EPC project execution—including budgeting, forecasting, and cash flow alignment. Manage project-based financial risks and ensure profitability of multi-year long-cycle EPC contracts. Treasury & Cash Flow Management Lead treasury operations including cash management, liquidity planning, and fund sourcing. Manage banking relationships, negotiate credit fac"
  },
  {
    "url": "https://bdjobs.com/h/details/1464098?ln=1",
    "company_name": "Boropool Limited",
    "job_title": "Front Desk & Client Hospitality Executive",
    "location": "Dhaka (GULSHAN 2)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Mar 2026",
    "job_description": "Front Desk & Client Hospitality Executive : Boropool Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Boropool Limited Front Desk & Client Hospitality Executive Application Deadline : 28 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Location: Dhaka (GULSHAN 2) Salary: Tk. 15000 - 24000 (Monthly) Published: 26 Feb 2026 Application Insights View Requirements Additional Requirements Only Female Responsibilities & Context Job Context BOROPOOL LTD is a premium Global Mobility & Migration Firm located in Gulshan-2, Dhaka (near Gulshan Society Mosque). We are looking for a disciplined and professional Front Desk & Client Hospitality Executive who can warmly welcome clients and maintain a highly organised and presentable front office environment. This is strictly a full-time career role . We are not hiring students or part-time job seekers. The front desk is the first impression of BOROPOOL. We want someone who genuinely understands Bangladeshi hospitality culture — where guests are treated with warmth, respect and care — while maintaining corporate professionalism. Job Responsibilities Client Hospitality & Greeting: Welcome and receive all clients warmly and professionally Ensure clients feel comfortable and attended Inform counsellors immediately about client arrival Maintain polite, respectful and confident communication at all times Front Office Organisation: Keep reception and front portion of the office clean and organised at all times Maintain visitor log and appointment records Ensure meeting rooms are prepared before client appointments Monitor overall presentation of the reception area Professional Conduct & Discipline: Personal mobile phone use during office hours is strictly limited No social media browsing while on duty Maintain alert and professional desk presence Follow company discipline and office etiquette Communication & Coordination: Answer incoming calls professionally Record enquiries in CRM / Google Sheets Confirm appointments via phone/WhatsApp Coordinate between clients and counsellors Additional Administrative Duties: Support general office activities as assigned by management Perform any other responsibilities provided by the administration when required Skills & Expertise cleanliness Client Acquisition Client Handling Communication Skills Customer Service Effective organisational skills guest handling Hospitality Office Administration Receptionist/ Front Desk Compensation & Other Benefits Performance bonus Salary Review: Yearly Festival Bonus: 2 Performance bonus based on client acquisition Structured career growth opportunity Professional office environment Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (GULSHAN 2) Job Highlights Premium international consultancy environment. Strictl"
  },
  {
    "url": "https://bdjobs.com/h/details/1464093?ln=1",
    "company_name": "US FDA Approved Leading Pharmaceuticals Company (Within Top 3)",
    "job_title": "Brand Executive",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Brand Executive : US FDA Approved Leading Pharmaceuticals Company (Within Top 3) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List US FDA Approved Leading Pharmaceuticals Company (Within Top 3) Brand Executive Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: At most 30 years Location: Dhaka Salary: Negotiable Published: 26 Feb 2026 Application Insights View Requirements Education Additional Requirements Age At most 30 years Freshers are highly encouraged to apply. Ability to generate creative ideas and work under pressure. Collaborative team focus and ability to lead and inspire across departments. Excellent verbal, written and presentation skills. Excellent computer skills. In depth knowledge of event planning and operations. Responsibilities & Context Successful management of assigned brands in line with company`s marketing objectives and providing strategic inputs to generate business and stay ahead in the competition. Responsible for the management of assigned products portfolio. Define medium and short term marketing plan with marketing objectives, strategies and tactics for assigned portfolio. Make annual marketing plan, formulate strategies for specific brands, ensure the growth of existing brands, search for new products, conduct feasibility analysis and launch new products according to the need of the market and company objectives. Create promotional materials, conduct promotional events, train the sales force, analyze market and sales trends, and ensure availability of products through distribution channels. Conduct field (Doctor & Chemist) visit to get first hand market experience and input these into marketing activities. To track & monitor competitors` promotional and marketing activity, provide feedback to reporting authority, design and implement strategic reactions. Maximizing the target customer`s awareness of the brand through creative approaches. Select few potential brands and make them into `Super` brands through brand building. Assist sales team to meet the monthly and yearly target. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information US FDA Approved Leading Pharmaceuticals Company (Within Top 3) Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Inter"
  },
  {
    "url": "https://bdjobs.com/h/details/1463720?ln=1",
    "company_name": "Alltech Biotechnology Pvt. Ltd.",
    "job_title": "Assistant Plant Manager",
    "location": null,
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "28 Mar 2026",
    "job_description": "Assistant Plant Manager : Alltech Biotechnology Pvt. Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Alltech Biotechnology Pvt. Ltd. Assistant Plant Manager Application Deadline : 28 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur (Tongi) Experience: At least 5 years Published: 26 Feb 2026 Application Insights View Requirements Education MBA Degree with experience in Import/Export and Supply Chain Management, is highly desirable. Experience At least 5 years The applicants should have experience in the following business area(s): Trading or Export/Import, Agro based firms (incl. Agro Processing/Seed/GM), Fisheries, Farming, Hatchery, Dairy Additional Requirements Responsibilities & Context Job Context Alltech is a global animal health and nutrition company with more than 45 years of experience in developing natural products that are scientifically proven to enhance animal health and performance. With 6,000 employees in 128 countries, the company has developed a strong regional presence in Europe, North America, Latin America, the Middle-East, Africa and Asia. Alltech`s rapid growth provides an opportunity for its Bangladesh office operating since 2003 for the mentioned position. Job Location: Borobari, Tongi, Gazipur Position Summary The Assistant Plant Manager will play a critical leadership role in ensuring smooth plant operations, maintaining quality standards, optimizing production efficiency, and fostering a strong safety culture. Job Responsibilities Oversee, plan, coordinate, and monitor daily manufacturing operations to ensure production targets are achieved in terms of quantity, quality, cost, and timelines. Maintain strict compliance with quality control, safety, regulatory, and company standards. Supervise, mentor, and develop plant personnel to drive high performance and operational excellence. Coordinate preventive and corrective maintenance to ensure maximum equipment uptime and operational efficiency. Lead continuous improvement initiatives to enhance productivity, reduce waste, and optimize operational costs. Manage inventory levels, raw material planning, and purchase orders in alignment with production requirements. Negotiate favorable terms with suppliers, including pricing, payment terms, and delivery schedules, while tracking supplier performance (quality, cost, and lead time). Oversee end-to-end import operations, including preparation, review, and validation of documents such as Proforma Invoice, Commercial Invoice, Packing List, Bill of Lading, Certificate of Origin, and Letters of Credit (LC). Handle LC operations, including opening, amendments, compliance checking, and payment processing. Ensure full compliance with customs procedures, Bangladeshi regulations (including NBR and BSTI), VAT, duty requirements, and international trade laws. Coordinate "
  },
  {
    "url": "https://bdjobs.com/h/details/1464061?ln=1",
    "company_name": "Md. Moyenuddin (Bashi) Limited",
    "job_title": "Accountant (Executive/Jr. Executive)",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Mar 2026",
    "job_description": "Accountant (Executive/Jr. Executive) : Md. Moyenuddin (Bashi) Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Md. Moyenuddin (Bashi) Limited Accountant (Executive/Jr. Executive) Application Deadline : 28 Mar 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 20 to 30 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 20 to 30 years Only Male •\tThe applicants should have experience in the following area(s): Able to work under pressure, Microsoft Word & Excel, Tally ERP 9 or other Accounting Software. •\tAbility to independently handle Statutory and Internal Audits, including Tax and VAT computation and analysis (preferred). •\tGood communication skills, both written, oral & must be an honest person. Responsibilities & Context ·         Maintain day to day cash register & Checking document/ instruments of the petty cash expenses, and prepares the summary for payments. ·         Auditing bills, vouchers, daily expenditures and daily cash or bank transactions. ·         Knowledge about Banking Activity, Stock report, Bank reconciliation, accounts payable/receivable, salary / payroll account statement, Proper documentation and file management. ·         Must have experience in operate computer application Software-MS Word, MS Excel & Internet Application. ·         Must have experience handle Accounts manually and also have experience & skill in accounts customize software like Tally ERP9 Software and Excel ·         Any other job relating to finance and accounts as assigned by management from time to time. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Read Before Apply Photograph must be enclosed & Active Mobile Number, E Mail ID with the resume. Apply Procedure Email Your CV Send your CV to the given email mmbl.hr1975@gmail.com or Email your CV from My Bdjobs account Company Information Md. Moyenuddin (Bashi) Limited Follow Address: Living Space Complex, House # 8, Flat # F4 (4th floor), Road # 13 (New), Dhanmondi, Dhaka Business: Md. Moyenuddin (Bashi) Limited is one of the top-ranking position construction firms (Roads & Highway Division) in the field of construction work of bridges, roads & buildings etc. This firm has been established in the year 1975. From then the company gradually developed and established as an efficient and reliable construction company in the field of construction work. The company Dhaka office address is “Living Space Complex”, House # 8, Flat # F4 (4th floor), Road # 13 (New), Dhanmondi, Dhaka and Jashore office address is 07, H.M.M. Road, Doratana, Jashore, Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্"
  },
  {
    "url": "https://bdjobs.com/h/details/1464115?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464108?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463667?ln=1",
    "company_name": "Dynamicflow",
    "job_title": "WordPress Web Developer - Night Shift",
    "location": "Dhaka (Pallabi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Mar 2026",
    "job_description": "WordPress Web Developer - Night Shift : Dynamicflow Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dynamicflow WordPress Web Developer - Night Shift Application Deadline : 28 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 25 to 35 years Location: Dhaka (Pallabi) Salary: Negotiable Published: 26 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 25 to 35 years Only Male Responsibilities & Context Dynamicflow is looking for a skilled WordPress Web Developer who will be responsible for developing, customizing, and maintaining high-quality WordPress websites for international and local clients. 🕒 Work Schedule: Night Shift (10:00 PM – 7:00 AM) Key Responsibilities: • Develop custom WordPress themes and plugins based on project requirements • Convert Figma/PSD/XD designs into fully functional responsive WordPress websites • Customize Elementor-based websites • Ensure website performance optimization and security best practices • Integrate third-party APIs and payment gateways • Perform website maintenance, troubleshooting, and bug fixing • Optimize websites for SEO and speed • Work closely with the Project Manager and UI/UX team • Maintain proper documentation and follow development standards • Ensure cross-browser and cross-device compatibility Candidates must be comfortable working in night shift to communicate with overseas clients. Skills & Expertise HTML & CSS PHP (OOP) PSD to Wordpress WordPress wordpress customization Wordpress Plugin Development wordpress them modification Compensation & Other Benefits Weekly 2 holidays Festival Bonus: 2 Salary Review: Yearly • Unlimited Tea & Coffee Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Pallabi) Job Highlights • Friendly and collaborative work environment • Opportunity to work with international clients • Performance-based salary increment • Career growth opportunity Read Before Apply Willing to work night shifts (10:00 PM - 7:00 AM local time) Company Information Dynamicflow Follow Address: E2, Eastern Housing, Pallabi 2nd Phase, Mirpur, Dhaka - 1216, Bangladesh Business: Dynamicflow is a design and development firm. We work across the design and implementation of ideas that helps businesses to navigate in the competitive marketplace. We specialize in creating branding solutions that has an enduring impact for businesses. We drive results by uncovering, crafting and sharing client`s compelling ideas to create desirable solutions. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ"
  },
  {
    "url": "https://bdjobs.com/h/details/1464101?ln=1",
    "company_name": "Duncan Brothers (BD) Limited",
    "job_title": "Executive Corporate Affairs",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Executive Corporate Affairs : Duncan Brothers (BD) Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Duncan Brothers (BD) Limited Executive Corporate Affairs Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 30 years Location: Anywhere in Bangladesh Salary: Tk. 25000 - 30000 (Monthly) Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At most 30 years Responsibilities & Context Role Purpose To support the Corporate Affairs function by ensuring timely regulatory compliance, licensing renewals, and effective coordination of garden-level legal matters through external counsel, minimizing regulatory and legal risks across the Group. Key Responsibilities 1. Garden Legal Coordination (Through External Lawyer) Coordinate with appointed garden-level external lawyers regarding litigation, land disputes, labour court matters, and other legal cases. Maintain and update litigation tracker with case status, hearing dates, and financial exposure. Ensure timely documentation, case papers, and management approvals are provided to external counsel. Escalate legal risks or delays to Assistant Manager promptly. 2. Regulatory Licensing & Compliance Ensure timely renewal and compliance of all statutory licenses. Maintain a centralized license database. Coordinate with relevant government authorities for inspections and approvals. Ensure zero lapse in statutory renewals. 3. Land & Property Documentation (Garden Focus) Coordinate matters relating to mutation, lease, land tax, sale/purchase, etc. Liaise with land offices, sub-registrar offices, and local authorities. Maintain secure and updated records of deeds, agreements, and land documents. 4. Corporate Documentation & Record Control Maintain structured repository of legal documents, agreements, and compliance records (hard & soft copy). Support preparation and execution of agreements, deeds, and contracts. Ensure documentation control standards are maintained. 5. Regulatory Liaison & Reporting Assist in statutory filings and regulatory correspondence as delegated. Prepare monthly compliance and litigation status reports. Identify compliance gaps and recommend corrective actions. Required Qualifications & Experience Bachelor’s degree in Law (LLB preferred) or related field. 2–5 years of experience in Corporate Affairs / Legal Coordination / Regulatory Compliance. Practical exposure to government licensing processes and land documentation. Willingness to travel to garden locations as required. Key Performance Indicators (KPIs) 100% on-time license renewals. Updated and accurate litigation tracker. Zero penalties arising from compliance delays. Proper maintenance of legal and statutory records. Compensation & Other Benefits"
  }
]