[
  {
    "url": "https://bdjobs.com/h/details/1457444?ln=1",
    "company_name": "The Hormone Lab & Infertility Centre",
    "job_title": "Account Assistant (Only Female)",
    "location": "Dhaka (Mohammadpur)",
    "salary": null,
    "experience": "At most 1 year",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Account Assistant (Only Female) : The Hormone Lab & Infertility Centre Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The Hormone Lab & Infertility Centre Account Assistant (Only Female) Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (Mohammadpur) Salary: Tk. 10000 - 15000 (Monthly) Experience: At most 1 year Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education HSC in Commerce Bachelor/Honors Bachelor of Business Administration (BBA) in Accounting Experience At most 1 year The applicants should have experience in the following business area(s): Diagnostic Centre Freshers are also encouraged to apply. Additional Requirements Yearly 16 Extra Paid Leave Duty Time: 10 AM - 07 PM Joining Date: 01 April 2026 *** We believe in first come first service *** One year experience in relative field is an asset Responsibilities & Context Perform daily data entry in accounting software or Excel as instructed. Maintain and update client information, payment status records, and follow-up logs accurately. Assist in preparing bills, invoices, receipts, and other documents as per guidance. Call clients to remind pending payments and update remarks accordingly. Coordinate with marketing or collection executives regarding client payment follow-ups. File and organize bills, invoices, vouchers, and other paperwork systematically. Assist in photocopying, scanning, and printing documents for accounts and administration. Support senior accountants in basic documentation and data management tasks. Maintain confidentiality of financial and client information. Perform any other clerical or support tasks assigned by the accounts or admin department. Skills & Expertise Accounting Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Mohammadpur) Company Information The Hormone Lab & Infertility Centre Follow More jobs from this company Address: 21/F 2nd Floor, Bashbari Main Road, Mohammadia Housing, Mohammadpur, Dhaka Website: https://hormonelab.org/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr."
  },
  {
    "url": "https://bdjobs.com/h/details/1457425?ln=1",
    "company_name": "Greenlab Environments Consultant Ltd.",
    "job_title": "Welders and Pipe fitters",
    "location": "Dhaka (Agargaon)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Welders and Pipe fitters : Greenlab Environments Consultant Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Greenlab Environments Consultant Ltd. Welders and Pipe fitters Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 18 to 50 years Location: Dhaka (Agargaon) Salary: Negotiable Published: 06 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education 8 Pass Additional Requirements Age 18 to 50 years Responsibilities & Context ওয়েল্ডার ও পাইপ ফিটার নিয়োগ চলমান ইন্ডাস্ট্রিয়াল প্রজেক্টের জন্য দক্ষ ওয়েল্ডার ও পাইপ ফিটার নিয়োগ করা হবে। যোগ্যতা ও অভিজ্ঞতা: ওয়েল্ডিং ও পাইপের কাজে ভালো দক্ষতা ড্রয়িং ও পাইপিং লেআউট বুঝতে সক্ষম ইন্ডাস্ট্রিয়াল পাইপলাইন ও মেকানিক্যাল ইনস্টলেশনের অভিজ্ঞতা কাজের স্থানে সেফটি নিয়ম সম্পর্কে জ্ঞান প্ল্যান্ট বা কনস্ট্রাকশন প্রজেক্টে কাজের অভিজ্ঞতা থাকলে অগ্রাধিকার দেওয়া হবে অভিজ্ঞ ও পরিশ্রমী প্রার্থীদের আবেদন করার জন্য অনুরোধ করা হচ্ছে। সিভি ও কাজের অভিজ্ঞতার বিবরণ জমা দিন। Skills & Expertise Welder PIpe Fitting Pipefitting HDPE pipe Production Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Agargaon) Company Information Greenlab Environments Consultant Ltd. Follow Address: Doyel SA Tower, 220/A/1, Amtola, South Pirerbag, 60 feet Road, Mirpur, Dhaka-1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App G"
  },
  {
    "url": "https://bdjobs.com/h/details/1457381?ln=0",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1457374?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1457418?ln=1",
    "company_name": "Shunno IT",
    "job_title": "NOC Support Engineer",
    "location": "Rajshahi",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "NOC Support Engineer : Shunno IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shunno IT NOC Support Engineer Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 32 years Location: Rajshahi Salary: Tk. 15000 - 30000 (Monthly) Experience: At least 2 years Published: 06 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Diploma MTCNA, MTCRE, or equivalent networking qualifications are highly preferred. Experience At least 2 years The applicants should have experience in the following business area(s): Business-to-Business (B2B) Software and Services Startup, ISP, IT Enabled Service, Software Company Additional Requirements Age 22 to 32 years To be considered for this role, candidates must possess:Proven expertise in MikroTik Router OS and advanced router configurations.Strong understanding of OLT systems, PON technology, and fiber network management.Hands-on experience with API and Radius integration.Familiarity with VLANs and routing protocols (e.g., OSPF, BGP).Ability to design and implement load balancing and high-availability solutions.Proficiency in network monitoring tools.Relevant certifications like MTCNA, MTCRE, or equivalent networking qualifications are highly preferred. Responsibilities & Context Our Company is looking for Two NOC Support Engineers to join our team. MikroTik Configuration & Management: Complete setup and management of MikroTik routers. Advanced VPN configuration and maintenance. PPPoE, static IP assignments, and hotspot configuration. Firewall rules creation, NAT configuration, and traffic shaping. Advanced scripting and automation for MikroTik. OLT Configuration & Support: Bringing OLT devices online and integrating them with the network. Configuring VLANs and managing PON (Passive Optical Network) ports. Monitoring and troubleshooting fiber connections and ensuring minimal downtime. Knowledge of ONU/ONT provisioning and firmware updates. API and Software Integration: Integrating software with MikroTik using API and Radius protocols. Troubleshooting issues between the billing platform and the network infrastructure. Network Monitoring & Troubleshooting: Real-time monitoring of network performance using NMS tools like The Dude, Zabbix, or similar platforms. Diagnosing and resolving network-related issues, including latency, packet loss, and device misconfigurations. Maintaining documentation for all configurations and troubleshooting procedures. Provide ongoing support and communication to customers. Preparing regular incident reports. Skills & Expertise CCNA (Cisco Certified Network Associate) GPON ISP ISP operation Mikrotik Administration MTCNA MTCRE OLT and ONU Compensation & Other Benefits Performance bonus Salary Review: Year"
  },
  {
    "url": "https://bdjobs.com/h/details/1457439?ln=1",
    "company_name": "EPISODES DOT WORLD",
    "job_title": "Sales Executive - Retail & E-commerce",
    "location": "Dhaka (Mirpur 10)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Sales Executive - Retail & E-commerce : EPISODES DOT WORLD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List EPISODES DOT WORLD Sales Executive - Retail & E-commerce Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 18 to 29 years Location: Dhaka (Mirpur 10) Salary: Tk. 10000 - 12000 (Monthly) Experience: 1 to 2 years Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Higher Secondary Experience 1 to 2 years The applicants should have experience in the following business area(s): Boutique/ Fashion, E-commerce, F-commerce, Retail Store Additional Requirements Age 18 to 29 years Minimum 6 months – 1 year experience in sales / e-commerce (preferred). Strong communication skill (Bangla mandatory, English basic). Must be confident in convincing customers. Experience in Facebook page inbox handling is a plus. Honest, punctual, and sales-driven mindset. Target-oriented & pressure-handling capability Responsibilities & Context Facebook & Instagram page message handling. Customer query handling and order confirmation. B2B (bulk order) customer communication. Old customer follow-up & retention calls. Coordinating with outlet & delivery team. Skills & Expertise B2B Sales Customer Service Retail Sales Telemarketing Suggested by Customer Relations Customer Support Sales target Customer Service Social Media Management Compensation & Other Benefits Mobile bill,Performance bonus,Over time allowance Salary Review: Half Yearly Festival Bonus: 2 Office time: 11.30am to 8.30pm (6 days a week) Basic Salary: 10,000 to 14,000 BDT Commission: Performance-based  (Delivered sales & B2B orders) upto 15k. Incentives for target achievement Growth opportunity with the brand Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur 10) Company Information EPISODES DOT WORLD Follow Address: 293 , SHENPARA, MIRPUR-10 Website: https://episodes.world/ Business: Episodes World Cap and Lifestyle Brand. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced"
  },
  {
    "url": "https://bdjobs.com/h/details/1457455?ln=1",
    "company_name": "Dhaka Bank PLC.",
    "job_title": "Risk Management Officer",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "At least 5 years",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Risk Management Officer : Dhaka Bank PLC. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dhaka Bank PLC. Risk Management Officer Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Experience: At least 5 years Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Minimum Bachelor Degree Experience At least 5 years The applicants should have experience in the following business area(s): Banks Additional Requirements Minimum 5 years` experience, including 2 years mandatory experience in RMD/Basel/Credit or Treasury. Excellent verbal and written communication skills both in Bangla and English Excellent analytical skills Responsibilities & Context Functional Role: Risk Analyst (Bond Investment), RBS Desk, Operational Risk Analyst, Research & Policy Development, BASEL Desk & PCA Desk Designation: PO-SPO Key Accountabilities Issuance of Sub-Ordinated Bond (Approval & Regulatory Compliance) Analyzing & identifying Market Risk, Operational Risk, Monitoring the implementation of Basel III across the bank Calculating & Raising the required Capital under Tier-2 Analyzing, Evaluating & Preparing proposal for investment in Tier-2 Bonds and Mutual Funds Monitoring the indicators of PCA Framework and identify early warning signals Assessing the Risks under PCA and taking appropriate steps for risk mitigation Developing the Recovery Plan of the Bank Collecting & Coordinating with related Divisions and Providing Information/Data for RBS, Present Reports to the Management & Coordinate with Bangladesh Bank on RBS progress, emerging risk and conduct assessment of inherent risk Arrange periodic meeting with the RBS Coordination Committee & Central Bank, Implementing & monitoring the Key Risk Indicator (KRI) Identifying the vulnerable areas related to operational risk Assisting in managing risks related to lapses in people, process and system Monitoring unsettled issues (identified fraud/forgeries, major irregularities etc.) through ICC Monitoring compliance of observations of Bangladesh Bank Developing, testing, and using different models (Collection scoring, Vintage curve etc.) for measuring/assessing risks Reviewing effectiveness of enterprise-wide risk governance framework and recommending necessary policy measures Conducting research to explore reasons behind concurrence of the identified risks Assisting senior management in formulating strategic planning considering bank`s risk exposures and industry as a whole. Preparing a consolidated Risk Appetite Statement (RAS) Calculating & Analyzing the ICAAP report under Basel III Skills & Expertise Suggested by Risk Management Regulatory Compliance Banks & Financial Recovery Employment Status Full Time Job Location Anywhere in Banglad"
  },
  {
    "url": "https://bdjobs.com/h/details/1457456?ln=1",
    "company_name": "Dhaka Bank PLC.",
    "job_title": "Special Asset Management Officer",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "At least 5 years",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Special Asset Management Officer : Dhaka Bank PLC. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dhaka Bank PLC. Special Asset Management Officer Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Experience: At least 5 years Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Minimum Bachelor Degree Experience At least 5 years The applicants should have experience in the following business area(s): Banks Additional Requirements Minimum 5 years` relevant experience Excellent verbal and written communication skills both in Bangla and English Excellent analytical skills Responsibilities & Context Designation: PO - SPO Key Accountabilities Monitor recovery/regularization/rescheduling of NPL portfolio in line with Bangladesh Bank and internal guidelines. Negotiate with clients and other relevant parties to implement strategies for recovery, restructuring, rescheduling, and settlement of classified loans and advances. Initiate legal processing upon requirement & maintain relationship with regulators, law enforcement teams and lawyers. Provide support, advice & guidance to the branches in recovery of the classified loans. Monitor proper utilization of budget for special asset management and maintain the quality of risk assets and ensure periodic review. Ensure compliance with internal policies and procedures and regulatory requirements with Bangladesh Bank. Prepare and present MIS, portfolio analysis, and recovery performance reports to senior management. Coordinate with other divisions/branches when required Skills & Expertise Suggested by Asset management Recovery Regulatory MIS Portfolio Management Employment Status Full Time Job Location Anywhere in Bangladesh Read Before Apply Interested candidates are requested to apply for the above role by 21 February 2026 Company Information Dhaka Bank PLC. Follow More jobs from this company Address: Plot: CWS (C)-10, Bir Uttam A K Khandakar Road, Gulshan-01, Ward-19, Dhaka North City Corporation, Dhaka-1212. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে"
  },
  {
    "url": "https://bdjobs.com/h/details/1457435?ln=1",
    "company_name": "Async Software",
    "job_title": "Backend / Full-Stack Python Developer (AI Systems, Azure/AWS)",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Backend / Full-Stack Python Developer (AI Systems, Azure/AWS) : Async Software Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Async Software Backend / Full-Stack Python Developer (AI Systems, Azure/AWS) Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 2 Age: 24 to 29 years Location: Anywhere in Bangladesh Experience: At least 1 year Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 1 year Additional Requirements Age 24 to 29 years Python FastAPI AWS PostgreSQL LangChain Machine Learning Streamlit ReactNext.js GitHub Responsibilities & Context We are hiring two developers to work on AI-powered backend services and system infrastructure, with some frontend integration work. This role focuses on building, improving, and maintaining production systems — not research or theory work. Responsibilities: Develop and maintain Python backend services Build APIs using FastAPI Work with PostgreSQL databases Support AI/LLM pipelines using LangChain Propose AI conepts and Models Improve system performance, fix bottlenecks, and optimise speed Implement caching and load balancing where needed Support deployments, environments, and pipelines Contribute across backend, middleware, and integration tasks Assist with frontend integration using React or Next.js when needed Build or maintain internal tools and dashboards using Streamlit Required Skills: Strong Python backend experience AWS experience (EC2, S3, RDS or similar) PostgreSQL FastAPI LangChain or LLM-based application experience Understanding of machine learning in practical applications Experience with Streamlit Experience with React or Next.js GitHub and version control workflows Experience with deployment and production environments Bonus (not required): Jira or other task management tools Docker or container experience Requirements: Must have a portfolio or GitHub showing previous work Experience working with production systems is important Ability to troubleshoot performance and scaling issues Comfortable working across backend and integration tasks Good communication skills We are looking for committed team members who take ownership and follow tasks through to completion Contract & Budget: This is a 3–6 month contract role with the possibility of extension based on performance and project needs. We are working within a tight startup budget , so applicants are asked to include their salary expectations when applying. This role suits developers looking for consistent project involvement and responsibility, rather than short-term gig work. Workplace Work from home Employment Status Contractual Job Location Anywhere in Bangladesh Company Information Async Software Follow Address: SW1 London Business: Growing SAAS, AI , Mobile Software business Report this Job / Company (রিপো"
  },
  {
    "url": "https://bdjobs.com/h/details/1456780?ln=1",
    "company_name": "GMR International Group Ltd",
    "job_title": "English Speaking Video Presenter",
    "location": "Dhaka",
    "salary": "",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "English Speaking Video Presenter : GMR International Group Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List GMR International Group Ltd English Speaking Video Presenter Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 25 to 35 years Location: Dhaka Experience: At least 1 year Published: 06 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Diploma Higher Secondary Experience At least 1 year The applicants should have experience in the following business area(s): Advertising Agency, Boutique/ Fashion, Direct Selling/Marketing Service Company, IT Enabled Service, Training Institutes Additional Requirements Age 25 to 35 years Responsibilities & Context We are looking for a confident English-speaking person who can speak fluently and feel comfortable in front of a camera. The job is to speak and present in videos for our company. Job Responsibilities: Speak English clearly in front of the camera Record simple videos for social media and marketing Follow given script or talk on given topics Look neat, clean, and confident on camera Manage customers on social media (reply to messages & comments) Talk with customers over phone if needed *** Experience in video, hosting, or presenting is a plusNo experience required. Requirements: Must speak English fluently Clear pronunciation and good accent Comfortable in front of camera Presentable and well-groomed Confident and friendly attitude IELTS or Spoken English certification from a well-reputed institution will be highly appreciated. Skills & Expertise Content Creation Customer Communication Fluent in English Speaking Good comunication skill On camera presence Teamwork Workplace Work from home,Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights Job Highlights: English speaking job (must be fluent) Work in front of camera (video presentation) No experience required – freshers can apply Friendly and supportive working environment Company Information GMR International Group Ltd Follow More jobs from this company Address: 71-75 Shelton Street, Covent Garden, London, WC2H 9JQ Website: https://www.upwaw.com/ Business: We are a UK-based technology company, hiring skilled remote developers from Bangladesh. Our focus is on building high-performance backend systems using modern tools like FastAPI, Docker, and PostgreSQL for global fintech, SaaS, and e-commerce projects. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চা"
  },
  {
    "url": "https://bdjobs.com/h/details/1457438?ln=1",
    "company_name": "Toplink Education",
    "job_title": "Japanese Language Teacher",
    "location": "Dhaka (Dhanmondi 27)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Japanese Language Teacher : Toplink Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Toplink Education Japanese Language Teacher Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 22 to 55 years Location: Dhaka (Dhanmondi 27) Salary: Negotiable Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 55 years Responsibilities & Context Toplink Japanese Language Center Toplink Japanese Language Center , a concern of TOPLINK Education , is inviting applications from qualified, energetic, and dedicated teachers for Japanese language instruction. Responsibilities: Conduct Japanese Language Classes (N5 & N4) Prepare lesson plans, teaching materials, and class activities Ensure regular student assessment and progress monitoring Communicate with students regarding class schedules, problems, and solutions Assist students in preparation for school interviews and embassy interviews Translate study materials and student documents ( English ↔ Japanese ) Maintain daily class reports and teaching records Coordinate with internal team members and management Organize Zoom classes, live sessions, and online meetings Perform any other academic duties assigned by the management Qualifications: Japanese Language proficiency ( JLPT N4 / N3 or above preferred ) Teaching experience in the Japanese language will be an advantage Strong communication and presentation skills Ability to conduct classes both online and offline Responsible, punctual, and student-friendly attitude Skills & Expertise Japanese Culture Japanese Interpreter Japanese Language Compensation & Other Benefits Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 As per company policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Dhanmondi 27) Apply Procedure Email Your CV Send your CV to the given email toplinkedu25@gmail.com or Email your CV from My Bdjobs account Company Information Toplink Education Follow Address: House 08, Road 14, Dhanmondi (Opposite of Subhanbagh Masjid) Website: http://www.toplinkeducation.com Business: We are dedicated to helping students achieve their academic and career goals through expert language training and professional study-abroad consultation. Our specialized programs in Japanese Language (JLPT & NAT) and IELTS ensure that students develop the skills Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন "
  },
  {
    "url": "https://bdjobs.com/h/details/1457454?ln=1",
    "company_name": "Dhaka Bank PLC.",
    "job_title": "Head, Special Asset Management Division",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Head, Special Asset Management Division : Dhaka Bank PLC. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dhaka Bank PLC. Head, Special Asset Management Division Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 15 years` experience in relevant area Excellent verbal and written communication skills both in Bangla and English Excellent analytical skills Responsibilities & Context Key Accountabilities Lead the recovery initiative of NPL portfolio in line with Bangladesh Bank and internal guidelines. Formulate and implement strategies for recovery, restructuring, rescheduling, and settlement of classified loans and advances. Drive the division`s performance by achieving recovery KPIs, stress asset resolution timelines, and other operational metrics. Liaise with legal advisors, external recovery agencies, and relevant authorities for litigation, arbitration, and settlement processes. Present MIS, portfolio analysis, and recovery performance reports to senior management and the Board. Ensure compliance with internal policies and procedures and regulatory requirements with Bangladesh Bank. Mentor and develop Special Asset Management Division (SAMD) team members to enhance recovery effectiveness and professional competence. Coordinate with other divisions/branches when required. Skills & Expertise Suggested by Banks & Financial Asset management KPI Credit Control And Recovery MIS Employment Status Full Time Job Location Anywhere in Bangladesh Read Before Apply Interested candidates are requested to apply for the above role by 21 February 2026 Company Information Dhaka Bank PLC. Follow More jobs from this company Address: Plot: CWS (C)-10, Bir Uttam A K Khandakar Road, Gulshan-01, Ward-19, Dhaka North City Corporation, Dhaka-1212. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professio"
  }
]