[
  {
    "url": "https://bdjobs.com/h/details/1400763?ln=1",
    "company_name": "Dr Erfan Colorectal Center",
    "job_title": "ওয়ার্ড বয়, আয়া, ক্লিনার (Ward Boy, Aya, Cleaner))",
    "location": "Dhaka (PanthaPath)",
    "salary": "Negotiable",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "ওয়ার্ড বয়, আয়া, ক্লিনার (Ward Boy, Aya, Cleaner)) : Dr Erfan Colorectal Center Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dr Erfan Colorectal Center ওয়ার্ড বয়, আয়া, ক্লিনার (Ward Boy, Aya, Cleaner)) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 20 to 35 years Location: Dhaka (PanthaPath) Salary: Negotiable Experience: 1 to 2 years Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education SSC HSC Experience 1 to 2 years Additional Requirements Age 20 to 35 years Responsibilities & Context স্ট্রেচার বা হুইলচেয়ারে করে রোগীদের অপারেশন থিয়েটার বা কেবিনে আনা-নেওয়া করা। রোগীর বিছানা পরিষ্কার করা,চাদর পরিবর্তন এবং ওয়ার্ড বা কেবিনের পরিচ্ছন্নতা নিশ্চিত করা। ডাক্তার বা নার্সদের বিভিন্ন মেডিকেল সরঞ্জাম প্রস্তুত রাখা ও সরবারহ করা। হাসপাতালের প্রয়োজনীয় ফাইলরিপোর্ট বা নথিপত্র এক বিভাগ থেকে অন্য বিভাগে আনা-নেওয়া করা। রোগীর সাধারণ অবস্থা পর্যবেক্ষণ করা এবং জরুরি প্রয়োজন বা কোনো পরিবর্তন হলে নার্স বা ডাক্তারকে দ্রুত জানানো। রোগীদের বেডনার্সিং স্টেশনবাথরুম এবং অপারেশন থিয়েটারসহ হাসপাতালের বিভিন্ন অংশ জীবাণুনাশক দিয়ে নিয়মিত পরিষ্কার করা। মেডিকেল বর্জ্যসাধারণ আবর্জনা নিরাপদে অপসারণ এবং নির্দিষ্ট স্থানে ফেলার ব্যবস্থা করা। Workplace Work at office Employment Status Full Time Job Location Dhaka (PanthaPath) Company Information Dr Erfan Colorectal Center Follow More jobs from this company Address: City Tower, Lift-4, 44/7 Panthapath, Dhaka 1205 Business: The only institution in Bangladesh specializing in colorectal laser proctology Dr Erfan Colorectal Center was founded by Prof. Dr. SMA Erfan with a vision to create a Ideal health care center for our nation's healthcare system. We prioritize transparency and are deeply committed to our work with unwavering dedication. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Lea"
  },
  {
    "url": "https://bdjobs.com/h/details/1464441?ln=1",
    "company_name": "Global Import",
    "job_title": "ফিল্ড মার্কেটিং এক্সিকিউটিভ",
    "location": "Chattogram",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "ফিল্ড মার্কেটিং এক্সিকিউটিভ : Global Import Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Global Import ফিল্ড মার্কেটিং এক্সিকিউটিভ Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At least 18 years Location: Chattogram Salary: Tk. 18000 (Monthly) Experience: 1 to 2 years Published: 01 Mar 2026 Application Insights View Requirements Education ​​শিক্ষাগত যোগ্যতা: ন্যূনতম এইচএসসি (HSC) পাস। (অভিজ্ঞদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য)।​ অভিজ্ঞতা: সংশ্লিষ্ট কাজে ১-২ বছরের অভিজ্ঞতা সম্পন্ন প্রার্থীরা অগ্রাধিকার পাবেন। তবে ফ্রেশাররাও আবেদন করতে পারবেন। ​অন্যান্য: চমৎকার যোগাযোগ দক্ষতা এবং স্মার্ট উপস্থাপনা। বাইসাইকেল বা মোটরসাইকেল চালনায় পারদর্শীদের অগ্রাধিকার দেওয়া হবে। Experience 1 to 2 years The applicants should have experience in the following business area(s): Importer Additional Requirements Age At least 18 years Only Male Responsibilities & Context ​নিয়োগ বিজ্ঞপ্তি: ​আমাদের প্রতিষ্ঠানে 'ফিল্ড মার্কেটিং এক্সিকিউটিভ' পদে কিছুসংখ্যক উদ্যমী ও পরিশ্রমী কর্মী নিয়োগ দেওয়া হবে। সরাসরি মাঠ পর্যায়ে কাজ করতে আগ্রহী প্রার্থীদের কাছ থেকে দরখাস্ত আহ্বান করা যাচ্ছে। ​পদের নাম: ফিল্ড মার্কেটিং এক্সিকিউটিভ ​মূল দায়িত্বসমূহ: ​প্রতিষ্ঠানের পণ্য বা সেবা সম্পর্কে সম্ভাব্য গ্রাহকদের জানানো। ​সরাসরি মাঠ পর্যায়ে (Field Level) ভিজিট করা এবং নতুন ক্লায়েন্ট তৈরি করা। ​মাসিক বিক্রয় লক্ষ্যমাত্রা অর্জন করা। ​কাস্টমারদের সাথে সুসম্পর্ক বজায় রাখা এবং নিয়মিত ফলোআপ করা। Compensation & Other Benefits বেতন ও সুযোগ-সুবিধা: ​মাসিক বেতন: 18,000/- টাকা ও নানাবিধি সুবিধা Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Chattogram Company Information Global Import Follow Address: Mohammad Ali building 3rd floor, Kadamtoli, Thana: Kotwali, Chattogram Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal a"
  },
  {
    "url": "https://bdjobs.com/h/details/1464442?ln=1",
    "company_name": "MetLife Bangladesh - Hoque Agency",
    "job_title": "Office Secretary",
    "location": "Dhaka, Dhaka (Purana Paltan)",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Office Secretary : MetLife Bangladesh - Hoque Agency Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MetLife Bangladesh - Hoque Agency Office Secretary Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 22 to 30 years Location: Dhaka, Dhaka (Purana Palt... Dhaka, Dhaka (Purana Paltan) Salary: Tk. 20000 - 25000 (Monthly) Published: 28 Feb 2026 Application Insights View Requirements Education Diploma in Computer Additional Requirements Age 22 to 30 years Responsibilities & Context Manage correspondence, phone calls, emails, and scheduling with accuracy and professionalism. Prepare and edit reports, letters, and presentations using modern office software. Maintain organized digital and physical records, databases, and filing systems. Coordinate meetings, appointments, and internal communications. Support management with daily administrative tasks, ensuring timely follow-ups. Assist team members with computer and technology use, including troubleshooting basic software issues. Adapt to new software platforms quickly and help implement efficient digital workflows. Skills & Expertise Communication in English Computer Literacy COMPUTER OFFICE MANAGEMENT Tech Savvy Technology skill Time Management Workplace Work at office Employment Status Full Time Job Location Dhaka, Dhaka (Purana Paltan) Company Information MetLife Bangladesh - Hoque Agency Follow Address: MetLife Bangladesh – Hoque Agency is one of the country’s leading life insurance and financial services agencies under MetLife Bangladesh. Founded with a mission to provide trusted financial protection and personalized client service, Hoque Agency has built a strong reputation for excellence. Website: https://www.metlife.com.bd/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal"
  },
  {
    "url": "https://bdjobs.com/h/details/1464142?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464425?ln=1",
    "company_name": "Majesto Limited",
    "job_title": "Die Casting Engineer",
    "location": "Narayanganj (Sonargaon)",
    "salary": "Negotiable",
    "experience": "4 to 8 years",
    "education": null,
    "deadline": "30 Mar 2026",
    "job_description": "Die Casting Engineer : Majesto Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Majesto Limited Die Casting Engineer Application Deadline : 30 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Age: 30 to 45 years Location: Narayanganj (Sonargaon) Salary: Negotiable Experience: 4 to 8 years Published: 28 Feb 2026 Application Insights View Requirements Education Bachelor in Engineering (BEngg) in Materials & Metallurgical Engineering Bachelor in Engineering (BEngg) in Mechanical Engineering Bangladesh University of Engineering and Technology,Rajshahi University of Engineering and Technology,Khulna University of Engineering and Technology,University of Science and Technology, Chittagong students will get preference Experience 4 to 8 years The applicants should have experience in the following business area(s): Furniture Manufacturer, Manufacturing (FMCG), Plastic/ Polymer Industry Additional Requirements Age 30 to 45 years Only Male Responsibilities & Context Monitor and control die casting production process; Optimise cycle time and improve productivity; Ensure proper machine parameter setting (temperature, pressure, injection speed, etc.); Maintain production quality as per standard; Coordinate die design, modification, and maintenance; Analyze mold life and take corrective actions; Ensure proper cooling system and lubrication; Identify casting defects (porosity, shrinkage, cold shut, flash, etc.); Conduct root cause analysis and implement corrective actions; Coordinate with maintenance team for preventive maintenance; Ensure machines and furnaces are operating efficiently; Maintain process documentation and SOP. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Narayanganj (Sonargaon) Job Highlights Experience Required in Metal & Aluminium Die Cast; BUET students will get priority with subject “Materials & Metallurgical Engineering” Company Information Majesto Limited Follow Address: Katharabo, Mohajampur, Sonargaon, Narayanganj, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow "
  },
  {
    "url": "https://bdjobs.com/h/details/1464451?ln=1",
    "company_name": "A Well Reputed Buying House",
    "job_title": "Merchandiser/Sr. Merchandiser (Denim)",
    "location": "Dhaka, Narayanganj",
    "salary": null,
    "experience": "6 to 9 years",
    "education": null,
    "deadline": "30 Mar 2026",
    "job_description": "Merchandiser/Sr. Merchandiser (Denim) : A Well Reputed Buying House Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Well Reputed Buying House Merchandiser/Sr. Merchandiser (Denim) Application Deadline : 30 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 28 to 34 years Location: Dhaka, Narayanganj Salary: Negotiable Experience: 6 to 9 years Published: 28 Feb 2026 Application Insights View Requirements Experience 6 to 9 years The applicants should have experience in the following business area(s): Garments, Buying House Additional Requirements Age 28 to 34 years Candidates with working experience in buying or sourcing offices will get preference. Must have good communication skill in English The applicants should have experience in the following business area(s):Buying House, Textile, Trading or Export/Import Responsibilities & Context A well reputed Buying House is looking for a potential candidate for \"Merchandiser/Sr. Merchandiser(Denim)\", should have the initiative, drive, and self-motivation to take the challenge to deliver high-quality results on set KPI. Review tech packs and buyer requirements to assess feasibility and costing strategy. Lead sample development (Proto, Fit, Size Set, PP, Wash) in coordination with design, washing, and technical teams. Source and develop denim fabrics, trims, and washes aligned with buyer expectations. Prepare accurate and competitive costing sheets ensuring target margin achievement. Provide risk analysis and proactive solutions during development stages. Confirm order details and establish Time & Action (T&A) calendar. Coordinate cross-functionally with production, washing, sourcing, QA, and commercial teams. Monitor raw material in-house status and production progress. Ensure compliance with buyer technical, quality, and social standards. Oversee shipment planning and documentation in coordination with the commercial department. Maintain strong buyer communication to ensure transparency and trust. Skills & Expertise Good knowledge in Denim Merchandiser Compensation & Other Benefits Mobile bill Salary Review: Yearly Festival Bonus: 2 Others Benefits as per Company Policy Workplace Work at office Employment Status Full Time Job Location Dhaka, Narayanganj Company Information A Well Reputed Buying House Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Int"
  },
  {
    "url": "https://bdjobs.com/h/details/1464443?ln=1",
    "company_name": "Talibrate",
    "job_title": "Python SDET (CI/CD & Test Infrastructure)",
    "location": "Dhaka",
    "salary": "Tk. 90000 - 180000 (Monthly)",
    "experience": "At least 3 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Python SDET (CI/CD & Test Infrastructure) : Talibrate Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Talibrate Python SDET (CI/CD & Test Infrastructure) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 24 to 35 years Location: Dhaka Salary: Tk. 90000 - 180000 (Monthly) Experience: At least 3 years Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience At least 3 years The applicants should have experience in the following business area(s): Software Company, IT Enabled Service Additional Requirements Age 24 to 35 years Responsibilities & Context Company: Talibrate Employment Type: Full-time Location: Remote (Bangladesh) Experience Level: Mid-Level (2–6 Years) About the Role Talibrate is hiring a Test Engineer on behalf of one of our US-based engineering clients. This is a mid-level, hands-on role focused on building and maintaining automated testing infrastructure across high-performance backend systems. This position is not a traditional manual QA role. The selected candidate will work closely with senior engineers to design, build, and improve automated test frameworks, CI/CD integrations, and validation systems that ensure reliability and performance as codebases scale. If you enjoy working on technical problems, building systems, and improving engineering quality at the infrastructure level, this role is for you. Key Responsibilities Design and build automated testing infrastructure (unit, integration, and end-to-end test suites) Develop and maintain reusable test frameworks across multiple backend projects Integrate automated testing into CI/CD pipelines Build monitoring and alerting mechanisms to detect regressions early Perform test planning, coverage analysis, and gap identification Write and maintain advanced test harnesses (including property-based or fuzz testing where applicable) Collaborate with backend engineers to improve system reliability and performance Document testing strategies and recommend technical improvements Required Qualifications 2–6 years of experience in software engineering or test automation Strong programming skills in Python or Rust Comfortable working with TypeScript or modern web technologies Strong knowledge of Linux systems and shell scripting Experience integrating automated testing within CI/CD pipelines Solid understanding of automation frameworks and testing methodologies Strong analytical and problem-solving ability High attention to detail Communication Requirement: Excellent English communication skills (spoken and written) are mandatory. Must be comfortable working directly with US-based engineering teams in English. Preferred Qualifications Experience with Rust Experience with Docker, Kubernetes, or containerized environments Exper"
  },
  {
    "url": "https://bdjobs.com/h/details/1464449?ln=1",
    "company_name": "Luxdon Travel Management",
    "job_title": "Senior Travel Consultant",
    "location": "",
    "salary": "Tk. 30000 - 45000 (Monthly)",
    "experience": null,
    "education": null,
    "deadline": "30 Mar 2026",
    "job_description": "Senior Travel Consultant : Luxdon Travel Management Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Luxdon Travel Management Senior Travel Consultant Application Deadline : 30 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 5 Location: Dhaka (Gulshan) Salary: Tk. 30000 - 45000 (Monthly) Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Responsibilities & Context Position: Senior Travel Consultant Vacancy: 2 Age: 25–40 years Job Location: Dhaka (Gulshan-1) Employment Status: Full Time Workplace: Work at office Company Overview Luxdon Travel Management is a trusted and dynamic travel solutions provider specializing in international and religious tourism. We offer flight ticketing, hotel reservations, visa processing, Umrah packages, and ground transfers for clients across the UK, Bangladesh, and beyond. We are seeking a motivated and experienced Senior Travel Consultant to lead our sales operations and enhance client experience. Key Responsibilities Lead and manage the sales team to achieve monthly performance targets. Engage with high-end international clients, providing tailored travel solutions. Handle bookings, amendments, client inquiries, and service requests professionally. Report directly to the Managing Director on sales performance and client satisfaction. Maintain strong coordination with internal teams to ensure smooth operations. Ensure accurate documentation, reporting, and booking management. Mentor and guide team members to improve service and sales performance. Participate in training sessions to enhance product knowledge and leadership skills. Requirements Bachelor/Honors degree (minimum). At least 3 years of proven experience in the travel industry. Fluent English communication skills (minimum IELTS band score 7+ or equivalent). Experience dealing with high-end international clients. Strong leadership and interpersonal skills. Willingness to work international hours including night shifts. Working Hours 2:00 PM – 11:00 PM 9:00 PM – 6:00 AM (Minimum 3–4 night shifts required per month) Compensation & Benefits Base Salary: Tk. 30,000 – 45,000 Commission: Tk. 25,000+ per month Additional performance-based bonuses Yearly salary review Festival Bonus: 2 Applicants are encouraged to submit a Video CV. Company Information Luxdon Travel Management Navana Tower, Flat-20C 45 Bir Uttam Mir Shawkat Ali Road Gulshan-1, Dhaka-1212 Employment Status Full Time Job Location Dhaka (Gulshan) Job Highlights Leadership role in an international travel firm. Salary Tk. 30,000–45,000 + Tk. 25,000+ commission. Direct reporting to MD. Yearly salary review, festival bonus, and strong career growth opportunity. Company Information Luxdon Travel Management Follow Address: Navana Tower, Flat-20C, 45 Bir Uttam Mir Shawkat Ali Road, Gulshan-1, Dhaka-1212. transfer this in Ba"
  },
  {
    "url": "https://bdjobs.com/h/details/1458081?ln=1",
    "company_name": "Dr Erfan Colorectal Center",
    "job_title": "মেডিকেল অফিসার (Medical Officer)",
    "location": "Dhaka (PanthaPath)",
    "salary": "Negotiable",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "মেডিকেল অফিসার (Medical Officer) : Dr Erfan Colorectal Center Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dr Erfan Colorectal Center মেডিকেল অফিসার (Medical Officer) Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 25 to 35 years Location: Dhaka (PanthaPath) Salary: Negotiable Experience: 1 to 3 years Published: 28 Feb 2026 Application Insights View Requirements Education Bachelor of Medicine and Bachelor of Surgery(MBBS) Experience 1 to 3 years Additional Requirements Age 25 to 35 years Responsibilities & Context ১. প্রাথমিক চিকিৎসার সাথে শিফটিং ডিউটি ওয়ার্ডের দায়িত্ব পালনের জন্য তাকে এমবিবিএস মানদণ্ডে থাকতে হবে। ২. জরুরি রোগীদের চিকিৎসা সেবা প্রদান। ৩. সার্জনকে সহায়তা করতে হবে। Skills & Expertise Surgery Workplace Work at office Employment Status Full Time Job Location Dhaka (PanthaPath) Company Information Dr Erfan Colorectal Center Follow More jobs from this company Address: City Tower, Lift-4, 44/7 Panthapath, Dhaka 1205 Business: The only institution in Bangladesh specializing in colorectal laser proctology Dr Erfan Colorectal Center was founded by Prof. Dr. SMA Erfan with a vision to create a Ideal health care center for our nation's healthcare system. We prioritize transparency and are deeply committed to our work with unwavering dedication. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Jo"
  },
  {
    "url": "https://bdjobs.com/h/details/1458454?ln=1",
    "company_name": "Dr Erfan Colorectal Center",
    "job_title": "ওটি ও ফ্লোর নার্স (OT or Staff Nurse)(OT Boy)",
    "location": "Dhaka (PanthaPath)",
    "salary": "Negotiable",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "ওটি ও ফ্লোর নার্স (OT or Staff Nurse)(OT Boy) : Dr Erfan Colorectal Center Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dr Erfan Colorectal Center ওটি ও ফ্লোর নার্স (OT or Staff Nurse)(OT Boy) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 20 to 35 years Location: Dhaka (PanthaPath) Salary: Negotiable Experience: 1 to 3 years Published: 28 Feb 2026 Application Insights View Requirements Education Diploma in Nursing Experience 1 to 3 years Additional Requirements Age 20 to 35 years Responsibilities & Context Skills & Expertise Senior Staff Nurse (OT) Staff Nursing Surgical Nursing Workplace Work at office Employment Status Full Time Job Location Dhaka (PanthaPath) Company Information Dr Erfan Colorectal Center Follow More jobs from this company Address: City Tower, Lift-4, 44/7 Panthapath, Dhaka 1205 Business: The only institution in Bangladesh specializing in colorectal laser proctology Dr Erfan Colorectal Center was founded by Prof. Dr. SMA Erfan with a vision to create a Ideal health care center for our nation's healthcare system. We prioritize transparency and are deeply committed to our work with unwavering dedication. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Reg"
  },
  {
    "url": "https://bdjobs.com/h/details/1464426?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464467?ln=1",
    "company_name": "Youngone",
    "job_title": "Maintenance Chief (In-Charge)",
    "location": "Dhaka (Savar EPZ)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Maintenance Chief (In-Charge) : Youngone Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Youngone Maintenance Chief (In-Charge) Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Location: Dhaka (Savar EPZ) Salary: Tk. 20000 (Monthly) Published: 01 Mar 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Responsibilities & Context Ensure smooth operation of all sewing machines (Single Needle, Overlock, Flatlock, Feed-off-the-Arm, Kansai, Button Attach, Buttonhole, Bartack, etc.). Supervise immediate troubleshooting of machine breakdowns. Monitor machine efficiency and reduce downtime. Ensure proper machine setting according to style change requirements. Skills & Expertise woven Garments Compensation & Other Benefits Provident fund,Insurance Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 As per company policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Savar EPZ) Company Information Youngone Follow More jobs from this company Address: Plot No: 1-4, 9-12 DEPZ, Savar, Dhaka. Business: A multinational company producing Technical outerwear, Active sportswear, Sports shoes, Backpack,Nylon Dyeing & Finishing, Polyester Fiber Products with backward linkage facilities, having Corporate Head Office at South Korea and production based and marketing offices across the globe. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow"
  },
  {
    "url": "https://bdjobs.com/h/details/1464330?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464452?ln=1",
    "company_name": "Ishara Consultancies",
    "job_title": "Intern – Virtual Assistant & AI-Workflow",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": "Tk. 8000 - 10000 (Monthly)",
    "experience": null,
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Intern – Virtual Assistant & AI-Workflow : Ishara Consultancies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ishara Consultancies Intern – Virtual Assistant & AI-Workflow Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Dhaka (DOHS Mirpur) Salary: Tk. 8000 - 10000 (Monthly) Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Responsibilities & Context 📢 We’re Hiring: Intern – Virtual Assistant & AI-Workflow Are you a university fresher or recent graduate looking to start your career in the digital industry? Do you want hands-on exposure to international virtual assistant projects, AI workflows, e-commerce, and performance marketing? We are looking for a smart, dedicated, and growth-driven intern who wants to build real-world skills in operations, Shopify development, and advanced digital systems. This is not a routine internship. You will work on practical tasks, international projects, and modern tools including AI workflow systems and Media Buying CAPI integrations. 🎯 Key Responsibilities 🔹 Virtual Assistant & AI-Workflow -Manage executive email sorting and organization -Coordinate meetings and calendar scheduling -Track tasks and maintain workflow systems -Support operational documentation and reporting -Assist in implementing basic AI automation workflows (training provided) 🔹 Shopify & Media Buying CAPI Management -Assist in Shopify store setup and development -Manage product uploads and backend configurations -Work on conversion rate optimization (CRO) improvements -Support performance tracking and store analysis -Assist in Media Buying CAPI integration tasks (Meta Conversion API) # Outstanding performance during the internship can lead to a full-time role with increased responsibility and leadership opportunities within the company. 🧠 Who We’re Looking For ✔ University fresher or recent graduate ✔ Strong willingness to learn and grow in digital operations & e-commerce ✔ Coachable mindset and openness to feedback ✔ Responsible and accountable in task execution ✔ Able to commit full-time ✔ Candidates residing in or near Mirpur DOHS will be given preference 🌍 What You’ll Gain Exposure to international client projects Practical experience with AI workflow systems Hands-on learning in Shopify development and CRO Experience working with Media Buying CAPI integrations Structured mentorship and real responsibility 𝐋𝐨𝐜𝐚𝐭𝐢𝐨𝐧: Mirpur DOHS (Candidates residing nearby are preferred) 𝐌𝐨𝐝𝐚𝐥𝐢𝐭𝐲: Full-time, On-site (6 Days/Week, 11:00am - 7:00pm) 𝐑𝐞𝐦𝐮𝐧𝐞𝐫𝐚𝐭𝐢𝐨𝐧: 8,000-10,000 BDT 𝐈𝐧𝐭𝐞𝐫𝐧𝐬𝐡𝐢𝐩 𝐃𝐮𝐫𝐚𝐭𝐢𝐨𝐧: 3 months, with the opportunity for a full-time position based on performance. Skills & Expertise Communication and interpersonal skill Virtual Assistance Workplace Work at office Employment Status Full Time Job"
  },
  {
    "url": "https://bdjobs.com/h/details/1464464?ln=1",
    "company_name": "CG Apparel Ltd. (Gavans Group)",
    "job_title": "Garment Quality Auditor",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "31 Mar 2026",
    "job_description": "Garment Quality Auditor : CG Apparel Ltd. (Gavans Group) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List CG Apparel Ltd. (Gavans Group) Garment Quality Auditor Application Deadline : 31 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 25 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 25000 (Monthly) Published: 01 Mar 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 35 years Only Male Responsibilities & Context Key Job Responsibilities Raw Material Inspection: Inspect fabric for GSM, shrinkage, and color consistency; check trims, buttons, and zippers for functionality. In-line Inspection: Conduct regular checks during sewing to identify and correct defects early (e.g., stitches per inch, seam strength). End-line & Final Audit: Perform inspections on finished garments to verify size specifications, appearance, and quality before packing. Documentation & Reporting: Maintain detailed inspection reports, maintain daily quality records, and analyze data to improve production quality. Quality Compliance: Ensure compliance with buyer specifications and international quality standards. Corrective Action (CAP): Investigate quality issues, identify root causes, and implement corrective actions to prevent recurrence. Technical Support: Train and guide QC inspectors. Final Random Inspection (FRI): Conduct final inspections using AQL standards before shipment. Key Competencies: Knowledge: Strong understanding of garment construction, fabric types, and AQL standards. Skills: Proficiency in MS Office, analytical skill, and familiarity with Quality Management Systems (QMS). Skills & Expertise Quality assurance and control Quality Control Audit/ Inspect Textile and Garments MS Office Communication in English Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information CG Apparel Ltd. (Gavans Group) Follow More jobs from this company Address: 129/1, Nayabari Road, Sataish, Tongi, Gazipur Website: https://cgapparelbd.com/ Business: 100% Japanese Inspection Company & Buying House Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor "
  },
  {
    "url": "https://bdjobs.com/h/details/1464465?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464453?ln=1",
    "company_name": "Ishara Consultancies",
    "job_title": "Marketing Executive - Virtual Assistant & AI-Workflow",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": "Tk. 18000 - 20000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Marketing Executive - Virtual Assistant & AI-Workflow : Ishara Consultancies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ishara Consultancies Marketing Executive - Virtual Assistant & AI-Workflow Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Dhaka (DOHS Mirpur) Salary: Tk. 18000 - 20000 (Monthly) Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Responsibilities & Context 📢 We’re Hiring: Marketing Executive - Virtual Assistant & AI-Workflow We are looking for a proactive and responsible Marketing Executive to lead executive operations, AI-driven workflow systems, and digital performance support within our organization. This role combines structured virtual assistance, AI workflow implementation, and hands-on involvement in Shopify store management and optimization. You will contribute to international projects, support Media Buying CAPI integrations, and help streamline operational and marketing processes through automation and data-driven systems. If you are organized, execution-focused, and ready to take ownership in a fast-growing digital environment, this position offers significant exposure and long-term growth potential. 🎯 Key Responsibilities 🔹 Automation & Virtual Assistance Manage and optimize executive email systems and communication flow Coordinate meetings, scheduling, and calendar management with precision Maintain structured task management and workflow systems Oversee documentation and operational processes Implement and manage AI automation workflows where applicable 🔹 Shopify & Media Buying CAPI Management Develop and manage Shopify stores, ensuring proper setup and functionality Handle product listings, backend management, and store maintenance Execute and optimize conversion rate strategies (CRO) Monitor store performance and implement improvements Assist in Media Buying CAPI integrations and tracking accuracy 🧠 Who We’re Looking For ✔ Strong sense of responsibility and ownership ✔ Ability to manage tasks independently with minimal supervision ✔ Structured, detail-oriented, and process-driven ✔ Coachable yet confident in execution ✔ Full-time commitment and professional work ethic ✔ Candidates residing in or near Mirpur DOHS will be preferred 🌍 What You’ll Gain Exposure to international client projects Practical experience with AI workflow systems Advanced knowledge in Shopify and performance optimization Opportunity to grow into a senior operational role 𝐋𝐨𝐜𝐚𝐭𝐢𝐨𝐧: Mirpur DOHS (Candidates residing nearby are preferred) 𝐌𝐨𝐝𝐚𝐥𝐢𝐭𝐲: Full-Time, On-site (6 Days/Week, 11:00am - 7:00pm) 𝐑𝐞𝐦𝐮𝐧𝐞𝐫𝐚𝐭𝐢𝐨𝐧: 20,000 BDT Skills & Expertise Communication and interpersonal skill Shopify Artificial intelligence (AI) Virtual Assistance Workplace Work at office Employment Status Full Time Job"
  },
  {
    "url": "https://bdjobs.com/h/details/1464457?ln=1",
    "company_name": "A H Khan Enterprise",
    "job_title": "Customer Service Representative",
    "location": "Dhaka (Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "Customer Service Representative : A H Khan Enterprise Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A H Khan Enterprise Customer Service Representative Application Deadline : 07 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 18 to 25 years Location: Dhaka (Mirpur) Salary: Tk. 8000 - 10000 (Monthly) Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Age 18 to 25 years Only Male English Typing দক্ষতা থাকতে হবে Bangla Typing দক্ষতা থাকলে ভালো শুদ্ধ ভাষায় কথা বলতে পারেন English & Bangla Typing স্কিল (প্রয়োজন অনুযায়ী) ধৈর্যশীল, রেসপন্সিভ, শেখার ইচ্ছা আছে Responsibilities & Context আমাদের টিম দ্রুত বড় হচ্ছে, তাই আবারও নিচ্ছি: Customer Service Representative (শিফট ভিত্তিক কাজ) শিফট টাইম: সকাল: ১০টা – ৮টা বিকেল: ১২টা – ১০টা সম্পূর্ণ অফিস জব কাজের ধরন: কল দিয়ে কাস্টমারের সাথে কথা বলা ফোনে কাস্টমারের সাথে যোগাযোগ প্রোডাক্ট ও সার্ভিস সম্পর্কে তথ্য প্রদান পেজ ও মেসেজ রিপ্লাই Facebook মেসেজ ও কমেন্ট রিপ্লাই WhatsApp মেসেজ রিপ্লাই অন্যান্য সোশ্যাল মিডিয়া ম্যানেজ Skills & Expertise Computer Literacy Suggested by Client Service/ Marketing Customer Service Compensation & Other Benefits প্রবেশন সময় ৩ মাস ৩ মাস পরে ১০,০০০/- করা হবে পারফ্রমেঞ্চের উপর ভিত্তি করে বাড়তে পারে ফেস্টিভাল বোনাস চা + স্ন্যাক্স ফ্রি শেখার সুযোগ + সাপোর্টিভ পরিবেশ Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur) Company Information A H Khan Enterprise Follow Address: House- 14, Lane- 8, Block- C, Mirpur- 6, Dhaka 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000"
  },
  {
    "url": "https://bdjobs.com/h/details/1464459?ln=1",
    "company_name": "Integrated Korea Education",
    "job_title": "Customer Relationship Officer (Female Only)",
    "location": "Dhaka (Uttara Sector 7)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Customer Relationship Officer (Female Only) : Integrated Korea Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Integrated Korea Education Customer Relationship Officer (Female Only) Application Deadline : 17 Mar 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 29 years Location: Dhaka (Uttara Sector 7) Salary: Tk. 16000 - 20000 (Monthly) Published: 28 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 20 to 29 years Only Female Effective Negotiation skills. Time management. Organize tasks and follow up accordingly. Good knowledge in internet, MS excel etc. Responsibilities & Context Overview We are looking for confident, smart, and success-driven Female Customer Relationship Officer to manage our students, parents, & agents inquiries, lead follow-ups, manage student data & information and track the progress. This role involves calling student, answer their queries, explaining study abroad as per company policy. Important Responsibilities: Clearly explain study costs, programs and academic requirement to study abroad in South Korea. Follow up on leads generated from phone calls, Facebook, WhatsApp, Messenger, and website inquiries. Maintain daily call logs, student information, and follow-up records in Excel & google sheet. Receive, record, and properly document students/customer feedback, queries, and complaints Coordinate with sales and management teams to ensure smooth client handling Maintain excellent customer service standards to ensure client satisfaction Meet assigned service and follow-up targets. Perform any other customer-care or telesales-related tasks assigned by management. Skills & Expertise Microsoft Excel Negotiation and Convincing Skill Planning and organizing Time Management Compensation & Other Benefits Performance bonus,Mobile bill,Over time allowance Festival Bonus: 3 Salary Review: Half Yearly Instant paid comission upto **3000 BDT** for each successful communication with students. Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Uttara Sector 7) Job Highlights Integrated Korea Education(IKE) is a prominent Education Consultancy in Bangladesh particularly famous for study visa processing for South Korea. IKE has been working with great fame and success. Apply Procedure Email Your CV Send your CV to the given email md@ikekorea.com or Email your CV from My Bdjobs account Company Information Integrated Korea Education Follow Address: Sector 7, Road 7, House No 1, Uttara, Dhaka-1230 Business: Integrated Korea Education is a leading Education Agency working for Bachelor, Master & GKS programs at the TOP-RANKED & prestigious South Korean universities, ensuring Bangladeshi talents pursue impactful education. Report this Job / Company (রিপোর্ট) রিপো"
  },
  {
    "url": "https://bdjobs.com/h/details/1463210?ln=0",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  }
]