[
  {
    "url": "https://bdjobs.com/h/details/1458931?ln=1",
    "company_name": "MalishaEdu Dhaka",
    "job_title": "Customer Support Executive",
    "location": "Dhaka (DOHS Mohakhali)",
    "salary": null,
    "experience": "2 to 4 years",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Customer Support Executive : MalishaEdu Dhaka Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MalishaEdu Dhaka Customer Support Executive Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Age: 18 to 30 years Location: Dhaka (DOHS Mohakhali) Salary: Tk. 25000 - 30000 (Monthly) Experience: 2 to 4 years Published: 12 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Ahsanullah University of Science and Technology,University of Dhaka,BRAC University,North South University,Shahjalal University of Science & Technology students will get preference Experience 2 to 4 years The applicants should have experience in the following business area(s): Training Institutes, Immigration and Education Consultancy Service, Educational Technology (Edtech) Startup Additional Requirements Age 18 to 30 years Responsibilities & Context We  are  looking  for  Customer  Support  Executive  (On-Site)  who  will  provide exceptional  customer  service  and  support  to   our  global  clients  across multiple platforms, including the company website, Facebook, Instagram, WeChat, WhatsApp, and Email. As  the primary point  of contact  for  clients,  you  will  address  customer  inquiries, resolve issues, and provide information about our services. If you are passionate about helping customers and thrive in a fast-paced, dynamic environment, we encourage you to apply. Key Responsibilities: 1.   Handle  customer inquiries via Website, WeChat, WhatsApp, Email  and  social media in a timely and professional manner 2.   Provide accurate information about products, services, admissions, processes, and policies 3.   Assist customers throughout the application or service process and resolve issues effectively 4.   Maintain and update customer records,  documents, and follow-ups in CRM or Excel systems 5.   Coordinate  with  internal teams  (admissions,  operations,  finance,  marketing) to ensure smooth service delivery 6.   Follow up with customers to ensure satisfaction and provide necessary updates 7.   Address complaints,  escalate  complex cases when required,  and ensure proper resolution 8.   Maintain a high level of professionalism, empathy, and customer satisfaction 9.   Prepare weekly reports on customer interactions and case status 10. Adhere to company policies, service standards, and confidentiality requirements Qualifications: 1.   Bachelor’s degree in any discipline. 2.   Strong command of both written and spoken English. 3.   Fluency in English is mandatory for all interactions. 4.   A customer-first attitude with strong problem-solving skills. 5.   Comfortable using digital platforms such as Facebook, WeChat, WhatsApp, Email, and live chat syste"
  },
  {
    "url": "https://bdjobs.com/h/details/1458925?ln=1",
    "company_name": "Mazen (BD) Industries Ltd.",
    "job_title": "AGM/DGM – Factory Operations",
    "location": "Nilphamari (Nilphamari Sadar)",
    "salary": null,
    "experience": "12 to 20 years",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "AGM/DGM – Factory Operations : Mazen (BD) Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mazen (BD) Industries Ltd. AGM/DGM – Factory Operations Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 38 to 50 years Location: Nilphamari (Nilphamari Sa... Nilphamari (Nilphamari Sadar) Salary: Negotiable Experience: 12 to 20 years Published: 12 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Master of Business Administration (MBA) Engineering (Industrial/Mechanical/Production) Experience 12 to 20 years The applicants should have experience in the following business area(s): Manufacturing (FMCG), Garments, Textile, Tannery/Footwear Additional Requirements Age 38 to 50 years Strong leadership and team management skills. Excellent knowledge of Bangladesh Labor Law. Budgeting & cost control expertise. Production planning and quality management. Good communication and negotiation skills. Strong People Management ability. Proficiency in MS office application and reporting. Responsibilities & Context 1. Overall Factory Management - Lead and manage overall factory operations. Develop and implement business plans, production targets, and KPIs. Ensure smooth coordination among HR, Admin, Accounts, and Production departments. 2. HR & Compliance Management - Manpower planning, and workforce optimization. Ensure proper implementation of Bangladesh EPZ Labor Law. Monitor attendance, leave management, payroll, and employee benefits. Directly handle disciplinary actions and grievance management. Maintain industrial all types of relations and prevent labor unrest. Ensure compliance with EPZ law, Environmental regulations, Fire & safety standards, Coustomer Compliance. Lead factory internal audits. Training programs. 3. Administrative Management - Supervise security, transport, housekeeping, and facility management. Ensure workplace safety, fire safety, and compliance audits. Manage factory licenses, renewals, and regulatory documentation. Coordinate with local authorities and external stakeholders. Maintain overall discipline and office management. 4. Financial Management - Monitor factory budget and cost control. Supervise financial reporting. Expenses Analysis. Operational Cost Management. 5. Production Management - Ensure production targets are achieved. Improve productivity and efficiency. Ensure quality control and reduce rejection rates. Monitor raw material usage and minimize wastage. Implement lean manufacturing or process improvement systems. Coordinate with supply chain and maintenance teams. 6. Strategic & Leadership - Develop long-term factory growth strategy. Introduce automation or process improvements. Lead crisis management (strike, shutdown, emergency). Build strong"
  },
  {
    "url": "https://bdjobs.com/h/details/1458940?ln=1",
    "company_name": "Ray Advertising",
    "job_title": "Compliance Manager",
    "location": "Bogura",
    "salary": null,
    "experience": "2 to 4 years",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "Compliance Manager : Ray Advertising Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ray Advertising Compliance Manager Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Age: 25 to 35 years Location: Bogura Salary: Tk. 15000 - 30000 (Monthly) Experience: 2 to 4 years Published: 12 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Law (LLB) Bachelor/Honors Experience 2 to 4 years The applicants should have experience in the following business area(s): Advertising Agency Additional Requirements Age 25 to 35 years Responsibilities & Context Ray Advertising is a U.S.-based company with global operations, specializing in performance marketing, health insurance, and e-commerce. Headquartered in Redding, California, we support leading U.S. businesses while creating meaningful career opportunities in Bangladesh through sustainable, performance-driven operations. Position Summary / Role Overview We are seeking a detail-oriented, execution-driven Compliance Manager to oversee and enforce compliance standards across Ray Advertising’s U.S.-focused operations. This role is responsible for ensuring that marketing practices, lead generation, call operations, data handling, and internal processes comply with U.S. regulations, platform policies, and industry standards . This is not an advisory-only role—the Compliance Manager leads implementation, monitoring, enforcement, documentation, and corrective actions to protect the company, clients, and partners. Primary Focus U.S. regulatory compliance & risk control Marketing, lead & call compliance enforcement Policy implementation & monitoring Audit readiness & documentation Cross-team compliance coordination Key Responsibilities & Duties 1. U.S. Compliance Oversight Ensure compliance with U.S. regulations including (but not limited to): • TCPA • FCC regulations • CMS (for insurance-related operations) • Data privacy and consumer protection standards Monitor changes in U.S. laws, regulations, and platform policies and ensure timely implementation. 2. Marketing, Lead & Call Compliance Review and approve marketing creatives, scripts, landing pages, and funnels for compliance Ensure lead generation, pay-per-call, and outreach follow approved standards Monitor call flows, disclosures, consent, and opt-in processes Collaborate with Sales, Affiliate, and Administrative teams to prevent violations 3. Policy Development & Enforcement Develop, update, and maintain internal compliance policies, SOPs, and checklists Ensure all teams follow approved compliance workflows Enforce corrective actions when violations or risks are identified Document incidents, resolutions, and preventive measures 4. Auditing, Monitoring & Reporting Conduct regular internal audits of campaigns,"
  },
  {
    "url": "https://bdjobs.com/h/details/1458937?ln=1",
    "company_name": "China Jingjiu Battery (BD) Ltd.",
    "job_title": "Area Executive - Sales & Marketing",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "Area Executive - Sales & Marketing : China Jingjiu Battery (BD) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List China Jingjiu Battery (BD) Ltd. Area Executive - Sales & Marketing Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 30 Age: 22 to 33 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: 1 to 2 years Published: 12 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Masters Experience 1 to 2 years The applicants should have experience in the following business area(s): Battery, Storage cell Freshers are also encouraged to apply. Additional Requirements Age 22 to 33 years Responsibilities & Context Achieve sales targets within the assigned timeline. Maintain strong and effective relationships with resellers and customers. Explore new markets, customers, and potential opportunities to increase the prospects of existing products. Ensure timely collection of outstanding payments and credit revenues from customers. Develop and implement new sales strategies to outperform competitors and capture key market segments. Gather and analyze market information and regularly update management. Visit customers and sales centers, providing continuous support to the marketing and sales teams. Collaborate with internal and external stakeholders to resolve complex issues. Prepare and present various reports to support decision-making for the Sales Leadership Team, and assist in short-, mid-, and long-term planning activities. Skills & Expertise Sales & Marketing Experienced in Battery Industry will get preference Compensation & Other Benefits Mobile bill,Tour allowance,Medical allowance,Performance bonus,Profit share,T/A Lunch Facilities: Full Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Read Before Apply If you send email must be mention the position. Company Information China Jingjiu Battery (BD) Ltd. Follow Address: China Jingjiu Battery (BD) Ltd. Ghoshbag, Zirabo, Ashulia, Savar, Dhaka. Business: KIJO GROUP, founded in 1993, is a professional enterprise which is a collection of science, industry and trade. With annual production capacity of 30 million units and output value of over 5 billion. Kijo is one of the biggest battery manufacturer in China. There are over 3000 staffs, more than 400 are middle & senior technologist. We have world-class auto production equipment, environmental protection equipment and facilities and we’re qualified with the ISO9001, ISO14001,CE,UL,RoHS,FCC and related certificates. Till now, we have 3 production bases, which are located in Nanchang, Jiujiang and Yichun city. Nanchang Base covers an area of 89,000 square meters, which is the headquarter of management and technical R&D center, also are respo"
  },
  {
    "url": "https://bdjobs.com/h/details/1458933?ln=1",
    "company_name": "CatExpress",
    "job_title": "Senior Merchandiser – Export (Warp Knitting Specialist)",
    "location": "Dhaka (DOHS Baridhara), Narayanganj",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "Senior Merchandiser – Export (Warp Knitting Specialist) : CatExpress Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List CatExpress Senior Merchandiser – Export (Warp Knitting Specialist) Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 28 years Location: Dhaka (DOHS Baridhara), N... Dhaka (DOHS Baridhara), Narayanganj Salary: Tk. 100000 - 200000 (Monthly) Experience: At least 5 years Published: 12 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience At least 5 years The applicants should have experience in the following business area(s): Garments, Garments Accessories, Textile, Trading or Export/Import Additional Requirements Age At least 28 years Responsibilities & Context We are seeking a highly experienced Senior Merchandiser – Export (Warp Knitting Specialist) to lead and manage export merchandising operations for polyester warp knit fabrics. The role requires hands-on expertise in warp knitting (Tricot / Mesh / Sports Fabric) and strong ownership of buyer handling, costing, production coordination, and shipment execution. Key Responsibilities: Independently manage and develop international export buyers for warp knit fabrics Handle direct communication with overseas clients regarding inquiries, samples, pricing, and order execution Prepare accurate fabric costing considering yarn (FDY/DTY), GSM, construction, processing, and margin targets Negotiate prices, delivery timelines, and commercial terms with buyers Coordinate end-to-end production flow from warp knitting, dyeing, finishing to final shipment Ensure on-time delivery and quality compliance as per buyer requirements Monitor order profitability and maintain strict margin control Work closely with production, planning, and quality teams to resolve technical and delivery issues Support factory expansion plans through buyer development and product diversification Build, mentor, and lead a merchandising team as the operation grows Context of the Role: This is a confidential, leadership-level position for professionals currently working in knit or warp knit fabric export manufacturing. The role offers strategic involvement in business growth, decision-making authority, and performance-based rewards. Note: Candidates with only garments merchandising experience are not suitable for this role. Skills & Expertise Apparel merchandising Fabric Merchandising Garments Merchandising Knitting Production Knitwear Merchandising Merchandising Merchandising and Marketing Merchandising and Production. Production Production Management (Knitting & Weaving) Compensation & Other Benefits T/A,Provident fund,Tour allowance,Profit share Festival Bonus: 2 Get Extra Commission based  on sales & Production Workplace Work at office Employment"
  }
]