[
  {
    "url": "https://bdjobs.com/h/details/1461728?ln=1",
    "company_name": "TOP Visa CONSULTANCY",
    "job_title": "COUNSELOR (Sky Route V C)",
    "location": "Dhaka (Agargaon, Kazipara, Mirpur 10, Mirpur 13, Mirpur 14, Mirpur 2, Shewrapara)",
    "salary": "Tk. 14000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "21 Mar 2026",
    "job_description": "COUNSELOR (Sky Route V C) : TOP Visa CONSULTANCY Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List TOP Visa CONSULTANCY COUNSELOR (Sky Route V C) Application Deadline : 21 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 18 Age: 18 to 32 years Location: Dhaka (Agargaon, Kazipara... Dhaka (Agargaon, Kazipara, Mirpur 10, Mirpur 13, Mirpur 14, Mirpur 2, Shewrapara) Salary: Tk. 14000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Higher Secondary Additional Requirements Age 18 to 32 years Responsibilities & Context Handle end-to-end visa processing, ensuring accuracy and compliance with regulations. Offer professional consultation and guidance through phone calls and WhatsApp. Cultivate and maintain positive, long-term client relationships. Keep up-to-date with immigration policies and country-specific requirements. Skills & Expertise Leadership and Good Communication skill. Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Agargaon, Kazipara, Mirpur 10, Mirpur 13, Mirpur 14, Mirpur 2, Shewrapara) Company Information TOP Visa CONSULTANCY Follow Address: Ring Tower (6th Floor), House 6/A, Ring Road, Mohammadpur, Dhaka-1207, Dhaka. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্র"
  },
  {
    "url": "https://bdjobs.com/h/details/1461777?ln=1",
    "company_name": "A Reputed Club in Banani",
    "job_title": "Billing Officer",
    "location": "Dhaka (Banani)",
    "salary": "Tk. 12000 (Monthly)",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Billing Officer : A Reputed Club in Banani Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Club in Banani Billing Officer Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Location: Dhaka (Banani) Salary: Tk. 12000 (Monthly) Experience: At least 2 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education HSC in Business Studies Diploma in Computer Experience At least 2 years The applicants should have experience in the following business area(s): Hotel, Restaurant, Bar/Pub Freshers are also encouraged to apply. Responsibilities & Context Job Overview: The Billing Officer will be responsible for preparing, processing, and maintaining accurate billing records for club services, memberships, and events. The role requires strong attention to detail, financial accuracy, and coordination with internal departments to ensure timely invoicing and collections. Key Responsibilities: Prepare and issue bills and invoices for club services, memberships, and events. Maintain accurate billing records and update customer/member accounts. Verify charges, discounts, and adjustments as per approved policies. Coordinate with accounts and front office teams regarding billing queries and corrections. Ensure timely follow-up on outstanding payments. Prepare daily, weekly, and monthly billing reports for management. Maintain proper documentation and support audit requirements. Requirements: HSC/Diploma Experience in billing, accounts, or front-desk finance will be preferred. Proficiency in MS Excel and basic accounting software. Strong numerical skills and attention to detail. Good communication and interpersonal skills. Skills & Expertise Billing Billing Software Communication Workplace Work at office Employment Status Full Time Job Location Dhaka (Banani) Company Information A Reputed Club in Banani Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on C"
  },
  {
    "url": "https://bdjobs.com/h/details/1461792?ln=1",
    "company_name": "ACI Godrej Agrovet Private Ltd.",
    "job_title": "Electrical Engineer-Breeding Farm",
    "location": "Panchagarh",
    "salary": null,
    "experience": "5 to 7 years",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Electrical Engineer-Breeding Farm : ACI Godrej Agrovet Private Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ACI Godrej Agrovet Private Ltd. Electrical Engineer-Breeding Farm Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 30 to 45 years Location: Panchagarh Salary: Negotiable Experience: 5 to 7 years Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Electrical & Electronic Engineering Experience 5 to 7 years The applicants should have experience in the following business area(s): Animal/Plant Breeding, Fisheries, Manufacturing (FMCG), Multinational Companies, Poultry Additional Requirements Age 30 to 45 years Experienced from Animal Feed industry will be preferred. Must have experience in maintaining Substation, Diesel Generator, Water Treatment Plant and other relevant utilities. Electrical load calculation and cable size calculation skill. AutoCAD skill Responsibilities & Context Assisting the superiors in all designs, drawings and specifications according to the project standards. Supervising, monitoring, and ensuring the quality of electrical & mechanical works as well as control on material usages. Resolving project or maintenance-related issues at project sites, in consultation with relevant stakeholders when necessary. Preparing, maintaining, and updating engineering documents and records. Attending meetings and maintaining effective communication with stakeholders as per requirements. Preparing drawings, specifications, and BOQs for electrical and mechanical works. Managing all electricians and ensuring completion of maintenance tasks as per schedule. Overseeing electrical power supply, Electrical interlocking, distribution, and panel board/PFI maintenance. Maintaining all backup power systems including generators, UPS, and IPS. Monitoring and maintaining all internal & external lighting systems of the institutions. Conducting scheduled maintenance visits, identify issues, and take proper actions. Carrying out necessary repairs and maintenance. Ensuring implementation of electrical safety systems such as grounding and lightning protection (LA & SPD). Preparing budget, maintenance schedules, control maintenance inventory, and maintain records properly. Ensuring preventive measures and proper maintenance of all electrical and EME-related equipment. Conducting equipment health check and maintaining inspection logs, registers, and checklists. To be responsible for preventing any damage (tangible or intangible) to the organization`s assets or interests due to negligence, incompetence, or misconduct. Maintain safety works across the operations and maintain all safety compliances. Performing any additional duties assigned by the authority. Skills & Expertise Electrical Installation and Ma"
  },
  {
    "url": "https://bdjobs.com/h/details/1461529?ln=1",
    "company_name": "Salam Mansion",
    "job_title": "কেয়ারটেকার ও সিকিউরিটি গার্ড",
    "location": "Bogura (Bogura Sadar)",
    "salary": "Tk. 10000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "কেয়ারটেকার ও সিকিউরিটি গার্ড : Salam Mansion Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Salam Mansion কেয়ারটেকার ও সিকিউরিটি গার্ড Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Bogura (Bogura Sadar) Salary: Tk. 10000 - 15000 (Monthly) Published: 21 Feb 2026 Application Insights View Requirements Education JSC/JDC/8 pass Responsibilities & Context প্রতিষ্ঠানের সকল প্রকার মালামাল চুরি রোধকল্পে সর্বদা সজাগ দৃষ্টি রাখা। প্রজেক্টের সকল প্রকার সম্পদ ও মালামালের রক্ষনাবেক্ষণ সহ তদারকি করা। ডিউটি শুরু হওয়ার কমপক্ষে ১৫ মিনিট পূর্বে কর্মস্থলে উপস্থিত হওয়া। কোন প্রকার সমস্যা পরিলক্ষিত হলে তাৎক্ষণিক ঊর্ধ্বতন সুপারভাইজার / কর্মকর্তাকে অবহিত করা। কর্মস্থলে উপস্থিত হয়ে পূর্ববর্তী গার্ড থেকে সকল প্রকার দায়িত্ব বুঝে নেয়া এবং কর্তব্য শেষে আগত গার্ডকে বুঝিয়ে দেয়া। নিরাপত্তার দায়িত্ব পালনের সাথে সরঞ্জামাদী সর্বদা সচল অবস্থায় সংরক্ষিত রাখা এবং সঠিক ব্যবহার নিশ্চিত করা । প্রজেক্টে আগত মালামাল এবং প্রজেক্ট থেকে বের হওয়া মালামালের সঠিক পরিমান যাচাই করা এবং যথাযথ নথিভুক্ত করা। পরিচ্ছন্নতা ও স্বাস্থ্য-সচেতন থাকা। সকল ইনকামিং আউটগোয়িং গেস্ট, পরিদর্শক এবং অন্যান্য ব্যক্তিদের পর্যবেক্ষণ করা। রাত্রীকালীন এলার্ম এবং হুইসেল শব্দের মাধ্যমে নিরাপত্তা নিশ্চিত করা। প্রতি শিফটে ১২ ঘন্টা ডিউটি করা। Skills & Expertise Security Guard Workplace Work at office Employment Status Full Time Job Location Bogura (Bogura Sadar) Company Information Salam Mansion Follow Address: Jaleswaritola,Kalimondir,Bogura Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BD"
  },
  {
    "url": "https://bdjobs.com/h/details/1461582?ln=1",
    "company_name": "Book Swift Pros",
    "job_title": "Senior Bookkeeper",
    "location": "Chattogram (Chattogram Sadar)",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Senior Bookkeeper : Book Swift Pros Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Book Swift Pros Senior Bookkeeper Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 32 years Location: Chattogram (Chattogram Sa... Chattogram (Chattogram Sadar) Salary: Tk. 20000 - 30000 (Monthly) Experience: At least 2 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Business Administration (BBA) Master of Business Administration (MBA) CA (CC) / CA (Part Qualified) – Preferred from reputed firm CMA (1200 marks passed) ACCA (Part qualified) Experience At least 2 years The applicants should have experience in the following business area(s): IT Enabled Service Additional Requirements Age At least 32 years Strong understanding of accounting standards Advanced bank reconciliation and ledger review skills Experience handling loan schedules and financial adjustments Strong analytical and review capability Leadership and team supervision ability Excellent Excel skills Strong written and verbal English communication Responsibilities & Context Oversee and review day-to-day bookkeeping operations Supervise bank & credit card reconciliations Monitor Accounts Payable & Accounts Receivable cycles Review and finalize monthly financial statements (P&L, Balance Sheet, Cash Flow) Coordinate month-end and year-end closing Review loan accounting, intercompany transactions and complex adjustments Ensure compliance with US accounting standards (GAAP understanding preferred) Review junior bookkeepers’ work and provide guidance Assist Accounts Manager in workflow improvement and quality control Identify financial risks and provide reporting insights Skills & Expertise Artificial intelligence (AI) Communication in English Financial Analysis Good in advance execel odoo Quickbooks Wave Accounting xero Compensation & Other Benefits Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Chattogram (Chattogram Sadar) Company Information Book Swift Pros Follow Address: Panir Kol, Noyabazar, Halishahar, Chattogram Website: https://bookswiftpros.com Business: We are a joint-venture bookkeeping firm dedicated to providing comprehensive and reliable financial management services. Our team specializes in delivering end-to-end bookkeeping solutions, including transaction recording, account reconciliation, financial reporting, payroll support, and other essential back-office accounting services.\n\nWith a commitment to accuracy, efficiency, and transparency, we help businesses maintain clear financial records and make informed decisions. Our goal is to serve as a trusted partner, ensuring that every clie"
  },
  {
    "url": "https://bdjobs.com/h/details/1461790?ln=1",
    "company_name": "A Reputed RMG Group of Company",
    "job_title": "Executive-Civil Store",
    "location": "Gazipur, Narayanganj",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Executive-Civil Store : A Reputed RMG Group of Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed RMG Group of Company Executive-Civil Store Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: At least 22 years Location: Gazipur, Narayanganj Salary: Negotiable Experience: At least 2 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Diploma in Engineering in Civil Engineering Experience At least 2 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements Age At least 22 years Responsibilities & Context Collect PI (Proforma Invoice), Work Order, and Requisition from SCM (Supply Chain Management) and prepare pipeline in ERP (Enterprise Resource Planning) system. Receive consignments, precisely check them, and update in software. Ensure on-time receive/issue with priority, and ensure RFID tag with location visualization. Maintain proper housekeeping and certification audit. Ensure stock accuracy. Conduct half-yearly and yearly physical audits. Skills & Expertise Civil Construction Civil Construction Compensation & Other Benefits T/A,Provident fund,Medical allowance,Mobile bill,Insurance,Gratuity Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 LFA Hospitalization Benefit Paternity Leave Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur, Narayanganj Company Information A Reputed RMG Group of Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate c"
  },
  {
    "url": "https://bdjobs.com/h/details/1461763?ln=1",
    "company_name": "Pix Store",
    "job_title": "Customer Support Executive",
    "location": "Khulna (Khulna Sadar)",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "Customer Support Executive : Pix Store Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Pix Store Customer Support Executive Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 18 to 35 years Location: Khulna (Khulna Sadar) Salary: Tk. 10000 - 15000 (Monthly) Experience: 1 to 5 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Higher Secondary Diploma Bachelor/Honors Experience 1 to 5 years The applicants should have experience in the following business area(s): E-commerce, E-commerce Startup, F-commerce Freshers are also encouraged to apply. Additional Requirements Age 18 to 35 years Responsibilities & Context 📍 অফিসের নাম: Pix Store 🕙 অফিস সময়: সকাল ১০টা – সন্ধ্যা ৭টা পদবী: কাস্টমার সাপোর্ট এক্সিকিউটিভ (মিনিমাম ১ বছরের অভিজ্ঞতা ) 🔹 দায়িত্বসমূহঃ গ্রাহকের ফোন, ফেসবুক, হোয়াটসঅ্যাপ ইত্যাদির প্রশ্নের উত্তর দেওয়া অর্ডার গ্রহণ ও প্রসেস করা গ্রাহকের সঙ্গে সুন্দর যোগাযোগ বজায় রাখা সফটয়্যার সম্পর্কে কাস্টমারদের সাপোর্ট দেওয়া অফিসের দৈনন্দিন কাজকর্মে সহায়তা করা 🔹 যোগ্যতাঃ ন্যূনতম এইচএসসি পাশ ১ বছরের বাস্তব অভিজ্ঞতা ( কাস্টমার সাপোর্ট ) বেসিক কম্পিউটার ও ইন্টারনেট সম্পর্কে ধারণা থাকতে হবে ভালো যোগাযোগ দক্ষতা (বাংলা এবং ইংরেজি হলে অগ্রাধিকার) সময়নিষ্ঠ, আন্তরিক এবং দায়িত্বশীল হতে হবে 🔹 সুবিধাসমূহঃ মাসিক বেতন ১০০০০- ১৪০০০ হাজার টাকা (আলোচনা সাপেক্ষে) সাপ্তাহিক ছুটি শুক্রবার বন্ধুত্বপূর্ণ কর্মপরিবেশ শিখে উন্নতি করার সুযোগ 📌 কর্মস্থল: বৈকালী , খুলনা 📩 আবেদন করতে চাইলে: আপনার সিভি সেন্ড করুন - pixstorebd@ gmail.com সিভি চেক করে অফিস থেকে যোগাযোগ করা হবে Skills & Expertise Customer Support Ecommerce Office Management Compensation & Other Benefits Mobile bill,Over time allowance,Performance bonus,Profit share Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Khulna (Khulna Sadar) Company Information Pix Store Follow Address: Pix House, 3rd Floor, Boikali, Boyra, Khalishpur, Khulna Website: https://pixstore.com.bd/ Business: Pix is a registered trademark gadget and gadget accessories brand in Bangladesh. We specialize in providing top-notch accessories for various gadgets, including Apple, Samsung, and Pixel smartphones, as well as smartwatches. Our product range includes Smartwatch, Mobile Charger, Neckband, Earphone, TWS, phone cases, screen protectors, straps, wireless charger, mini printer and more – all designed to ensure that your gadgets remain protected, stylish, and functional. At Pix, we take pride in offering only the highest quality products to our customers. All our products are made from premium materials and undergo rigorous quality checks before being made available for sale. Our team of experts is dedicated to providing you with the best products and services, ensuring that your gadgets remain safe and protected at all times. S"
  },
  {
    "url": "https://bdjobs.com/h/details/1461741?ln=1",
    "company_name": "Pro IT",
    "job_title": "Digital Marketing Executive",
    "location": "Dhaka (PanthaPath)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Digital Marketing Executive : Pro IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Pro IT Digital Marketing Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: N/A Age: 22 to 35 years Location: Dhaka (PanthaPath) Salary: Tk. 35000 - 50000 (Monthly) Experience: 1 to 2 years Published: 21 Feb 2026 Application Insights View Requirements Education A Level Bachelor/Honors Experience 1 to 2 years The applicants should have experience in the following business area(s): IT Enabled Service Additional Requirements Age 22 to 35 years Experience: Minimum 1 year Candidate Requirements: Strong knowledge of social media marketing & boosting Experience with Facebook Ads, Google Ads, YouTube Ads Excellent communication & multitasking skills Basic Photoshop, Illustrator & Video Editing Familiarity with Meta Business Suite (preferred) Experience in ICT companies (preferred) Responsibilities & Context Prothoma Bangladesh is Hiring! – Mid-Level Digital Marketing Executive Location: 147 D, 1 Green Rd, Dhaka 1215 About the Role Are you passionate about digital marketing and eager to make an impact? Join our creative and fast-growing team at Prothoma Bangladesh, where your ideas and skills will shape our digital future! Strong knowledge of social media marketing & boosting Basic Photoshop, Illustrator & Video Editing Edit and produce professional video content for campaigns Manage and promote content across Facebook, Instagram, LinkedIn, Google, Email, etc. Plan, monitor, and optimize paid campaigns (Facebook Ads, TiikTok,YouTube) Use Meta Business Suite and analyze performance metrics Write SEO-friendly content and manage website updates Stay updated with the latest digital trends and tools Collaborate with cross-functional teams for consistent branding Handle multiple projects and meet deadlines efficiently Skills & Expertise Digital Marketing (Social Media Marketing) Suggested by Adobe Illustrator Adobe Photoshop Digital Marketing (Social Media Marketing) Facebook Ads Manager Online Marketing Social Media Management Video Editing Compensation & Other Benefits Tour allowance,Performance bonus Festival Bonus: 2 Salary: Tk 25,000 - 50,000 per month Workplace Work at office Employment Status Full Time Job Location Dhaka (PanthaPath) Company Information Pro IT Follow More jobs from this company Address: 147/H, Green Road, Dhaka Panthpath Dhaka-1215 Website: https://proit.digital/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না"
  },
  {
    "url": "https://bdjobs.com/h/details/1461663?ln=1",
    "company_name": "Rangpur Dairy and Food Products Limited",
    "job_title": "Junior Accounts Officer",
    "location": "Dhaka, Rangpur",
    "salary": "Negotiable",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Junior Accounts Officer : Rangpur Dairy and Food Products Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rangpur Dairy and Food Products Limited Junior Accounts Officer Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 22 to 40 years Location: Dhaka, Rangpur Salary: Negotiable Experience: At least 2 years Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Experience At least 2 years The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM), Food (Packaged)/Beverage Additional Requirements Age 22 to 40 years Responsibilities & Context Accounting & Bookkeeping Maintain daily books of accounts (cash book, bank book, ledger). Record all financial transactions accurately and timely. Prepare journal entries, vouchers & supporting documents. Maintain proper documentation & filing of accounts records. Accounts Payable & Receivable Handle accounts payable & receivable. Prepare and verify bills, invoices & payment vouchers. Follow up on outstanding receivables and vendor payments. Bank & Cash Management Prepare bank reconciliation statements (BRS). Monitor cash & bank balances. Handle cheques, deposits & bank correspondence. Supervision (for Senior Accounts Officer) Guide & supervise junior accounts staff. Review junior staff work and ensure accuracy. Support training and task allocation. Coordination & Software Use Coordinate with admin, HR, sales & procurement departments. Operate accounting software like Tally / ERP / SAP / Excel.· Assist in improving accounting processes and internal control     systems. Verify and process customer trade offer claims and ensure     proper accounting adjustments. Review supporting documents to confirm accuracy and authenticity of customer claims. Conduct occasional customer visits for claim verification and  authenticity checks when required. Coordinate with sales and finance teams to resolve claim-related discrepancies. Maintain proper documentation and records of trade offer claims and adjustments. Skills & Expertise Accounting Data Entry Accounts and audit Billing Cash Management ERP Software General Banking MS Office Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka, Rangpur Company Information Rangpur Dairy and Food Products Limited Follow More jobs from this company Address: 23, Adarsha Chayaneer, Ring Road, Adabor, Dhaka -1207 , Bangladesh\r\n(Beside Amana Bazaar Store) Factory:Rangpur Dairy & Food Products.Salaipur, Baldipukur,Rangpur-5460 Website: https://www.rdmilk.com/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ ক"
  },
  {
    "url": "https://bdjobs.com/h/details/1461737?ln=1",
    "company_name": "Global Wings",
    "job_title": "অফিস সহকারী (মহিলা)",
    "location": "Dhaka",
    "salary": "Tk. 15000 - 20000 (Monthly)",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "অফিস সহকারী (মহিলা) : Global Wings Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Global Wings অফিস সহকারী (মহিলা) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 18 to 35 years Location: Dhaka Salary: Tk. 15000 - 20000 (Monthly) Experience: 1 to 2 years Published: 21 Feb 2026 Application Insights View Requirements Education SSC Experience 1 to 2 years The applicants should have experience in the following business area(s): Consulting Firms, Immigration and Education Consultancy Service, Immigration/Visa Processing, Training Institutes, Travel Agent, University Additional Requirements Age 18 to 35 years Responsibilities & Context কর্মকর্তা ও কর্মচারীদের জন্য স্টেশনারি, চা, পানি ও নাস্তা প্রস্তুত ও পরিবেশন করা অফিসের ভেতর ও আশপাশ পরিষ্কার-পরিচ্ছন্ন রাখা নিয়মিত ঝাড়ু দেওয়া, মুছা, ভ্যাকুয়াম করা ও মেঝে পরিষ্কার রাখা অফিসের টেবিল, চেয়ার, জানালা, গ্লাস ও অন্যান্য আসবাবপত্র পরিষ্কার রাখা প্রয়োজন অনুযায়ী সাবান, টিস্যু, টয়লেট পেপার ইত্যাদি সরবরাহ করা মিটিংয়ের আগে চেয়ার-টেবিল সাজানো, নোটপ্যাড, পানি, গ্লাস ইত্যাদি সরবরাহ করা ফটোকপি, স্ক্যান ও প্রিন্ট করার প্রাথমিক দক্ষতা থাকতে হবে প্রয়োজন হলে ফাইল ও ডকুমেন্ট সাজানো ও স্থানান্তরে সহায়তা করতে হবে সাধারণ অফিস ডকুমেন্ট পড়তে ও বুঝতে পারার সক্ষমতা থাকতে হবে কর্তৃপক্ষ প্রদত্ত অন্যান্য দায়িত্ব যথাযথভাবে পালন করা কর্মঘণ্টা: প্রতিদিন ১০ ঘন্টা (সকাল ৯:৩০ – রাত ৭:৩০) Skills & Expertise Cleaner Operation Cooking Document scanning Peon Photocopying Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka Company Information Global Wings Follow Address: Level-7, A. Mazid Tower, Ka-24, Progoti Sarani, Kuril Bishawroad, (Opposite side of the Jamuna Future Park`s exit gate) Dhaka-1229 Business: A leading overseas education consultant in Bangladesh; Globalwings Consultant is the preferred choice for the serious student community of Bangladesh due to its high-quality authentic services and solutions. It has been a pioneer in overseas education providing dedicated services and support throughout the international educational lifecycle. We help to bring overseas education within your reach through ethical and unbiased counseling, clear understanding with precision in the systems, operational excellence, result-oriented attitude as well a student-friendly environment. We are committed to dynamic growth and service excellence built upon our high degree of trust and professionalism. We feel pride in making efforts to position the company at the forefront nationally. Over the years, we are succeeding and we look forward to more successes in the coming years. We, therefore, invite you to join us so that you may share our wonderful experiences. If you do not find the information you are looking for on this Website, call personally or telephone or e-mail our friendly staff who will assist you. Repor"
  },
  {
    "url": "https://bdjobs.com/h/details/1461494?ln=1",
    "company_name": "Esho Desh Gori (EDG)",
    "job_title": "Accountant",
    "location": null,
    "salary": null,
    "experience": "5 to 10 years",
    "education": null,
    "deadline": "21 Mar 2026",
    "job_description": "Accountant : Esho Desh Gori (EDG) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esho Desh Gori (EDG) Accountant Application Deadline : 21 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 30 to 55 years Location: Dhaka (Lalmatia) Salary: Negotiable Experience: 5 to 10 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Business Administration (BBA) in Finance Bachelor of Business Administration (BBA) in Accounting Master of Business Administration (MBA) in Finance Master of Business Administration (MBA) in Accounting Bachelor’s or Master’s degree in Accounting/Finance Professional certification Experience 5 to 10 years The applicants should have experience in the following business area(s): NGO Additional Requirements Age 30 to 55 years Requirements: Strong knowledge of accounting software and MS Excel, accountant software like tally. Good understanding of Bangladesh tax and VAT laws High level of integrity and attention to detail Responsibilities & Context About Us Esho Desh Gori (EDG) is a non-governmental organization committed to social development, community empowerment, and sustainable initiatives in Bangladesh. We are seeking a qualified and experienced Accountant to manage our financial operations with transparency and professionalism. Job Location: 5/8 Lalmatia, Block-B, Mohammadpur, Dhaka, Bangladesh Job Responsibilities: Maintain accurate financial records and bookkeeping Prepare monthly, quarterly, and annual financial reports Manage budgeting, forecasting, and fund allocation Handle NGO project accounts and Donar reporting Ensure compliance with government regulations and NGO Affairs Prepare audit reports and coordinate with external auditors Manage payroll, VAT, and tax-related matters Skills & Expertise Language skills both in Bengali and English Compensation & Other Benefits Salary Negotiable (Based on experience and qualification) Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Lalmatia) Read Before Apply How to Apply : Interested candidates are requested to send their CV along with a cover letter to: Subject Line: Application for Accountant - EDG NGO Company Information Esho Desh Gori (EDG) Follow Address: 5/8,Block B, Lalmatia, Mohammadpur, Dhaka-1207. Business: The organization has been implementing various government and private development projects for 15 years. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির ("
  },
  {
    "url": "https://bdjobs.com/h/details/1461796?ln=1",
    "company_name": "Shakti Foundation for Disadvantaged Women.",
    "job_title": "ট্রেইনি অফিসার, মাইক্রোফাইন্যান্স (মাঠ পর্যায়ের কাজের জন্য)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "ট্রেইনি অফিসার, মাইক্রোফাইন্যান্স (মাঠ পর্যায়ের কাজের জন্য) : Shakti Foundation for Disadvantaged Women. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shakti Foundation for Disadvantaged Women. ট্রেইনি অফিসার, মাইক্রোফাইন্যান্স (মাঠ পর্যায়ের কাজের জন্য) Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 200 Age: 25 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 22500 - 27500 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Additional Requirements Age 25 to 35 years Responsibilities & Context ১. সার্ভে করে সম্ভাব্য সদস্য নিরুপন করাঃ নির্ধারিত কর্ম এলাকাতে বসবাসরত অধিবাসী এবং কর্মজীবীগনকে সার্ভে (জরিপ) করে সম্ভাব্য সদস্য নিরুপন করা সার্ভে রেজিষ্ট্রার আপডেট করা নিয়মিত সার্ভেকৃত ব্যক্তিদের মধ্যে সম্ভাব্য সদস্যদের ফলোআপ করা সম্ভাব্য সদস্যদের মধ্যে থেকে যোগ্য ব্যক্তিদের সদস্য হিসেবে ভর্তির জন্য নির্বাচিত করা শাখা ব্যবস্থাপকের মাধ্যমে নিয়ম মোতাবেক সম্ভাব্য সদস্যদের কে সদস্য হিসেবে ভর্তির ব্যবস্থা করা কেন্দ্র ভিত্তিক সদস্য ভর্তি ও মাইক্রোফাইন্যান্স অপারেশন পরিচালনা করা ২. ঋণ বিতরণ সংক্রান্তঃ সদস্যের প্রয়োজন এবং ঋণ পরিশোধের স্বক্ষমতা বিবেচনায় প্রত্যেক সদস্যের জন্য উপযুক্ত পরিমান ঋণ নিরুপন করা প্রত্যেক সদস্যকে সংস্থার নিয়ম-কানুন সম্পর্কে বিস্তারিত ভাবে অবগত করা বর্তমান সদস্য এবং নতুন ভর্তিকৃত সদস্যদের মাঝে ঋণ বিতরনের জন্য ঋণ প্রস্তাব প্রস্তুত করা পলিসি মোতাবেক ঋণ বিতরনের জন্য প্রয়োজনীয় সকল ডকুমেন্টস সংগ্রহ এবং ঋণ প্রস্তাবের সাথে সংযুক্ত করা প্রত্যেক ঋনের জন্য উপযুক্ত জামিনদার নির্বাচন করা স্বশরীরে প্রত্যেক জামিনদার ভিজিট করে জামিনদারের উপযুক্ততা নিরুপন ও তাদের ঋণ সম্পর্কে স্ববিস্তারে অবহিত করে তাদের সম্মতি গ্রহন করা ঋনের পরিমান অনুযায়ী প্রয়োজনীয় স্তরের সুপারভাইজারদের মাধ্যমে ঋণ প্রস্তাব অনুমোদনের ব্যবস্থা করা বিতরনের জন্য নির্ধারিত সময়ের মধ্যে শাখা একাউন্টেন্ট / সিনিওর একাউন্টেন্ট কে ঋণ ফাইল জমা দেবার ব্যবস্থা করা ঋণ বিতরনের সময়ে সদস্য এবং জামিনদারের স্বশরীরে উপস্থিতি এবং প্রয়োজনীয় ডকুমেন্টস (অরিজিনাল বা কপি, যেটি প্রযোজ্য) জমাদান নিশ্চিত করা সদস্য কর্তৃক বিতরণকৃত ঋনের সমপরিমান টাকা প্রাপ্তি সম্পর্কে নিশ্চিত হওয়া ৩. ঋনের কিস্তি আদায় সংক্রান্তঃ কেন্দ্র মিটিং এর আগে সদস্যদেরকে কেন্দ্র মিটিং এবং কিস্তি সম্পর্কে ফলোয়াপ করা সিডিউল অনুযায়ী সঠিক সময়ে কেন্দ্রে উপস্থিত হওয়া কেন্দ্রে বসে শতভাগ কিস্তি আদায় নিশ্চিত করা পাশবইয়ে এন্ট্রি করে কিস্তি আদায় করা এবং আদায়ের পরে পাশবইয়ে স্বাক্ষর করা যেসব সদস্য কেন্দ্রে বা অফিসে এসে কিস্তি প্রদান করছেন না, তাদেরকে কেন্দ্রে বা অফিসে এসে উপস্থিত হয়ে কিস্তি প্রদানে উদ্বুদ্ধ করা কিস্তি গ্রহনের সময় প্রত্যেক সদস্যকে তার ঋণস্থিতি ও সঞ্চয় স্থিতি (ব্যালেন্স) সম্পর্কে অবগত করা ৪. সঞ্চয় সংগ্রহ সংক্রান্তঃ ঋণ বিতরনের সময়ে নূন্যতম পরিমান বা তার বেশী মাই সেভিংস সংগ্রহ নিশ্চিত করা প্রত্যেক সদস্যকে সেচ্ছা সেভিংস, এসডিপিএস এবং লাখপতি হিসাব খোলার ব্যাপারে উব্দুদ্ধ করা প্রত্যেক সদস্যের ঋনের কিস্তি গ্রহনের সময়ে তাদের নিকট থেকে নির্ধারিত পরিমানে মাই সেভিংস, সেচ্ছা সেভিংস, এসড"
  },
  {
    "url": "https://bdjobs.com/h/details/1461776?ln=1",
    "company_name": "Closet Cloud",
    "job_title": "Sales Associate (Female)",
    "location": "Dhaka (Basundhara RA)",
    "salary": "Tk. 12000 - 14000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Sales Associate (Female) : Closet Cloud Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Closet Cloud Sales Associate (Female) Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 50 Location: Dhaka (Basundhara RA) Salary: Tk. 12000 - 14000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Responsibilities & Context We are looking for Dynamic Sales Associate to be responsible for all sales job duties, from generating leads to closing sales. As Closet cloud is a female clothing brand for that we are looking for full-time female sales associates to provide excellent customer service and meet sales targets for our business. Job Type – Full-time (6 days a week). Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Basundhara RA) Company Information Closet Cloud Follow More jobs from this company Address: House-39, Lake Drive Road, Nikunja-1, Khilkhet, Dhaka-1229 Business: Closet cloud is a lifestyle store . Original and Master Replica of Pakistan woman`s clothing of latest trend are available in closet cloud Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learni"
  },
  {
    "url": "https://bdjobs.com/h/details/1461767?ln=1",
    "company_name": "SAM Trading and Construction",
    "job_title": "Computer Operator / Typist",
    "location": "Dhaka (Pallabi)",
    "salary": "Tk. 10000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Computer Operator / Typist : SAM Trading and Construction Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SAM Trading and Construction Computer Operator / Typist Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Company Information Summary Vacancy: -- Age: At least 25 years Location: Dhaka (Pallabi) Salary: Tk. 10000 - 15000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 25 years Workplace Work at office Employment Status Full Time Job Location Dhaka (Pallabi) Company Information SAM Trading and Construction Follow More jobs from this company Address: 5, House#J-62,(2nd floor), Pallabi, Mirpur, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Part"
  },
  {
    "url": "https://bdjobs.com/h/details/1461769?ln=1",
    "company_name": "OMNIA CORPORATION",
    "job_title": "Manager/Sr. Manager - HR & Admin",
    "location": "Dhaka",
    "salary": null,
    "experience": "3 to 6 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Manager/Sr. Manager - HR & Admin : OMNIA CORPORATION Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List OMNIA CORPORATION Manager/Sr. Manager - HR & Admin Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 18 to 35 years Location: Dhaka Salary: Tk. 30000 - 40000 (Monthly) Experience: 3 to 6 years Published: 21 Feb 2026 Application Insights View Requirements Education Master of Business Administration (MBA) Bachelor of Business Administration (BBA) North South University,East West University,BRAC University,American International University Bangladesh,Daffodil International University students will get preference Experience 3 to 6 years The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service, Immigration/Visa Processing, Overseas Companies Additional Requirements Age 18 to 35 years What We’re Looking For: A dedicated learner with a keen desire to grow and improve continuously. A problem-solver who enjoys taking on challenges and finding innovative solutions. Strong communication and leadership skills, with the ability to inspire and manage a team. Ability to thrive under pressure and maintain focus in a fast-paced environment. A mindset that aligns with a growing organisation, adaptable to change and eager to contribute to its success. Responsibilities & Context We require a qualified and experienced management professional to efficiently oversee the growing operations of our organization. The selected candidate will supervise the overall activities of the company and assume full responsibility in the absence of the General Manager. The candidate must possess strong leadership, strategic decision-making, and management skills. HR Responsibilities: Recruitment & Staffing, Employee Relations & Engagement, Policy & Compliance, Performance Management, Compensation & Benefits, HR Reporting & MIS. Admin Responsibilities: Office Administration, Sales Administration, Sales team support and Performance, Logistics & Support Services, Compliance & Legal Support, Health, Safety & Security, Management Support. Training Responsibilities: Train to Worker, Sales Force, Office stuff ( As per training need) Skills & Expertise Communication in English Good communication skills in both English and Bangla Compensation & Other Benefits Mobile bill,Profit share,Performance bonus Lunch Facilities: Partially Subsidize Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka Company Information OMNIA CORPORATION Follow Address: Sheltech Ayaan Tower, Level 8, House 58, Road 11&06, Banani C/A, Dhaka 1213 Business: We do manpower placements effectively, saving you 50% time and effort. You  just need to shortlist the  candidates and we shall do "
  },
  {
    "url": "https://bdjobs.com/h/details/1461685?ln=1",
    "company_name": "Boomershub",
    "job_title": "Sales Development Representative (SDR)",
    "location": "Chattogram, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Sales Development Representative (SDR) : Boomershub Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Boomershub Sales Development Representative (SDR) Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: At least 25 years Location: Chattogram, Dhaka Salary: Tk. 30000 - 60000 (Monthly) Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 25 years Relevant Background : Experience working in international outbound sales or call handling roles is essential Communication Skills : Strong command of English, with clear speaking ability and solid listening comprehension to interact effectively with overseas clients. Work Schedule : Availability to work night shifts to match US and Canadian business hours. Outbound Calling Strength : Comfortable initiating conversations and engaging prospects in the North American market. Responsibilities & Context Join Us in Revolutionizing Business Communication! Our cutting-edge AI Caller System, VerbaCall is designed to revolutionize customer interactions for businesses across diverse industries—healthcare, retail, hospitality, and beyond. As we enter this exciting phase, we are seeking dynamic individuals to join our team and help us build a client base for this game-changing product. About the Role: As a Sales Development Representative, you will be at the forefront of our growth strategy, driving sales and forging impactful partnerships. Your mission: to introduce businesses to our AI Caller System and showcase how it saves time, boosts efficiency, and transforms customer service. This role is perfect for self-starters with a passion for technology, a consultative approach to selling, and a proven ability to build lasting relationships. We provide access to advanced tools, support a collaborative environment to help you succeed. Core Responsibilities: Conduct outbound outreach (calls, emails, sms, LinkedIn) to generate interest Qualify leads based on predefined criteria Schedule product demo appointments for the sales team Maintain accurate records of outreach and follow-ups in CRM Follow up consistently with prospects to nurture interest Identify and target high-potential business opportunities in diverse industries. Build and nurture relationships with decision-makers to close deals. Leverage a consultative sales approach to assess client needs and deliver tailored solutions. Present and promote the AI Caller System, highlighting its ability to solve critical business challenges. Strategically manage your sales pipeline to exceed performance goals. Collaborate with internal teams to align product features with market demands. Report on key sales metrics and continuously refine strategies for success. Why Join"
  },
  {
    "url": "https://bdjobs.com/h/details/1461806?ln=1",
    "company_name": "Cityscape International Ltd",
    "job_title": "Personal Secretary to the Managing Director (MD)",
    "location": "Dhaka (GULSHAN 1)",
    "salary": "Negotiable",
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "24 Mar 2026",
    "job_description": "Personal Secretary to the Managing Director (MD) : Cityscape International Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Cityscape International Ltd Personal Secretary to the Managing Director (MD) Application Deadline : 24 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Dhaka (GULSHAN 1) Salary: Negotiable Experience: 3 to 5 years Published: 22 Feb 2026 Application Insights View Requirements Experience 3 to 5 years The applicants should have experience in the following business area(s): Food (Packaged)/Beverage, Real Estate, Group of Companies, Developer Responsibilities & Context Position: Personal Secretary to the Managing Director (MD) Company: Cityscape Lifestyle Limited Location: Cityscape Tower, Gulshan, Dhaka Reports Directly To: Managing Director Employment Type: Full-Time | Executive Level Support 1. Position Summary The Personal Secretary to the Managing Director will serve as a trusted executive support partner , ensuring seamless coordination of the MD’s professional, strategic, and operational responsibilities across all entities under Cityscape Lifestyle Limited (Cave Bar, Andaaz Restaurant, Happiness Café, Membership Division, Investment Division, etc.). This role requires absolute confidentiality, high-level professionalism, precision, and proactive problem-solving ability The position is not clerical — it is a strategic coordination role . 2. Core Responsibilities A. Executive & Calendar Management ·       Manage MD’s daily calendar, meetings, appointments, and travel schedules. ·       Prioritize appointments based on strategic importance. ·       Coordinate board meetings, investor meetings, membership briefings, and legal consultations. ·       Prepare daily executive briefing notes. B. Confidential Documentation & Communication Draft, review, and format: ·       Legal agreements ·       Employment contracts ·       Membership agreements ·       Investor communications ·       Official notices and board resolutions ·       Maintain strict confidentiality of sensitive financial and legal documents. ·       Manage MD’s email and official correspondence. ·       Ensure professional communication tone across all channels. C. Meeting & Board Support ·       Prepare meeting agendas and documentation. ·       Record accurate minutes of meetings (Board, Investors, Senior Management). ·       Track follow-ups and execution deadlines. ·       Maintain official records and digital archives. D. Multi-Floor Operational Coordination Act as coordination bridge between MD and: ·       Cave Bar Management ·       Andaaz Restaurant ·       Happiness Café ·       Membership Sales Team ·       Investment & Finance Team ·       HR & Legal Departments ·       Ensure MD instructions are implemented properly. ·       Monitor performance updates and provide daily summary reports. E. I"
  },
  {
    "url": "https://bdjobs.com/h/details/1461770?ln=1",
    "company_name": "Zennova Essence",
    "job_title": "Receptionist / Client Service Executive",
    "location": "Uttara Branch – Dhaka",
    "salary": "🔹 Attractive salary (Negotiable based on experience)",
    "experience": "",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "Receptionist / Client Service Executive : Zennova Essence Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Zennova Essence Receptionist / Client Service Executive Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 22 to 35 years Location: Bogura (Bogura Sadar), Dh... Bogura (Bogura Sadar), Dhaka (Uttara Sector 11) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 22 to 35 years Responsibilities & Context 💼 WE ARE HIRING Receptionist & Customer Service Executive Rabia's Beauty Station (Sister Concern of Zennova Essence ) We are looking for smart, well-presented and customer-focused individuals to join our team in Uttara (Dhaka) and Bogura branches. 📍 Job Locations: Uttara Branch – Dhaka House-15, Road-10/A, Sector-11, Uttara, Dhaka Bogura Branch Amin Plaza, Lift-05, Romena Afaz Road, Jaleshwari Tola, Bogura 🧾 Position: 🔘 Receptionist 🔘 Customer Service Executive 🎯 Key Responsibilities: ✔️ Welcome and assist clients professionally ✔️ Manage appointment scheduling and customer queries ✔️ Handle calls, messages, and social media inquiries ✔️ Maintain client records and billing coordination ✔️ Ensure smooth front-desk operations ✔️ Deliver excellent customer experience ✅ Requirements: ▪️Minimum Bachelor’s Degree (Private University preferred) ▪️ Smart, presentable and well-groomed ▪️ Strong communication skills (Bangla & English) ▪️ Basic computer knowledge (MS Office, Social Media handling) ▪️ Customer-focused, polite and professional attitude ▪️Only female candidate can apply 💰 Salary & Benefits: 🔹 Attractive salary (Negotiable based on experience) 🔹 Performance bonus 🔹 Professional work environment 🔹 Career growth opportunities Skills & Expertise Customer Relations Customer Handling Customer Service Quality Control Product knowledge Beauty Parlour Beauty Skincare knowledge Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Bogura (Bogura Sadar), Dhaka (Uttara Sector 11) Company Information Zennova Essence Follow More jobs from this company Address: Address- House-29, Road-05, Sector-1O, Uttara,Dhaka-1230 Business: Zennova Essence is a trusted online beauty and skincare store based in Uttara, Dhaka. We specialize in providing authentic and high-quality skincare and hair care products from renowned international brands such as Cosrx, The Ordinary, Dr Althea, Purito, Skin1004 and more.\n\nOur product range includes serums, cleansers, moisturizers, toners, sunscreens, and hair care essentials designed to meet various skin types and concerns. We are committed to ensuring product authenticity, customer satisfaction, and excellent service.\n\nWith a growing customer base across Bangladesh, Zennova Essence continues to exp"
  },
  {
    "url": "https://bdjobs.com/h/details/1461633?ln=1",
    "company_name": "UK CLIPPING PATH LTD",
    "job_title": "Jr./Sr. Image Editor",
    "location": "Dhaka (PanthaPath)",
    "salary": null,
    "experience": "At least 3 years",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Jr./Sr. Image Editor : UK CLIPPING PATH LTD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List UK CLIPPING PATH LTD Jr./Sr. Image Editor Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Age: 20 to 30 years Location: Dhaka (PanthaPath) Salary: Negotiable Experience: At least 3 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education HSC Diploma Experience At least 3 years The applicants should have experience in the following business area(s): Design/Printing/Publishing Additional Requirements Age 20 to 30 years Responsibilities & Context We Are Hiring... Requirements: • Have to be an expert in High-End Photo Retouching, Advanced/Basic Colour Correction, Jewellery Retouching, Masking, Shadow, Symmetric Neck Joint, Image Manipulation, On model Retouching, Clipping Path etc. • Have a great sense of urgency with a positive attitude and have minimum knowledge of the English language so that you can understand client instructions. • Strong visual skills with attention to detail and an eye for consistency and colour. • Knowledge of retouching skin tone and matching Colour. • Excellent communication skills. Job Responsibilities: Perform advanced Colour Correction to ensure product accuracy and visual appeal across various lighting conditions. Execute flawless Ghost Mannequin (Neck Joint) effects for apparel, maintaining natural shapes and textures. Conduct High-End Retouching for fashion, beauty, and product photography, ensuring a premium quality finish. Master Symmetrical and Retouching to ensure perfect balance and alignment in product presentation. Maintain consistency in image quality and style according to specific brand guidelines. Review final outputs to ensure they are free of artefacts, blemishes, or technical errors. Perform Complex Image Masking. Skills & Expertise Color Correction High end retouching Image manipulation Masking model retouching Multiple Clipping Path Compensation & Other Benefits Over time allowance Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (PanthaPath) Company Information UK CLIPPING PATH LTD Follow Address: 57/12 Panthapath , Dhanmondi Business: Our journey begins at UK Clipping Path company back in 2017 focusing on providing world-class image editing services for e-Commerce owners, retailers, and pack-shot photographers. We’ve come a long way in a short period and take pride in becoming more than just an image editing company. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর"
  },
  {
    "url": "https://bdjobs.com/h/details/1461759?ln=1",
    "company_name": "The Nazifa Recruitment Services",
    "job_title": "Bike Deliveryman( Kuwait )",
    "location": "Kuwait",
    "salary": "Tk. 40000 - 50000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Bike Deliveryman( Kuwait ) : The Nazifa Recruitment Services Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The Nazifa Recruitment Services Bike Deliveryman( Kuwait ) Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 80 Age: 21 to 35 years Location: Kuwait Salary: Tk. 40000 - 50000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Age 21 to 35 years Responsibilities & Context Core Responsibilities: Pick-up and Delivery: Collecting items from a designated location and delivering them to the recipient's address. Route Planning: Determining the most efficient route to minimize travel time and ensure timely delivery. Traffic Navigation: Safely navigating through city traffic while adhering to traffic laws. Customer Interaction: Interacting with customers, potentially providing updates, and ensuring a positive delivery experience. Package Handling: Ensuring packages are handled with care and delivered in good condition. Documentation: Maintaining records of deliveries, including signatures or other confirmations as needed. সরাসরি ডেলিগেট কর্তৃক ইন্টারভিউ অনুষ্ঠিত হবে পদের নাম: বাইক ডেলিভারি ম্যান ( ৮০ জন ) ➖ বেতন: ১০০ দিনার ( ৩ মাস প্রবেশন পিরিয়ড শেষে ১২০-১৩০ দিনার) + টিপস ➖ বাসস্থান: ফ্রী ➖ খাবার: ফ্রী ➖ ডিউটি: ১২ ঘন্টা ➖ মোটরসাইকেল কোম্পানি দিবে, গাড়ির মেইনটেনেন্স, তেল, মোবাইল ফোন, ইন্টারনেট প্যাকেজ, কোম্পানি বহন করবে । ➖ এক্সট্র ডেলিভারি সম্পন্ন করলে এক্সট্রা অ্যালাউন্স পাবে। প্রয়োজনীয়তা: ১. বাংলাদেশী বাইক ড্রাইভিং লাইসেন্স থাকতে হবে বাধ্যতামূলক (অনলাইন কপি গ্রহণযোগ্য) ২. বেসিক ইংরেজি জানতে হবে। ৩. বয়স ২১ থেকে ৩৫ বছরের মধ্যে হতে হবে। বিশেষ দ্রষ্টব্য: শুধুমাত্র যাদের পাসপোর্ট, ড্রাইভিং লাইসেন্স (কার্ড/অনলাইন কপি) এবং কুয়েতে যেতে আগ্রহী তারা যোগাযোগ করবেন। ➖ প্রয়োজনীয় কাগজপত্র: ১. পাসপোর্ট 2. ড্রাইভিং লাইসেন্স 3. এন আই ডি 4. ফটো 5. অভিজ্ঞতা সনদ (যদি থাকে ) হোয়াটসঅ্যাপ: +৮৮০১৭৫৮০৪৬০২২ যোগাযোগ: দি নাজিফা রিক্রুটমেন্ট সার্ভিসেস (আর এল-১৮৫৯) ঠিকানা: ১০৪ গ্লোব চেম্বার, লিফট-৫, মতিঝিল, ঢাকা। মোবাইল/হোয়াটসঅ্যাপ: ০১৭৫৮০৪৬০২২, ০১৯০১৬৪৬৭৪৪, ০১৯০১৬৪৬৭৪২, ০১৯০১৬৪৬৭৪১, ০১৯০১৬৪৬৭৪৩ Skills & Expertise Motorbike Riding Employment Status Full Time Gender Only males are allowed to apply. Job Location Kuwait Apply Procedure Email Your CV Send your CV to the given email nazifarecruitmentbd2@gmail.com or Email your CV from My Bdjobs account Company Information The Nazifa Recruitment Services Follow More jobs from this company Address: Globe Chamber, 5th Floor, 104, Motijheel C/A, Dhaka-1000. Website: www.nazifarecruitment.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন"
  },
  {
    "url": "https://bdjobs.com/h/details/1461803?ln=1",
    "company_name": "Maximo International",
    "job_title": "Internship Opportunity (Paid) – Business Development & E-commerce Intern",
    "location": "Dhaka, Dhaka (Uttara)",
    "salary": null,
    "experience": "At most 2 years",
    "education": null,
    "deadline": "24 Mar 2026",
    "job_description": "Internship Opportunity (Paid) – Business Development & E-commerce Intern : Maximo International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Maximo International Internship Opportunity (Paid) – Business Development & E-commerce Intern Application Deadline : 24 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Age: 18 to 25 years Location: Dhaka, Dhaka (Uttara) Experience: At most 2 years Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Business Administration (BBA) in Marketing Experience At most 2 years The applicants should have experience in the following business area(s): Advertising Agency, Business-to-Business (B2B) Software and Services Startup, Consulting Firms, Direct Selling/Marketing Service Company, E-commerce, Garments, Telecommunication Freshers are also encouraged to apply. Additional Requirements Age 18 to 25 years Responsibilities & Context Internship Opportunity (Paid) – Business Development & E-commerce Intern Company Information Company Name: Maximo International Company Type: Authorized Channel Partner of Alibaba.com Location: Uttara, Dhaka Maximo International is an officially authorized Channel Partner of Alibaba.com, the world’s leading B2B e-commerce platform. We help Bangladeshi exporters and manufacturers expand globally by onboarding, managing, and growing their presence on Alibaba.com. Maximo International is a concern of Maximo Group Bangladesh, a leading supply chain and global trade solutions company. Position Details Position: Business Development & E-commerce Intern Internship Type: Full-time (Office-based) Duration: 3–6 Months Number of Vacancies: 6 Compensation: Paid Internship (Allowance will be discussed during interview) Job Responsibilities Assist in onboarding exporters and manufacturers onto Alibaba.com Conduct market research and generate potential B2B leads Support client communication and follow-up activities Assist in product listing creation and optimization Support digital marketing campaigns and promotional activities Prepare reports, maintain CRM data, and track performance metrics Work closely with the Business Development team to achieve monthly targets Educational Requirements Currently pursuing or recently completed Bachelor’s degree Preferred background: BBA, Marketing, International Business, International Trade, E-commerce, or related fields Job Requirements Strong communication and interpersonal skills Basic knowledge of MS Office / Google Workspace / ChatGPT, Canva Interest in E-commerce, B2B Trade, and International Business Self-motivated, goal-oriented, and proactive mindset Ability to work in a fast-paced, target-driven environment Additional Requirements Fresh graduates are encouraged to apply Previous internship or campus leadership e"
  },
  {
    "url": "https://bdjobs.com/h/details/1461696?ln=1",
    "company_name": "IOVISION",
    "job_title": "Web Developer - WordPress & PHP",
    "location": "Dhaka (Mohammadpur)",
    "salary": null,
    "experience": "At least 4 years",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Web Developer - WordPress & PHP : IOVISION Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List IOVISION Web Developer - WordPress & PHP Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (Mohammadpur) Salary: Tk. 40000 - 60000 (Monthly) Experience: At least 4 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor in Engineering (BEngg) in Computer Science Experience At least 4 years The applicants should have experience in the following business area(s): IT Enabled Service Additional Requirements Essential Expertise: Applicants must possess extensive hands-on experience with PHP, WordPress, WooCommerce, WordPress Multisite, Elementor plugin, jQuery, AJAX, MySQL, CSS3, and Bootstrap. Advanced Proficiency:  Strong expertise in PHP, Object-Oriented PHP (OOP), Laravel, JavaScript, and JSON is required. UI/UX Proficiency: Strong expertise in User Interface (UI) and User Experience (UX) design is essential. Database Skills: Advanced proficiency in writing complex MySQL queries using WordPress`s native database access classes. Development Standards: Ability to write clean, maintainable code and manage the full development cycle, including design, development, testing, and debugging. Communication Skills: Proficiency in both spoken and written English is required. Responsibilities & Context We are seeking experienced and highly skilled WordPress Developers for Singapore team with a minimum of 4 years of hands-on experience in PHP and WordPress development. Key Responsibilities: Develop dynamic and interactive websites and web applications using WordPress CMS or custom PHP solutions. Design and build custom WordPress plugins, as well as troubleshoot and enhance existing themes and plugins by adding new features or fixing bugs. Build and customize WooCommerce solutions, including plugin and extension development. Implement and manage WordPress Multisite environments. Customize premium WordPress themes and plugins to meet project-specific requirements. Convert Figma designs into fully responsive and interactive WordPress websites with a strong focus on user experience. Develop and integrate RESTful APIs for seamless data communication across platforms. Skills & Expertise Elementor gSAP HTML5 & CSS3 JS JQuery AJAX Laravel Framework PHP (OOP) RESTful API Shopify Woocommerce WordPress Suggested by Web Development PHP wordpress customization Compensation & Other Benefits Festival Bonuses: Two annual festival bonuses (applicable after one year of employment). Salary Increment: Annual salary review based on performance. Company Tour: Enjoy a yearly company-sponsored tour. Refreshments: Unlimited tea and coffee, along with afternoon snacks. Performance Bonus: Additional bonuses based "
  },
  {
    "url": "https://bdjobs.com/h/details/1461779?ln=1",
    "company_name": "Closet Cloud",
    "job_title": "Assistant branch Manager",
    "location": "Dhaka (Basundhara RA, DOHS Banani)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Assistant branch Manager : Closet Cloud Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Closet Cloud Assistant branch Manager Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Dhaka (Basundhara RA, DOH... Dhaka (Basundhara RA, DOHS Banani) Salary: Tk. 22000 - 24000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Responsibilities & Context Job Circular: Branch Manager Company: Closet Cloud Location: Banani / Uttara / Bashundhara R/A Position: Branch Manager Responsibilities: Oversee daily operations of the outlet to ensure smooth functioning. Implement effective sales and marketing strategies to meet targets. Manage inventory, including restocking and maintaining appropriate stock levels. Supervise and motivate store staff to provide excellent customer service. Monitor and report on outlet performance to higher management. Requirements: Proven experience in retail management, preferably in the fashion industry. Strong leadership and decision-making skills. Excellent communication and interpersonal abilities. Knowledge of fashion trends and customer preferences. Ability to analyze sales reports and implement improvements. Salary Range: 22000 - 24000 tk Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Basundhara RA, DOHS Banani) Company Information Closet Cloud Follow More jobs from this company Address: House-39, Lake Drive Road, Nikunja-1, Khilkhet, Dhaka-1229 Business: Closet cloud is a lifestyle store . Original and Master Replica of Pakistan woman`s clothing of latest trend are available in closet cloud Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Cour"
  },
  {
    "url": "https://bdjobs.com/h/details/1461713?ln=1",
    "company_name": "Dhaka Timber Complex",
    "job_title": "Jr. Marketing Officer",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Jr. Marketing Officer : Dhaka Timber Complex Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dhaka Timber Complex Jr. Marketing Officer Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 07 Location: Dhaka Salary: Tk. 12000 - 12000 (Monthly) Published: 21 Feb 2026 Application Insights View Requirements Education Additional Requirements মোটসাইকেল চালাতে পারলে অগ্রাধিকার দেয়া হবে, কিন্তু বাধ্যবাধকতা নেই। Responsibilities & Context মার্কেট ভিজিট: নিয়মিত সম্ভাব্য বাজার ও বিভিন্ন প্রজেক্ট এলাকা পরিদর্শন করা এবং নতুন ক্লায়েন্ট বা কাস্টমার খুঁজে বের করা। কাস্টমার রিলেশন: বিদ্যমান কাস্টমারদের সাথে সুসম্পর্ক বজায় রাখা এবং তাদের যে কোনো প্রয়োজনে সহায়তা প্রদান করা। প্রোডাক্ট প্রেজেন্টেশন: সম্ভাব্য ক্রেতাদের কাছে টিম্বার বা কাঠের পণ্যের গুণগত মান ও বৈশিষ্ট্য তুলে ধরা। বাজার বিশ্লেষণ: প্রতিযোগী কোম্পানিগুলোর কার্যক্রম এবং বাজারের বর্তমান চাহিদা পর্যবেক্ষণ করে ঊর্ধ্বতন কর্মকর্তাদের রিপোর্ট প্রদান করা। ফলো-আপ: সম্ভাব্য ক্রেতাদের সাথে নিয়মিত যোগাযোগ (কল বা সরাসরি সাক্ষাত) বজায় রাখা এবং ডিল ক্লোজ করা। ব্র্যান্ডিং: বিভিন্ন ইভেন্ট বা প্রচারণামূলক কাজের মাধ্যমে কোম্পানির ব্র্যান্ড ইমেজ বৃদ্ধিতে সহায়তা করা। রিপোর্টিং: প্রতিদিনের কাজের আপডেট এবং মার্কেটিং কার্যক্রমের বিস্তারিত রিপোর্ট ম্যানেজমেন্টের কাছে পেশ করা। Skills & Expertise Leadership and Good Communication skill. Motorbike Driving Compensation & Other Benefits Mobile bill,T/A Lunch Facilities: Partially Subsidize Festival Bonus: 2 Salary Review: Yearly Attractive Sales Incentives Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Dhaka Timber Complex Follow Address: 202, Satarkul Road, North Badda, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 "
  },
  {
    "url": "https://bdjobs.com/h/details/1461717?ln=1",
    "company_name": "Matamuhury Infrastructure Development (Pvt.) Ltd.",
    "job_title": "Office Assistant",
    "location": "Dhaka (Vatara)",
    "salary": "Tk. 12000 - 13000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Office Assistant : Matamuhury Infrastructure Development (Pvt.) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Matamuhury Infrastructure Development (Pvt.) Ltd. Office Assistant Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Age: 18 to 28 years Location: Dhaka (Vatara) Salary: Tk. 12000 - 13000 (Monthly) Published: 21 Feb 2026 Application Insights View Requirements Education Additional Requirements Age 18 to 28 years Responsibilities & Context Job Responsibilities: Purchase Team–এর হয়ে কোটেশন সংগ্রহ ও ভেন্ডর যোগাযোগে সহায়তা করা ক্রয় সংক্রান্ত বিল, ইনভয়েস ও ডকুমেন্ট সংরক্ষণ ও ফাইলিং Accounts Team–এর জন্য ভাউচার প্রস্তুত ও ডাটা এন্ট্রি সহায়তা বিল যাচাই ও পেমেন্ট প্রসেসে সহযোগিতা করা অফিসের প্রয়োজনীয় স্টেশনারি ও সাপ্লাই মনিটর করা দৈনন্দিন প্রশাসনিক ও সাপোর্ট সংক্রান্ত কাজ সম্পাদন Requirements: ন্যূনতম HSC / Graduate (অগ্রাধিকারযোগ্য) প্রাথমিক কম্পিউটার জ্ঞান (MS Word, Excel) হিসাব ও ক্রয় সংক্রান্ত কাজে আগ্রহ দায়িত্বশীল, সৎ ও পরিশ্রমী মনোভাব Benefits & Facilities: Weekly 1 Day Holiday Casual Leave as per Company Policy Annual Salary Review 2 Festival Bonuses per Year Promotion and Increment as per Company Policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Vatara) Company Information Matamuhury Infrastructure Development (Pvt.) Ltd. Follow More jobs from this company Address: Flat# 8-C, 7th Floor, House# 534 & 538, Hazi Abu Sayed Plaza, (Near Evercare Hospital Gate) Dhali Bari Link Road, Vatara, Dhaka - 1212\r\nGoogle Map: https://maps.app.goo.gl/Uv3oFq7WTups1ner8 Website: https://matamuhurygroup.com Business: Matamuhuy Infrastructure Development (Pvt.) Ltd. (MMIDL) is 1st class building contractor and building developer, established & incorporated on May 21, 2021 under the registration no. C-171298/2021. MMIDL is one of the best building construction companies in Dhaka. Mobile: 01716097086 Google Map: https://maps.app.goo.gl/Uv3oFq7WTups1ner8 Address: Flat# 8-C, Level 7, House# 534/538, Hazi Abu Sayed Plaza, Dhali Bari Link Road, Near Evercare Hospital Rd, Vatara, Dhaka-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Regis"
  },
  {
    "url": "https://bdjobs.com/h/details/1461782?ln=1",
    "company_name": "Sherazi IT",
    "job_title": "Senior Laravel Developer – Lead SaaS POS Platform Redevelopment",
    "location": "Dhaka (Uttara Sector 9)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Senior Laravel Developer – Lead SaaS POS Platform Redevelopment : Sherazi IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sherazi IT Senior Laravel Developer – Lead SaaS POS Platform Redevelopment Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 40 years Location: Dhaka (Uttara Sector 9) Salary: Tk. 30000 - 30000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 40 years Experience Level: কমপক্ষে ২+ বছরের production-level Laravel/PHP development experience (SaaS/multi-tenant projects preferred)। Location & Work Mode: Dhaka/Uttara-based preferred (অফিসে কাজ করতে হবে), অথবা hybrid/remote flexibility যদি allow করেন। Soft Skills: Strong problem-solving, clean code writing, team collaboration, ability to handle multiple tasks & deadlines, good communication (English + Bangla)। Portfolio/Proof: GitHub / portfolio links, live SaaS project examples (যেমন: multi-tenant POS/eCommerce/ERP systems), previous work references যাচাই করা যাবে। Availability: Immediate / within ১ মাস join করতে পারবে। Other Bonus: Experience with POS/hardware integrations (barcode scanner, thermal printer, weighing scale), payment gateways, courier APIs (Steadfast/Patahoo), SMS marketing tools — অথবা similar domain knowledge। Responsibilities & Context আমরা Senior Level অভিজ্ঞ Laravel Developer নিয়োগ করছি Sherazi POS-এর major redevelopment-এর জন্য। আবশ্যিক শর্তসমূহ: SaaS প্রজেক্টে কাজের প্রমাণিত ও যাচাইযোগ্য অভিজ্ঞতা থাকতে হবে। নির্ধারিত টেকনিক্যাল টেস্ট/পরীক্ষায় উত্তীর্ণ হতে হবে। নিয়োগের পর প্রথম ১ মাস প্রবেশন (Paid Probation) থাকবে। এই শর্তসমূহ পূরণ না হলে দুঃখিত, আবেদন বিবেচনা করা সম্ভব হবে না। অন্যান্য প্রার্থীরা আবেদন থেকে বিরত থাকুন। আবেদনকারীদের অনুগ্রহ করে পদের প্রধান দায়িত্বসমূহ ভালোভাবে পড়ে নেওয়ার অনুরোধ রইল। প্রধান দায়িত্বসমূহ: Laravel Framework ব্যবহার করে SaaS-based ও custom projects ডেভেলপ, maintain ও enhance করা (যেমন: Sherazi POS-এর full redevelopment)। RESTful API development, Authentication (Passport/Sanctum), advanced Database design (MySQL), NGINX configuration, project architecture। Multi-tenant SaaS architecture design & optimization (e.g., tenancyforlaravel or custom isolation)। Application security, performance tuning, scalability নিশ্চিত করা। Bug fixing, code optimization, Git-based version control। CyberPanel / VPS / Dedicated Server-এ Laravel projects deploy ও manage করা। Full-stack capabilities: Laravel backend + modern frontend tools (Inertia.js / Livewire, Tailwind CSS + shadcn/ui / Alpine.js)। Performance optimization: Laravel Octane, Horizon, Redis। Comprehensive testing: PHPUnit/Pest, Dusk/Browser tests, CI/CD (GitHub Actions)। পছন্দনীয় (Bonus) দক্ষতা: Real-time features: Laravel Echo + Reverb / Pusher (WebSockets "
  },
  {
    "url": "https://bdjobs.com/h/details/1461735?ln=1",
    "company_name": "Jibon Alo Hospital",
    "job_title": "Medical Officer",
    "location": "Noakhali (Noakhali Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Medical Officer : Jibon Alo Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Jibon Alo Hospital Medical Officer Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: 30 to 50 years Location: Noakhali (Noakhali Sadar) Salary: Tk. 45000 - 50000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 30 to 50 years Responsibilities & Context Provide regular healthcare services to both indoor and outdoor patients. Assist the consultant doctor in seeing patients and taking initial patient histories. Follow up on patient investigations and treatment processes as per the consultant’s advice. Assist in prescribing medicines, administering injections/IV (as needed), and following the consultant’s instructions. Clearly explain the consultant’s treatment plan to patients and their families. Prepare necessary documents, reports, and prescriptions during the consultant’s chamber hours. Properly maintain and file all patient-related medical records. Complete medical reports and other documentation as per hospital guidelines. Participate in emergency patient care and refer patients when necessary. Follow Infection Prevention and Control (IPC) protocols and ensure hygiene standards. Provide necessary counseling to patients and their families regarding medical conditions and treatments. Coordinate with other doctors and healthcare staff to ensure effective teamwork. Work towards patient satisfaction and improving the quality of service. Carry out any other responsibilities assigned by the hospital management. Strictly avoid any inappropriate behavior, including sexual harassment or misconduct. Compensation & Other Benefits Mobile bill Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Noakhali (Noakhali Sadar) Company Information Jibon Alo Hospital Follow Address: Jibon alo hospital,hospital road,maizdee court,noakhali Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 35"
  },
  {
    "url": "https://bdjobs.com/h/details/1461785?ln=1",
    "company_name": "Shams Trade International",
    "job_title": "Marketing / Sales Executive",
    "location": "Dhaka, Dhaka (Uttara Sector 3)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Marketing / Sales Executive : Shams Trade International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shams Trade International Marketing / Sales Executive Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 20 to 45 years Location: Dhaka, Dhaka (Uttara Sect... Dhaka, Dhaka (Uttara Sector 3) Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 20 to 45 years Responsibilities & Context Job Requirements: Candidates should be good knowledge about food item and fruits, frozen item,skin care products all are imported item. should be good knowledge supply product to supershop . Should be sincere, honest, hardworking, enthusiastic, self-motivated. Computer Proficiency with Office Application, e-mail and internet browsing. Good command in English & Bangla Language is needed. He will work as a DATA ANALYST. He will analyses data time to time based on assignment. He will analyses data on new product Launching based on assignment. He will analyses data on new product existence in the market based on assignment. He will make report on daily sales, weekly sales , monthly sales and yearly sales data based on assignment etc. He will data analyses by comparing with the previous months, years , product wise, Sku wise data based on assignment etc. Candidates have the positive mentality to extensive travel throughout the country. Any other job needs to perform as and when assigned by the management. Skills & Expertise Sales & Marketing Sales target Customer Service Workplace Work at office Employment Status Full Time Job Location Dhaka, Dhaka (Uttara Sector 3) Job Highlights We are looking for “EXECUTIVE/  EXECUTIVE -SALES ADMIN.. Candidates must have sound knowledge on Computer, Apply Procedure Email Your CV Send your CV to the given email mmazumder495@gmail.com or Email your CV from My Bdjobs account Company Information Shams Trade International Follow Address: Nigar plaza , road 02, sector 3, uttara ,Dhaka. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professio"
  },
  {
    "url": "https://bdjobs.com/h/details/1461750?ln=1",
    "company_name": "Aus Bangla Jutex Ltd. ( Factory)",
    "job_title": "Full S tack Engineer (Mid-Level) - Cloud, DevOps & AI Applications",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Full S tack Engineer (Mid-Level) - Cloud, DevOps & AI Applications : Aus Bangla Jutex Ltd. ( Factory) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aus Bangla Jutex Ltd. ( Factory) Full S tack Engineer (Mid-Level) - Cloud, DevOps & AI Applications Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 18 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 50000 - 100000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 18 to 35 years Responsibilities & Context Rankinsoft is a sister concern of Aus Bangla Jutex and is headquartered in San Francisco, California, serving clients across the United States. As an IT consulting and AI implementation partner, Rankinsoft helps startups and Small & Medium Businesses (SMBs) eliminate operational bottlenecks and accelerate growth through custom software, cloud infrastructure, and intelligent automation. The Full Stack Engineer (Mid-Level) will join the team as a full-time remote member, contributing to the design, development, and deployment of scalable, client-focused technology solutions in a fast-paced, delivery-driven environment. Key Responsibilities Design, develop, and maintain custom web applications across frontend and backend technologies based on specific client requirements Translate business pain points into practical, scalable technical solutions Build and optimize WordPress-based platforms where required Deploy and manage applications on AWS cloud infrastructure Implement and maintain DevOps practices, including CI/CD pipelines and automated deployment workflows Containerize and orchestrate services using Docker and Kubernetes (K8s) Configure and manage Linux/Unix and Windows server environments Handle networking setup and performance optimization (DNS, SSL, load balancing, domain configuration) Develop and integrate AI-powered solutions, including Retrieval-Augmented Generation (RAG) applications and workflow automation Troubleshoot and resolve application, infrastructure, and performance issues across environments Collaborate directly with clients and internal teams to ensure timely and high-quality delivery Role Expectations Take ownership of features and projects from development through production deployment Work across multiple technologies depending on solution needs in a consulting environment Contribute to real-world AI adoption for startups and SMBs Maintain strong problem-solving ability, adaptability, and delivery focus in client-facing scenarios Skills & Expertise Artificial intelligence (AI) AWS Cloud Full Stack Development Programming Python Compensation & Other Benefits Global Career Progression Opportunity As Rankinsoft scales its U.S. operations and client portfo"
  },
  {
    "url": "https://bdjobs.com/h/details/1461716?ln=1",
    "company_name": "Matamuhury Infrastructure Development (Pvt.) Ltd.",
    "job_title": "Jr. Officer (Accounts)",
    "location": "Dhaka (Vatara)",
    "salary": "Tk. 13000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Jr. Officer (Accounts) : Matamuhury Infrastructure Development (Pvt.) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Matamuhury Infrastructure Development (Pvt.) Ltd. Jr. Officer (Accounts) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Age: 22 to 28 years Location: Dhaka (Vatara) Salary: Tk. 13000 - 15000 (Monthly) Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Age 22 to 28 years Responsibilities & Context Freshers are encouraged to apply. Job Responsibilities: Verify invoices, receipts, and financial documents for accuracy. Maintain daily financial operations including accounts payable/receivable, and ledger entries. Process and manage payroll, including ensuring timely payments and deductions. Perform bank reconciliations and manage cash book and bank book entries. Maintain fixed asset registers and monitor inventory movement. Highly performer on Microsoft Office, especially on word & excel and accounting software. Strong attention to detail and accuracy in financial record-keeping. Ability to work under pressure and meet deadlines. Prepare monthly, quarterly, and annual financial reports for management review. Support the audit process by preparing necessary documentation. Benefits & Facilities: Weekly 1 Day Holiday Casual Leave as per Company Policy Annual Salary Review 2 Festival Bonuses per Year Promotion and Increment as per Company Policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Vatara) Company Information Matamuhury Infrastructure Development (Pvt.) Ltd. Follow More jobs from this company Address: Flat# 8-C, 7th Floor, House# 534 & 538, Hazi Abu Sayed Plaza, (Near Evercare Hospital Gate) Dhali Bari Link Road, Vatara, Dhaka - 1212\r\nGoogle Map: https://maps.app.goo.gl/Uv3oFq7WTups1ner8 Website: https://matamuhurygroup.com Business: Matamuhuy Infrastructure Development (Pvt.) Ltd. (MMIDL) is 1st class building contractor and building developer, established & incorporated on May 21, 2021 under the registration no. C-171298/2021. MMIDL is one of the best building construction companies in Dhaka. Mobile: 01716097086 Google Map: https://maps.app.goo.gl/Uv3oFq7WTups1ner8 Address: Flat# 8-C, Level 7, House# 534/538, Hazi Abu Sayed Plaza, Dhali Bari Link Road, Near Evercare Hospital Rd, Vatara, Dhaka-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব "
  },
  {
    "url": "https://bdjobs.com/h/details/1461725?ln=1",
    "company_name": "Aman Spinning Mills Limited",
    "job_title": "GM, Technical",
    "location": "Dhaka (Ashulia)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "GM, Technical : Aman Spinning Mills Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aman Spinning Mills Limited GM, Technical Application Deadline : 07 Mar 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Salary & Benefits Company Information Summary Vacancy: 01 Location: Dhaka (Ashulia) Salary: Negotiable Published: 21 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements At least 8-10 years of job experience in designing, developing, and manufacturing textile machinery. In-depth knowledge of designing, including programming for developing new prototypes of spinning machinery. Thorough knowledge of electronics is also mandatory. Applications are welcome from candidates of any nationality Applicants who do not meet the criteria outlined above should not apply. We also strongly encourage overseas candidates to apply. Skills & Expertise Suggested by Prototyping Mechanical Engineering Electronics Compensation & Other Benefits attractive offer for the right individual. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Ashulia) Apply Procedure Email Your CV Send your CV to the given email munsur.a@amanspinning.com or Email your CV from My Bdjobs account Company Information Aman Spinning Mills Limited Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন ক"
  },
  {
    "url": "https://bdjobs.com/h/details/1461765?ln=1",
    "company_name": "Sharif Properties Service",
    "job_title": "ইলেকট্রিশিয়ান ও প্লাম্বার",
    "location": "Dhaka (Gulshan)",
    "salary": "Tk. 15000 - 16000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "ইলেকট্রিশিয়ান ও প্লাম্বার : Sharif Properties Service Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sharif Properties Service ইলেকট্রিশিয়ান ও প্লাম্বার Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 18 to 30 years Location: Dhaka (Gulshan) Salary: Tk. 15000 - 16000 (Monthly) Published: 21 Feb 2026 Application Insights View Requirements Education Additional Requirements Age 18 to 30 years Responsibilities & Context জরুরি নিয়োগ বিজ্ঞপ্তি পদবী: ইলেকট্রিশিয়ান ও প্লাম্বার পদসংখ্যা: ১ জন কর্মস্থল: রোড-৩৫, হাউস-২১, গুলশান-২ কাজের সময়: সকাল ৯:০০টা থেকে সন্ধ্যা ৬:০০টা পর্যন্ত সাপ্তাহিক ছুটি: শুক্রবার বার্ষিক অতিরিক্ত ছুটি: ১২ দিন বেতন: ১৫,০০০ টাকা (মাসিক) ✅ যোগ্যতা ও অভিজ্ঞতা: সংশ্লিষ্ট কাজে অভিজ্ঞতা থাকতে হবে। ইলেকট্রিক ও প্লাম্বিং কাজ সম্পর্কে ভালো ধারণা থাকতে হবে। দায়িত্বশীল ও পরিশ্রমী হতে হবে। আগ্রহী প্রার্থীদের দ্রুত যোগাযোগ করার জন্য অনুরোধ করা যাচ্ছে। Rakib -01783427155 Skills & Expertise Electrician Plumber Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Gulshan) Company Information Sharif Properties Service Follow More jobs from this company Address: Road-35,House-21B ,Gulshan -2,Dhaka-1212 &\nRoad-2/2,House-3,Block-L,Banani-1213 Website: https://sharif.com.bd/ Business: Property Management Company based on Dhaka ,\nHotel Business & service Apartment in Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now In"
  }
]