[
  {
    "url": "https://bdjobs.com/h/details/1457042?ln=1",
    "company_name": "Royal Weaving and Coating Industries Ltd.",
    "job_title": "Sales Officer (SO)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "Sales Officer (SO) : Royal Weaving and Coating Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Royal Weaving and Coating Industries Ltd. Sales Officer (SO) Application Deadline : 07 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Age: 18 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 18000 - 35000 (Monthly) Experience: 1 to 3 years Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education HSC Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Plastic/ Polymer Industry Freshers are also encouraged to apply. Additional Requirements Age 18 to 35 years Responsibilities & Context Job Overview: We are seeking a dynamic and results-driven Sales Officer to join our Sales & Marketing team. The ideal candidate will be responsible for driving sales growth, building strong relationships with clients, and achieving set sales targets. If you are a motivated individual with a passion for sales and customer engagement, we encourage you to apply. Key Responsibilities: Achieve monthly and quarterly sales targets as set by management. Identify and develop new sales territories and market segments. Acquire new customers and expand the existing customer base. Monitor and ensure effective distribution to dealers and customer points. Build and maintain strong relationships with dealers and clients. Promote company products to potential clients and stakeholders within the assigned area. Execute all sales and marketing activities as assigned by the company. Prepare and submit accurate and timely sales reports to management. Skills & Expertise Retail Sales Sales & Marketing Sales Executive Sales target Customer Service Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Performance Bonus Sales Commission Staff Program Incentive Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Royal Weaving and Coating Industries Ltd. Follow Address: Head Office: 19, Bangshal Road, Dhaka-1100;\nFactory: Banti, Duptara, Araihazar, Narayanganj Website: https://www.royalpolycoat.com/ Business: Royal Weaving & Coating Ind. Ltd. is an leading PVC Leather Manufacturer. Supplying individuals and companies with Premium Quality Synthetic Leather they need for producing Shoes, Bags, and other Accessories. We also manufacture Vinyl Table Cloths and Floor coverings. Furthermore, we provide coating services on textiles for various garments and military uses. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ কর"
  },
  {
    "url": "https://bdjobs.com/h/details/1458836?ln=1",
    "company_name": "International Labour Organization (ILO)",
    "job_title": "National Consultant - (GEAR) Program",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "National Consultant - (GEAR) Program : International Labour Organization (ILO) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List International Labour Organization (ILO) National Consultant - (GEAR) Program Application Deadline : 22 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Employment Status Full Time Job Location Anywhere in Bangladesh Apply Procedure Hard Copy https://hotjobs.bdjobs.com/jobs/mmad/ilo173.htm Apply URL: https://hotjobs.bdjobs.com/jobs/mmad/ilo173.htm Company Information International Labour Organization (ILO) Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1459331?ln=1",
    "company_name": "Phoenix Education",
    "job_title": "Junior Accountant",
    "location": "Dhaka (Basundhara RA)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": "Freshers are also encouraged to apply.",
    "deadline": "15 Mar 2026",
    "job_description": "Junior Accountant : Phoenix Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Phoenix Education Junior Accountant Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 24 to 30 years Location: Dhaka (Basundhara RA) Salary: Tk. 16000 - 20000 (Monthly) Experience: 1 to 3 years Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Diploma Experience 1 to 3 years The applicants should have experience in the following business area(s): IT Enabled Service, Educational Technology (Edtech) Startup, BPO/ Data Entry Firm, Audit Firms /Tax Consultant Freshers are also encouraged to apply. Additional Requirements Age 24 to 30 years Responsibilities & Context Brief About the Role: The Accountant will play a vital role in managing the financial operations of the company. They are responsible for maintaining accurate financial records, preparing financial statements, processing invoices, and handling payroll. The role also involves managing budgets, conducting financial analysis, and ensuring compliance with accounting regulations and tax laws. Job Responsibilities: Analyze cost data to identify areas of cost savings and efficiency improvements. Preparing Annual & Periodical Budgets as per Management Requirements. Assessing the financial risk of the organization to ensure sustainable growth. Develop standard procedures for Financial Processes. Ensure compliance with financial regulations, tax laws, and accounting standards. Assist in the preparation of tax returns and audits. Provide financial information to management by researching and analyzing accounting data and preparing reports. Implement and update daily cash books, material, stock register, and other registers to maintain accurate financial records. Monitor cash flow and manage short-term liquidity. Prepare and maintain accurate cost reports, forecasts, budgets and budget variance. Establish budgetary control through pre-costing analysis. Conduct cost-benefit analysis as and when required to assist in making management decisions regarding current and proposed project proposals & capital budgeting etc. Summarizing the current financial status by collecting information and preparing balance sheets profit and loss statements and other reports. Prepare and present financial reports for management review. Assist with internal and external audits, ensuring that all documentation and financial data are readily available and accurate. Provide accurate and timely reporting on the financial activity of individual projects. Facing external audit, internal audit, audit of Bangladesh Bank, NBR (Tax and VAT) and other Legislation bodies. Assist with preparing, reviewing, and verifying purchase/sales orders, vendor inv"
  },
  {
    "url": "https://bdjobs.com/h/details/1459289?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Officer/Sr.Officer (Local Procurement)",
    "location": "Chattogram, Dhaka",
    "salary": "",
    "experience": "2 to 6 years",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Officer/Sr.Officer (Local Procurement) : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Officer/Sr.Officer (Local Procurement) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Chattogram, Dhaka Experience: 2 to 6 years Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Masters Bachelor in Engineering (BEngg) Bachelor/Honors Experience 2 to 6 years The applicants should have experience in the following business area(s): Cement Industry, Food (Packaged)/Beverage, Steel Additional Requirements Strong negotiation and communication skills.                   Honest, proactive, and able to work under pressure.           Good understanding of local supplier market. Responsibilities & Context Manage procurement of raw materials, packaging materials, factory consumables, and spare parts. Collect quotations, prepare comparative statements (CS), and issue purchase orders (PO). Negotiate with suppliers for best price, quality, and delivery terms. Ensure timely delivery of materials to avoid any production disruption. Maintain good relationships with existing suppliers and explore new vendors. Maintain proper documentation for audit and internal compliance. Coordinate with internal departments for smooth purchase planning. Skills & Expertise Local Procurement Purchase/ Procurement Workplace Work at office Employment Status Full Time Job Location Chattogram, Dhaka Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 E"
  },
  {
    "url": "https://bdjobs.com/h/details/1459263?ln=1",
    "company_name": "Akij Food & Beverage Ltd",
    "job_title": "Executive- Market Audit and Business Intelligence (MABI)",
    "location": "Barishal, Bogura, Chattogram (Chakbazar Chittagong), Cumilla, Mymensingh, Rangpur, Sylhet",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Executive- Market Audit and Business Intelligence (MABI) : Akij Food & Beverage Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Food & Beverage Ltd Executive- Market Audit and Business Intelligence (MABI) Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 22 to 35 years Location: Barishal, Bogura, Chattog... Barishal, Bogura, Chattogram (Chakbazar Chittagong), Cumilla, Mymensingh, Rangpur, Sylhet Salary: Negotiable Experience: 1 to 2 years Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience 1 to 2 years The applicants should have experience in the following business area(s): Food (Packaged)/Beverage, Healthcare/Lifestyle product, Manufacturing (FMCG) Freshers are also encouraged to apply. Additional Requirements Age 22 to 35 years The applicants should have experience in Group of Companies, Manufacturing (FMCG), Food & Beverage Industries or Healthcare & Hygiene Ltd. Responsibilities & Context Visit retail outlets to collect information regarding AFBL & competitor’s products Collecting information regarding competitor’s activities Collecting retailer’s opinions regarding the service quality of different beverage companies Visiting distribution points and observing their SOP Working with field forces to assess their activities and observing their gaps and strengths Evaluating the effectiveness & response of various trade, retail & consumer program implementation Retail outlets visit to collect cooler & product aging information Fake sales identification Collecting whole sales dumping information Preparing reports on market observations Conducting field force promotional assessment activities Preparing various trade program bills (Slab, Memo Scratch Card, Display, etc.) for claim adjustment. Skills & Expertise Market Audit Market Research Market Research Analysis Suggested by Business intelligence Competitor Analysis Market Audit Report Preparation Compensation & Other Benefits T/A,Mobile bill,Medical allowance,Provident fund,Insurance,Gratuity Salary Review: Yearly Festival Bonus: 2 Leave Fare Assistance (LFA) Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Barishal, Bogura, Chattogram (Chakbazar Chittagong), Cumilla, Mymensingh, Rangpur, Sylhet Job Highlights We seek a motivated field based person ,detail-oriented Executive for our MABI Department to conduct market audits, analyze business performance, and deliver insights that support strategic decision-making. Company Information Akij Food & Beverage Ltd Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জব"
  },
  {
    "url": "https://bdjobs.com/h/details/1459325?ln=1",
    "company_name": "Dynamic Solution Innovators Limited",
    "job_title": "Operations Manager",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 12 years",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Operations Manager : Dynamic Solution Innovators Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dynamic Solution Innovators Limited Operations Manager Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 12 years Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Minimum 12+ years of experience in operations management or a similar role, preferably in Software Industry Experience At least 12 years The applicants should have experience in the following business area(s): Software Company, IT Enabled Service Additional Requirements Proven track record of managing operational processes and leading teams Strong understanding of operational workflows, supply chain basics, and performance metrics Excellent problem-solving and decision-making abilities Strong leadership, communication, and interpersonal skills Strong people development skills Experience in solution-based or innovation-driven organizations Demonstrated experience with budget management and cost control Knowledge of ERP systems and automation tools Familiarity with quality management systems and compliance standards Strong organizational and time management skills Analytical mindset with attention to detail Ability to work under pressure and manage multiple priorities Proactive and solution-oriented approach Responsibilities & Context Description Dynamic Solution Innovators (DSi) is a software company providing software development services since 2001 to clients across Bangladesh and various international markets. With a team of 270+ professionals, we have delivered impactful solutions in the education, finance, logistics, and government sectors. We are seeking a results-driven and detail-oriented Operations Manager to oversee and optimize our day-to-day operational functions at DSi. This key management position will be responsible for ensuring operational efficiency, implementing process improvements, and supporting the execution of our business strategy. Responsibilities Manage daily operations across various departments, ensuring smooth workflow, adherence to compliance, quality standards and timely delivery of products/services Analyze internal operations to identify, develop and implement solutions to streamline operations, and introduce best practices that enhance productivity and reduce costs Leading and supervising operation team, you will foster a collaborative and productive work environment. This involves scheduling, training team members, conducting performance evaluations, and ensuring team adherence to company policies and procedures. Oversee the allocation and utilization of resources including materials, equipment, and personnel to ensure optimal efficiency Monitor performance with tracking software and take correctiv"
  },
  {
    "url": "https://bdjobs.com/h/details/1459369?ln=1",
    "company_name": "Betopia Group",
    "job_title": "Senior Odoo Developer",
    "location": "Dhaka (Banasree)",
    "salary": null,
    "experience": "3 to 4 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Senior Odoo Developer : Betopia Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Betopia Group Senior Odoo Developer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Location: Dhaka (Banasree) Salary: Tk. 60000 - 70000 (Monthly) Experience: 3 to 4 years Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Master of Science (MSc) in Computer Science & Engineering Experience 3 to 4 years The applicants should have experience in the following business area(s): Group of Companies, IT Enabled Service, Software Company Additional Requirements Proficiency in Python, PostgreSQL, XML, JavaScript and templatingExperience with Linux and Git version controlGood understanding of HTML5, CSS3, JavaScript and jQueryExperience in building Portals and customizing front-end viewsExperience with external API integration (REST, JSON, XML-RPC)Ability to work independently and collaboratively in a fast-paced environment. Responsibilities & Context ▸ Should have good knowledge of Python/Odoo's Default Modules i.e Sales, Purchase, warehouse i.e inventory Management, Accounting, Human Resources etc. ▸ Should have very much good knowledge of Python and its related libraries. ▸ Should have good knowledge of Odoo Framework and Custom Module Creation based on Clients Requirements. ▸ Need to have a good knowledge of PostgreSQL and its queries & stored procedures. ▸ Should have good knowledge of GIT. ▸ Familiarity with jQuery &/or OWL is a plus ▸ Excellent oral and written communication skills. ▸ Need to have good knowledge of API's in Odoo i.e. System Integrations. ▸ Should have knowledge of Q-web for Reporting in Odoo. ▸Must Have experience handling a team and also well versed in client Interaction. ▸ Keep team members and Project Managers informed of key developments, program decisions, issues, and changes to the project and the project plan. ▸ Should be able to manage stringent deadlines and pressure. Skills & Expertise Git Version Control System HTML5 & CSS3 Python Linux JavaScript Compensation & Other Benefits Core Benefits Profit share 2 Festival bonus Yearly salary review Other Benefits * Excellent Work Environment * Fast Career Growth * Global Exposure * Innovation-Driven Culture Workplace Work at office Employment Status Full Time Job Location Dhaka (Banasree) Company Information Betopia Group Follow More jobs from this company Address: Level 6, Lotus Kamal Tower-2, 59 & 61, Gulshan South Avenue, Gulshan 1, Dhaka 1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আ"
  },
  {
    "url": "https://bdjobs.com/h/details/1459270?ln=1",
    "company_name": "Sheba Holdings Limited",
    "job_title": "Visa Officer",
    "location": "Dhaka",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Visa Officer : Sheba Holdings Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sheba Holdings Limited Visa Officer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 02 Age: At least 22 years Location: Dhaka Salary: Negotiable Experience: 1 to 3 years Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Travel Agent Additional Requirements Age At least 22 years Responsibilities & Context Process visas for USA, UK, Canada, Australia & Schengen Prepare Documentation & File Submissions Reviews financial & Travel Documents Handle online portals & appointments Provide visa consultation Ensure high success rate Compensation & Other Benefits Tour allowance,Mobile bill Lunch Facilities: Full Subsidize Festival Bonus: 2 Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights As a Visa Officer, you will be responsible for reviewing visa applications, conducting interviews, verifying documents, and making decisions on visa approvals. Company Information Sheba Holdings Limited Follow Address: Sheba Nurjahan Eyecon Center, 60 Purana Paltan, Dhaka, Bangladesh Website: https://www.shebaholdings.com Business: Sheba Holdings Ltd. Sheba Holdings Limited Is a promising Real Estate company in Bangladesh having highly experienced management and committed professionals. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle M"
  },
  {
    "url": "https://bdjobs.com/h/details/1459292?ln=1",
    "company_name": "Phoenix Education",
    "job_title": "Telesales Executive",
    "location": "Dhaka (Basundhara RA)",
    "salary": null,
    "experience": "At least 1 year",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Telesales Executive : Phoenix Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Phoenix Education Telesales Executive Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 18 years Location: Dhaka (Basundhara RA) Salary: Tk. 16000 - 20000 (Monthly) Experience: At least 1 year Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Diploma Bachelor/Honors A Level HSC Experience At least 1 year The applicants should have experience in the following business area(s): Call Center, Educational Technology (Edtech) Startup, Immigration and Education Consultancy Service, IT Enabled Service Additional Requirements Age At least 18 years Responsibilities & Context Role Overview: We are looking for a confident and friendly female Telesales Executive to join our dynamic team. The ideal candidate will speak clearly, listen actively, and promote our educational programs with genuine enthusiasm. This role involves direct phone-based communication with potential students and guardians to guide them through our offerings and help drive enrollment. Key Responsibilities: Must be available to work in the office from 12 PM to 8 PM, six days a week (days and hours may adjust based on the roster) Make outbound calls & receive inbound calls to student leads and prospects from CRM or inquiry lists. Introduce Phoenix services clearly and confidently, aligning offerings with student goals. Convince prospects to enroll using structured sales pitches and personal follow-ups. Maintain call logs, lead conversion records, and feedback notes for reporting. Achieve monthly and weekly enrollment targets set by the Sales Respond promptly to student queries over phone, Messenger, Telegram, and WhatsApp SMS. Assist enrolled students in accessing study materials, mentor support, and schedule updates. Monitor student progress and flag admission issues to coordinators. Help guide students through scholarship and university application documentation. Maintain accurate records of student interactions and support outcomes. Skills & Expertise Sales & Marketing Sales Executive Sales target Customer Service Telecommunication Service Telesales Compensation & Other Benefits Medical allowance,Over time allowance Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 What We Offer Unlimited Tea/Coffee facility Supportive work culture and professional growth opportunities Structured training and mentorship A chance to represent a brand that’s making learning accessible Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Basundhara RA) Company Information Phoenix Education Follow Address: A5, 5th Floor, House 262, 263, Road 1, Block B, (Opposite of Gp House), Bashundhara R/A,"
  },
  {
    "url": "https://bdjobs.com/h/details/1459088?ln=1",
    "company_name": "Lavender Convenience Store Ltd.",
    "job_title": "Sales Assistant / Executive",
    "location": "Dhaka (Gulshan, GULSHAN 1, GULSHAN 2)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Mar 2026",
    "job_description": "Sales Assistant / Executive : Lavender Convenience Store Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Lavender Convenience Store Ltd. Sales Assistant / Executive Application Deadline : 16 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Location: Dhaka (Gulshan, GULSHAN 1... Dhaka (Gulshan, GULSHAN 1, GULSHAN 2) Salary: Tk. 10000 - 14000 (Monthly) Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context Customer Engagement: Greet and assist customers in a friendly manner, providing product knowledge and recommendations to enhance their shopping experience. Sales Performance: Meet and exceed individual and store sales targets through effective selling techniques and up selling of products. Product Knowledge: Stay informed about product offerings, promotions, and inventory levels to answer customer inquiries accurately. Inventory Management: Assist in receiving and stocking merchandise, ensuring shelves are organized and well-presented. Store Maintenance: Maintain a clean, organized, and visually appealing store environment, adhering to merchandising standards. Customer Feedback: Handle customer complaints and feedback professionally, working to resolve issues promptly. Team Collaboration: Work closely with team members to ensure efficient store operations and a positive work environment. Reporting: Assist in maintaining sales records, inventory counts, and other administrative tasks as required. Skills & Expertise Suggested by Sales Sales & Marketing Salesman Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Leave Facilities Workplace Work at office Employment Status Full Time Job Location Dhaka (Gulshan, GULSHAN 1, GULSHAN 2) Job Highlights We are seeking a motivated and enthusiastic Sales Assistant/Executive to join our dynamic team at Lavender Convenience Store Ltd. Read Before Apply Age Requirement: Applicants must be between 18 and 30 years of age. Candidates should be physically fit and capable of performing duties in a retail super shop environment. Applications from candidates outside the specified age range will not be considered. Company Information Lavender Convenience Store Ltd. Follow More jobs from this company Address: AJ Heights, Six(6th) Floor, Cha-72/1/D, Progoti Shoroni, Uttar Badda, Dhaka-1212, Bangladesh. Business: Super Shop Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। "
  },
  {
    "url": "https://bdjobs.com/h/details/1459278?ln=1",
    "company_name": "VIYELLATEX group",
    "job_title": "Executive/Sr. Executive - Sales & Distribution (Merchandiser, Knit Garments)",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Executive/Sr. Executive - Sales & Distribution (Merchandiser, Knit Garments) : VIYELLATEX group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List VIYELLATEX group Executive/Sr. Executive - Sales & Distribution (Merchandiser, Knit Garments) Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 5 years of experience in relevant field. Strong knowledge of knit garments production process, fabric, trims, accessories, and garment construction. Practical experience in product costing, consumption, and price negotiation with buyers and suppliers. Must have good understanding of order follow-up from development to shipment. Ability to handle buyer communications with professionalism and accuracy. Fluency in English (both written and spoken) will be considered an advantage. Responsibilities & Context Managing sales activities and distribution operations. Support in tracking sales orders and ensuring timely and accurate delivery to customers. Help monitor and maintain product inventories to meet customer demand without overstocking or understocking. Assist in preparing sales reports and updates for management. Assist in the creation and maintenance of product displays, ensuring that they are visually appealing and aligned with brand standards. Support the merchandising team in planning product assortments and ensuring proper product placement for maximum sales impact. Help in the preparation of product catalogs, price lists, and promotional materials. Maintain an understanding of market trends and customer preferences to support product recommendations. Respond to customer queries, and provide support in resolving issues related to orders or deliveries. Skills & Expertise Buyer Compliance Management Buyer Handling Costing Merchandising FLUENCY IN ENGLISH LANGUAGE Knit garments Knitwear Merchandising Merchandising Merchandising and Marketing Product Costing and budgeting Sales & Marketing Compensation & Other Benefits As per company policy. Workplace Work at office Employment Status Full Time Job Location Gazipur Company Information VIYELLATEX group Follow Address: Le Meridien Dhaka (Level-06), 79/A, Nikunja Commercial Area, Airport Road, Dhaka-1229 Business: Viyellatex Group is 100% export oriented composite garments industry having its knit and woven garments, spinning, knitting, dyeing, embroidery, accessories, printing & designing. The group has achieved numerous awards for business, social and environmental performance over the years.\nPledge Harbor International School is one of the concern of Viyellatex Group. This is the largest international English"
  },
  {
    "url": "https://bdjobs.com/h/details/1453708?ln=1",
    "company_name": "Family ChoiceFood & Consumer Ltd.",
    "job_title": "Area Sales Manager",
    "location": "Dhaka (Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Area Sales Manager : Family ChoiceFood & Consumer Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Family ChoiceFood & Consumer Ltd. Area Sales Manager Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 20 Location: Dhaka (Uttara) Published: 25 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Strong communication, negotiation, and interpersonal skills Proven sales experience in FMCG or food industry preferred Ability to work independently and as part of a team Willingness to travel within assigned areas Responsibilities & Context Achieve sales targets and drive business growth within the assigned area Develop and implement area sales plans and strategies Build and maintain relationships with distributors, retailers, and key clients Monitor market trends, competitor activities, and customer needs Ensure execution of company sales policies, promotions, and marketing initiatives Prepare regular sales reports and provide feedback to management Skills & Expertise Suggested by Sales & Marketing Sales target Customer Service Compensation & Other Benefits Competitive salary with performance-based incentives Career growth opportunities Other benefits as per company policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara) Read Before Apply Interested candidates are requested to apply through bdjobs.com within 4 days of this advertisement. Only shortlisted candidates will be contacted. Company Information Family ChoiceFood & Consumer Ltd. Follow More jobs from this company Address: House-31, Road-29, Sector-7, Level-4, Uttara Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course "
  },
  {
    "url": "https://bdjobs.com/h/details/1459291?ln=1",
    "company_name": "Eastern Bank PLC",
    "job_title": "Future Leader Program 2026 (Towards Tomorrow Leadership)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Future Leader Program 2026 (Towards Tomorrow Leadership) : Eastern Bank PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Eastern Bank PLC Future Leader Program 2026 (Towards Tomorrow Leadership) Application Deadline : 25 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Your Approach and Skillset We seek individuals with ambition, intellectual curiosity, and the drive to excel as top-tier banking professionals. The ideal candidate must demonstrate: A growth mindset and the confidence to express ideas with clarity and conviction Strong analytical and problem-solving capabilities Excellent interpersonal and communication skills Emotional intelligence and collaborative leadership potential The resilience and adaptability required in a fast-evolving financial environment Above all, we value individuals who aspire not only to build successful careers, but also to contribute meaningfully to the institution they represent. Responsibilities & Context Eastern Bank PLC (EBL), one of Bangladesh's leading financial institutions, continues to set industry benchmarks in innovation, customer excellence, and sustainable growth. At EBL, we firmly believe that our people are our greatest asset. For decades, we have cultivated exceptional talent-professionals who today are shaping the future of banking in Bangladesh and beyond. Our Future Leader Program 2026 is a flagship initiative designed to identify and develop high-potential young graduates into impactful banking professionals and future decision-makers. This immersive program combines structured learning, cross-functional rotations, real-world banking exposure, strategic project assignments, and personalized leadership development. Participants will gain hands-on experience within a dynamic, world-class work environment that fosters innovation, collaboration, and continuous growth. Through this journey, EBL aims to build a strong leadership pipeline-professionals equipped not only with technical excellence but also with the strategic mindset required to lead in an evolving financial landscape. Your Commitment At EBL, we believe future leaders build future institutions. We are committed to investing in your growth-and we expect a shared commitment in return. Selected candidates will sign a Surety Bond to serve the Bank for a minimum of three (03) years, reflecting a mutual dedication to sustained professional and organizational success. Skills & Expertise Suggested by Analytical Skill Problem Solving Interpersonal Skill Compensation & Other Benefits Your Reward Successful candidates will embark on a transformative development journey enriched with comprehensive learning programs and rotational assignments across key busine"
  },
  {
    "url": "https://bdjobs.com/h/details/1458245?ln=1",
    "company_name": "OSHS Global Education & Migration",
    "job_title": "Student Counsellor",
    "location": "Dhaka (Banani)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Student Counsellor : OSHS Global Education & Migration Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List OSHS Global Education & Migration Student Counsellor Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Location: Dhaka (Banani) Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Must have knowledge of Australian universities and their entry requirements. Who We’re Looking For: 1–3 years of proven experience in student counseling, particularly with Australian applications. In-depth knowledge of Australian education systems, course options, visa requirements, and GS guidelines. Excellent communication and interpersonal skills. Strong organizational skills with the ability to handle multiple files at once. Proficiency in MS Office, CRM systems, and basic online platforms. Qualifications: Experience with Australian applications is a must. Fluency in English (spoken and written) is essential. Experience with other destinations (e.g., UK, Canada, USA) is an advantage. Responsibilities & Context Key Responsibilities: Provide personalized counseling to students, recommending Australian universities, courses, and locations based on their academic profile, career goals, and budget. Assess student eligibility and guide them through meeting GS (Genuine Student) requirements, including academic progression, study purpose, and financial capacity. Guide students through the entire application and visa process for studying in Australia. Prepare, review, and submit university applications, supporting documents, and visa files accurately. Stay updated with the latest information on Australian universities, admission criteria, scholarships, and visa policies. Build and maintain strong relationships with students, parents, and education providers. Maintain accurate student records and manage queries through email, phone, and in-person meetings. Participate in education fairs, seminars, and marketing activities to promote OSHS Global’s services. Skills & Expertise Australia Visa Process Communication in English Education Consultant Education Counseling Student File Processing Student Visa Processing Study Australia Suggested by Student Counseling Compensation & Other Benefits Salary as per industry standards performance-based incentives after probationary period Career growth opportunities and professional training Friendly, supportive work environment Exposure to global education partner Workplace Work at office Employment Status Full Time Job Location Dhaka (Banani) Company Information OSHS Global Education & Migration Follow More jobs from this company Address: 41, Road -7 Block - F Banani -1213 ( beside Banani Thana) 1st Floor, Dha"
  },
  {
    "url": "https://bdjobs.com/h/details/1454714?ln=1",
    "company_name": "US-Bangla Assets Ltd.",
    "job_title": "Executive - Front Desk",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Executive - Front Desk : US-Bangla Assets Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List US-Bangla Assets Ltd. Executive - Front Desk Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Published: 28 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Good communication skills in English and Bangla Proficient in MS Office and email communication Presentable, well-groomed, and customer-focused Organized, responsible, and professional attitude Responsibilities & Context Manage front desk/reception and handle visitors professionally. Greet, welcome, direct visitors/clients/vendors and announce them to concerned personnel. Answer, screen, and forward phone calls and inquiries. Receive and route queries to relevant departments. Schedule appointments and assist in meeting/training room arrangements. Maintain visitor logs, access control, and front-desk security. Receive, sort, and distribute mails, couriers, and deliveries. Maintain front-desk records, databases, and inventory. Ensure reception area cleanliness and professional appearance. Provide basic administrative support as required. Perform any other duties assigned by management. Skills & Expertise Suggested by Front Desk Reception Compensation & Other Benefits Medical allowance,Mobile bill,Weekly 2 holidays Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information US-Bangla Assets Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now "
  },
  {
    "url": "https://bdjobs.com/h/details/1459376?ln=1",
    "company_name": "National Development Engineers Ltd. (NDE)",
    "job_title": "Deputy Project Manager (Bridge Project)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Deputy Project Manager (Bridge Project) : National Development Engineers Ltd. (NDE) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List National Development Engineers Ltd. (NDE) Deputy Project Manager (Bridge Project) Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 54 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 54 years Must have 12 years of experience in bridge project Responsibilities & Context Assist the project manager (PM) in overall project management activities. Ensure construction is carried out in accordance with approved drawings, designs,and technical specifications Review and implement construction methodologies and method statements Monitor construction schedules and work programs Support the PM in variation orders, extra items, and claims management Coordinate among client (LGED), Consultant, and Contractor Provide necessary technical input and recommendations to support management decisions Compensation & Other Benefits Tour allowance,Mobile bill Salary Review: Yearly Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Job Highlights Must have 15 Yrs of experience in bridge project Must have the ability to manage clients (LGED), consultants, and contractors. Company Information National Development Engineers Ltd. (NDE) Follow More jobs from this company Address: NDE House, House # 22, Road # 04, Block # C, Banani, Dhaka-1213\nEmail: career@ndebd.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor cert"
  },
  {
    "url": "https://bdjobs.com/h/details/1459375?ln=1",
    "company_name": "Aalok Healthcare & Hospital",
    "job_title": "Medical Officer (Suitable Dept)",
    "location": "Dhaka (Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Medical Officer (Suitable Dept) : Aalok Healthcare & Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aalok Healthcare & Hospital Medical Officer (Suitable Dept) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 32 Location: Dhaka (Mirpur) Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Basic Computer Skill Organization Behavior Incident reporting Report analysis Evidential work experience Responsibilities & Context Maintenance of all clinical records, history taking, physical examinations, and legal documentation. Participate training, Continuous Medical Education (CME), and clinical audits. Adhere strictly policies, including IPC and patient safety standards. Skills & Expertise Patient Assessment History Discharge planning Team Management and leadership communication and interpersonal skill. Hospital management Hospital Administration Observation and Diagnosis Compensation & Other Benefits Provident fund Salary Review: Yearly Festival Bonus: 2 Other as per Hospital Policy. Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur) Job Highlights Medical Officer Weekly 48 Hours duty, Shifting Roster wise for all MO position. As MO Duty as Hospital policy Any assign task by Management as Hospital policy. Read Before Apply Ready to do shifting duty. Weekly 48 Hours duty. Report to Medical Coordinator. Abide by Hospital policy as Management instruction. After interview discussion will confirm duty Hospital as we have General, Mother & Child Care Hospital. Report to Advisor, Hospital Director. hr.aalok@gmail.com Company Information Aalok Healthcare & Hospital Follow Address: Corporate Office: House# 3, Road # 4, Block # A, Section-06, Mirpur, Dhaka-1216 Website: https://www.aalokhealthcare.com/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is innacurate.” Back to Top ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000"
  },
  {
    "url": "https://bdjobs.com/h/details/1459272?ln=1",
    "company_name": "Bardown Sports Inc",
    "job_title": "Shopify Manager / UI/UX Designer",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Shopify Manager / UI/UX Designer : Bardown Sports Inc Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bardown Sports Inc Shopify Manager / UI/UX Designer Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Tk. 60000 - 80000 (Monthly) Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum of 5 years of hands-on experience managing Shopify stores and delivering UI/UX design solutions for e-commerce platforms. Advanced proficiency in design tools such as Figma, Adobe XD, or equivalent platforms. Working knowledge of HTML, CSS, and Shopify Liquid (JavaScript is considered an asset). Strong understanding of Conversion Rate Optimization (CRO) principles and e-commerce best practices. Exceptional attention to detail with strong analytical and problem-solving capabilities. Demonstrated ability to work independently and effectively in a remote environment. Excellent English communication skills, with the ability to interact confidently and professionally with native English speakers. Must possess a high-performance personal PC or laptop (equipment will not be provided by the organization). Reliable high-speed internet connection with dedicated power and internet backup solutions. Access to a quiet, professional, and distraction-free remote work setup suitable for meetings and client communication. Responsibilities & Context Workplace: Work from Home Work Schedule: 8:00 PM-4:30 AM (Night Shift) ABOUT US Bardown Sports Inc. is headquartered in Oakville, Ontario, Canada. We have rapidly grown and established a strong presence in the hockey apparel market by offering high-quality products at fair prices. What truly sets us apart is our community: over 100 NHL Brand Ambassadors choose to wear and purchase our products organically-without giveaways or sponsorship. This authentic approach is rare in today's apparel industry and reflects the trust and value we've built within the hockey community. POSITION OVERVIEW The Shopify Manager / UI/UX Designer is responsible for managing, optimizing, and enhancing our Shopify e-commerce platform to ensure seamless, engaging, and conversion-focused customer experience. This role combines Shopify store management with UI/UX design expertise, working closely with internal teams to support growth, performance optimization, and brand consistency. The ideal candidate is creative, analytical, detail-oriented, and comfortable working in a fast-paced, remote environment. Shopify Store Management Manage day-to-day operations of the Shopify store, including products, collections, pricing, content, and navigation Customize Shopify themes and layouts to meet brand and business needs Manage Shopify a"
  },
  {
    "url": "https://bdjobs.com/h/details/1459343?ln=1",
    "company_name": "Intellier Limited",
    "job_title": "Call Center Representative",
    "location": "Dhaka (Kawran Bazar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Call Center Representative : Intellier Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Intellier Limited Call Center Representative Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Location: Dhaka (Kawran Bazar) Salary: Tk. 10000 - 12000 (Monthly) Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Outbound and Inbound Calls: Conduct outbound and inbound calls to prospective customers to present our products/services and explain their benefits. Effectively communicate product features, pricing, and promotions to potential clients. Qualify leads and schedule appointments for the sales team where necessary. Customer Engagement: Establish and maintain strong relationships with clients to build trust and loyalty. Address customer inquiries, provide information, and resolve concerns or issues in a timely manner. Sales Targets: Meet and exceed Daily, weekly and monthly sales targets.Track and report sales performance using CRM tools or other designated systems. Product Knowledge: Stay informed about the features and benefits of the products/services offered. Continuously update knowledge of product updates. Documentation: Maintain accurate records of all interactions with clients in the CRM system. Prepare and submit regular reports on sales activities and outcomes. Skills & Expertise Call Center Compensation & Other Benefits Lunch Facilities: Partially Subsidize Incentives on Sales Target Achievement Workplace Work at office Employment Status Contractual Job Location Dhaka (Kawran Bazar) Job Highlights Education: High school diploma / Graduate degreeJob Location: Karwan bazar, Dhaka Job Nature: Full-Time (Contractual) Office Hours: 10:00 AM-07:00 PM or 12:00 PM-09:00 PM (roaster based) Working Day: 06 days weekly (roaster-based holiday) Company Information Intellier Limited Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate "
  },
  {
    "url": "https://bdjobs.com/h/details/1459213?ln=1",
    "company_name": "Mukti Foundation,Tala,Satkhira",
    "job_title": "Monitoring and Evaluation (M&E) Officer (Male/Female)",
    "location": "Satkhira",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Monitoring and Evaluation (M&E) Officer (Male/Female) : Mukti Foundation,Tala,Satkhira Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mukti Foundation,Tala,Satkhira Monitoring and Evaluation (M&E) Officer (Male/Female) Application Deadline : 18 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Satkhira Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experience: Previous minimum five (5) years of experience in monitoring and evaluation, ideally in an NGO setting. Research Expertise: Demonstrated knowledge of design and analysis of qualitative and quantitative research methods required. Technical Knowledge: Proficiency in data collection tools (e.g., Kobo Toolbox) and data analysis software (e.g., Excel, SPSS, Stata). Communication: Excellent verbal and written communication skills in English. Field Work: Willingness to travel frequently to project sites. Age Limit: Age will not be crossed over 40 years. Typical Qualifications & Requirements Strong understanding of PCM (Project Cycle Management) and log frames. Ability to work independently and manage multiple tasks. Commitment to development and humanitarian principles and confidentiality. Strong experience in conducting research studies including the entire evaluation cycle, from design and formulation to implementation, analysis and presentation of results and recommendations. Must be results-focused and able to work under pressure and tight deadlines. Excellent interpersonal skills and the ability to work well within a multi-cultural team environment. Strong analytical skills. Technical knowledge and experience in implementation of gender and disability sensitive approaches is a plus. Knowledge and experience in implementing health, WASH, food security & nutrition or social protection programs may have added advantages. Responsibilities & Context Project Name: Strengthening resilience and improving living conditions of vulnerable communities in Kurigram and Satkhira, Bangladesh Commissioning Organizations: Mukti Foundation (MF) and Malteser International (MI) Job Context Mukti Foundation, an NGO, is inviting applications from qualified candidates for the position of Monitoring and Evaluation (M&E) Officer for “Strengthening resilience and improving living conditions of vulnerable communities in Kurigram and Satkhira, Bangladesh” project which has been implementing in the Southern parts (Tala Upazila, Satkhira) of Bangladesh which is being funded by BMZ-PT, ADH and Malteser International, Germany. The duration of the project is from 1st February 2026 to 31st December, 2029. Purpose of the Position: The M&E (Monitoring and Evaluation) Officer will be responsible for designing, implementing and managing systems to track project progress, collecting quality field data, and ensure accountabi"
  },
  {
    "url": "https://bdjobs.com/h/details/1459314?ln=1",
    "company_name": "Gildan-G.A.B. Limited",
    "job_title": "Application Developer (Microsoft Dynamics)",
    "location": "Dhaka (GULSHAN 2)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Application Developer (Microsoft Dynamics) : Gildan-G.A.B. Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Gildan-G.A.B. Limited Application Developer (Microsoft Dynamics) Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Location: Dhaka (GULSHAN 2) Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Programming: Strong proficiency in X++, C#, .NET, and SQL Server. “Dynamics 365 Business Central Developer“ or equivalent is a plus. Functional Knowledge: Deep understanding of ERP logic within. Tools: Experience with Azure DevOps, and Power Platform (Power BI/Power Apps) is highly preferred. Stakeholder Management: Ability to communicate technical concepts to non technical business leaders effectively. Problem Solving: A proactive approach to identifying system bottlenecks and proposing innovative solutions. Adaptability: Comfortable working in an agile environment with shifting priorities. Responsibilities & Context As an Application Developer (MS Dynamics), you will be responsible for the design, development, and maintenance of our ERP ecosystem. You will serve as the technical bridge between business requirements and system functionality, ensuring that the system modules are optimized to support global operations. A key part of this role involves Stakeholder Management, collaborating directly with department heads and end users to translate complex business needs into scalable technical solutions. Technical Development: Design, code, and test customizations, extensions, and integrations within the MS Dynamics environment (X++, C#, .NET). Module Enhancement: Configure and customize workflows for Finance, Manufacturing, and Sales & Distribution to improve operational efficiency. System Integration: Manage data migrations and develop integrations between MS Dynamics and third party applications or legacy systems. Stakeholder Collaboration: Facilitate discovery sessions with business stakeholders to gather requirements and provide technical feasibility assessments. Support & Maintenance: Perform root-cause analysis for system issues, provide Tier 3 technical support, and oversee regular system updates/patches. Documentation: Maintain comprehensive technical documentation, including functional design documents and technical design documents. Skills & Expertise .Net ERP Good English communication skills (verbal and Written) Microsoft Dynamics Microsoft Power BI MS Power Apps MS SQL Server. Compensation & Other Benefits Provident fund,Mobile bill Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Transport: Pick & Drop (Depending on availability) Weekend: Saturday and Sunday Office Hours: 8 AM "
  },
  {
    "url": "https://bdjobs.com/h/details/1459361?ln=1",
    "company_name": "M & J Group",
    "job_title": "Executive-II / I (RQS) - Quality - Genesis Fashions Ltd. | Mandatory SIS Certificate (C&A)",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Executive-II / I (RQS) - Quality - Genesis Fashions Ltd. | Mandatory SIS Certificate (C&A) : M & J Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List M & J Group Executive-II / I (RQS) - Quality - Genesis Fashions Ltd. | Mandatory SIS Certificate (C&A) Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 26 to 35 years Location: Gazipur Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 35 years Must have experience as a C&A-certified SIS inspector. Must have experience of working on Denim bottom, preferably with C&A buyer. Fabric knowledge, technical knowledge (sewing, cutting, printing, embroidery) Knowledge of finishing process. Quality Management. Reporting skill, computer skill. Must be fluent at English (Reading, writing and speaking). Responsibilities & Context About the Company: M&J Group entered into manufacturing activities in 1963 by establishing a flour milling company. The business horizon gets expanded in 1989 when the garment manufacturing factory was opened. Now with its 8 sister concerns, M&J Group is a leading manufacturer in Bangladesh. The group is producing a wide range of top-quality denim bottoms including some non-denim products. M&J Group aspires to be the leading supplier in the global fashion business by offering the best expertise and knowledge in producing Ready Made Garments. Job Responsibilities: Arrange the proto/red tag sample and coordinate the risk assessment meeting with the technical team. Review the size set, conduct the PP meeting, and prepare all tasks for the PP meeting. Follow-up and monitor buyer quality requirements in cutting, sewing, finishing, and washing garments. Follow-up and monitor buyer sample requirements, ensure sample quality, and ensure on-time delivery of all samples. Follow up on the buyer SOP and internal quality procedures at the workstation. Perform section-wise quality inspections to keep DHU within the stipulated parameters. Communicate buyer quality standards to all concerned sections and personnel. All updated information is collected from the PLM and GIN sites and dispatched to the production floor. Perform inline, pre-final, and final inspections based on the C&A inspection SOP. Ensure timely approvals from buyer representatives. Independently work with the buying representative during the factory visit. Communicate and appraise buying representatives on all QA activities. Good knowledge of C&A and all SOPs (QMS, PP meeting, mold prevention, Lycra breakage SOP, Delivery Accuracy, SQM, Inline, Defect Zoning and Classification, Safety, SIS, and Final Inspection SOP) Having good command on C&A web browsing (GIN site, PLM, Pivot88, and IAA) The candidate mus"
  },
  {
    "url": "https://bdjobs.com/h/details/1459350?ln=1",
    "company_name": "Esquire Group",
    "job_title": "Area Sales Manager (ASM) - Paint Industry",
    "location": "Chattogram, Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Area Sales Manager (ASM) - Paint Industry : Esquire Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Group Area Sales Manager (ASM) - Paint Industry Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Chattogram, Dhaka Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Develop and execute effective sales strategies and achieve sales targets. Build and maintain strong relationships with key clients and stakeholders to ensure long-term business partnerships. Monitor competitor activity and suggest proactive strategies to management. Maintain a deep understanding of our product offerings and communicate their benefits to clients effectively. Prepare and deliver compelling sales presentations and proposals to potential clients. Track and report on sales performance, providing regular updates to senior management. Gather and relay customer feedback to inform product improvements and business strategies. Maintain relationship with active and non-active dealers for potential sales and marketing. Skills & Expertise Corporate Marketing Market Research Marketing Sales & Marketing Workplace Work at office Employment Status Full Time Job Location Chattogram, Dhaka Company Information Esquire Group Follow Address: Esquire Tower, 21, Shaheed Tajuddin Ahmed Sarani, Tejgaon, Dhaka-1208. Business: Textile, Electronics, Plastics, Paints Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management"
  },
  {
    "url": "https://bdjobs.com/h/details/1459296?ln=1",
    "company_name": "Esquire Group",
    "job_title": "Executive , Sales Admin",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Executive , Sales Admin : Esquire Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Group Executive , Sales Admin Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Previous experience in sales administration or office administration (preferred). Good communication skills (written and verbal). Proficiency in MS Word, Excel, and email communication. Strong organisational and time-management skills. Ability to work under pressure and meet deadlines. Attention to detail and accuracy. Responsibilities & Context Handle day-to-day sales administration activities, including order processing, coordination, and documentation. Maintain accurate sales records, customer databases, and documentation. Coordinate with sales executives, accounts, and logistics teams. Prepare and generate MIS reports from ERP software as required by management. Prepare daily, weekly, and monthly sales reports as per requirement. Handle field force sales team, customer inquiries and provide basic product information. Support sales promotions and marketing activities. Assist in forecasting and tracking sales performance. Ensure accuracy, timeliness, and proper filing of all sales-related documents and reports. Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Esquire Group Follow Address: Esquire Tower, 21, Shaheed Tajuddin Ahmed Sarani, Tejgaon, Dhaka-1208. Business: Textile, Electronics, Plastics, Paints Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001"
  },
  {
    "url": "https://bdjobs.com/h/details/1457930?ln=1",
    "company_name": "power Engineering",
    "job_title": "Marketing Executive - Lift Marketing",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Marketing Executive - Lift Marketing : power Engineering Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List power Engineering Marketing Executive - Lift Marketing Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 22 to 46 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 46 years Responsibilities & Context নতুন লিফট প্রজেক্ট ও ক্লায়েন্ট সংগ্রহ করা বিল্ডিং ও কনস্ট্রাকশন সাইট ভিজিট করা ডেভেলপার, কন্ট্রাক্টর, আর্কিটেক্ট ও বিল্ডিং মালিকদের সাথে নিয়মিত যোগাযোগ রাখা লিফট সেলস, ইনস্টলেশন ও সার্ভিস সম্পর্কিত তথ্য ক্লায়েন্টকে প্রদান করা কোটেশন, ফলোআপ ও ডিল ক্লোজিং এ সহযোগিতা করা কোম্পানির মার্কেটিং টার্গেট পূরণে সক্রিয়ভাবে কাজ করা গ্রাহকদের প্রতি সদাচরণ, সহানুভূতিশীল ও পেশাদার মনোভাব বজায় রাখা গ্রাহকের জিজ্ঞাসার দ্রুত ও কার্যকর জবাব প্রদান ভালোভাবে মনোযোগ দিয়ে গ্রাহকের কথা শোনা টেলিফোনে দক্ষতা থাকা (বিশেষ করে জটিল বা মাল্টি-লাইন ফোন সিস্টেমে) গ্রাহকের প্রয়োজন বুঝে সমস্যা চিহ্নিত করা এবং যথাযথ সমাধান প্রদান চমৎকার যোগাযোগ দক্ষতা ও শ্রবণ দক্ষতা থাকা আকর্ষণীয় কণ্ঠস্বর থাকা অবশ্যই পরিশ্রমী হতে হবে (যারা কঠোর পরিশ্রমে অভ্যস্ত নন, তারা অনুগ্রহ করে আবেদন করবেন না) Skills & Expertise Good communication skills in both English and Bangla Good comunication skill Presentation skill Compensation & Other Benefits T/A,Mobile bill Festival Bonus: 2 🚲 কোম্পানির পক্ষ থেকে বাইক প্রদান করা হবে 💰 অভিজ্ঞতা অনুযায়ী আকর্ষণীয় বেতন 📈 সেলস কমিশন ও পারফরম্যান্স বোনাস 📊 দক্ষতার ভিত্তিতে স্থায়ী চাকরি ও পদোন্নতির সুযোগ যোগাযোগের জন্য (অফিসিয়াল): প্রয়োজনে নিম্নোক্ত নম্বরসমূহে যোগাযোগ করার জন্য অনুরোধ করা যাচ্ছে— 📞 সিইও: ০১৮৪৩-৪৩৮৮১০ 📞 এইচ আর : ০১৯৪৭-০০২৯৯৯ আপনার প্রয়োজনীয় যেকোনো তথ্য বা সহায়তার জন্য উল্লিখিত নম্বরগুলোতে যোগাযোগ করতে পারেন। Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Job Highlights লিফট / এলিভেটর মার্কেটিংয়ে ন্যূনতম ১ বছর বাস্তব অভিজ্ঞতা অফিস থেকে প্রাইভেট কার / মোটরবাইক প্রদান করা হবে (অপশনাল) ঢাকার বিভিন্ন এলাকা ও বিল্ডিং সেক্টর সম্পর্কে ধারণা থাকতে হবে যোগাযোগ ও নেগোশিয়েশন স্কিল ভালো হতে হবে Company Information power Engineering Follow Address: House# 30/32, Road# 10, Sector# 15/B, (Dubai Tower) Uttara, Dhaka-1230 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01"
  },
  {
    "url": "https://bdjobs.com/h/details/1453712?ln=1",
    "company_name": "Family ChoiceFood & Consumer Ltd.",
    "job_title": "Sales Manager",
    "location": "Dhaka (Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Sales Manager : Family ChoiceFood & Consumer Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Family ChoiceFood & Consumer Ltd. Sales Manager Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Location: Dhaka (Uttara) Published: 25 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements 7–10 years of proven experience in sales management, preferably in FMCG or food manufacturing. Strong leadership, negotiation, and communication skills. Ability to work under pressure and meet sales targets. Responsibilities & Context Develop and implement effective sales strategies to achieve company targets. Lead, manage, and motivate the sales team to improve performance. Expand market presence, manage key accounts, and build strong customer relationships. Analyze sales data, prepare reports, and forecast sales trends. Coordinate with marketing, distribution, and production teams to ensure smooth operations. Skills & Expertise Suggested by Marketing Relationship Marketing Sales & Marketing Compensation & Other Benefits Attractive salary package with performance-based incentives. Career growth opportunities in a reputed organization. Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara) Read Before Apply Interested candidates are requested to apply through bdjobs.com within 4 days of this advertisement. Only shortlisted candidates will be contacted. Company Information Family ChoiceFood & Consumer Ltd. Follow More jobs from this company Address: House-31, Road-29, Sector-7, Level-4, Uttara Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das "
  }
]