[
  {
    "url": "https://bdjobs.com/h/details/1458626?ln=1",
    "company_name": "ActionAid Bangladesh",
    "job_title": "Programme Officer - Community Level",
    "location": "Cox`s Bazar (Pekua), Satkhira (Shyamnagar)",
    "salary": null,
    "experience": "2 to 3 years",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Programme Officer - Community Level : ActionAid Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ActionAid Bangladesh Programme Officer - Community Level Application Deadline : 18 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Cox`s Bazar (Pekua), Satk... Cox`s Bazar (Pekua), Satkhira (Shyamnagar) Salary: Tk. 32148 (Monthly) Experience: 2 to 3 years Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma in Agriculture Higher Secondary Experience 2 to 3 years Additional Requirements At least 2--3 years of relevant field experience Technical Skills Working experience on diversified community and leading the community. Knowledge of climate-resilient agriculture and DRR Experience facilitating women’s and youth groups Working experience with Union Parishad Strong communication, facilitation, and problem-solving skills with respect to understanding of HRBA, gender equality, and social inclusion Basic computer skills Responsibilities & Context Project Name: Civil Society–Led Transformation Toward Gender-Responsive Climate Resilience in Coastal Bangladesh and Vietnam Unit/Priority Name : Resilience and Climate Justice Types of contract\t: Contractual, up to December 2028 Job Summary: The Programme Officer will assist Project Coordinator-Field in planning, implementing, and monitoring community-based activities that enhance civil society participation in gender-responsive climate adaptation and disaster risk reduction. The role emphasizes strengthening grassroots CSOs, women, and youth to engage effectively in democratic processes, advocate for an inclusive climate and DRR actions, and support locally driven resilience. This position also helps expand civic space, encourages stakeholder collaboration, and ensures accountable, participatory, and locally informed program delivery. Key responsibilities include (not limited to) Community Mobilization and CSO Support (35%) Organize and facilitate regular meetings of women’s and youth groups, ensuring active participation through follow-up and household visits. Support the capacity building initiatives for CSOs and community groups Support CSOs and community groups to form federation, improve governance, transparency, and accountability. Encourage reflection and learning through regular group discussions. Climate Adaptation and DRR Support (25%) Facilitate CSO and community group to prepare Local Adaptation Plan of Action (LAPA) Work with UDMC to activate the UDMC and facilitate their CRA-RRAP development/revision process Assist in implementing Climate-Resilient Sustainable Agriculture (CRSA) and DRR-related activities at the community level. Promote local knowledge, gender equality, and social inclusion in climate and resilience actions. Support women and youth"
  },
  {
    "url": "https://bdjobs.com/h/details/1450603?ln=1",
    "company_name": "Rapid Clipping Path",
    "job_title": "Digital Marketing And Branding Executive",
    "location": "Dhaka (Shewrapara)",
    "salary": "Negotiable",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Digital Marketing And Branding Executive : Rapid Clipping Path Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rapid Clipping Path Digital Marketing And Branding Executive Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 20 to 30 years Location: Dhaka (Shewrapara) Salary: Negotiable Experience: 1 to 3 years Published: 22 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Advertising Technology (AdTech) Startup, Software Company Additional Requirements Age 20 to 30 years Responsibilities & Context Plan and execute digital marketing campaigns across LinkedIn, Google, Instagram, and Facebook. Manage and optimize Google Ads, Facebook Ads and LinkedIn marketing campaigns Handle LinkedIn page management , B2B outreach, and lead generation Conduct basic SEO activities (on-page SEO and keyword research) Assist with content marketing, email marketing, and promotional campaigns Monitor campaign performance and prepare weekly/monthly reports Coordinate with the design team to showcase company work and portfolio Research competitors and market trends in the image editing & outsourcing industry Stay updated with the latest digital marketing tools and trends Skills & Expertise B2B and B2C sales and marketing B2B Marketing Content Marketing Corporate Sales (B2B Business) Sales & Marketing Workplace Work at office Employment Status Full Time Job Location Dhaka (Shewrapara) Company Information Rapid Clipping Path Follow Address: Rapid Clipping Path is a professional photo editing company providing fast and high-quality image post-production services for e-commerce businesses and brands worldwide. Our skilled team ensures accuracy, consistency, and visually appealing results for every project. Website: https://www.rapidclippingpath.com Business: We specialise in clipping path, background removal, photo retouching, colour correction, and product image editing. Our focus is on delivering precise work, quick turnaround times, and complete client satisfaction. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT "
  },
  {
    "url": "https://bdjobs.com/h/details/1458950?ln=1",
    "company_name": "Meihan buying office",
    "job_title": "Quality Controller",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Quality Controller : Meihan buying office Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Meihan buying office Quality Controller Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context Job Overview: We are seeking a highly motivated and ethical Garment Quality Controller (QC) with deep knowledge of garment production processes. The ideal candidate will have hands-on experience in identifying quality issues, ensuring production consistency, and communicating effectively between the factory floor and the buying office. This role demands technical know-how, independent problem-solving, and a strong drive for excellence. Key Responsibilities: Conduct quality inspections during various stages of production to ensure products meet set standards. Identify, document, and classify garment defects with precision. Independently follow up on production progress and resolve quality issues in real-time. Act as the liaison between the factory and the buying office, ensuring clear, timely, and accurate communication. Analyze technical specifications, patterns, and samples to preempt potential production issues. Evaluate fabric, print, trims, and accessories for quality conformance before and during production. Maintain comprehensive reports (online and offline) on inspections, issues, and resolutions. Ensure production meets delivery schedules without compromising quality. Uphold and advocate ethical standards and honesty in all interactions and operations. Compensation & Other Benefits Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply US based buying office, only looking for QC with buying office experience, well English speaking, located in Dhaka. Company Information Meihan buying office Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Profe"
  },
  {
    "url": "https://bdjobs.com/h/details/1458951?ln=1",
    "company_name": "Runrunty Ltd",
    "job_title": "Waiter / Waitress",
    "location": "Dhaka (Banani)",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Waiter / Waitress : Runrunty Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Runrunty Ltd Waiter / Waitress Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 30 years Location: Dhaka (Banani) Salary: Negotiable Experience: At least 2 years Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 2 years The applicants should have experience in the following business area(s): Restaurant Additional Requirements Age 20 to 30 years Responsibilities & Context Job Vacancy: We are Hiring Waiter/Waitress at Runrunty Japanese Restaurant and Couisine,Dhaka. Responsibilities and Context: Greeting guest and taking orders from customers. Staying attentive to the needs of guest in the dinning area. Ensure compliance with health and safety regulations. Maintain cleanliness and hygiene in the dinning area. Assist in setting up table and restaurant ambiance. Collaborate with chefs and kitchen staff to optimize the menu and service. Assist with marketing and promotional activities. Skills & Expertise cleanliness Guest service Health and Safety Hygiene Maintainance Order taking Restaurant Waiter Suggested by Waiter Hotel waiter Customer Service Compensation & Other Benefits Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Banani) Read Before Apply If you are assuming to join with us please drop your CV in this mail address: runruntyltdbd@gmail.com Apply Procedure Email Your CV Send your CV to the given email runruntyltdbd@gmail.com Company Information Runrunty Ltd Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Cont"
  },
  {
    "url": "https://bdjobs.com/h/details/1458948?ln=1",
    "company_name": "Revolution Technology BD",
    "job_title": "Executive ( MIS & Customer Relationship Management )",
    "location": "Dhaka",
    "salary": null,
    "experience": "At most 2 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Executive ( MIS & Customer Relationship Management ) : Revolution Technology BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Revolution Technology BD Executive ( MIS & Customer Relationship Management ) Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 21 to 28 years Location: Dhaka Salary: Negotiable Experience: At most 2 years Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Computer Science Bachelor of Business Administration (BBA) in Business Studies BRAC University,North South University,American International University Bangladesh,Bangladesh University of Business and Technology,East West University students will get preference Courses on AI, English debate certificate , Customer management course, Online Training for ICT products , Skill test for Speech and type Experience At most 2 years The applicants should have experience in the following business area(s): Group of Companies, IT Enabled Service Freshers are also encouraged to apply. Additional Requirements Age 21 to 28 years Responsibilities & Context #Manage and update customer data in the CRM system. #Track customer interactions (calls, emails, meetings). #Follow up with leads and convert them into customers. #Handle customer complaints and ensure timely resolution. #Analyze customer behavior and prepare reports. #Coordinate with sales and marketing teams for campaigns. #Maintain customer retention and loyalty programs. #Generate daily/weekly/monthly CRM reports. #Ensure data accuracy and database cleanliness. #Collect data from different departments. #Prepare daily, weekly, and monthly MIS reports using internal software. #Maintain databases and ensure data accuracy. #Generate performance dashboards and analytics. #Analyze trends and highlight key business insights. #Coordinate with departments for data requirements. #Maintain  ERP systems for reporting tools. #Support management with data-driven reports Skills & Expertise communication and interpersonal skill. COMPUTER OFFICE MANAGEMENT Customer Relationship Management Fluent in written and spoken Bengali-English. Smart and Dedicated Smart presentation Skill Typing Skill - Bengali and English Compensation & Other Benefits T/A,Tour allowance,Mobile bill,Performance bonus Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 “Female candidates are encouraged to apply.” Financial Benefits will be for getting merit points due to outstanding efforts . Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Will be responsible for managing customer relationships improvement,supporting sales and marketing team through effective CRM system  collecting, analyzing, and managing business data to support decision-making"
  }
]