[
  {
    "url": "https://bdjobs.com/h/details/1433203?ln=0",
    "company_name": "Posted by Anonymous",
    "job_title": "Video Editor",
    "location": "Dhaka (Uttara Sector 15)",
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "25 Nov 2026",
    "job_description": "Video Editor : Posted by Anonymous Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Posted by Anonymous Video Editor Application Deadline : 25 Nov 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Dhaka (Uttara Sector 15) Published: 25 Nov 2025 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context Company name: Travoza Holidays Vacancy: 04 Salary: Negotiable Posted 1. Student Councilor 2. International tour package sales 3. Visa service Key responsibility 1. Counseling students (Student councilor post) 2. Achieve monthly target (Applicable for every position) 3. Visa Counseling, sale and submission Qualifications 1. Bachelor or Running bachelor Student 2. One year Experience 3. Fresher are also encourage to apply Official benefits: 1. Lunch 2. Weekend on Friday 3. Govt. Holidays 4. Festival bonus For more details feel free to knock us Phone: +8801601092997 (Whatsapp) Mail: travozaholidays2025@gmail.com Note: Please drop your CV via WhatsApp or mail we'll contact with you thank you. Office: Metro center point, Uttara-Dhaka Employment Status Full Time Job Location Dhaka (Uttara Sector 15) Company Information Posted by Anonymous Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with "
  },
  {
    "url": "https://bdjobs.com/h/details/1458989?ln=1",
    "company_name": "FSN Solution Limited",
    "job_title": "Network and Infrastructure Consultant",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Network and Infrastructure Consultant : FSN Solution Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List FSN Solution Limited Network and Infrastructure Consultant Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 40 to 70 years Location: Dhaka Salary: Negotiable Experience: At least 5 years Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (Pass) Masters in Information Systems Security (MISS) Master of Information & Communication Technology (MICT) Experience At least 5 years The applicants should have experience in the following business area(s): IT Enabled Service, Software Company Additional Requirements Age 40 to 70 years Experience: 10+ years in core networking, virtualization, and infrastructure management. Technical Skills: Proficiency in NGFWs, endpoint security, VMware, Proxmox, Hyper-V, Linux, Windows Server, and Active Directory. Certifications (Preferred): CCNP/CCIE, VCP, RHCE, MCSE, or equivalent. Strong problem-solving, communication, and multitasking abilities. Soft Skills: Strong communication and problem-solving skills. Effective time management and attention to detail. Team-oriented and adaptable to changes. Responsibilities & Context FSN Solution Limited is a cyber security company committed to delivering cutting-edge solutions to protect our clients from evolving cyber threats. As we expand our operations, we are looking for a few experienced and dynamic cyber security engineers to join our talented team of cybersecurity experts. In this role, you will play a critical role in ensuring that the infrastructure of our clients is protected from sophisticated cyber threats. Job Summary: We are looking for a highly skilled Network and Infrastructure Consultant with over 10 years of experience in core networking, virtualization (VMware, Proxmox, and Hyper-V), Linux and Windows Server management, Active Directory, NGFWs, and endpoint security. The role focuses on designing and managing secure, scalable IT environments tailored to business requirements. Responsibilities: Manage virtualization platforms, including VMware, Proxmox, and Hyper-V. Administer Linux and Windows Servers, including Active Directory and GPOs. Design and manage LAN, WAN, and VPN solutions.Configure and monitor NGFWs (e.g., Palo Alto, Fortinet) and IDS/IPS systems. Implement and maintain endpoint security measures. Virtualization and Systems Management: Maintain server hardware, storage solutions, and networking devices. Perform system backups, disaster recovery, and hardware lifecycle management. Develop and maintain system documentation, network diagrams, and SOPs. Ensure compliance with security and industry standards. Stay abreast of industry trends and emerging threats to enhance our security postu"
  },
  {
    "url": "https://bdjobs.com/h/details/1458982?ln=1",
    "company_name": "One Direction Companies Limited",
    "job_title": "Project Architect",
    "location": "Dhaka (Dhaka Sadar)",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Project Architect : One Direction Companies Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List One Direction Companies Limited Project Architect Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 28 years Location: Dhaka (Dhaka Sadar) Salary: Negotiable Experience: At least 5 years Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Architecture (B.Arch) in Architecture Professional certification or membership in relevant architectural bodies will be considered an advantage. Experience At least 5 years The applicants should have experience in the following business area(s): Architecture Firm, Group of Companies, Hospital, Retail Store, Share Brokerage/ Securities House Additional Requirements Age At least 28 years Proven experience as a lead architect or project architect is mandatory. Strong portfolio demonstrating experience in luxurious residential houses, renowned hotels, commercial buildings, and industrial construction projects. Advanced proficiency in 3ds Max, AutoCAD, SketchUp, and other CAD software. Strong capability in 3D modeling, rendering, and presentation design. In-depth knowledge of modern architectural concepts and interior/exterior design detailing. Solid understanding of construction materials, costing, budgeting, and project scheduling. Excellent leadership, communication, and reporting skills. Ability to coordinate with engineers, contractors, vendors, and regulatory authorities. Willingness to visit and supervise construction sites regularly. Responsibilities & Context We are seeking a highly experienced and visionary Project Architect to lead and oversee architectural design, planning and project execution. The ideal candidate will be responsible for managing end-to-end architectural development, ensuring design excellence, regulatory compliance, timely delivery, and alignment with project specifications. Key Responsibilities Lead the conceptualization, planning, and detailed design of architectural and engineering projects. Prepare, review, and approve architectural drawings for interior and exterior works. Develop high-quality 2D and 3D presentations, design proposals, and project documentation. Coordinate with clients, consultants, stakeholders, and senior management to ensure project alignment. Supervise site activities and ensure construction work complies with approved designs and standards. Monitor project timelines, budgets, and quality benchmarks to ensure on-time project delivery. Guide and mentor junior architects and design team members; conduct design reviews and workshops when necessary. Ensure compliance with building codes, safety regulations, and industry standards. Conduct final inspections and provi"
  },
  {
    "url": "https://bdjobs.com/h/details/1458926?ln=1",
    "company_name": "Unibuzz Ltd",
    "job_title": "Student Advisor",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Student Advisor : Unibuzz Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Unibuzz Ltd Student Advisor Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 20 to 39 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 40000 (Monthly) Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education A Level A Level in Fluent In English Additional Requirements Age 20 to 39 years Note : Working Hours = 04.00 pm to 11.00 pm Weekly = Monday to Friday Responsibilities & Context Main purpose of the job Student Advisor will support setting the student recruitment targets based on acquired knowledge of markets, partnerships, and past trends. The role is crucial in supporting the counselling teams in meeting their recruitment targets. Student Advisor will focus on the development and execution of the Unibuzz student recruitment strategy, targeting appropriate students from key geographies. The role holder will grow awareness, support recruitment and convert students through varied channels, in order to meet annual growth and targets. The role will create and implement a carefully planned programme of conversion activities for prospective students, ensuring they receive a coordinated and timely flow of communication. Duties and Responsibilities · Screening and assessing inbound leads from marketing activity via high-volume phone calls, face-to-face meetings and online webinars. · Meeting and exceeding the company’s KPIs and intake targets by supporting counselling teams. · Ensuring each stage of the student lifecycle is completed whilst meeting customer needs by regular follow ups and thorough analysis of the company CRM. · Breaking down barriers to entry and utilising sales and conversion techniques · Proactively contacting prospective students to drive interest/applications. · Follow up with students who applied to study at UNIBUZZ partner universities by using a range of technology and social media to contact students, in order to ensure a high standard of post-application support. · Providing input into the marketing strategy and utilising multiple channels to generate new leads. · Reporting sales data, creating reports and dashboards in order to analyse UNIBUZZ recruitment efforts. · Deliver regular reports on targets and compose a forecast for the next quarter. · Analysing feedback provided by students and other stakeholders. · Analysing reports and counselling teams’ performance, finding gaps and resolving issues; facilitate the improvements. · Supporting student conversion, across all markets, through the development and delivery of a range of new and existing initiatives. · Undertaking market research and providing administrative support to ensure optimal engagement with priority areas. · Providing strategic advice and support to the Recru"
  }
]