[
  {
    "url": "https://bdjobs.com/h/details/1458942?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1456674?ln=1",
    "company_name": "Ambience Care",
    "job_title": "Sales Coordinator",
    "location": "Dhaka (Mirpur)",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Sales Coordinator : Ambience Care Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ambience Care Sales Coordinator Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 24 to 35 years Location: Dhaka (Mirpur) Salary: Tk. 30000 (Monthly) Experience: At least 2 years Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 2 years The applicants should have experience in the following business area(s): Call Center, Consulting Firms, Direct Selling/Marketing Service Company, Individual/Personal Recruitment, Manpower Recruitment, Market Research Firms, Overseas Companies Freshers are also encouraged to apply. Additional Requirements Age 24 to 35 years Responsibilities & Context Generate client leads through online market research. Reach out to the leads through cold calls. Persuade and negotiate with the potential clients to use our service and thereby close the deal. Look for new business opportunities on vendor clients. Source and place the candidates with the suitable job roles on direct and vendor clients. Build a solid rapport with direct and vendor clients to ensure long-term business with their organizations. Provide on-call support to the Team. Prepare daily and weekly reports, weekly planner, and any other necessary reports as and when required by the senior managers. Skills & Expertise Good English communication skills (verbal and Written) Good Knowledge in MS Office and G Suite Multi tasking ability Overseas Sales Problem solving and decision making Recruitment & Selection Sales & Marketing Selling skills and strategies Telemarketing Telesales Compensation & Other Benefits Weekly 2 holidays Lunch Facilities: Partially Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur) Job Highlights Office timing is from 01:00 PM to 10:30 PM. Must be proficient in English speaking and listening. DO NOT APPLY , if you are not fluent in English or unable to communicate effectively in English. Salary is negotiable. Company Information Ambience Care Follow Address: Ambience Care Limited\r\nRegal Court Business Centre\r\n42-44 High Street\r\nSlough\r\nSL1 1EL\r\nEmail: info@ambiencecare.co.uk Business: Ambience recruitment is one of the leading recruitment companies (based in UK) offering clients both permanent and temporary recruitment services. We work in partnership with our clients by delivering ranges of employment services with adding values on long-term relationship. We are always proactive to understand our clients’ needs and keep our promises clear and easy to do business with. We remain compliant with all current legislation together with membership of the REC (Recruitment and Employment Confedera"
  },
  {
    "url": "https://bdjobs.com/h/details/1458968?ln=1",
    "company_name": "Buying House",
    "job_title": "Merchandiser / Sr. Merchandiser (Knit, Woven & Sweater)",
    "location": "Dhaka (Gulshan)",
    "salary": null,
    "experience": "4 to 8 years",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Merchandiser / Sr. Merchandiser (Knit, Woven & Sweater) : Buying House Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Buying House Merchandiser / Sr. Merchandiser (Knit, Woven & Sweater) Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 25 to 35 years Location: Dhaka (Gulshan) Salary: Negotiable Experience: 4 to 8 years Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience 4 to 8 years The applicants should have experience in the following business area(s): Buying House, Garments, Textile Additional Requirements Age 25 to 35 years Should have product and fabric knowledge of specially Woven and Sweater items. Should be able to prepare costing of specially Woven and Sweater products. Experience in working at Buying House. Supplier sourcing with goods connections. Responsibilities & Context Prepare Costing and price negotiation with buyers and factories. Cross costing of all knit, woven and sweater items. Sourcing right factory for the right product maintaining sustainability, quality and cost. Follow up the entire merchandising process from product development to shipment with the factories. Communicate independently with buyers for pricing, approvals, comments, revisions & order confirmation. Handle L/C, Sales Contract and commercial matters. Prepare daily/weekly/monthly merchandising status reports for management. Maintain strong relationships with suppliers, buyers, and support departments. Skills & Expertise Communication Computer Literacy Factory Sourcing Garments Costing Knit garments Multiple customer order follow up price negotiation Sweater woven Garments Compensation & Other Benefits Festival Bonus: 2 Other benefits as per company policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Gulshan) Read Before Apply Experienced Company Information Buying House Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Registe"
  },
  {
    "url": "https://bdjobs.com/h/details/1458929?ln=1",
    "company_name": "Supremo Media",
    "job_title": "Digital Marketer & English Copywriting",
    "location": "Chattogram",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "Digital Marketer & English Copywriting : Supremo Media Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Supremo Media Digital Marketer & English Copywriting Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At most 30 years Location: Chattogram Salary: Tk. 15000 - 20000 (Monthly) Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age At most 30 years Excellent written and spoken English — strong grammar and vocabulary are essential. Bachelor’s degree in English, Marketing, or related field preferred. Prior experience in copywriting, blogging, or digital marketing is a plus. Comfortable working with WordPress or similar CMS platforms. Basic understanding of SEO and online marketing concepts. Detail-oriented, organized, and able to meet deadlines. Must be based in Bangladesh and able to work remotely. Responsibilities & Context Company Overview: We are a UK-based digital marketing agency managing multiple websites in the health, wellness, and lifestyle industries. Our growing team in Bangladesh supports SEO, content creation, and online directory management for international clients. We’re looking for a Digital Marketing & English Copywriting Executive with excellent English literacy and writing skills to join our remote Bangladesh team. Job Responsibilities: Write and edit high-quality English blog articles and website content. Upload and format content on WordPress and other CMS platforms. Perform data entry and content updates for English-language online directories. Conduct keyword research and basic SEO optimization. Coordinate with UK-based and Bangladesh-based teams for project tasks. Ensure all content is accurate, engaging, and aligns with brand voice. Assist with digital marketing activities, including on-page SEO and content scheduling. Employment Details: Reporting To: UK-based Digital Marketing Manager Team: You’ll join our existing Bangladesh-based marketing team Skills & Expertise Communication in English ENGLSIH FLUENCY IN ENGLISH LANGUAGE Fluent In English Good English communication skills (verbal and Written) Suggested by Blogging Copywriting Digital Marketing Video Marketing Compensation & Other Benefits Competitive salary based on experience Performance-based bonuses Training and growth opportunities in international digital marketing Long-term employment with a UK company Workplace Work from home Employment Status Full Time Job Location Chattogram Job Highlights Remote role with UK-based digital agency. Write English blogs, manage online directories, and assist with SEO. Excellent English literacy required. Join our Bangladesh team and grow your digital marketing career. Company Information Supremo Media Follow Address: Pill Box, 11"
  },
  {
    "url": "https://bdjobs.com/h/details/1458969?ln=1",
    "company_name": "লায়ন্স শিশু হাসপাতাল, সিলেট",
    "job_title": "কনসালটেন্ট",
    "location": "Sylhet (Sylhet Sadar)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "কনসালটেন্ট : লায়ন্স শিশু হাসপাতাল, সিলেট Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List লায়ন্স শিশু হাসপাতাল, সিলেট কনসালটেন্ট Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Sylhet (Sylhet Sadar) Salary: Negotiable Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context লায়ন্স শিশু হাসপাতালে কনসালটেন্ট পদে যোগ্যতা সম্পন্ন, দক্ষ ও অভিজ্ঞ প্রার্থী জরুরী ভিত্তিতে নিয়োগ দেয়া হবে। শিক্ষাগত যোগ্যতা: MBBS, F.C.P.S/M.D/D.C.H অভিজ্ঞতার উল্লেখসহ জীবনবৃত্তান্ত, ২ কপি পাসপোর্ট সাইজ ছবি, শিক্ষাগত যোগ্যতার সনদপত্র ও B.M.D.C- এর রেজিস্ট্রেশন সার্টিফিকেটের কপিসহ আবেদনপত্র নিয়ে আগামী ২৮ ফেব্রুয়ারি ২০২৬ রোজ শনিবার দুপুর ১২ ঘটিকার সময় অত্র হাসপাতালে উপস্থিত হয়ে সাক্ষাতকার প্রদানের জন্য আগ্রহী প্রার্থীদের অনুরোধ জানানো যাচ্ছে। ঠিকানা: লায়ন্স শিশু হাসপাতাল কুমারপাড়া, সিলেট। মোবাইল: ০১৭১৬৪৬৫৫৭৮, ০১৭১২৬৪৫৮৪৭ Workplace Work at office Employment Status Full Time Job Location Sylhet (Sylhet Sadar) Company Information লায়ন্স শিশু হাসপাতাল, সিলেট Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458962?ln=1",
    "company_name": "Hoque Consultancy (Dhaka)",
    "job_title": "UK Student Counsellor / PR Associate.",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "UK Student Counsellor / PR Associate. : Hoque Consultancy (Dhaka) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hoque Consultancy (Dhaka) UK Student Counsellor / PR Associate. Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Age: 18 to 35 years Location: Dhaka (Dhanmondi 27, Kala... Dhaka (Dhanmondi 27, Kalabagan) Salary: Tk. 20000 - 20000 (Monthly) Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Masters Additional Requirements Age 18 to 35 years Responsibilities & Context Hoque consultancy is a leading Education consultancy for International students aspiring to come to the United Kingdom for higher education. Job Location : Kolabagan, Dhanmondi, Dhaka Branch, Bangladesh. Job Requirements : IELTS requirement 6.5+. Candidates with IELTS results and an English background, Bachelor’s and Master's degrees are encouraged to apply. Freshers are encouraged to apply if their capability in English is good. Job Responsibilities: Responsible for assisting students in shaping their careers overseas. Answering calls and explaining the University Course, Tuition Fee, and the company’s services. To initiate the telephonic conversation with potential or existing clients to generate leads. Assisting them in making important decisions about their career path and university. Be available for students daily to address their concerns, and follow up with universities and internal teams to ensure their application process runs smoothly. Play a proactive role in compiling a list of all documents required for application submission. To advise students on university application procedures and assist them in applying for various scholarships and accommodations. Maintaining good relationships and coordinating with Branches / Associates for pending documents and payments. Maintaining accurate ledger and computer records of students counseled and applications sent to the specific country· Filling out the online / paper applications and applying to overseas universities. Assist clients with SOP analysis and enhancements, LOR assistance, resume editing, and financial documentation support. Active participation and contribution during education fairs, university visits, and in-house seminars organized by the company. Media Relations, Content Creation, Social Media Management, Research and Analysis of Marketing, Collaboration Roles, Planning Publicity Strategies, and Campaigns. You have to play a key role in shaping public perception and promoting the organization`s brand. Strong communication skills and a good understanding of the organization’s goals and values are essential for success in the role. Skills & Expertise Suggested by Student Consultancy Air Ticketing and Visa processing. Education Co"
  },
  {
    "url": "https://bdjobs.com/h/details/1458979?ln=1",
    "company_name": "Dream71 Bangladesh Limited (Dhaka)",
    "job_title": "Senior Officer - Accounts And Finance",
    "location": "Dhaka (Basundhara RA)",
    "salary": null,
    "experience": "2 to 5 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Senior Officer - Accounts And Finance : Dream71 Bangladesh Limited (Dhaka) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dream71 Bangladesh Limited (Dhaka) Senior Officer - Accounts And Finance Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (Basundhara RA) Salary: Tk. 25000 - 35000 (Monthly) Experience: 2 to 5 years Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Commerce (Pass) in Accounting Bachelor of Commerce (Pass) in Accounting & Information System Experience 2 to 5 years The applicants should have experience in the following business area(s): Software Company Responsibilities & Context Maintain accurate books of accounts in accounting software (ERP/Tally/QuickBooks, etc.). Prepare monthly, quarterly, and annual financial statements. Ensure compliance with applicable accounting standards and company policies. Monitor accounts receivable aging and follow up for collections. Reconcile customer and vendor ledgers regularly. Ensure compliance with VAT, Income Tax, Withholding Tax, and other statutory requirements. Prepare and submit tax returns and related documentation. Liaise with auditors, tax consultants, and regulatory authorities. Monitor daily cash flow position. Prepare cash flow forecasts. Manage bank reconciliations and fund transfers. Required Qualifications & Skills: Bachelor’s/Master’s in Accounting, Finance, or related field. 2–5 years of relevant experience Strong knowledge of accounting software and MS Excel. Good analytical and reporting skills. Strong communication and coordination ability. Skills & Expertise Accounting Accounts and Finance Cash Flow Management Microsoft Excel MS Excel VAT and Tax Compensation & Other Benefits Mobile bill,Weekly 2 holidays,T/A Salary Review: Yearly Festival Bonus: 2 Excellent office environment Working opportunity to work with foreign clients and government organization Workplace Work at office Employment Status Full Time Job Location Dhaka (Basundhara RA) Read Before Apply Email your cv to the email id career@dream71.com with the subject line “Application for the post of Senior Officer(Accounts and Finance)_Years of Experience Expected Salary“ Company Information Dream71 Bangladesh Limited (Dhaka) Follow Address: Hyatt Rose Park (Level-5), House 16, Block A, Basundhara Main Road, Bashundhara R/A, Dhaka-1229, Bangladesh Business: Company Short Profile: Dream71 Bangladesh Ltd is now exporting software to 12+ countries including Japan, Netherlands, UAE, Cameroon, East Timor, Nigeria, Mozambique and others. In Bangladesh, it`s working with A2i, ICT Division, Biman Bangladesh, WASA, Ministry of Foreign Affairs, PWD, Health Engineering Department, Ministry of Commerce, BSCIC, UNDP(Bangladesh, Turkey and East Timor) and other organi"
  },
  {
    "url": "https://bdjobs.com/h/details/1458975?ln=1",
    "company_name": "alliance builders ltd",
    "job_title": "PS to MD cum Front Desk",
    "location": "Dhaka (Mirpur)",
    "salary": null,
    "experience": "3 to 7 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "PS to MD cum Front Desk : alliance builders ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List alliance builders ltd PS to MD cum Front Desk Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: 24 to 40 years Location: Dhaka (Mirpur) Salary: Negotiable Experience: 3 to 7 years Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience 3 to 7 years The applicants should have experience in the following business area(s): IT Enabled Service, Real Estate, Developer, Agro based Startup Additional Requirements Age 24 to 40 years Responsibilities & Context Greet and welcome visitors with a friendly and professional demeanor. Manage phone calls, emails, and inquiries, directing them to the appropriate departments. Handle check-ins, check-outs, and appointment scheduling efficiently. Maintain a clean and organized reception area. Assist with administrative tasks, including filing, data entry, and handling mail. Provide information and assistance to guests or clients as needed. Ensure security by following procedures and monitoring access to the premises. Support other departments with tasks as required. Communicate with T&T person and Ensure connectivity Managing schedules and appointments of the Managing Director and updating him regularly. Manage the daily schedule, meeting and appointment of the Managing Director. Provide comprehensive secretarial and administrative support to Managing Director. Draft, review and manage official correspondence, reports and documents of behalf of the Managing Director. Manage meeting minutes & reporting. Maintaining confidential papers, files and agreement of The Managing Director’s work. Handling all sorts of personal accounts of Managing Director. Any other job assign by Management. Compensation & Other Benefits T/A,Mobile bill Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur) Company Information alliance builders ltd Follow More jobs from this company Address: 640, 1st floor floor, west kazipara, opposite side of shopno life, mirpur, dhaka-1216 Business: we are one of the pioneer real estate firm in bangladesh. we have many projects all around in dhaka city. we construct building and sell apartments to the prospective buyer. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করব"
  },
  {
    "url": "https://bdjobs.com/h/details/1458964?ln=1",
    "company_name": "Al-Musawwir Construction Ltd",
    "job_title": "Architect ( Juniot Executive)",
    "location": "Dhaka (Mirpur 13)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "13 Mar 2026",
    "job_description": "Architect ( Juniot Executive) : Al-Musawwir Construction Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Al-Musawwir Construction Ltd Architect ( Juniot Executive) Application Deadline : 13 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 05 Age: 20 to 30 years Location: Dhaka (Mirpur 13) Experience: 1 to 2 years Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma in Architecture in Architecture Experience 1 to 2 years The applicants should have experience in the following business area(s): Architecture Firm Freshers are also encouraged to apply. Additional Requirements Age 20 to 30 years Age At least 20 years. Strong understanding of architectural drafting standards. Strong portfolio demonstrating interior projects, working drawings, and renderings. Proficieancy in: AutoCAD,SketchUp,Lumion,Enscape,D5,3ds Max,Corona Renderer,Adobe illustrator,Photoshop,CoreIDRAW,MS Powerpoint,Excel,and Word. Excellent Presentation and client communication skills. Ability to lead and manage mustiple project simultaneously. Self-driven,organized,and abl to work both indipendently and within a team. Portfolio Submission Applications must submit a portfolio that includes. 3D renderings Working/ Detail drawings Photographs of completed projects Responsibilities & Context Develop and present Detailed Architectural and interior Working drawings. Prepare complete 2D architectural drwaing sets ( floor plans, elevations, sections,site plans). Develop conceptual and detailed and architectural desings based on client requirements. Convert client concepts into hand sketches and professionl drawings. Revise desings based on client feedback and regulatory requirements. Develop detailed drawings, 3D views, and specifications for construction. Ensure desings comply with local building codes,zonning laws, and safety regulations. Coordinate with structural,electrical,plumbing,and mechanical engineers. Prepare and review project cost estimates and material selections. Visit construction sites to monitor progress and ensure desing accuracy. Resolve desing or construction sites issues during project execution. Prepare accurate factory/shop drawings for furniture and customized interior elements. Coordinate with the implimentationteam,site engineers,project managers, and sales team for smooth project execution. Oversee interior projects from concept to handover with strong attention to detaile. Stay updated with with modern desing trends, materials,finishes, ajnd technologies. Prepare high-quality presentation materials using illustrator,photoshop,CoreIDRAW, and power point. Produce precise 2D and 3D drawing using AutoCAD and sketch Up. Guide 3D Visualizers to creat photorealistic renderings using Lumion, Enscape,D5 Render, "
  },
  {
    "url": "https://bdjobs.com/h/details/1458981?ln=1",
    "company_name": "Arogga Limited",
    "job_title": "শেলভার (Shelver)",
    "location": "Dhaka (Mirpur 10)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "শেলভার (Shelver) : Arogga Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Arogga Limited শেলভার (Shelver) Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka (Mirpur 10) Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education 8 Pass Responsibilities & Context কাজের দায়িত্ব: র‍্যাক/শেলফে পণ্য সঠিকভাবে সাজিয়ে রাখা পণ্যের নাম, কোড বা লেবেল দেখে ঠিক জায়গায় রাখা নতুন আসা পণ্য শেলফে তোলা প্রয়োজনে শেলফ থেকে পণ্য নামিয়ে পিকার/প্যাকারকে দেওয়া শেলফ ও কাজের জায়গা পরিষ্কার ও গোছানো রাখা পণ্যের ক্ষতি বা ঘাটতি হলে সুপারভাইজারকে জানানো সুপারভাইজারের নির্দেশনা অনুযায়ী কাজ করা কারা আবেদন করতে পারবেন: কমপক্ষে অষ্টম শ্রেণি পাস হতে হবে শেলফে মাল সাজানোর কাজ জানা থাকলে ভালো নতুন লোকেরাও আবেদন করতে পারবেন নিয়ম মেনে কাজ করার মানসিকতা থাকতে হবে কাজের সময়: শিফট অনুযায়ী কাজ (দিন/রাত) প্রয়োজনে ওভারটাইম করতে হতে পারে বেতন ও সুযোগ-সুবিধা: কোম্পানির নিয়ম অনুযায়ী বেতন ওভারটাইম সুবিধা অন্যান্য সুবিধা (যদি প্রযোজ্য) ইউনিফর্ম ও সেফটি সামগ্রী দেওয়া হবে Workplace Work at office Employment Status Part Time Job Location Dhaka (Mirpur 10) Company Information Arogga Limited Follow More jobs from this company Address: Address: D/15-1, Road-36, Block-D, Section-10, Mirpur, Dhaka-1216\r\n\r\nHot Line: 09610016778 Business: Arogga App is the first Bangladeshi app that brings prescription and healthcare services to your doorstep. Easy and efficient, with just a click of a button, upload your prescription and we will ensure safe delivery of your medicine at the earliest possible time. Arogga, brings complete prescription and healthcare products from a complete range of medicines and over-the-counter items, including vitamins, diet/fitness supplements, herbal products, mother and baby care products, beauty products, and much more. With new services in plan, Arogga will be the number one healthcare services app for Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. T"
  },
  {
    "url": "https://bdjobs.com/h/details/1458984?ln=1",
    "company_name": "Meskat",
    "job_title": "Sales Executive",
    "location": "Dhaka (Mirpur 2, Pirerbag)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Sales Executive : Meskat Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Meskat Sales Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 18 to 30 years Location: Dhaka (Mirpur 2, Pirerbag... Dhaka (Mirpur 2, Pirerbag) Salary: Tk. 12000 - 15000 (Monthly) Experience: 1 to 3 years Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education HSC Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Call Center, Consulting Firms, E-commerce, E-commerce Startup Freshers are also encouraged to apply. Additional Requirements Age 18 to 30 years Responsibilities & Context The candidate will be responsible for delivering a top-level of service to inbound and outbound interactions across various channels. E.g. Telephone, email, Live Chat, social media, etc. You will have to learn and do teamwork on an daily basis for new products and technologies. Manage Large amounts of inbound and outbound calls in a timely manner. Face-to-Face Sales, Customer Support through Phone, Tele Marketing, QC (Quality Control) of Customer Service, Counseling, Online (web/ e-mail) Support, Guest Relations/ Services Handle customer inquiries through phone calls, Facebook, WhatsApp, and website chat. Convert incoming leads into confirmed sales orders. Provide accurate product information and proper guidance to customers. Maintain follow-up with customers to ensure order confirmation and satisfaction. Update and manage customer data, orders, and follow-ups in an organized manner. Coordinate with the delivery team to ensure timely order processing and delivery. Handle customer complaints professionally and provide effective solutions. Maintain daily sales reports and customer communication records. Support sales campaigns, promotional offers, and special events. Skills & Expertise Call Center Operation Customer Service Customer Service Management Sales & Marketing Sales Executive Compensation & Other Benefits Over time allowance,Medical allowance,Performance bonus,Mobile bill Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur 2, Pirerbag) Job Highlights We are hiring a proactive Sales & Customer Care Executive to manage customer inquiries, convert leads into sales, and deliver excellent customer satisfaction for our hair and skincare brand through confident and professional communication. Read Before Apply We are looking for candidates who can join immediately, preferably within this month. Selected candidates will have the opportunity to start work in a very short time and become an integral part of our growing hair and skincare brand. Prompt joining is highly appreciated. Appl"
  },
  {
    "url": "https://bdjobs.com/h/details/1458590?ln=1",
    "company_name": "Tilottoma Limited",
    "job_title": "SEO Manager & Digital Marketing Expert",
    "location": "Dhaka (Banani, Banglamotor)",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "SEO Manager & Digital Marketing Expert : Tilottoma Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Tilottoma Limited SEO Manager & Digital Marketing Expert Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 25 to 50 years Location: Dhaka (Banani, Banglamoto... Dhaka (Banani, Banglamotor) Salary: Negotiable Experience: At least 5 years Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors SEO Digital Markering AI Experience At least 5 years Additional Requirements Age 25 to 50 years 1. More high quality leads from clients searching for full interior andturnkey solu8ons 2. More local inquiries from Google Maps and city based searches 3. Higher trust and conversion through op8mized porHolio and real projectpages 4. Lower cost per lead over 8me and reduced dependency on paid ads 5. Stronger brand credibility through helpful blogs with measurable growthin traffic and bookings Responsibilities & Context SEO Strategy and Roadmap for full interior design services and target locations. Technical SEO site speed, mobile performance, indexing, crawling sitemap, and error fixes. Keyword Research and Page Mapping focused on high-intent full interior and turnkey queries. Service Page Optimization titles meta headings, schema, internal linking, and strong CTA setup. Portfolio and Project Page SEO project-wise pages with location scope, budget range, meline before aJer and FAQs. Local SEO and Google Business Profile maps ranking services, photos posts reviews and NAP consistency. Authority Building quality backlinks, brand mentions and reputation support. Blog Posts and Content Marketing publish SEO blog,s guides and FAQs to build trust capture search traffic and support service page rankings Tracking and Reporting GA4 GSC lead tracking calls WhatsApp forms and monthly performance report. Advanced knowledge in meta marketing and Google Ads marketing. \"AI \" knowledge will be given extra preference. Skills & Expertise SEO and Digital Marketing Compensation & Other Benefits T/A Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Banani, Banglamotor) Company Information Tilottoma Limited Follow Address: Regency Farooq Castle, House # 86, Level – 7, \nRoad # 17A, Block – E, Banani, Dhaka-1213, Bangladesh Business: TILOTTOMA LIMITED is a sister concern of SBS .TILOTTOMA LIMITED is a Bangladeshi company that has contemporary, elegant & unique ideas among Bangladeshi and international customers.\n\nThe company was founded by Mr. Subrota Biswas, a young, talented designer who has a lot of creativity with a bulk volume of project management & handover experience with local & multinational companies.\n\nOver the years"
  },
  {
    "url": "https://bdjobs.com/h/details/1458956?ln=1",
    "company_name": "IVAMCO",
    "job_title": "Procurement Data Entry Executive",
    "location": "Dhaka (Uttara Sector 4)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Procurement Data Entry Executive : IVAMCO Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List IVAMCO Procurement Data Entry Executive Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 30 years Location: Dhaka (Uttara Sector 4) Salary: Tk. 12000 - 15000 (Monthly) Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 30 years Age 25 to 30 years. Proven experience in data entry or procurement-related roles. Strong proficiency in Google Sheets and Microsoft Excel (Basic). Attention to detail and a strong commitment to accuracy. Ability to work independently and as part of a team. Responsibilities & Context Job Summary: We are looking for a dedicated Procurement Data Entry Executive. This role is responsible for accurately entering and maintaining procurement data, including placing orders on websites, creating purchase orders, and tracking upcoming shipments. The ideal candidate should have strong attention to detail, be proficient in Excel, Google Sheets and possess excellent organizational skills to support smooth operations within our procurement process. Key Responsibilities: Data Entry: Accurately enter procurement-related data into internal systems and databases. Order Placement: Place orders on websites as per business requirements and ensure timely order processing. Purchase Orders: Create and update purchase orders, ensuring proper documentation. Order Tracking: Follow up on Order Sheets, Upcoming Orders, Track Shipments, and manage Tracking Numbers for incoming parcels. Documentation: Maintain organized records of purchase orders, invoices, and delivery confirmations. Administrative Support: Assist with general administrative tasks related to procurement as required. Skills & Expertise Data analysis Data Management Google Sheets Procurement and Logistics Procurement Management System Compensation & Other Benefits Performance bonus,Over time allowance Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Uttara Sector 4) Company Information IVAMCO Follow More jobs from this company Address: House-30, Road-11, Sector-04, Uttara, Dhaka-1230 Website: https://www.ivamco.com Business: IVAMCO is a supply chain and distribution company focused on sourcing consumer goods, managing inventory, and delivering products across Bangladesh. We ensure efficient logistics and warehousing while supporting retail operations through reliable product flow. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন ক"
  },
  {
    "url": "https://bdjobs.com/h/details/1458965?ln=1",
    "company_name": "IVAMCO",
    "job_title": "Executive - Inventory Management",
    "location": "Dhaka (Uttara Sector 4)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Executive - Inventory Management : IVAMCO Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List IVAMCO Executive - Inventory Management Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 22 to 28 years Location: Dhaka (Uttara Sector 4) Salary: Tk. 15000 - 18000 (Monthly) Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 28 years 2-5 years of experience in warehouse, inventory, or logistics operations. Familiarity with SKU system, barcoding, and stock tracking procedures. Competence in using Google spreadsheets or inventory management tools. Strong attention to detail, punctuality, and accountability. Experience in e-commerce or Retail fulfillment is an added advantage. Responsibilities & Context Inventory Management Executive is responsible for executing daily warehouse activities including SKU labeling, packaging, inventory tracking, and dispatch coordination. This role plays a key part in ensuring the seamless flow of products from IVAMCO (B2B) to B2C Retail channels. The job needs someone who is organized, detail-oriented, and comfortable working with inventory systems to help keep things running efficiently and accurately. Key Responsibilities: Perform processing of inbound product. Maintain accurate and up-to-date inventory records in the system. Coordinate product dispatches and ensure correct product allocation to B2C retailers. Follow warehouse SOP and maintain a clean, organized storage environment. Collaborate with procurement and inventory teams to support B2B to B2C workflows. Support team management and maintain accurate inventory. Skills & Expertise Accuracy Auditing skill Data analysis Ecommerce Google Sheets Microsoft Excel Supply Chain Management Suggested by Cost and Inventory Management Inventory Management Store/ inventory Compensation & Other Benefits Performance bonus Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Uttara Sector 4) Company Information IVAMCO Follow More jobs from this company Address: House-30, Road-11, Sector-04, Uttara, Dhaka-1230 Website: https://www.ivamco.com Business: IVAMCO is a supply chain and distribution company focused on sourcing consumer goods, managing inventory, and delivering products across Bangladesh. We ensure efficient logistics and warehousing while supporting retail operations through reliable product flow. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান"
  },
  {
    "url": "https://bdjobs.com/h/details/1458970?ln=1",
    "company_name": "Proxima IT LAB",
    "job_title": "Call Center Executive",
    "location": "Dhaka (Farmgate)",
    "salary": "Tk. 12000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Call Center Executive : Proxima IT LAB Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Proxima IT LAB Call Center Executive Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 22 to 30 years Location: Dhaka (Farmgate) Salary: Tk. 12000 - 15000 (Monthly) Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) Additional Requirements Age 22 to 30 years Responsibilities & Context Handle inbound and outbound customer calls Provide basic technical support for software products Log issues Escalate complex technical problems to Level 2 / IT support teams Follow up with customers on issue resolution Maintain customer records and documentation Explain product features, updates, and service plans Coordinate with technical teams and developers Skills & Expertise Call Center Microsoft Excel Google meet Data Entry (Both English & Bengali) Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Farmgate) Company Information Proxima IT LAB Follow Address: Proxima IT Lab is a technology-driven solutions provider offering software development, IT services, and digital innovation support. We help businesses grow with smart tech solutions, efficient systems, and reliable technical expertise. Website: https://proximaitlab.com/ Business: Proxima IT Lab is an innovative IT solutions company specializing in software development, digital services, and technology integration. We empower businesses with modern tools, efficient systems, and reliable tech support to enhance growth and performance. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About "
  },
  {
    "url": "https://bdjobs.com/h/details/1458971?ln=1",
    "company_name": "লায়ন্স শিশু হাসপাতাল, সিলেট",
    "job_title": "মেডিকেল অফিসার",
    "location": "Sylhet (Sylhet Sadar)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "মেডিকেল অফিসার : লায়ন্স শিশু হাসপাতাল, সিলেট Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List লায়ন্স শিশু হাসপাতাল, সিলেট মেডিকেল অফিসার Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Sylhet (Sylhet Sadar) Salary: Negotiable Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context লায়ন্স শিশু হাসপাতালে মেডিকেল অফিসার পদে যোগ্যতা সম্পন্ন, দক্ষ ও অভিজ্ঞ প্রার্থী জরুরী ভিত্তিতে নিয়োগ দেয়া হবে। শিক্ষাগত যোগ্যতা: M.B.B.S পাশ (সরকার অনুমোদিত বিশ্ববিদ্যালয় হতে ও B.M.D.C হতে রেজিস্ট্রেশন প্রাপ্ত হতে হবে)। অভিজ্ঞতার উল্লেখসহ জীবনবৃত্তান্ত, ২ কপি পাসপোর্ট সাইজ ছবি, শিক্ষাগত যোগ্যতার সনদপত্র ও B.M.D.C- এর রেজিস্ট্রেশন সার্টিফিকেটের কপিসহ আবেদনপত্র নিয়ে আগামী ২৮ ফেব্রুয়ারি ২০২৬ রোজ শনিবার দুপুর ১২ ঘটিকার সময় অত্র হাসপাতালে উপস্থিত হয়ে সাক্ষাতকার প্রদানের জন্য আগ্রহী প্রার্থীদের অনুরোধ জানানো যাচ্ছে। ঠিকানা: লায়ন্স শিশু হাসপাতাল কুমারপাড়া, সিলেট। মোবাইল: ০১৭১৬৪৬৫৫৭৮, ০১৭১২৬৪৫৮৪৭ Workplace Work at office Employment Status Full Time Job Location Sylhet (Sylhet Sadar) Company Information লায়ন্স শিশু হাসপাতাল, সিলেট Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458729?ln=1",
    "company_name": "Life Project 4 Youth Bangladesh",
    "job_title": "GREEN VILLAGE LEADER",
    "location": "Lalmonirhat, Lalmonirhat (Tushbhandar), Rangpur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "GREEN VILLAGE LEADER : Life Project 4 Youth Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Life Project 4 Youth Bangladesh GREEN VILLAGE LEADER Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 35 years Location: Lalmonirhat, Lalmonirhat ... Lalmonirhat, Lalmonirhat (Tushbhandar), Rangpur Salary: Tk. 20000 - 25000 (Monthly) Published: 13 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Fluent in Bangla and well command in English (compulsory) Work experience in the corporate or NGO sector will be appreciated Basic knowledge in MS office (word, excel, drive, email…) Professional behavior Ability to work in a team (team spirit) especially with intercultural members Motivated and proactive profile who like challenges, volunteer spirit Ready to learn and grow Responsibilities & Context Life Project 4 Youth is an international movement of 16 organizations in 13 countries whose mission is the development of innovative solutions for the professional and social inclusion of young adults (17-25 years old) from extreme poverty and victims of exclusion. LP4Y supports the decent inclusion of thousands of young people and their families through programs, 18 Training & Development Centers, 4 Little Angels Academies, 4 Green Villages, in South East Asia, South Asia, Middle East, Europe and the US. Over the past 16 years LP4Y has created solutions, always close to slum areas in large cities such as Manila, Cebu, Iligan, Calauan, Jakarta, Surabaya, New-Delhi, Kolkata, Mumbai, Bengaluru, Raipur, Chennai, Kathmandu, Yangon, Dhaka, Beirut, and Cairo. Currently, we are 130 Catalysts in Asia and the Middle East working with vulnerable young adults contributing to the development of their country. Since 2009, + 10,800 Youth have been accompanied to the professional world. GREEN VILLAGE Green Villages are established in regions away from the big cities, and offer a pedagogy that is specially tailored for Youth living in rural communities. The Green Village (GV) is a Sustainable Entrepreneurial Hub, an example of environmentally-friendly living and contributes to the sustainable development of local communities. It provides a 3-month residential professional training program. The Green Village Bangladesh will welcome 50 young people on a regular basis, exclusively young women. MISSION JOB DESCRIPTION GREEN VILLAGE LEADER Location: Village - Tushbhander, Upazila - Kaliganj, Zila - Lalmonirhat, Division - Rangpur, Bangladesh Responsibilities and Duties Once trained to the LP4Y Pedagogy and to the use of our tools, the mission will take part in supporting a team: Organization - Management Coordinate the Green Village Bangladesh project Manage the Finance & Administrative respon"
  },
  {
    "url": "https://bdjobs.com/h/details/1458954?ln=1",
    "company_name": "tutree india technologies pvt ltd",
    "job_title": "Social Media Chat Executive – Lead Generation (Remote)",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 15000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Social Media Chat Executive – Lead Generation (Remote) : tutree india technologies pvt ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List tutree india technologies pvt ltd Social Media Chat Executive – Lead Generation (Remote) Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 18 to 60 years Location: Anywhere in Bangladesh Salary: Tk. 15000 - 30000 (Monthly) Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 60 years Responsibilities & Context We are hiring a proactive and results-oriented Social Media Chat Executive – Lead Generation to join our growing team. This is a Remote (Work From Home) Night Shift position . The selected candidate will be responsible for posting advertisements on various social media platforms, engaging with interested prospects via chat, and converting conversations into qualified leads. Key Responsibilities Post ads and promotional content across social media platforms (Facebook, Instagram, LinkedIn, etc.) Respond to incoming messages and inquiries promptly and professionally Engage prospects via chat and understand their requirements Collect relevant details and qualify potential leads Categorize leads as cold, warm, or hot Maintain accurate records in Google Sheets or CRM Follow up with interested prospects through chat Coordinate with the internal team for further processing of hot leads Required Skills & Qualifications Excellent written English communication skills Strong persuasion and chat conversation skills 2-3 years of prior experience in social media handling or lead generation Ability to manage multiple conversations simultaneously Target-oriented mindset Basic understanding of Facebook groups, pages, and online communities Self-disciplined and comfortable working independently from home Job Details Job Type: Full-Time Location: Remote / Work From Home Shift: Night Shift Incentives: Performance-based incentives available Why Join Us? 100% Work From Home opportunity Stable night shift role Growth opportunities within the company Performance-based earnings Supportive team environment Skills & Expertise Good at English Writing Social Media Marketing (SMM) Digital Marketing (Social Media Marketing) lead generation Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information tutree india technologies pvt ltd Follow Address: House-1, Road-6, Sector-4, Uttara Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদা"
  }
]