[
  {
    "url": "https://bdjobs.com/h/details/1464107?ln=0",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464212?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464207?ln=1",
    "company_name": "Bestic International",
    "job_title": "Student Consultancy Officer",
    "location": "Dhaka (Tejgaon Industrial Area)",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Student Consultancy Officer : Bestic International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bestic International Student Consultancy Officer Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 05 Age: 25 to 35 years Location: Dhaka (Tejgaon Industrial... Dhaka (Tejgaon Industrial Area) Salary: Negotiable Experience: 3 to 5 years Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience 3 to 5 years The applicants should have experience in the following business area(s): Consulting Firms, Immigration/Visa Processing, Immigration and Education Consultancy Service Additional Requirements Age 25 to 35 years Responsibilities & Context Counsel students regarding study abroad opportunities (UK, Canada, Australia, USA, Malaysia, Europe etc.) Guide students through university selection, course selection, and admission process Assist students in preparing and verifying application documents (transcripts, SOP, LOR etc.) Handle student visa application process and embassy documentation Follow up with students and parents regarding application and visa status Achieve monthly enrollment targets and maintain updated student database Build strong relationships with students, parents, and partner universities Coordinate with visa and operations team for smooth processing Stay updated with university admission requirements, scholarship information, and visa policies Skills & Expertise Student Counseling Student counseling and student visa processing USA student visa processing Student Admission Student Recruitment Compensation & Other Benefits Mobile bill,Performance bonus,Over time allowance Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Tejgaon Industrial Area) Company Information Bestic International Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course"
  },
  {
    "url": "https://bdjobs.com/h/details/1463639?ln=1",
    "company_name": "Hena International Ltd.",
    "job_title": "Content Strategist / Creative Lead / Head of Content (Digital Marketing)",
    "location": "Bangladesh, Dhaka",
    "salary": null,
    "experience": "At least 4 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Content Strategist / Creative Lead / Head of Content (Digital Marketing) : Hena International Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hena International Ltd. Content Strategist / Creative Lead / Head of Content (Digital Marketing) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Location: Bangladesh, Dhaka Salary: Negotiable Experience: At least 4 years Published: 28 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Bachelor’s degree in Marketing, Media, Communication, or related field (preferred) Experience At least 4 years The applicants should have experience in the following business area(s): Advertising Agency, Advertising Technology (AdTech) Startup, E-commerce, Film Production, Market Research Firms, Satellite TV, Software Company Additional Requirements Strong storytelling and creative writing skills. Hands-on experience with digital content creation tools (Canva, Photoshop, Illustrator, video editing tools). Knowledge of social media trends, SEO, and paid advertising campaigns. Leadership , team management, and coordination skills. Analytical mindset to evaluate content performance. Must be able to work from office in Dhaka. Responsibilities & Context Job Context We are seeking a creative and strategic Content Strategist / Content Planner / Creative Lead / Head of Content / Content Marketing Strategist to join our digital marketing team. In our small team, you will handle planning and executing content strategies, supervise content production across all channels (image, video, text), ensure brand consistency across campaigns, and provide team guidance—all in one role. Requirements 4/5 years of experience in content strategy, content planning, creative leadership, or agency content roles Ability to manage multiple projects and deadlines efficiently Strong understanding of copywriting, video editing, and graphic design processes Experience in digital media, content marketing, and digital advertising Key Responsibilities Develop content strategies aligned with client goals and business objectives. Lead and guide a team of content creators, designers, and video editors to execute tasks effectively. Create and maintain content plans, schedules, and campaign structures. Plan and oversee the production of social media, advertising, and website content. Generate, review, and refine creative ideas and concepts. Maintain consistent brand voice, tone, and style across all channels. Conduct market research , competitor analysis, and audience insights. Analyze content performance and optimize campaigns for engagement and conversions. Collaborate with Digital Marketing Strategists, Performance Teams, and Client Managers. Generate creative ideas for campaigns, video scripts, ad copy, and social media posts. Ensure content i"
  },
  {
    "url": "https://bdjobs.com/h/details/1464188?ln=1",
    "company_name": "A Reputed Multinational Company",
    "job_title": "Manager - Quality Assurance",
    "location": "Dhaka (Savar EPZ)",
    "salary": null,
    "experience": "5 to 10 years",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Manager - Quality Assurance : A Reputed Multinational Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Multinational Company Manager - Quality Assurance Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (Savar EPZ) Salary: Tk. 60000 - 80000 (Monthly) Experience: 5 to 10 years Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor in Engineering (BEngg) in Textile Engineering Bachelor/Honors Experience 5 to 10 years The applicants should have experience in the following business area(s): Garments Responsibilities & Context Develop, implement, communicate, and maintain the Quality Plan to ensure the company’s QA systems, SOPs, and policies comply with required standards. Plan, coordinate, and direct quality control programs to ensure continuous production meeting established standards. Take overall responsibility for quality systems to meet and exceed customer requirements. Ensure product quality and conformity according to buyer specifications. Maintain workplace safety, quality, and compliance activities. Set up, train, and monitor QC and QI teams to ensure garments meet customer requirements. Review size-set garments for measurements, construction, and visual approval. Arrange PP meetings to confirm required quality control standards according to style. Monitor daily reports, analyze feedback, and implement corrective and preventive actions. Analyze defects and reduce variation using appropriate analytical tools. Liaise with customer auditors and ensure corrective actions comply with their specifications. Follow up on Inline, Pre-Final, and Final audits, taking necessary action and documenting results. Coordinate with Production, IE, Merchandising, Finishing, and related departments. Supervise and direct subordinate activities, set targets, evaluate yearly performance, and approve leave/gate passes. Perform any other tasks assigned by mana Skills & Expertise Quality Management System Compensation & Other Benefits Provident fund,Gratuity,Insurance Salary Review: Yearly Festival Bonus: 2 As Per BEPZA ACT 2019 & Company Policy. Employment Status Full Time Job Location Dhaka (Savar EPZ) Company Information A Reputed Multinational Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdj"
  },
  {
    "url": "https://bdjobs.com/h/details/1464189?ln=1",
    "company_name": "Betopia Group",
    "job_title": "Head of Business (Betopia Cloud)",
    "location": "Dhaka",
    "salary": null,
    "experience": "8 to 15 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Head of Business (Betopia Cloud) : Betopia Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Betopia Group Head of Business (Betopia Cloud) Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At least 24 years Location: Dhaka Salary: Negotiable Experience: 8 to 15 years Published: 27 Feb 2026 Application Insights View Requirements Experience 8 to 15 years The applicants should have experience in the following business area(s): Group of Companies, IT Enabled Service, Software Company Additional Requirements Age At least 24 years What We’re Looking For 8–15 years of experience in Cloud, Data Center, ISP, or IT Infrastructure business. Strong P&L management experience. Solid understanding of: GPU infrastructure (AI/ML workloads). Virtualization & cloud architecture. Storage & networking fundamentals. Proven ability to scale technology-driven businesses. Strong leadership & commercial negotiation skills. Educational Qualification MBA preferred. Key Success Metrics Revenue & Margin Growth. GPU utilization rate. Customer acquisition & retention. Channel partner development. SLA compliance. Why Join Us? Lead one of Bangladesh’s emerging AI & GPU cloud platforms. Full business ownership & executive visibility. Opportunity to shape a national cloud infrastructure brand. Competitive compensation & performance incentives. Responsibilities & Context About Betopia Cloud Betopia Cloud is building Bangladesh’s next-generation AI-ready cloud platform offering: Dedicated & Shared GPU Infrastructure. GPU-as-a-Service (AI/ML workloads). VPS, Storage & Backup Services. Networking Solutions. Domain Reselling & Web Hosting . Business Email & SSL Services. Role Summary The Head of Business – Betopia Cloud will have full P&L ownership and be responsible for strategy, revenue growth, product development, partnerships, sales, and operational excellence. This is a high-impact leadership role for someone who understands both cloud infrastructure economics and commercial execution. Job Responsibilities Define and execute cloud business strategy. Drive revenue growth across GPU, VPS & hosting services. Build enterprise & reseller channel sales models. Develop competitive pricing & packaging. Lead product roadmap (AI/GPU cloud, storage, backup). Build strategic partnerships (AI startups, ISVs, enterprises). Ensure SLA, uptime & service quality standards. Lead marketing & brand positioning for Betopia Cloud. Compensation & Other Benefits Profit share Salary Review: Yearly Festival Bonus: 2 Excellent Work Environment. Fast Career Growth. Global Exposure. Innovation-Driven Culture. Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Betopia Group is a fast-growing family of 5000+ employees, operating locally and in international markets. We drive innovation, empowe"
  },
  {
    "url": "https://bdjobs.com/h/details/1464209?ln=1",
    "company_name": "Zennova Essence",
    "job_title": "Medical Assistant",
    "location": "Bogura (Bogura Sadar), Dhaka (Uttara Sector 11)",
    "salary": "📍Branch Addresses:",
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Medical Assistant : Zennova Essence Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Zennova Essence Medical Assistant Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 18 to 35 years Location: Bogura (Bogura Sadar), Dh... Bogura (Bogura Sadar), Dhaka (Uttara Sector 11) Experience: 1 to 5 years Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Diploma Bachelor/Honors Experience 1 to 5 years The applicants should have experience in the following business area(s): Cosmetics/Toiletries/Personal Care, Beauty Parlor/Saloon/Spa, Clinic Additional Requirements Age 18 to 35 years Only Female Responsibilities & Context WE ARE HIRING Medical Assistant/ Lesser Expert  For Rabia’s Beauty Station (Sister Concern of Zennova Essence ) We are looking for smart, well-presented and customer-focused individuals to join our team in Uttara (Dhaka) and Bogura branches 🔹 Position: Medical Assistant 🔹 Vacancy: 4 Persons 🔹 Workplace: Uttara / Bogura 📌 Requirements & Experience: ✔️ Prior working experience in a hospital or clinic is required ✔️ Experience in an aesthetic center will be given preference ✔️ Must be responsible, hardworking, and eager to learn 💎 Benefits & Facilities: ✨ Attractive Salary ✨ Eid Bonus ✨ Weekly Holiday ✨ Professional and pleasant working environment 📍 Branch Addresses: 🔹 Uttara Branch: House-50 (Lift-03) Road-17, Sector-11, Uttara, Dhaka 🔹 Bogura Branch: Amin Plaza (Lift-05) Romena Afaz Road, Joleshwari Tola, Bogura Skills & Expertise Aneasthesia Injection Medical Assistance Nurse Surgical Nursing Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Bogura (Bogura Sadar), Dhaka (Uttara Sector 11) Company Information Zennova Essence Follow Address: Address- House-29, Road-05, Sector-1O, Uttara,Dhaka-1230 Business: Zennova Essence is a trusted online beauty and skincare store based in Uttara, Dhaka. We specialize in providing authentic and high-quality skincare and hair care products from renowned international brands such as Cosrx, The Ordinary, Dr Althea, Purito, Skin1004 and more.\n\nOur product range includes serums, cleansers, moisturizers, toners, sunscreens, and hair care essentials designed to meet various skin types and concerns. We are committed to ensuring product authenticity, customer satisfaction, and excellent service.\n\nWith a growing customer base across Bangladesh, Zennova Essence continues to expand its operations while maintaining high standards of quality and reliability.\n\nAddress: House-29, Road-05, Sector-10, Uttara, Dhaka. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্"
  },
  {
    "url": "https://bdjobs.com/h/details/1464205?ln=1",
    "company_name": "Fozi Group",
    "job_title": "Car Sales Officer",
    "location": "Dhaka (Tejgaon Industrial Area)",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Car Sales Officer : Fozi Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fozi Group Car Sales Officer Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 05 Age: 25 to 35 years Location: Dhaka (Tejgaon Industrial... Dhaka (Tejgaon Industrial Area) Salary: Negotiable Experience: 3 to 5 years Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience 3 to 5 years The applicants should have experience in the following business area(s): Automobile Additional Requirements Age 25 to 35 years Only Male Responsibilities & Context Manage showroom sales and assist walk-in customers Explain vehicle features, pricing, and financing options Maintain strong customer relationships and follow up leads Achieve monthly sales targets Skills & Expertise Automobile Sales & Marketing Sales Executive Sales Target Achievement Retail Sales Compensation & Other Benefits Performance bonus,Mobile bill,Over time allowance,Profit share Salary Review: Yearly Festival Bonus: 2 Lunch Facilities: Partially Subsidize Carrier growth opportunity Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Tejgaon Industrial Area) Company Information Fozi Group Follow More jobs from this company Address: 37/2, GPO Near , Dhaka-1000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhu"
  },
  {
    "url": "https://bdjobs.com/h/details/1464177?ln=1",
    "company_name": "Bestic International",
    "job_title": "Tour Package Consultant And Sales Officer",
    "location": "Dhaka (Tejgaon Industrial Area)",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Tour Package Consultant And Sales Officer : Bestic International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bestic International Tour Package Consultant And Sales Officer Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 05 Age: 19 to 35 years Location: Dhaka (Tejgaon Industrial... Dhaka (Tejgaon Industrial Area) Salary: Negotiable Experience: 3 to 5 years Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience 3 to 5 years The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service, Immigration/Visa Processing, Tour Operator, Travel Agent Additional Requirements Age 19 to 35 years Only Male Strong communication and presentation skills Experience in travel & tourism sector will be an advantage Basic computer and social media proficiency Responsibilities & Context Promote and sell domestic & international tour packages Communicate with clients via phone and in person to provide travel consultation Design and customize tour packages based on client needs Follow up online and social media leads Achieve monthly sales targets Skills & Expertise Air Ticketing and Visa processing. Tour and Travel Agency Tour and Travel visa Tour Guide Tour Package Tourist visa processing Travel and Tourism Travel Consultant Compensation & Other Benefits Mobile bill,Tour allowance,Gratuity,Profit share,Performance bonus Lunch Facilities: Partially Subsidize Festival Bonus: 2 Carrier growth opportunities professional work environment Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Tejgaon Industrial Area) Company Information Bestic International Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Em"
  },
  {
    "url": "https://bdjobs.com/h/details/1464198?ln=1",
    "company_name": "Synergy Solutions Ltd.",
    "job_title": "International Call Center Agent (Night Shift)",
    "location": "Dhaka (Mirpur 10, Mirpur 14)",
    "salary": null,
    "experience": "Leader or Sales Manager.",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "International Call Center Agent (Night Shift) : Synergy Solutions Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Synergy Solutions Ltd. International Call Center Agent (Night Shift) Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 15 Age: 18 to 30 years Location: Dhaka (Mirpur 10, Mirpur ... Dhaka (Mirpur 10, Mirpur 14) Salary: Tk. 20000 - 25000 (Monthly) Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education O Level A Level HSC Bachelor of Business Administration (BBA) Additional Requirements Age 18 to 30 years Freshers are encouraged to apply (Only O-level, A-level or Fluent ENGLISH Speaker). Willing to work at night shifts to match business hours in USA & CANADA (Bangladesh time 8:00 PM - 5:00 AM). Willing to be in a minimum of 3 - 6 months probation period (depending on performance). Able to speak clearly and persuasively in English in positive or negative situations. Proven organizational and interpersonal skills. Self-motivated, independent worker with the ability to multitask. Professional, courteous and know proper phone etiquette. Excellent communication skills in English, both written and verbal, with the ability to convey complex information clearly and concisely. Strong interpersonal skills and the ability to work collaboratively in a team-oriented environment. Ability to work independently as well as cooperatively in a team setting. Exceptional attention to detail and organizational skills to manage multiple tasks simultaneously. Ability to relate with a diverse group of people. Sound knowledge of essential software like MS Word, MS Excel, Email etc. Previous experience in call centers, telemarketing or a similar role will be preferred. Responsibilities & Context Make outbound calls to USA / Canada customers and handle different topics according to the communication script. Identify customers` needs, clarify information, research every issue and provide solutions and/or alternatives. Sell services / products over the phone as per the instructions provided. Keep records of all conversations in our call center database in a comprehensible way. Meet personal / team qualitative and quantitative targets. Skills & Expertise Fluent in English Speaking Punctual Target Oriented Teamplayer Willingness to learn Suggested by Call Center Client Service Customer Service Compensation & Other Benefits Performance bonus,Weekly 2 holidays Lunch Facilities: Full Subsidize Festival Bonus: 2 Salary Review: Quarterly (In every 3 months) Attendance Bonus 3000/- BDT & Transportation allowance 2000/- BDT will be provided with Hourly salary. Transportation (Pick up and Drop off) facility arranged by office. 2 Festival Bonuses after probation period. Exclusive Sales / Telemarketing training will be pro"
  },
  {
    "url": "https://bdjobs.com/h/details/1464141?ln=0",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464182?ln=1",
    "company_name": "Hena International Ltd.",
    "job_title": "Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist (Digital Marketing)",
    "location": "Bangladesh, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist (Digital Marketing) : Hena International Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hena International Ltd. Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist (Digital Marketing) Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Location: Bangladesh, Dhaka Salary: Negotiable Published: 28 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements 3–4 years of experience in sales, preferably in digital marketing, IT services, or related industries. Proven experience in sales, lead conversion, or client relationship management. Excellent communication and negotiation skills. Ability to understand client needs and provide tailored solutions. Target-driven with strong result orientation. Familiarity with CRM or sales tracking systems is a plus. Responsibilities & Context Job Context Hena Technology, a leading digital marketing service provider in Bangladesh, is seeking a results-driven Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist. The role focuses on converting incoming leads into paying clients by understanding client needs, preparing tailored proposals, sending quotations, and ensuring professional customer service while achieving sales targets. Key Responsibilities: Communicate with potential clients and follow up effectively on all inbound leads. Convert incoming leads into confirmed/paid clients efficiently. Understand client requirements and prepare suitable service/product proposals. Send customized proposals and quotations to close deals. Achieve assigned sales targets consistently. Record all client interactions in CRM or sales tracking systems. Provide high-quality customer service and build long-term client relationships. বুঝার সুবিধার্থে বাংলায় দায়িত্বসমূহ: কোম্পানিতে আসা সকল কাস্টমারের সঙ্গে প্রফেশনাল যোগাযোগ রাখা। ইনকামিং লিডকে দ্রুত এবং কার্যকরভাবে চুক্তিবদ্ধ/পেইড ক্লায়েন্টে রূপান্তর করা। কাস্টমারের চাহিদা অনুযায়ী উপযুক্ত সার্ভিস/প্রোডাক্ট প্রপোজাল তৈরি করা। কাস্টমাইজড প্রপোজাল এবং কোটেশন পাঠিয়ে ডিল ক্লোজ করা। নির্দিষ্ট সেলস টার্গেট অর্জন করা। CRM বা সেলস ট্র্যাকিং সিস্টেমে কাস্টমার ইন্টারেকশন রেকর্ড করা। উচ্চমানের কাস্টমার সার্ভিস বজায় রাখা এবং সম্পর্ক গড়ে তোলা। Skills & Expertise Client Acquisition Client Communication Client Relationships Deal Closing Sales Sales & Marketing sales closing Compensation & Other Benefits T/A,Performance bonus,Mobile bill Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Lunch , Tea, coffee & snacks provided Workplace Work at office Employment Status Full Time Job Location Bangladesh, Dhaka Company Information Hena International Ltd. Follow More jobs from this company Address: 3rd Floor, 6 Purana Paltan Lane (Nea"
  },
  {
    "url": "https://bdjobs.com/h/details/1464187?ln=1",
    "company_name": "Hector Technologies",
    "job_title": "জেনারেল ওয়ার্কার",
    "location": "Saudi Arabia",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "জেনারেল ওয়ার্কার : Hector Technologies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hector Technologies জেনারেল ওয়ার্কার Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 100 Age: 21 to 40 years Location: Saudi Arabia Salary: Negotiable Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Experience Additional Requirements Age 21 to 40 years Only Male প্রয়োজনীয় যোগ্যতা সংশ্লিষ্ট পদে চাকুরী করার অভিজ্ঞতা থাকতে হবে। বিদেশে কাজের অভিজ্ঞতা থাকলে সুবিধা পাবেন। বিশেষ করে জিসিসি দেশ সমুহে (Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates) চাকুরী করার অভিজ্ঞতা থাকলে অগ্রাধিকার। ট্রেনিং বা সার্টিফিকেট থাকলে ভালো। ইংরেজি বা আরবি ভাষায় কথা বলতে পারলে অগ্রাধিকার। মিনিমাম এসএসসি পাস হতে হবে। Responsibilities & Context যে পদে নিয়োগ দেওয়া হবে কনস্ট্রাকশন ওয়ার্কার, ম্যাশন (টাইলস/ইট), কাঠমিস্ত্রি (কার্পেইন্টার), স্টিল ফিক্সার, ওয়েল্ডার, স্ক্যাফোল্ডার, পেইন্টার, প্লাম্বার, ক্লিনার, হাউসকিপার, সার্ভিস ক্রু, ডিশওয়াশার, ট্রলি বয়, গুদাম কর্মী, কৃষি শ্রমিক ইত্যাদি। Skills & Expertise Construction Steel Building Mason Carpenter Cleaning Welder Scaffolding Plumber Warehouse Agriculture Compensation & Other Benefits Over time allowance Lunch Facilities: Full Subsidize বেতন ও সুবিধা বেতন: ৩৫,০০০ - ১,২০,০০০ টাকা (পদ ও অভিজ্ঞতা অনুযায়ী) খাবার: বিনামূল্যে বাসস্থান: বিনামূল্যে ওভারটাইম: আছে Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Saudi Arabia Apply Procedure Hard Copy সরাসরি অফিসে নিম্নে উল্লেখিত ডুকোমেন্ট সহ যোগাযোগ করুন: আপডেট করা সিভি পাসপোর্টের মূল কপি প্রয়োজনীয় কাগজপত্র ও ছবি এটি একটি বিদেশে চাকুরির বিজ্ঞাপন। সার্ভিস ফি আছে। বিস্তারিত জেনে  আবেদন করার অনুরোধ রইল। প্রয়োজনে হোয়াটসঅ্যাপে মেসেজ করুন: +8801953331789 Company Information Hector Technologies Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register N"
  },
  {
    "url": "https://bdjobs.com/h/details/1464210?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464202?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464193?ln=1",
    "company_name": "Vero Style Limited",
    "job_title": "Manager (Quality Control)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Manager (Quality Control) : Vero Style Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Vero Style Limited Manager (Quality Control) Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Location: Dhaka Salary: Negotiable Published: 27 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Minimum 10 years of practical experience in the Ready-Made Garments (RMG) industry, with proven experience in a managerial role in Quality Control. Must have hands-on experience in handling Knit, Woven, and Sweater categories. Strong command of English (written and spoken) is mandatory to communicate effectively with international buyers. The role requires frequent factory visits and direct buyer interaction to ensure products meet required quality standards. Strong leadership and team management skills with the ability to supervise and motivate QC teams. Excellent problem-solving and decision-making capability under pressure. Ability to work independently with strong follow-up and monitoring skills. Strong ethical standards and commitment to maintaining product integrity and compliance. Responsibilities & Context We are seeking an experienced and quality-focused Manager (Quality Control) to oversee end-to-end quality assurance of Knit, Woven, and Sweater products in a reputed garment buying house. The ideal candidate must ensure compliance with buyer requirements and international standards while communicating directly with foreign buyers to maintain product excellence. Job responsibilities : ·       Lead and manage the overall Quality Control (QC) operations for Knit, Woven, and Sweater products from the development stage to final shipment. ·       Ensure products are manufactured in compliance with buyer requirements, approved samples, technical specifications, and international quality standards. ·       Communicate directly with foreign buyers to clarify quality requirements, address technical concerns, and provide regular quality updates. ·       Develop and implement quality assurance procedures, inspection standards, and corrective action plans to minimize defects and rework. ·       Conduct factory visits and in-line, pre-final, and final inspections to ensure on-time shipment with required quality levels. ·       Coordinate closely with Merchandising, Production, and Compliance teams to resolve quality-related issues proactively. ·       Analyze quality reports, identify root causes of defects, and implement preventive measures across production units. ·       Guide, train and supervise QC team members to ensure effective monitoring and reporting at all stages of production. ·       Maintain proper documentation of inspection reports, buyer communications, and quality performance records. ·       Ensure compliance with international buy"
  },
  {
    "url": "https://bdjobs.com/h/details/1464206?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464196?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "Sales Officer & sales representative",
    "location": "Chandpur, Chattogram, Chattogram (Chakbazar Chittagong, Chittagong Sadar Firozshah, Chittagong Sadar Middle Patenga), Cox`s Bazar, Cox`s Bazar (Cox's Bazar Sadar, Teknaf), Cumilla, Feni (Feni Sadar), Lakshmipur (Raipur), Narayanganj, Noakhali (Noakhali Sadar)",
    "salary": "Tk. 17000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Sales Officer & sales representative : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD Sales Officer & sales representative Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 200 Age: 22 to 45 years Location: Chandpur, Chattogram, Cha... Chandpur, Chattogram, Chattogram (Chakbazar Chittagong, Chittagong Sadar Firozshah, Chittagong Sadar Middle Patenga), Cox`s Bazar, Cox`s Bazar (Cox's Bazar Sadar, Teknaf), Cumilla, Feni (Feni Sadar), Lakshmipur (Raipur), Narayanganj, Noakhali (Noakhali Sadar) Salary: Tk. 17000 - 25000 (Monthly) Published: 28 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 22 to 45 years Responsibilities & Context ডিলার ওপেন করা,অর্ডার কালেকশন ও ডেলিভারি নিশ্চিত করা,দোকানদারের সাথে সুসম্পর্ক স্থাপন করা। বিঃদ্রঃ নিজ উপজেলায় কাজের সুযোগ । Workplace Work at office Employment Status Full Time Job Location Chandpur, Chattogram, Chattogram (Chakbazar Chittagong, Chittagong Sadar Firozshah, Chittagong Sadar Middle Patenga), Cox`s Bazar, Cox`s Bazar (Cox's Bazar Sadar, Teknaf), Cumilla, Feni (Feni Sadar), Lakshmipur (Raipur), Narayanganj, Noakhali (Noakhali Sadar) Company Information Agro Farm BD Follow More jobs from this company Address: Mirpur 6,Block D,Orchid Community Centere ,House 24, Lift 7. Dhaka 1216 Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul"
  },
  {
    "url": "https://bdjobs.com/h/details/1464208?ln=1",
    "company_name": "Fozi Group",
    "job_title": "Car Rental Officer",
    "location": "Dhaka (Tejgaon Industrial Area)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Car Rental Officer : Fozi Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fozi Group Car Rental Officer Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 05 Age: 22 to 45 years Location: Dhaka (Tejgaon Industrial... Dhaka (Tejgaon Industrial Area) Salary: Negotiable Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 22 to 45 years Only Male Responsibilities & Context Handle car rental bookings via phone, email, and walk-in inquiries Assist clients in selecting suitable vehicles as per their requirements Prepare rental agreements, invoices, and vehicle handover documents Coordinate with drivers and fleet team for timely vehicle delivery and pickup Follow up with clients for feedback, renewals, and repeat bookings Achieve monthly booking targets and maintain updated client database Handle corporate client accounts and build long-term business relationships Monitor vehicle availability, scheduling, and daily fleet management Stay updated with pricing, packages, and competitor market rates Skills & Expertise Automobile Customer Care Compensation & Other Benefits Performance bonus,Mobile bill,Over time allowance,Profit share Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Tejgaon Industrial Area) Company Information Fozi Group Follow More jobs from this company Address: 37/2, GPO Near , Dhaka-1000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree D"
  }
]