[
  {
    "url": "https://bdjobs.com/h/details/1463587?ln=1",
    "company_name": "Hassle Free Education",
    "job_title": "Virtual Sales Executive",
    "location": "United Kingdom",
    "salary": null,
    "experience": "Fluent in English Speaking",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Virtual Sales Executive : Hassle Free Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hassle Free Education Virtual Sales Executive Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 20 to 36 years Location: United Kingdom Salary: Tk. 12000 - 12000 (Monthly) Published: 25 Feb 2026 Application Insights View Requirements Education Higher Secondary Diploma Bachelor/Honors Masters Candidates with IELTS certification will be given preference during the selection process. Additional Requirements Age 20 to 36 years IELTS 6.5 or Equivalent English Proficiency(especially strong Listening & Speaking Skill) Responsibilities & Context About Hassle Free Education Hassle Free Education is a leading student consultancy firm based in the UK, with offices in London, Birmingham, Manchester, Leeds, Dhaka, Barishal, and Lagos . We specialize in providing expert guidance and comprehensive support for higher education opportunities in the UK, USA, Canada, Malta, and Finland . Our team assists students in securing admission to top universities, ensuring a smooth, transparent, and hassle-free application process. Our mission is to create accessible and affordable pathways for students to achieve their academic and career goals overseas. Working Hours Office Hours: 🕙 10:00 AM – 06:00 PM (UK Time) Key Responsibilities Communicate with prospective students and clients, providing detailed information about university study opportunities. Support the UK office in managing student recruitment, enrollments, and the admissions process. Follow up on incoming leads and inquiries efficiently and convert them into confirmed applications. Track and manage student documentation and monitor application progress. Maintain clear and professional communication with the UK office team. Achieve sales targets and provide regular performance reports. Respond promptly to student queries and provide effective problem-solving support. Guide students in selecting suitable courses and programs based on their academic background and career objectives. Skills & Expertise Computer Literacy Customer Service Data Entry Experience in English Medium School Fluent in English Speaking IELTS Problem solving and decision making Sales & Marketing Student Admission Telesales Compensation & Other Benefits Performance bonus Festival Bonus: 2 Salary Review: Yearly Competitive Salary Salary will be reviewed after the 3-month probation period based on performance. Quarterly Bonus Performance-based bonus of BDT 100,000–150,000 every 3 months (per intake). Workplace Work from home Employment Status Full Time Job Location United Kingdom Company Information Hassle Free Education Follow Address: Suite No: 636, Level 6, RH Home Centre, Green Road, Panthapath, Dhaka-1212 Website: https://hasslefreeeducation.co.uk/ B"
  },
  {
    "url": "https://bdjobs.com/h/details/1463646?ln=1",
    "company_name": "Data Verse Ltd",
    "job_title": "Senior Content Strategist",
    "location": "Dhaka (Banani)",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "27 Mar 2026",
    "job_description": "Senior Content Strategist : Data Verse Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Data Verse Ltd Senior Content Strategist Application Deadline : 27 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 36 years Location: Dhaka (Banani) Salary: Tk. 50000 - 60000 (Monthly) Experience: 3 to 5 years Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Business Administration (BBA) Experience 3 to 5 years The applicants should have experience in the following business area(s): Advertising Agency Additional Requirements Age 25 to 36 years Responsibilities & Context Key Responsibilities Content Strategy & Planning Develop content strategies for internal businesses and client brands. Plan scripts for videos, reels, and marketing campaigns. Lead content writing direction including social media, campaigns, and long-form content. Plan and structure website copy and web content strategy. Design and execute campaign content plans aligned with marketing goals. Client Collaboration Participate in client onboarding and strategy discussions. Communicate content direction, storytelling ideas, and campaign plans. Understand client goals and translate them into effective content strategies. Insights & Thought Leadership Share content insights, trends, and innovative ideas. Contribute content that helps educate and engage online audiences. Support the agency’s positioning as a strategic marketing partner. Requirements 4+ years of experience in content strategy, digital marketing, or brand communication. Strong expertise in content planning, storytelling, and campaign strategy. Experience working in an agency or multi-brand environment. Excellent writing and communication skills. Ability to think strategically and analytically. Leadership and team management skills. Skills & Expertise Creative content writing Content Marketing Advertising Branding Storytelling Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Job Location Dhaka (Banani) Job Highlights What We’re Looking For · A strategic thinker who understands content’s role in business growth. · Someone who can connect strategy, storytelling, and marketing. · A professional who can lead content that creates real brand impact. Company Information Data Verse Ltd Follow More jobs from this company Address: Dataverse Ltd.\nLevel-6, B&T Nehaleeya Tower, Plot No # 80, Block # B, Kemal Ataturk Avenue, Banani, Dhaka 1213 Website: https://www.dataverce.agency/ Business: Data Verce Limited is a new generation marketing agency built for the brands of tomorrow. Since our beginning we have focused on one simple goal to connect creativity with strategy and turn ideas into real growth.\n\nWe provide complete digital marketing s"
  },
  {
    "url": "https://bdjobs.com/h/details/1460724?ln=1",
    "company_name": "FHI Clinical dba Total Trials Inc",
    "job_title": "Senior Clinical Research Associate I",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "5 to 10 years",
    "education": null,
    "deadline": "19 Mar 2026",
    "job_description": "Senior Clinical Research Associate I : FHI Clinical dba Total Trials Inc Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List FHI Clinical dba Total Trials Inc Senior Clinical Research Associate I Application Deadline : 19 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Experience: 5 to 10 years Published: 25 Feb 2026 Application Insights View Requirements Education Clinical Research Associate Experience 5 to 10 years The applicants should have experience in the following business area(s): Healthcare Startup, Healthcare/Lifestyle product, Third Party Auditor (Quality, Health, Environment, Compliance Responsibilities & Context Summary of the Position: The Senior Contract Clinical Research Associate I (Snr. CRA I) monitors activities at clinical study sites to assure adherence to Good Clinical Practices (GCPs), Standard Operating Procedures (SOPs), study protocols and applicable regulatory requirements. Reviews study documents as required and prepares site visit reports. May be responsible for multiple projects and must work both independently and in a team environment. Participate in the study development and start-up process including reviewing protocols, designing and/or reviewing Case Report Forms (CRF), preparing Informed Consent Forms (ICF’s), developing study documents, organizing, and presenting at investigator meetings, working with management on a monitoring strategy, and/or developing project specific CRA training. They may participate in clinical training programs and maintain awareness of developments in the field of clinical research as needed. They may provide a benchmark of monitoring competence to inexperienced/less experienced colleagues. Prepares clinical documents, business correspondence, and procedural manuals. Maintains systems and processes necessary to report trial status and activities; and to help ensure that quality, regulatory-compliant clinical projects are conducted on time and within budget. Depending upon the level of experience, may become involved in other areas of study management and staff training. Contributes to the review of sponsor/client’s and/or FHI Clinical’s systems and procedures as appropriate. Essential Functions: Contributes to the development of routine protocols, informed consent/assent forms, SOPs, and other appropriate study documentation. Monitors clinical trials to ensure subject safety and compliance with the study protocol, applicable regulations and ICH GCP Guidelines. Performs site monitoring visits (selection, initiation, monitoring and close-out visits) in accordance with contracted scope of work, SOPs, and regulatory requirements, i.e., Good Clinical Practice (GCP) and other International Council on Harmonization (ICH) guidelines. Ensures timely submission of protocols, informed consents, safety reports and o"
  },
  {
    "url": "https://bdjobs.com/h/details/1454205?ln=1",
    "company_name": "FnF Pharmaceuticals Ltd.",
    "job_title": "Microbiologist",
    "location": "Jhenaidah",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Microbiologist : FnF Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List FnF Pharmaceuticals Ltd. Microbiologist Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: At least 28 years Location: Jhenaidah Salary: Negotiable Experience: 1 to 3 years Published: 27 Jan 2026 Application Insights View Requirements Education Doctor of Veterinary Medicine (DVM) MS in Microbiology Experience 1 to 3 years The applicants should have experience in the following business area(s): Pharmaceutical/Medicine Companies Additional Requirements Age At least 28 years Responsibilities & Context R&D (Research and Development) Biological Unit. To carry out any other relevant tasks assigned by the Line Manager and authority, when necessary. Skills & Expertise Medicine Product Development Veterinary medicine Suggested by Medicine Product Development Compensation & Other Benefits Mobile bill,Provident fund Salary Review: Yearly Festival Bonus: 2 And other advantages, as per company policy. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Jhenaidah Read Before Apply Important Notice: We encourage all applicants to carefully read the full job description before applying. This ensures that your skills and experience align with the role, allowing us to better assess your suitability. Thank you for taking the time to review the details thoroughly! Company Information FnF Pharmaceuticals Ltd. Follow More jobs from this company Address: Corporate Office: Urban Stream Com. Complex, Level # 03, 18, New Eskaton (R.K Menon Road), Dhaka- 1000 Business: FnF Pharmaceuticals Ltd. is a fast growing, Innovative, research oriented company and the First vaccine manufacturing Industry in the Private sector of Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্র"
  },
  {
    "url": "https://bdjobs.com/h/details/1463181?ln=1",
    "company_name": "Anchor Real Estate Ltd",
    "job_title": "Deputy Manager – Sales & Marketing",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 7 years",
    "education": null,
    "deadline": "26 Mar 2026",
    "job_description": "Deputy Manager – Sales & Marketing : Anchor Real Estate Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Anchor Real Estate Ltd Deputy Manager – Sales & Marketing Application Deadline : 26 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Salary: Tk. 40000 - 50000 (Monthly) Experience: At least 7 years Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Bachelor’s degree in any discipline from a recognized university Experience At least 7 years The applicants should have experience in the following business area(s): Developer, Real Estate Additional Requirements Excellent communication, negotiation, and interpersonal skills Strong leadership and team coordination ability Target-driven and self-motivated Sound knowledge of the real estate market in Dhaka Experience Requirements: Minimum 7 (five) years of experience in apartment / real estate sales and marketing Candidates with proven performance in apartment sales will be given preference Responsibilities & Context Anchor Real Estate Ltd , a reputed and growing real estate company, is seeking a highly motivated, experienced, and result-oriented professional for the position of Deputy Manager – Sales & Marketing. The ideal candidate must have strong experience in apartment sales and a proven ability to achieve sales targets. Key Responsibilities: Achieve assigned apartment sales targets in line with company objectives Develop and implement effective sales and marketing strategies Identify potential clients and generate new business opportunities Maintain strong and professional relationships with existing and prospective clients Conduct project presentations, client meetings, and site visits Negotiate with clients and successfully close sales Prepare and submit regular sales reports to management Analyze market trends and competitor activities to support business growth Compensation & Other Benefits Attractive and competitive salary package (Negotiable) Lucrative sales incentives Mobile allowance Festival bonus and other benefits as per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Anchor Real Estate Ltd Follow Address: H-31, R-18, Sec-3, Dhaka-1230 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 comp"
  },
  {
    "url": "https://bdjobs.com/h/details/1463650?ln=1",
    "company_name": "Shakti Foundation for Disadvantaged Women.",
    "job_title": "মালী(Gardener)",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 1 year",
    "education": null,
    "deadline": "27 Mar 2026",
    "job_description": "মালী(Gardener) : Shakti Foundation for Disadvantaged Women. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shakti Foundation for Disadvantaged Women. মালী(Gardener) Application Deadline : 27 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 35 years Location: Dhaka Salary: Tk. 18000 - 18000 (Monthly) Experience: At least 1 year Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education JSC/JDC/8 pass Experience At least 1 year Additional Requirements Age 20 to 35 years Responsibilities & Context কার্য-বিবরণী: ১। প্লান্টেশন ·       প্রকল্প এলাকায় বৃক্ষরোপণের জন্য প্লানিং অনুযায়ী কাজ করা ·       প্রকল্পের অবস্থান ও ডিজাইন অনুযায়ী গাছ নির্বাচন করা ও রোপণ করা ·       প্রকল্প স্থানের আগাছা ও অপ্রয়োজনীয় স্থুপ পরিস্কার করা ·       গর্তসহ ও মাটি প্রস্তুত, মাটি ভরাট, সার মিক্স এবং বৃক্ষ রোপণ ও এ ক্ষেত্রে প্রয়োজনীয় কাজ করা ·       প্রয়োজন অনুযায়ী পানি দেওয়া ২। রক্ষণাবেক্ষণ ·       নিয়িমিত আগাছা দমন করা ·       শিডিউল অনুযায়ী সার ও কীটনাশক প্রয়োগ করা ·       প্রকল্পে নিয়মিত পানি দেওয়া প্রয়োজনে রাত্রে বা ভোরে ·       শিডিউল অনুযায়ী প্রকল্পের গাছ সমূহ ট্রিমিং করা এবং পাতা ও ডালপালা একটি নির্দিস্ট স্থানে রাখা ·       প্রকল্পে আবর্জনা ও অতিরিক্ত বালি অপসারণ করা ·       প্রকল্পে মৃত গাছ অপসারণ ও নতুন গাছ লাগানো ৩। সুপারভাইজারের নির্দেশনা অনুযায়ী কাজ করা এবং অফিসের প্রয়োজন অনুযায়ী যখন যেখানে দায়িত্ব প্রদান করা হবে সেখানে কাজ করা। Skills & Expertise Gardener Suggested by Homestead gardening Compensation & Other Benefits Mobile bill,Over time allowance Salary Review: Yearly Festival Bonus: 3 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights কর্ম সময়: সপ্তাহে ৬ দিন (সকাল ৭.৩০ মিনিট থেকে সন্ধ্যা ৬.৩০ মিনিট পর্যন্ত।) শুক্রবার সাপ্তাহিক ছুটি। সুবিধা : বেতনের পাশাপাশি ওভারটাইম পাবে ঘন্টা প্রতি, সাপ্তাহিক ছুটি বা সরকারী ছুটির দিনে কাজ করলে হলিডে এ্যালাউন্স পাবে। Company Information Shakti Foundation for Disadvantaged Women. Follow More jobs from this company Address: House# 4, Road# 1(Main Road), Block# A, Section-11, Mirpur, Pallabi, Dhaka-1216 Business: Shakti Foundation for Disadvantaged Women, a leading Microfinance institution Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Au"
  },
  {
    "url": "https://bdjobs.com/h/details/1463655?ln=1",
    "company_name": "Relaxify",
    "job_title": "Graphics And Motion Graphic Designer",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "Graphics And Motion Graphic Designer : Relaxify Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Relaxify Graphics And Motion Graphic Designer Application Deadline : 07 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: At least 22 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: At least 2 years Published: 25 Feb 2026 Application Insights View Requirements Education HSC Experience At least 2 years The applicants should have experience in the following business area(s): Advertising Agency, Travel Agent, Film Production Freshers are also encouraged to apply. Additional Requirements Age At least 22 years Responsibilities & Context • Design high-converting creatives for Facebook, Instagram, TikTok, and other digital platforms • Edit short-form video ads, reels, and product demonstration videos • Create engaging UGC-style and direct-response marketing videos • Develop product visuals, landing page graphics, and promotional materials • Maintain brand consistency and premium visual quality • Research trends, competitors, and winning ad creatives • Collaborate with the marketing and operations team to improve campaign performance • Use modern tools and AI-assisted design workflows to increase speed and efficiency • Continuously improve design quality based on performance data and feedback Skills & Expertise Graphic Design motion graphics Adobe Photoshop Adobe Illustrator Adobe After Effects Adobe Premiere Pro Workplace Work from home,Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Relaxify Follow Address: In front of moshiur rahman school, Arappur, Jhenaidah Sadar, Jhenaidah Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT J"
  },
  {
    "url": "https://bdjobs.com/h/details/1454258?ln=1",
    "company_name": "European International",
    "job_title": "Sr Counsellor / Counsellor",
    "location": null,
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Sr Counsellor / Counsellor : European International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List European International Sr Counsellor / Counsellor Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 6 Age: 20 to 40 years Location: Dhaka (Banani) Salary: Negotiable Published: 27 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Bachelor degree in any discipline. A level Students Can apply Additional Requirements Age 20 to 40 years Fresher’s are encouraged to apply. Honest & hard working Experience Candidate from Education Consultancy will be given preference. Must have good command over the English language. Computer skill : MS Word, Excel, English Typing, email, internet researching, etc. Must be polite, patient, honest, and loyal to the work. Responsibilities & Context Provide comprehensive counseling to students and their families on education abroad options and opportunities Guide students through the application and enrolment process for education abroad Build and maintain relationships with students, their families, and institutions abroad Stay up-to-date on education abroad options and opportunities, as well as changes in laws and regulations affecting international students Provide accurate and timely reports on counseling and enrolment progress Attend and participate in education fairs and other events to promote our services Providing students with materials related to a career of their choice or career counseling to suit their skills. Job Location: House 05, Road 17, Block D, Banani, Dhaka-1213 Skills & Expertise Suggested by Counseling Education Counseling Student Counseling Compensation & Other Benefits T/A, Mobile bill, Tour allowance, Performance bonus Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Job Location Dhaka (Banani) Apply Procedure Email Your CV Send your CV to the given email career.european@gmail.com or Email your CV from My Bdjobs account Company Information European International Follow Address: House# 42/A (4th floor), Road # 9/A, Dhanmondi, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Projec"
  },
  {
    "url": "https://bdjobs.com/h/details/1463660?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "SELLS  REPRESENTIVE /SR",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 15000 - 20000 (Monthly)",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "SELLS  REPRESENTIVE /SR : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD SELLS  REPRESENTIVE /SR Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 100 Age: 20 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 15000 - 20000 (Monthly) Experience: 1 to 2 years Published: 26 Feb 2026 Application Insights View Requirements Education HSC in ????? SSC in ????? Experience 1 to 2 years The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM), Farming, Science Laboratory, Dairy, Agro based Startup Freshers are also encouraged to apply. Additional Requirements Age 20 to 40 years Responsibilities & Context ডিলার ওপেন করা,অর্ডার কালেকশন ও ডেলিভারি নিশ্চিত করা,দোকানদারের সাথে সুসম্পর্ক স্থাপন করা। বিঃদ্রঃ নিজ উপজেলায় কাজের সুযোগ । Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Agro Farm BD Follow Address: Mirpur 6,Block D,Orchid Community Centere ,House 24, Lift 7. Dhaka 1216 Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? O"
  },
  {
    "url": "https://bdjobs.com/h/details/1463648?ln=1",
    "company_name": "Al-Falaq Real Estate Limited",
    "job_title": "Manager - Sales & Marketing (Land Share & Flat Sales)",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "5 to 10 years",
    "education": null,
    "deadline": "24 Mar 2026",
    "job_description": "Manager - Sales & Marketing (Land Share & Flat Sales) : Al-Falaq Real Estate Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Al-Falaq Real Estate Limited Manager - Sales & Marketing (Land Share & Flat Sales) Application Deadline : 24 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 25 to 45 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: 5 to 10 years Published: 25 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Experience 5 to 10 years The applicants should have experience in the following business area(s): Developer, Real Estate Additional Requirements Age 25 to 45 years Responsibilities & Context Experience At least 5-10 years The applicants should have experience in the following business area(s): Real Estate Additional Requirements Age 25 to 45 years Strong network in Bangladesh real estate and corporate sector Negotiation & deal-closing capability Digital marketing proficiency Leadership and team-building ability Responsibilities & Context Sales & Business Development: Develop and execute sales strategies to achieve company targets. Identify and engage potential clients through networking, cold calls, and site visits.Manage the entire sales process, from lead generation to closing deals. Client Relationship Management: Build and maintain strong relationships with new and existing customers. Provide clients with detailed information about real estate properties, pricing, and financing options. Address customer queries and concerns professionally to ensure high satisfaction. Market Research & Strategy: Analyse market trends, competitor activities, and customer preferences to develop sales strategies. Provide recommendations for pricing, promotions, and marketing campaigns. Sales Reporting & Documentation: Maintain accurate records of sales activities, client interactions, and deal progress. Prepare sales reports and forecasts for senior management. Team Coordination & Collaboration: Work closely with marketing, finance, and legal teams to facilitate smooth property transactions. Provide guidance and support to junior sales executives. Site Visits & Promotional Activities: Conduct site visits with potential clients to showcase properties. Participate in real estate expos, open houses, and promotional events Skills & Expertise Real estate companies Real Estate Marketing Real Estate Sales Sales & Marketing Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Al-Falaq Real Estate Limited Follow Address: Room no: 240, Level-8, Muktobangla Shopping complex, Section-1, Mirpur Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর "
  },
  {
    "url": "https://bdjobs.com/h/details/1463635?ln=1",
    "company_name": "City Bank PLC",
    "job_title": "Associate Relationship Manager/Relationship Manager (EO/SEO), Medium Business",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Associate Relationship Manager/Relationship Manager (EO/SEO), Medium Business : City Bank PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List City Bank PLC Associate Relationship Manager/Relationship Manager (EO/SEO), Medium Business Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 25 Feb 2026 Application Insights View Requirements Education Experience Responsibilities & Context Acquire new Medium Business segment customers and drive deposit growth through strategic market engagement Maintain and expand existing client relationships with proactive service and personalized financial solutions Conduct market research and gather competitive intelligence to support business expansion Identify client needs and align them with suitable products to ensure customer satisfaction and portfolio growth Collaborate with internal teams to deliver seamless onboarding and account servicing processes Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information City Bank PLC Follow More jobs from this company Address: City Bank Center, 28, Gulshan Avenue, Gulshan 1, Dhaka 1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Regis"
  },
  {
    "url": "https://bdjobs.com/h/details/1463654?ln=1",
    "company_name": "Emami Bangladesh Ltd.",
    "job_title": "Merchandiser",
    "location": "Chattogram, Dhaka (Badda, Basundhara RA, Dhanmondi, Gulshan, Malibagh, Mirpur, Savar), Gazipur (Tongi), Sylhet",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "Merchandiser : Emami Bangladesh Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Emami Bangladesh Ltd. Merchandiser Application Deadline : 07 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Location: Chattogram, Dhaka (Badda,... Chattogram, Dhaka (Badda, Basundhara RA, Dhanmondi, Gulshan, Malibagh, Mirpur, Savar), Gazipur (Tongi), Sylhet Salary: Negotiable Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Responsibilities & Context Regularly visit assigned outlets/markets to ensure proper execution of all company activities. Ensure product display on shelves as per the approved planogram. Maintain adequate stock levels and avoid any stock-out situation. Increase shelf share and product visibility across all outlets. Monitor expiry dates and damaged products and take necessary action. Ensure accurate price tags and MRP display at all times. Implement ongoing promotions/offers properly and verify execution. Track competitor activity including pricing, promotions, and display initiatives; report promptly. Maintain strong relationships with outlet in‑charge/store managers for smooth operations. Submit daily reports including work summary and market feedback to the supervisor. Ensure proper visibility, display, and communication during new product launches. Follow all company policies and guidelines during market operations. Compensation & Other Benefits T/A,Mobile bill,Insurance,Performance bonus Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Job Location Chattogram, Dhaka (Badda, Basundhara RA, Dhanmondi, Gulshan, Malibagh, Mirpur, Savar), Gazipur (Tongi), Sylhet Company Information Emami Bangladesh Ltd. Follow Address: Emami Bangladesh Ltd, Aqua Tower (Level-6), 43, Mohakhali C/A, Dhaka-1212, Bangladesh. Business: Emami Bangladesh ltd. is one of the leading personal & health care manufacturing company with an enviable portfolio of household name such as Navratna, Fair & Handsome, Boro plus & so on. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean "
  },
  {
    "url": "https://bdjobs.com/h/details/1362242?ln=0",
    "company_name": "ASSDcadfaASSDcadfa up asfadgaf up",
    "job_title": "Housekeeper",
    "location": "Pirojpur (Zianagar)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "28 Apr 2026",
    "job_description": "Housekeeper : ASSDcadfaASSDcadfa up asfadgaf up Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ASSDcadfaASSDcadfa up asfadgaf up Housekeeper Application Deadline : 28 Apr 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Pirojpur (Zianagar) Published: 28 Apr 2025 Application Insights View Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context Test Employment Status Full Time Job Location Pirojpur (Zianagar) Company Information ASSDcadfaASSDcadfa up asfadgaf up Follow More jobs from this company Address: Building: Arial Kha, House: 182, Flat: 6/c, Dhanmondi, Dhaka-1209 up, Afghanistan; nkC1ARSsW7, Malawi Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463657?ln=1",
    "company_name": "Advanced Chemical Industries PLC (ACI)",
    "job_title": "Area Manager, Modern Trade (Consumer Brands)",
    "location": "Dhaka, Dhaka (Uttara), Gazipur",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Area Manager, Modern Trade (Consumer Brands) : Advanced Chemical Industries PLC (ACI) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Advanced Chemical Industries PLC (ACI) Area Manager, Modern Trade (Consumer Brands) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Location: Dhaka, Dhaka (Uttara), Ga... Dhaka, Dhaka (Uttara), Gazipur Salary: Negotiable Published: 25 Feb 2026 Application Insights View Requirements Education Experience Responsibilities & Context Achieve monthly, quarterly, and annual sales targets for assigned Modern Trade accounts. Manage and develop relationships with key retail chains, store managers, and category buyers. Negotiate product listings, shelf space, display agreements, and promotional plans. Ensure product availability, stock replenishment, and expiry control in outlets. Drive in-store visibility, planogram compliance, and merchandising excellence. Execute trade promotions, campaigns, and activation programs effectively. Monitor competitor activities and identify growth opportunities. Coordinate with Supply Chain and Distribution for smooth product flow. Supervise and guide merchandisers/promoters (if applicable). Prepare sales forecasts, performance reports, and market insights. Skills & Expertise Key Account Management Modern Trade Sales Workplace Work at office Employment Status Full Time Job Location Dhaka, Dhaka (Uttara), Gazipur Company Information Advanced Chemical Industries PLC (ACI) Follow More jobs from this company Address: ACI Centre, 245 Tejgaon Industrial Area, Dhaka-1208. Business: Pharmaceuticals; Agribusiness; Consumer Brands. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Audito"
  },
  {
    "url": "https://bdjobs.com/h/details/1463631?ln=0",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463665?ln=1",
    "company_name": "Shams Trade International",
    "job_title": "Digital Marketing & E-Commerce Expert",
    "location": "Dhaka (Uttara Sector 3)",
    "salary": "Negotiable",
    "experience": "2 to 6 years",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "Digital Marketing & E-Commerce Expert : Shams Trade International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shams Trade International Digital Marketing & E-Commerce Expert Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 20 to 40 years Location: Dhaka (Uttara Sector 3) Salary: Negotiable Experience: 2 to 6 years Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education HSC Bachelor of Business Administration (BBA) Master of Business Administration (MBA) Bachelor of Computer Application (BCA) Experience 2 to 6 years The applicants should have experience in the following business area(s): Wholesale, Trading or Export/Import, Direct Selling/Marketing Service Company, Importer, Online Retail Startup Additional Requirements Age 20 to 40 years Responsibilities & Context Develop and execute digital marketing strategies Manage social media platforms (Facebook, Instagram, LinkedIn, etc.) Create and manage paid ad campaigns (Meta Ads, Google Ads) SEO (Search Engine Optimization) & SEM management Email marketing campaigns Content planning and marketing strategy Lead generation and conversion optimization Monthly performance reporting Manage e-commerce platforms . Product listing optimization Inventory and order management Payment gateway integration Improve website user experience Conversion rate optimization Sales performance tracking Skills & Expertise Facebook marketing Ecommerce business knowledge eCommerce Operation Facebook Business Manager Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara Sector 3) Job Highlights Increase online sales Improve website traffic Generate qualified leads Increase brand visibility Improve ROI on advertising campaigns Apply Procedure Email Your CV Send your CV to the given email mmazumder495@gmail.com or Email your CV from My Bdjobs account Company Information Shams Trade International Follow More jobs from this company Address: Nigar plaza , road 02, sector 3, uttara ,Dhaka. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq"
  },
  {
    "url": "https://bdjobs.com/h/details/1463637?ln=1",
    "company_name": "Hassle Free Education",
    "job_title": "Admission officer",
    "location": "United Kingdom",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Admission officer : Hassle Free Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hassle Free Education Admission officer Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Age: 20 to 32 years Location: United Kingdom Salary: Tk. 12000 - 12000 (Monthly) Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 20 to 32 years Candidates must be fluent in English with strong communication and conversational skills.Candidates with an IELTS score of 6.0 or above will be given preference. Responsibilities & Context Hassle Free Education is a leading student consultancy firm specializing in providing guidance and support for higher education in the UK, USA, Canada, Malta, and Finland. We assist students in securing admission to top universities, ensuring a smooth and hassle-free application process. Our mission is to provide students with the best opportunities for education abroad, all while making the process affordable and accessible. Working Hours: The Office working hours will be from 10:00 AM to 06:00 PM (UK Time) Job Responsibilities: Writing Personal Statements: Students' personal statements for university applications will be written and edited, ensuring they meet the specific requirements of the universities. CV Writing: Assist students in creating professional CVs tailored for university admissions, internships, or job applications. University Admission Application Submission: Oversee and manage the submission process of university admission applications, ensuring timely and accurate submission to relevant institutions. Providing Guidance on Course Selection: Help students select the right courses and programs based on their academic background and career goals. Counselling and Support: Offer one-on-one counselling to students regarding their university choices, application procedures, and scholarship opportunities. Reviewing Admission Requirements: Ensure that all application materials meet the specific criteria of each university, including deadlines, required documents, and additional submission requirements. Liaising with Universities: Communicate with universities to follow up on students' applications, provide necessary documentation, and resolve any issues during the application process. Assisting in Visa and Immigration Processes: Provide guidance and support to students regarding student visa applications and other related immigration matters. Maintaining Records: Keep accurate records of student applications and admission statuses, ensuring all information is up to date and organized. Compensation & Other Benefits Performance bonus Salary Review: Yearly Festival Bonus: 2 Competitive salary (Salary will be reviewed based on performance after a 4-month prob"
  },
  {
    "url": "https://bdjobs.com/h/details/1463664?ln=1",
    "company_name": "Shams Trade International",
    "job_title": "Showroom Sales Executive",
    "location": "Dhaka (Uttara Sector 3)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Showroom Sales Executive : Shams Trade International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shams Trade International Showroom Sales Executive Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 18 to 32 years Location: Dhaka (Uttara Sector 3) Salary: Negotiable Published: 26 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 18 to 32 years Responsibilities & Context কাস্টমারের প্রয়োজন বুঝে কোন প্রোডাক্ট সাইজ বা স্টাইল সেরা হবে সেই সাজেশন দেওয়া এবং লেটেস্ট ফ্যাশন ট্রেন্ড সম্পর্কে ধারণা রাখা। শোরুমে আসা কাস্টমারদের ডাটাবেজ মেইনটেইন করা। POS সফটওয়্যার চালানো এবং কম্পিউটারে প্রতিদিনের স্টকের হিসাব রাখা। দোকানের বিক্রির পাশাপাশি ফেসবুক বা হোয়াটসঅ্যাপের অনলাইন অর্ডারগুলো সামলানো এবং কাস্টমারদের পার্সেল ট্র্যাকিংয়ে সাপোর্ট দেওয়া। কাস্টমার প্রোডাক্ট নিয়ে কোনো কমপ্লেইন করলে বা সাইজ বদলাতে আসলে তা প্রফেশনালভাবে সমাধান করা। সেলস প্রমোশন বা ক্যাম্পেইন কাস্টমারদের কাছে চমৎকারভাবে উপস্থাপন করা। টিম পার্সন হিসেবে দলের প্রয়োজন পূরণে সচেষ্ট থাকা। লাইভ , ভিডিও করতে পারলে । Skills & Expertise Customer satisfaction POS Software Showroom Manager Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Uttara Sector 3) Job Highlights only female can apply for ladies clothing business. Apply Procedure Email Your CV Send your CV to the given email mmazumder495@gmail.com or Email your CV from My Bdjobs account Company Information Shams Trade International Follow More jobs from this company Address: Nigar plaza , road 02, sector 3, uttara ,Dhaka. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 40"
  },
  {
    "url": "https://bdjobs.com/h/details/1463633?ln=1",
    "company_name": "Mazen (BD) Industries Ltd.",
    "job_title": "Medical Officer",
    "location": "Nilphamari (Nilphamari Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Mar 2026",
    "job_description": "Medical Officer : Mazen (BD) Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mazen (BD) Industries Ltd. Medical Officer Application Deadline : 24 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: At least 24 years Location: Nilphamari (Nilphamari Sa... Nilphamari (Nilphamari Sadar) Salary: Negotiable Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 24 years Clinical skills, Emergency support & minor surgical knowledge preferred. Good communicative candidate will be preferred Experienced candidates are encouraged to apply. Self motivated and energetic candidate will be preferred. Responsibilities & Context To provide first aid to the patients of the factory as much as possible. To distribute the responsibilities of the staff as medical officers and to coordinate all the work. Always make sure that all medical medicines and other things are stored properly & Monitoring the stock of medicines in medical and giving demand letter to the Admin officer as required. Regularly check the first aid box on the floor used for first aid and inspect the work area of the workers. Provide Weekly / monthly training to the workers on Maternity, Motherhood, Sanitary napkins, AIDS, Virus awareness, Vaccination and Hand Washing Monitoring the stock of medicines in medical and giving demand letter to the Admin officer as required. Compensation & Other Benefits Medical allowance,Provident fund,Gratuity Salary Review: Yearly Festival Bonus: 2 Earn Leave Encashment Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Nilphamari (Nilphamari Sadar) Company Information Mazen (BD) Industries Ltd. Follow More jobs from this company Address: Factory Address : Plot # 2-21, Sector # 03, Uttara EPZ, Nilphamari.\r\n\r\nHead Office : House # 15, Road # 08, Gulshan-01, Dhaka -1215, Website: https://mazen.group/ Business: We are a leading optical manufacturer based in Hong Kong with production plants in China and Bangladesh respectively.  Currently we have more than 5,000 workforces with annual production capacity over 8.5 million pieces of optical glasses. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joys"
  },
  {
    "url": "https://bdjobs.com/h/details/1463604?ln=1",
    "company_name": "Khaled Group of Companies",
    "job_title": "Engineer (Control Room)",
    "location": "Cumilla",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Engineer (Control Room) : Khaled Group of Companies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Khaled Group of Companies Engineer (Control Room) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Location: Cumilla Salary: Negotiable Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Minimum age: 25 years Ability to work under pressure and meet deadlines Experience in large-scale manufacturing, poultry, agro-industrial, or feed mill operations will be given preference Relevant experience in automated manufacturing or feed mill operations will be given priority. Sound knowledge of automated control systems (PLC/SCADA). Ability to work in rotational shifts. Responsibilities & Context Job Summary Nourish Poultry and Hatchery Limited is seeking more qualified and experienced Engineers (Control Room) to oversee and manage automated feed production processes. The ideal candidates will be responsible for operating and monitoring PLC/SCADA-based control systems to ensure smooth, efficient, and quality-compliant production operations. Key Responsibilities Operate and monitor computerized control systems (PLC/SCADA) for feed production lines Control batching, grinding, mixing, pelleting, and packaging processes Ensure accurate ingredient proportions according to approved formulations Monitor equipment performance, alarms, and process parameters Maintain production logs, reports, and shift records Coordinate with maintenance and production teams for troubleshooting and process optimization Ensure compliance with quality standards and safety procedures Minimize downtime, wastage, and operational errors Maintain a clean and organized working environment. Skills & Expertise COMPUTER OFFICE MANAGEMENT Reporting and documentation skill Communication and interpersonal skill Compensation & Other Benefits Competitive salary package Provident Fund Service benefits Two festival bonuses annually Mobile allowance Annual salary increases Workplace Work at office Employment Status Full Time Job Location Cumilla Job Highlights Khaled Group is a business conglomerate in Bangladesh, which has grown organically and built a diverse portfolio of 20+ companies supported by 10000+ employees & has the presence in Poultry Feed, Animal Nutrition, DOC, Agriculture & other industries. Company Information Khaled Group of Companies Follow More jobs from this company Address: House-39, Takia Center, Sonargaon Janapath Road, Sector-7, Uttara, Dhaka-1230. Business: ICT, Shipping, Agri-business, Garment Manufacturing, Real Estate etc Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার"
  },
  {
    "url": "https://bdjobs.com/h/details/1463652?ln=1",
    "company_name": "Al-Falaq Real Estate Limited",
    "job_title": "Executive/ Senior Executive- Apartment & Land Hotel Share Sales",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "Executive/ Senior Executive- Apartment & Land Hotel Share Sales : Al-Falaq Real Estate Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Al-Falaq Real Estate Limited Executive/ Senior Executive- Apartment & Land Hotel Share Sales Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 3 Location: Anywhere in Bangladesh Published: 25 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Responsibilities & Context Education Bachelor of Business Administration (BBA) in Marketing Experience 2 to 3 years Additional Requirements Age 28 to 35 years Experience: 2 to 3 years of relevant experience. Applicants should have experience in the following business area(s): Developer, Engineering Firms, Real Estate, Real Estate Startup, Land & Hotel share sales,  Apartment Sales. Must be professional and in sound mental and physical condition. Strong skills in Property Sales & Marketing, Sales Target Achievement, and Customer Service. Responsibilities & Context • To generate new leads & potential clients.• To follow up every prospect time to time.• To convert leads into sales independently.• To find out new sort of idea to generate sale and also find out new idea for attraction to the customer.• Report to the team leader when & where required.• Fulfill monthly or quarterly sales target.• To perform any sorts of relevant job if assign by the management. Skills & Expertise Land Development Real Estate Marketing Sales & Marketing Real Estate Real Estate Sales Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Al-Falaq Real Estate Limited Follow Address: Room no: 240, Level-8, Muktobangla Shopping complex, Section-1, Mirpur Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Sel"
  }
]