[
  {
    "url": "https://bdjobs.com/h/details/1457446?ln=1",
    "company_name": "LensCafe Studio",
    "job_title": "Digital Marketing Expert (Paid Ads & Growth)",
    "location": "Dhaka (Malibagh)",
    "salary": "Tk. 20000 - 40000 (Monthly)",
    "experience": "2 to 5 years",
    "education": null,
    "deadline": "10 Feb 2026",
    "job_description": "Digital Marketing Expert (Paid Ads & Growth) : LensCafe Studio Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List LensCafe Studio Digital Marketing Expert (Paid Ads & Growth) Application Deadline : 10 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 23 to 36 years Location: Dhaka (Malibagh) Salary: Tk. 20000 - 40000 (Monthly) Experience: 2 to 5 years Published: 06 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience 2 to 5 years The applicants should have experience in the following business area(s): Business-to-Business (B2B) Software and Services Startup, Educational Technology (Edtech) Startup, Direct Selling/Marketing Service Company, Online Retail Startup Additional Requirements Age 23 to 36 years Responsibilities & Context Job Opening: Digital Marketing Expert (Paid Ads & Growth) Company: Lens Cafe Studio Job Type: Full-Time Work Mode: Hybrid (Office + Work From Home) Lens Cafe Studio is looking for an experienced, performance-driven Digital Marketing Expert who specializes in paid advertising, campaign optimization, and digital growth strategies . The ideal candidate should be result-oriented, analytical, responsible, and passionate about driving measurable business growth. 🕒 Work Schedule 4 Days Work From Office 3 Days Work From Home Must be highly dedicated and responsive during working hours 💰 Salary BDT 20,000 – 40,000 (Salary depends on experience, skills, and performance) 🎯 Job Responsibilities Plan, execute, manage, and optimize paid ad campaigns on: Facebook & Instagram (Meta Ads) Instagram Marketing (Organic & Paid Strategy) YouTube Ads Google Ads (Search, Display & Video) Develop and manage full-funnel marketing strategies (Awareness → Leads → Sales). Strong understanding of platform algorithms, audience targeting, and scaling strategies . Set up, manage, and optimize: Facebook Pixel Google Tag Manager Conversion Tracking & Retargeting Work with LMS and CRM platforms to track: Leads User journeys Conversions Analyze campaign performance and prepare weekly & monthly reports with actionable insights. Continuously optimize ads for better ROI, lead quality, sales, and conversions . Collaborate closely with content, design, and strategy teams . Stay updated with the latest digital marketing trends, tools, and platform updates . ✅ Required Skills & Experience Proven experience in paid advertising and performance marketing . Strong knowledge of LMS-based businesses and education platforms . Hands-on experience in selling online courses will get strong preference . Excellent analytical skills and data-driven decision-making ability. Ability to manage multiple campaigns and meet deadlines. Strong communication and teamwork skills. ⭐ Preferred Candidate Traits Result-oriented mindset Highly r"
  }
]