[
  {
    "url": "https://bdjobs.com/h/details/1461603?ln=1",
    "company_name": "Esquire Knit Composite PLC",
    "job_title": "Senior Executive/Assistant Manager - IE",
    "location": "Narayanganj",
    "salary": null,
    "experience": "At least 4 years",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Senior Executive/Assistant Manager - IE : Esquire Knit Composite PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Knit Composite PLC Senior Executive/Assistant Manager - IE Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 26 to 38 years Location: Narayanganj Salary: Negotiable Experience: At least 4 years Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in IPE or Textile Engineering Experience At least 4 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements Age 26 to 38 years Strong analytical and numerical skills Advanced proficiency in MS Excel Leadership and team management capability (for AM position) Ability to work under pressure and meet shipment deadlines Responsibilities & Context Esquire Knit Composite PLC is looking for a competent and performance-driven Senior Executive / Assistant Manager – IE to strengthen its Industrial Engineering team. The selected candidate will be responsible for optimizing production processes, improving line efficiency, ensuring accurate SMV calculation, and supporting cost-effective production in knit garment manufacturing. 🔹 Key Responsibilities: Conduct time & motion study and prepare accurate SMV. Develop operation bulletin and machine layout plan. Perform line balancing and manpower planning for maximum productivity. Monitor daily production efficiency and analyze performance gaps. Identify bottlenecks and implement method improvements. Conduct capacity analysis based on order quantity and shipment schedule. Support implementation of Lean tools (5S, Kaizen, Continuous Improvement). Prepare and present IE performance reports to management. Coordinate with Production, Planning, Quality, and Merchandising teams. Compensation & Other Benefits Service Benefit Transport Facility Corporate SIM + Mobile Allowance Yearly Salary Review 02 Festival Bonus Insurance Workplace Work at office Employment Status Full Time Job Location Narayanganj Company Information Esquire Knit Composite PLC Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle "
  },
  {
    "url": "https://bdjobs.com/h/details/1461570?ln=1",
    "company_name": "Solution Explorer",
    "job_title": "WordPress Developer (Remote)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "21 Mar 2026",
    "job_description": "WordPress Developer (Remote) : Solution Explorer Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Solution Explorer WordPress Developer (Remote) Application Deadline : 21 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: At least 18 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 40000 (Monthly) Experience: 1 to 5 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Diploma Experience 1 to 5 years The applicants should have experience in the following business area(s): Artificial Intelligence (AI) Startup, Business-to-Business (B2B) Software and Services Startup, E-commerce, E-commerce Startup, IT Enabled Service, Software Company Additional Requirements Age At least 18 years Proven experience as a WordPress Developer (minimum 1–2 years preferred) Strong knowledge of WordPress architecture, themes, and plugin development Proficiency in PHP, HTML5, CSS3, JavaScript, and jQuery Experience with page builders (Elementor, WPBakery, etc.) Understanding of WooCommerce customization Familiarity with hosting environments and cPanel Experience with website performance optimization Knowledge of Git/version control is a plus Ability to manage multiple tasks and meet deadlines Strong problem-solving skills and attention to detail Comfortable working in a remote environment Preferred Qualifications (Good to Have) Experience with custom post types and Advanced Custom Fields (ACF) Familiarity with REST API integrations Understanding of basic SEO principles Experience working with international clients Knowledge of Agile or Scrum workflows Responsibilities & Context Role Overview We are looking for a skilled WordPress Developer to join our team. You will be responsible for developing, customizing, and maintaining high-quality WordPress websites for various clients. You’ll collaborate closely with project managers, designers, and other developers to deliver secure, scalable, and high-performing web solutions. The ideal candidate has strong technical expertise, attention to detail, and the ability to manage multiple development tasks efficiently in a fast-paced environment. Key Responsibilities Develop and customize WordPress websites based on project requirements Convert Figma, PSD, or Adobe XD designs into pixel-perfect, fully functional WordPress websites Customize and extend existing themes and plugins Optimize websites for speed, performance, and SEO best practices Ensure fully responsive and cross-browser compatible designs (mobile, tablet, desktop) Integrate third-party APIs, payment gateways, CRM systems, and external services Perform website maintenance, updates, and troubleshooting Identify and resolve bugs, errors, and compatibility issues Implement WordPress security best practices Colla"
  },
  {
    "url": "https://bdjobs.com/h/details/1461585?ln=1",
    "company_name": "Three-m",
    "job_title": "Packaging Staff",
    "location": "Dhaka (Mirpur, Mirpur 10)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "Packaging Staff : Three-m Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Three-m Packaging Staff Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 18 to 25 years Location: Dhaka (Mirpur, Mirpur 10) Salary: Tk. 8000 - 10000 (Monthly) Published: 19 Feb 2026 Application Insights View Requirements Education SSC Additional Requirements Age 18 to 25 years Only candidates from Mirpur, Dhaka are allowed to apply (must be residents of Mirpur ) Male candidates only. Knowledge of basic English Writing & Reading. Responsibilities & Context Job Responsibilities: Product packing Quality checking before packing Maintaining packing records on note Package labeling Skills & Requirements: Basic product packing skill Ability to do quality checking before packing Attention to detail Ability to maintain simple packing records Basic labeling knowledge Physically fit and able to work long hours Teamwork and discipline Skills & Expertise displine Packing operations Teamwork Compensation & Other Benefits Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur, Mirpur 10) Company Information Three-m Follow Address: Mirpur 10. dhaka 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্"
  },
  {
    "url": "https://bdjobs.com/h/details/1461601?ln=1",
    "company_name": "A Reputed Multinational Apparel Sourcing Office",
    "job_title": "Assistant – Mechanic (Sewing Machine)",
    "location": "Dhaka (DOHS Baridhara)",
    "salary": null,
    "experience": "4 to 7 years",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Assistant – Mechanic (Sewing Machine) : A Reputed Multinational Apparel Sourcing Office Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Multinational Apparel Sourcing Office Assistant – Mechanic (Sewing Machine) Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (DOHS Baridhara) Salary: Negotiable Experience: 4 to 7 years Published: 20 Feb 2026 Application Insights View Requirements Experience 4 to 7 years The applicants should have experience in the following business area(s): Multinational Companies, Garments, Buying House Additional Requirements Candidate must have experience in sewing machine. Responsibilities & Context Perform routine cleaning, lubrication, and minor adjustments of sewing machines. Assist in installation and setup of new sewing machines. Assist in identifying required spare parts for repair work. Ensure machines are safe for operators after maintenance work. Compensation & Other Benefits Weekly 2 holidays,Insurance,Profit share Festival Bonus: 2 Salary Review: Yearly As per policy. Workplace Work at office Employment Status Full Time Job Location Dhaka (DOHS Baridhara) Company Information A Reputed Multinational Apparel Sourcing Office Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employa"
  },
  {
    "url": "https://bdjobs.com/h/details/1461432?ln=1",
    "company_name": "tasfia2026",
    "job_title": "অফিস অ্যাসিস্ট্যান্ট (ক্লিনার)",
    "location": "Dhaka",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "অফিস অ্যাসিস্ট্যান্ট (ক্লিনার) : tasfia2026 Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List tasfia2026 অফিস অ্যাসিস্ট্যান্ট (ক্লিনার) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Dhaka Salary: Tk. 10000 - 12000 (Monthly) Experience: 1 to 5 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education PSC/5 pass Experience 1 to 5 years Additional Requirements অভিজ্ঞতা: প্রিমিয়াম স্যালুন, বিউটি পার্লার, বড় কর্পোরেট অফিস অথবা হাসপাতালে ক্লিনার হিসেবে কাজের অভিজ্ঞতা থাকলে অগ্রাধিকার দেওয়া হবে। আচরণ: ভদ্র, নম্র এবং দায়িত্বশীল হতে হবে।দক্ষতা: আধুনিক ক্লিনিং ইকুইপমেন্ট এবং কেমিক্যাল ব্যবহারে প্রাথমিক ধারণা থাকতে হবে।অত্যন্ত পরিচ্ছন্ন এবং সুশৃঙ্খলভাবে কাজ করার মানসিকতা থাকতে হবে। Responsibilities & Context কাজের বিবরণ ও দায়িত্ব: স্যালুন এবং ট্রেনিং ইনস্টিটিউটের ফ্লোর, আসবাবপত্র এবং কাজের সরঞ্জামসমূহ প্রতিদিন নির্দিষ্ট সময়ে পরিষ্কার ও জীবাণুমুক্ত রাখা। স্যালুনের প্রিমিয়াম মান বজায় রাখতে হাইজিন (Hygiene) প্রোটোকল কঠোরভাবে অনুসরণ করা। কাস্টমার এবং স্টুডেন্টদের ব্যবহারের জায়গাগুলো (যেমন: ওয়াশরুম, ওয়েটিং এরিয়া) সার্বক্ষণিক পরিষ্কার রাখা। ক্লিনিং ম্যাটেরিয়াল বা পরিষ্কার করার সরঞ্জামের স্টক দেখাশোনা করা এবং প্রয়োজন হলে কর্তৃপক্ষকে জানানো। কাজের সময় ও স্থান: ডিউটি সময়: সকাল ১০:০০ টা থেকে রাত ০৮:০০ টা পর্যন্ত। কর্মস্থল: ফার্মগেট , ধানমন্ডি ঢাকা। আবেদন প্রক্রিয়া: আগ্রহী প্রার্থীদের অতি দ্রুত যোগাযোগ করার জন্য অনুরোধ করা হচ্ছে। আসার সময় অবশ্যই আপনার জীবনবৃত্তান্ত (CV) সাথে নিয়ে আসবেন। Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 বেতন ও সুবিধাদি: মাসিক বেতন: আলোচনা সাপেক্ষ (আপনার যোগ্যতা ও অভিজ্ঞতার ওপর ভিত্তি করে)। দুপুরের খাবার: অফিস থেকে দুপুরের খাবারের ব্যবস্থা আছে। উৎসব বোনাস: বছরে ২টি (ঈদুল ফিতর ও ঈদুল আযহা)। বাৎসরিক ইনক্রিমেন্ট: সন্তোষজনক পারফরম্যান্সের ভিত্তিতে বছরে ৫% বেতন বৃদ্ধি। প্রফেশনাল এবং প্রিমিয়াম কর্মপরিবেশ। Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information tasfia2026 Follow Address: Its Group of company Business: Its Group of company Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4"
  },
  {
    "url": "https://bdjobs.com/h/details/1460947?ln=1",
    "company_name": "Renaissance Group",
    "job_title": "AGM - Production (Woven)",
    "location": "Dhaka (Ashulia)",
    "salary": null,
    "experience": "10 to 12 years",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "AGM - Production (Woven) : Renaissance Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Renaissance Group AGM - Production (Woven) Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 02 Age: At least 35 years Location: Dhaka (Ashulia) Salary: Negotiable Experience: 10 to 12 years Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Industrial & Production Engineering Experience 10 to 12 years The applicants should have experience in the following business area(s): Buying House, Garments, Group of Companies, Satellite TV, Textile Additional Requirements Age At least 35 years Responsibilities & Context Production Monitoring: Daily monitoring of production lines to ensure targets are achieved (OTIF - On Time in Full) Quality Control: Maintain high quality, reducing defects (DHU%), and ensuring AQL standards in finishing. Planning & Coordination: Review production, material, and machinery planning, and coordinate with merchandising for TNA (Time & Action) calendar compliance. Efficiency Improvement: Implement Industrial Engineering (IE) techniques to increase productivity and reduce waste. Technical Support: Oversee pre-production meetings, sample approvals, and technical adjustments to meet buyer specs. Team Leadership: Supervise, train, and motivate production staff to improve skills and reduce absenteeism. Compensation & Other Benefits Mobile bill,Insurance Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Ashulia) Company Information Renaissance Group Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 140"
  },
  {
    "url": "https://bdjobs.com/h/details/1461469?ln=1",
    "company_name": "Beauty training institute",
    "job_title": "Branch Manager - Shylet",
    "location": null,
    "salary": null,
    "experience": "At least 3 years",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Branch Manager - Shylet : Beauty training institute Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Beauty training institute Branch Manager - Shylet Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 27 to 37 years Location: Anywhere in Bangladesh Salary: Tk. 18000 - 20000 (Monthly) Experience: At least 3 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience At least 3 years The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM) Additional Requirements Age 27 to 37 years Experience: 2–8 years in a Premium Salon, Luxury Hotel, or Service Industry. Communication: Excellent verbal communication skills in English and Bengali.Appearance: Highly presentable with a professional grooming sense. Availability: Must be ready to join immediately. Job Location Shylet - Biyanibazar Please apply those people who are come in interview date and joining as soon as possible Responsibilities & Context Premium Guest Relations: Provide a \"VIP Experience\" by welcoming high-end clients and ensuring their comfort throughout their visit. Operational Excellence: Oversee daily salon activities, ensuring all aesthetic services (Skin/Hair) are delivered according to brand standards. Team Supervision: Lead a team of beauticians, barbers, and support staff; manage their attendance, grooming, and performance. Appointment & Scheduling: Manage the booking calendar efficiently to minimize wait times and maximize outlet revenue. Inventory & Quality Control: Monitor the usage of premium products and ensure all tools and equipment are sterilized and maintained. Financial Reporting: Maintain daily sales records, cash management, and submit daily operational reports to the head office. Hygiene Standards: Ensure 100% cleanliness and a luxurious atmosphere within the salon at all times. Working Hours: 9:30 AM to 10:30 PM (As per the agreement). Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Beauty training institute Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... "
  },
  {
    "url": "https://bdjobs.com/h/details/1461609?ln=1",
    "company_name": "Longmarch Metallic Industries Ltd.",
    "job_title": "Accounts Officer",
    "location": "Dhaka (Dhamrai)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Accounts Officer : Longmarch Metallic Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Longmarch Metallic Industries Ltd. Accounts Officer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 24 to 36 years Location: Dhaka (Dhamrai) Salary: Negotiable Experience: 1 to 2 years Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor of Commerce (BCom) Bachelor’s (Honours) and/or Master’s degree in Accounting, Finance, or a related discipline (preferred). Experience 1 to 2 years The applicants should have experience in the following business area(s): Steel Additional Requirements Age 24 to 36 years • Bachelor’s (Honours) and/or Master’s degree in Accounting, Finance, or a related discipline (preferred). • Minimum 1–2 years of relevant experience in Accounts, Finance, or a related field. • Sound knowledge of financial reporting, taxation, VAT, audit procedures, and compliance. • Proficiency in accounting software (e.g., Tally, ERP systems, QuickBooks) and MS Office. • Strong analytical, communication, and reporting skills. • Ability to work under pressure and meet deadlines. Responsibilities & Context Longmarch Metallic Industries Ltd., a reputed and growing organization in the metal manufacturing sector, is inviting applications from qualified and motivated candidates for the position of Accounts Officer. The selected candidate will be responsible for managing accounting operations, financial reporting, and ensuring statutory compliance. Skills & Expertise Analytical and Decision making ability Audit Financial Reporting Good Ms office and Emailing skill Knowledge of preparing financial statements Proficiency in Accounting Software (Tally ERP9 Quick Book) VAT and Tax Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Dhamrai) Apply Procedure Email Your CV Send your CV to the given email mustakimkt@gmail.com or Email your CV from My Bdjobs account Company Information Longmarch Metallic Industries Ltd. Follow Address: Plot No-B-10 & B-11, BSCIC Industrial City, Dautia, Ward No-7, Kalampur, Dhamrai, Dhaka-1351 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro.."
  },
  {
    "url": "https://bdjobs.com/h/details/1461640?ln=1",
    "company_name": "Maheen Accessories Ltd.",
    "job_title": "Manager - Accounts & Finance",
    "location": "Narayanganj",
    "salary": null,
    "experience": "8 to 12 years",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "Manager - Accounts & Finance : Maheen Accessories Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Maheen Accessories Ltd. Manager - Accounts & Finance Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 40 to 50 years Location: Narayanganj Salary: Negotiable Experience: 8 to 12 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Business Administration (BBA) in Accounting Master of Business Administration (MBA) in Accounting Professional certification CA & CC is Preferred. Experience 8 to 12 years The applicants should have experience in the following business area(s): Garments, Garments Accessories Additional Requirements Age 40 to 50 years Well conversant and Proficiency in English (both in written & Spoken) is mandatory. Ability to maintain a positive work environment. Ability to work well on under pressure. Strong communication and leadership skills. Proficient in financial analysis and reporting. Able to manage multiple tasks in restricted time. Responsibilities & Context Overseeing the day-to-day operation & activities of all accounts and financial information system. To monitor the overall recording process, preparation of Profit & Loss Account and Balance sheet. Develop and implement effective tax strategies to minimize the company`s tax liabilities while ensuring compliance with relevant tax laws and regulations. Ensuring that the company is fully compliant with Taxation, RJSC, and Internal and External audits. Clear knowledge on LC . Liaising with all relevant Departments and Business Units on a range of issues. Ensuring the recording of all purchases and relevant expenses. Ensuring proper recording for LATR opening, settlement and bank interest. Ensuring Foreign Exchange gain loss calculation and recording. Ensure Bank Reconciliation. Preparing, examining and analyzing accounting records, financial statements and other financial reports to assess accuracy, completeness and conformance to reporting and procedural standards. Ensuring compliance with tax and VAT deduction at source and other tax requirements. Ensuring reconciliation of client`s ledger and confirmation of balance. Monitor the whole accounts and finance requirements of selected concern. Provide Budgets, Financial Reports and Financial Trends in order to assist the Management. Meeting all the official Accounting documents & statutory Auditing requirements including internal audits by implementing functional systems, monitoring and achieving cost reduction. Analyzing and coordinating proper mix of Equity & debt fund requirements. Cost Benefit Analysis of each activity in business Processes, identifying vital and critical processes to operate at optimum Cost. Any other responsibilities assigned "
  },
  {
    "url": "https://bdjobs.com/h/details/1461598?ln=1",
    "company_name": "Esquire Knit Composite PLC",
    "job_title": "Executive-IE",
    "location": "Narayanganj",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Executive-IE : Esquire Knit Composite PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Knit Composite PLC Executive-IE Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 34 years Location: Narayanganj Salary: Negotiable Experience: At least 2 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Science (BSc) in IPE or Textile Engineering Experience At least 2 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements Age 25 to 34 years Responsibilities & Context Esquire Knit Composite PLC is a leading export-oriented knit garment manufacturer in Bangladesh, recognized for its commitment to quality, innovation, and operational excellence, looking for smart IE Executive, responsible for optimizing production processes, improving line efficiency, reducing operational cost, and ensuring effective manpower utilization in knit garment manufacturing. The role focuses on SMV calculation, line balancing, productivity enhancement, and implementation of lean manufacturing tools to achieve organizational production targets and on-time shipment. Key Responsibilities: Conduct operation breakdown and prepare accurate SMV for knit garments (T-shirt, Polo, Tank Top, etc.). Maintain and update operation bulletin and machine layout plan. Ensure SMV accuracy through regular time study and method validation. Prepare line layout and manpower distribution plan. Conduct capacity analysis based on order quantity and shipment deadline. Monitor bottlenecks and adjust line balancing to achieve target efficiency. Ensure optimum machine and operator utilization. Monitor daily line efficiency, productivity, and output achievement. Analyze variance between target vs. actual production. Support production team to improve first-hour production and overall line performance. Provide daily, weekly, and monthly IE performance reports to management. Identify areas of wastage (time, motion, manpower, machine idle time). Propose cost-saving initiatives through method improvement. Work closely with Quality team to reduce rework, alteration, and rejection rate. Implement Lean tools such as 5S, Kaizen, Work Study, and Method Study. Develop and maintain SOPs for standardized production processes. Conduct training sessions for supervisors and operators on efficiency improvement. Compensation & Other Benefits Service Benefit Transport Facility Corporate SIM + Mobile Allowance Yearly Salary Review 02 Festival Bonus Insurance Workplace Work at office Employment Status Full Time Job Location Narayanganj Read Before Apply No need to apply, if you do not meet job requirements Company Information Esquire Knit Composite PLC Follow Report this Job / Company (রিপোর"
  },
  {
    "url": "https://bdjobs.com/h/details/1461623?ln=1",
    "company_name": "Esquire Knit Composite PLC",
    "job_title": "APM/DPM/PM - Sewing (Knit)",
    "location": "Narayanganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "APM/DPM/PM - Sewing (Knit) : Esquire Knit Composite PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Knit Composite PLC APM/DPM/PM - Sewing (Knit) Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At least 28 years Location: Narayanganj Salary: Negotiable Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 28 years Strong knowledge of sewing operations, SMV, line balancing, and efficiency calculation. Hands-on experience in Lean Manufacturing, 5S, and production optimization. Strong leadership and team management skills. Ability to work under pressure and manage multiple styles. Good communication and reporting skills. Responsibilities & Context Esquire Knit Composite PLC is looking for a highly experienced and performance-driven Production Manager – Sewing (Knit) to lead and manage the sewing production floor. The incumbent will be responsible for achieving daily production targets, maintaining quality standards, optimizing efficiency, and ensuring on-time shipment as per buyer requirements. Key Responsibilities : Plan, organize, and control sewing production activities to meet shipment deadlines. Ensure achievement of daily, weekly, and monthly production targets. Monitor line efficiency, productivity, DHU%, and WIP control. Coordinate closely with IE, Quality, Cutting, Finishing, and Merchandising teams. Implement capacity planning and manpower allocation effectively. Ensure smooth line setup and style changeover with minimum downtime. Identify bottlenecks and take corrective actions to improve output. Maintain quality standards as per buyer requirement and AQL guidelines. Control rejection, alteration, and rework percentage. Maintain discipline, safety, and compliance standards on the production floor. Lead and motivate Supervisors, Line Chiefs, and Operators to achieve operational excellence. Prepare daily production reports and present to top management. Compensation & Other Benefits Service Benefit Transport Facility Corporate SIM + Mobile Allowance Yearly Salary Review 02 Festival Bonus Insurance Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Narayanganj Company Information Esquire Knit Composite PLC Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না।"
  },
  {
    "url": "https://bdjobs.com/h/details/1461619?ln=1",
    "company_name": "Esquire Knit Composite PLC",
    "job_title": "Assistant Manager/Deputy Manager - Quality Assurance (Knit)",
    "location": "Narayanganj",
    "salary": null,
    "experience": "6 to 12 years",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Assistant Manager/Deputy Manager - Quality Assurance (Knit) : Esquire Knit Composite PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Knit Composite PLC Assistant Manager/Deputy Manager - Quality Assurance (Knit) Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At least 28 years Location: Narayanganj Salary: Negotiable Experience: 6 to 12 years Published: 20 Feb 2026 Application Insights View Requirements Education B.Sc. in Textile Engineering / Apparel Manufacturing / Industrial Engineering. Master’s degree will be an added advantage. Experience 6 to 12 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements Age At least 28 years Strong leadership and team management skills. In-depth knowledge of AQL, 4-Point System, Fabric & Garments Quality Standards. Familiarity with international buyers’ compliance requirements. Strong analytical and problem-solving skills. Proficiency in MS Office & reporting tools. Ability to work under pressure and handle multiple buyers. Responsibilities & Context Esquire Knit Composite PLC is seeking experienced and result-driven Quality professionals to lead and control end-to-end quality assurance and quality control processes in Knit Composite operations. The incumbents will ensure buyer compliance, product quality standards, and continuous improvement across production process. Key Responsibilities : Lead overall Quality Assurance (QA) & Quality Control (QC) operations of the factory. Develop and implement quality policies, SOPs, and inspection procedures. Ensure inline, end-line, and final inspections as per AQL standards. Monitor knitting, dyeing, finishing, cutting, sewing, and packing quality performance. Conduct root cause analysis (RCA) and implement corrective & preventive actions (CAPA). Ensure buyer compliance and third-party audit readiness. Coordinate with Production, Merchandising, IE, and Technical teams to minimize rejection and rework. Monitor DHU%, RFT%, and other quality KPIs. Conduct quality training and skill development programs for QC team. Prepare quality reports and present analysis to top management. Ensure compliance with international standards and customer requirements. Compensation & Other Benefits Service Benefit Transport Facility Corporate SIM + Mobile Allowance Yearly Salary Review 02 Festival Bonus Insurance Workplace Work at office Employment Status Full Time Job Location Narayanganj Company Information Esquire Knit Composite PLC Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অ"
  },
  {
    "url": "https://bdjobs.com/h/details/1461655?ln=1",
    "company_name": "Advanced Chemical Industries PLC (ACI)",
    "job_title": "Area Sales Manager- Stationery Business",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "Area Sales Manager- Stationery Business : Advanced Chemical Industries PLC (ACI) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Advanced Chemical Industries PLC (ACI) Area Sales Manager- Stationery Business Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Negotiable Published: 20 Feb 2026 Application Insights View Requirements Education Experience Responsibilities & Context Achieve area-wise sales targets for stationery products across retail, wholesale, and institutional channels. Plan and execute sales activities including new product launches (e.g., notebooks, pens, office supplies) and promotional campaigns targeting schools, offices, and corporate clients. Monitor trade discounts, schemes, and credit policies to ensure profitability and minimize financial risk. Collect and analyze market insights on competitors, seasonal demand (school opening season, exam periods, etc.), and emerging trends to guide strategy. Build and maintain strong distributor, retailer, and institutional client networks to expand market coverage. Conduct regular market visits to stationery shops, bookstores, and corporate clients to ensure visibility and availability of products. Develop accurate sales forecasts and inventory plans to meet seasonal peaks and ensure uninterrupted supply. Mentor and motivate the sales team through performance reviews, field training, and incentive programs. Organize monthly sales meetings to review performance, share market feedback, and align business plans. Support marketing initiatives by evaluating trade promotions, in-store branding, and school/office campaigns. Skills & Expertise Sales Target Achievement Distributor Management Sales Forecasting Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Job Highlights Lead area sales & achieve targets Expand distributor & retail network Drive product launches & promotions Ensure profitability & market growth Attractive incentives & career growth Company Information Advanced Chemical Industries PLC (ACI) Follow More jobs from this company Address: ACI Centre, 245 Tejgaon Industrial Area, Dhaka-1208. Business: Pharmaceuticals; Agribusiness; Consumer Brands. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro..."
  },
  {
    "url": "https://bdjobs.com/h/details/1461607?ln=1",
    "company_name": "Esquire Knit Composite PLC",
    "job_title": "Executive - Supply Chain Management",
    "location": "Narayanganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Executive - Supply Chain Management : Esquire Knit Composite PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Esquire Knit Composite PLC Executive - Supply Chain Management Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 24 to 30 years Location: Narayanganj Salary: Negotiable Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 24 to 30 years Strong analytical and negotiation skills. Good communication skills in English & Bangla. Proficiency in MS Office (Excel, Word, PowerPoint). Knowledge of ERP systems will be preferred. Ability to work under pressure and meet deadlines. Responsibilities & Context Esquire Knit Composite PLC is looking for a dynamic and detail-oriented Executive – Supply Chain Management to manage end-to-end supply chain operations including sourcing, procurement, planning, inventory control, and coordination with production and commercial departments to ensure smooth factory operations. Key Responsibilities : Execute procurement plans based on production requirements and buyer schedules. Coordinate with Merchandising, Production, Commercial (Export-Import), and Store departments. Monitor raw materials (yarn, dyes, chemicals, trims, accessories) inventory levels. Ensure timely sourcing and delivery of materials to avoid production delays. Maintain strong relationships with local and foreign suppliers. Compare quotations, negotiate prices, and prepare comparative statements (CS). Follow up on purchase orders (PO) and ensure on-time delivery. Monitor shipment schedules and coordinate with Commercial team for import/export documentation. Maintain proper documentation and ERP updates. Analyze supply chain data and suggest cost-saving opportunities. Ensure compliance with company policies and industry standards. Compensation & Other Benefits Service Benefit Transport Facility Corporate SIM + Mobile Allowance Yearly Salary Review 02 Festival Bonus Insurance Workplace Work at office Employment Status Full Time Job Location Narayanganj Company Information Esquire Knit Composite PLC Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 90"
  },
  {
    "url": "https://bdjobs.com/h/details/1461496?ln=1",
    "company_name": "tasfia2026",
    "job_title": "Classroom Supervisor (Urgent Hiring)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Classroom Supervisor (Urgent Hiring) : tasfia2026 Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List tasfia2026 Classroom Supervisor (Urgent Hiring) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 35 years Location: Dhaka Salary: Tk. 15000 - 17000 (Monthly) Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 35 years Skills: Strong communication and interpersonal skills. Availability: Must be able to join immediately (ASAP). Experience: Previous experience in educational supervision or training centers is a plus. Responsibilities & Context Is looking for a proactive, organized, and energetic Classroom Supervisor to join our team immediately. If you are passionate about student management and field coordination, we want to hear from you! Key Responsibilities: Student Support: Provide daily academic and administrative support to students within the classroom. Mark Sheet Distribution: Manage and distribute student transcripts and mark sheets accurately and timely. Field Coordination: Organize and lead students to external locations for mandatory Practical Classes . Classroom Management: Ensure a disciplined and productive environment for both trainers and trainees. Compensation & Other Benefits T/A Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Job Location Dhaka Company Information tasfia2026 Follow Address: Its Group of company Business: Its Group of company Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cy"
  },
  {
    "url": "https://bdjobs.com/h/details/1461621?ln=1",
    "company_name": "Knit Composite Factory",
    "job_title": "Assistant General Manager - Marketing & Merchandising (Gazipur)",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Assistant General Manager - Marketing & Merchandising (Gazipur) : Knit Composite Factory Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Knit Composite Factory Assistant General Manager - Marketing & Merchandising (Gazipur) Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At least 38 years Location: Gazipur Salary: Negotiable Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 38 years Positive work ethics and a focus on results are required for assigned responsibilities. The candidate must have adequate knowledge of the inquiry stage to shipment in the stipulated timeline. The candidate should be technically sound in the costing & manufacturing process. Excellent communication in English (written/verbal) & presentation skills. Positive work ethics and results-oriented for assigned responsibilities. Ability to maintain good interpersonal relationships and good teamwork. Energetic, confident and proactive. Responsibilities & Context Ensure and supervise the Merchandising activities in order to achieve the monthly and yearly targets. Conduct market analysis of new demand and marketing for newly designed products. Ensure order processing, design development, costing, production, and product shipment on time as per order. Follow up cost sheet of pricing & negotiate with the buyer for taking the order. Ensure coordination among all required departments, stakeholders and business partners as required. Coordinates with a production team in order to deliver the on-time shipment and ensure merchandisers are updating order status to the buyer. Work closely with QA to ensure the best product. Coordinate with sample section to ensure proper sample design for the buyer, send the sample on time and follow up on any comments or acceptance of that sample from the buyer. Proper execution of orders according to planned `Time and Action Plan` to ensure on-time shipment with the right quality and quantity. Follow-up subordinates about their assigned tasks and ERP update. Lead, monitor, appraise and train up subordinates to achieve Departmental goals. Skills & Expertise Merchandising and Marketing Knitwear Merchandising Garments Costing Compensation & Other Benefits Mobile bill Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Gazipur Company Information Knit Composite Factory Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিক"
  },
  {
    "url": "https://bdjobs.com/h/details/1461608?ln=1",
    "company_name": "Powerade Technology Ltd.",
    "job_title": "Executive (Sales & Marketing)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Executive (Sales & Marketing) : Powerade Technology Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Powerade Technology Ltd. Executive (Sales & Marketing) Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Age: 25 to 35 years Location: Dhaka Salary: Tk. 15000 (Monthly) Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Age 25 to 35 years Person should have good knowledge about Electrical Sub-Station, Diesel Generator and BBT. Preference will be given to those candidates who have a motorcycle and Driving License. Ability to develop and drive a highly motivated team. Good presentation and communication skill. Enthusiastic and proactive in nature. Responsibilities & Context Responsible to achieve the sales target. Negotiating the terms of agreement and closing sales. Gathering market and customer information. Gaining a clear understanding of customers need and requirements. Skills & Expertise Suggested by Sales & Marketing Target Oriented Strategic Planning Electric Item Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply Preference will be given to those candidates who have a motorcycle and Driving License. Company Information Powerade Technology Ltd. Follow Address: House-275/A, Road- 20, 2nd Floor, Mohakhali DOHS, Mohakhali, Dhaka-1206 Business: Electrical Sub-Station Equipments Manufacturer and Authorized Dealer of KIRLOSKAR Brand Generator. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor "
  }
]