[
  {
    "url": "https://bdjobs.com/h/details/1458739?ln=1",
    "company_name": "A leading Liaison Office in Bangladesh",
    "job_title": "Sample Technician",
    "location": "Dhaka",
    "salary": null,
    "experience": "4 to 5 years",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Sample Technician : A leading Liaison Office in Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A leading Liaison Office in Bangladesh Sample Technician Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 28 to 45 years Location: Dhaka Salary: Negotiable Experience: 4 to 5 years Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor Degree, Preferable for Textile Engineering. Experience 4 to 5 years Additional Requirements Age 28 to 45 years Skills Required: Knit garments Sample, Collection Sample, Development Sample, Management Sample, Product Risk Assessment, Sample Quality, Sample Section, Management Time Management, Ability to communicate effectively, ability to work as a team, Ability to Work Under Pressure, Communication in English Proficiency in Microsoft Office applications and mail communication. Experience Requirements Experience handling international buyers such as H&M, Kiabi, Gemo, Auchan, etc. Strong knowledge of CAD and 3D systems. Able to work under pressure and manage tight deadlines. Strong communication and coordination skills. Excellent knowledge about sweater, knit & woven items (shirt/jacket/trouser) knowledge about various kind of sweater design, yarn, wash, print, embroidery, accessories, knit fabric, capability of arrange sample from factory as per given information from Abroad team. Kids garments experience mandatory for this post. Responsibilities & Context Job Context : A leading Liaison Office in Bangladesh Job Responsibility : Receive tech pack, sample request, and comments from buyer. Clarify fabric, trims, construction, measurement, artwork, and fit details. Share sample status regularly and follow up for approvals with T&A. Track each stage: fabric sourcing → cutting → sewing → finishing → dispatch. Ensure lab dips, strike-offs, prints, embroidery are approved before sample making. Manage all development samples such as: Proto / First sample, Fit sample, Size set, PP sample, Salesman / Photo / GPT sample, Shipment sample Ensure samples meet buyer quality standards, workmanship, and measurement tolerance. Measurement check and visual inspection before sending. Coordinate with QC & pattern team for correction. Receive buyer comments and analyze issues. Communicate corrections clearly to factory. Arrange re-sampling quickly to avoid delay. Work closely with Pattern & CAD team/Cutting & sewing team/Print & embroidery/Quality control to Ensure sample is 100% as per buyer expectation, not factory assumption. Documentation & Record Keeping - Maintain sample files/Tech pack versions/Approval comments/Fabric & trim details Ensure approved sample is reference for bulk production. Identify potential issues early-Fabric delay/Print quality/Fit or co"
  },
  {
    "url": "https://bdjobs.com/h/details/1458870?ln=1",
    "company_name": "A well-reputed garment buying house",
    "job_title": "Creative Graphic Designer",
    "location": "Dhaka (DOHS Baridhara)",
    "salary": "Negotiable",
    "experience": "4 to 5 years",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Creative Graphic Designer : A well-reputed garment buying house Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A well-reputed garment buying house Creative Graphic Designer Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 25 to 55 years Location: Dhaka (DOHS Baridhara) Salary: Negotiable Experience: 4 to 5 years Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Masters BGMEA University of Fashion Technology,Shanto Mariam University of Creative Technology students will get preference Experience 4 to 5 years The applicants should have experience in the following business area(s): Buying House, Garments, Multinational Companies, Textile Additional Requirements Age 25 to 55 years Applicants with expertise in operating CLO 3D software will be given priority Responsibilities & Context Strong knowledge of Womenswear and Menswear design and development . Hands-on experience with 3D design software (CLO & Browzwear) . Proficient in Adobe Photoshop, Illustrator, and Microsoft Office . Up-to-date awareness of fashion trends , seasonal colors, materials, fabrics, prints, and trims. Knowledge of printing, embroidery, and garment washing techniques . Excellent written and verbal communication in English , with strong presentation skills . Self-driven, creative, proactive, and able to work efficiently in fast-paced, high-volume environments . Experience working with UK and European market requirements . Develop seasonal mood boards, color palettes, and thematic concepts aligned with the brand’s creative direction and market strategy. Understand and interpret buyers’ mood boards, seasonal color and material trends, and fabric qualities . Create artwork and sketches based on themes provided by buyers, business development teams, and the design team. Conduct fit sessions in collaboration with technical teams to ensure proper garment construction and quality. Monitor and follow up on the design development critical path for collections as required. Identify and source new fabrics, trims, and materials from international suppliers. Skills & Expertise CLO 3D Workplace Work at office Employment Status Full Time Job Location Dhaka (DOHS Baridhara) Read Before Apply Expected salary s/b mentioned Apply Procedure Email Your CV Send your CV to the given email hiringcandidates.bd@gmail.com or Email your CV from My Bdjobs account Company Information A well-reputed garment buying house Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458858?ln=1",
    "company_name": "Udvash-Unmesh-Uttoron Education Family",
    "job_title": "Data Entry & Computer Operator",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Data Entry & Computer Operator : Udvash-Unmesh-Uttoron Education Family Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Udvash-Unmesh-Uttoron Education Family Data Entry & Computer Operator Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 15 Age: At most 32 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Graduate Currently studying (undergarduate) students are encouraged to apply Educational qualification is considerable If an applicant has enough training and experience in computer work Additional Requirements Age At most 32 years The candidate must be a non-smoker Willingness to work long hours even on any national & religious holiday Responsibilities & Context Have to operate in Adobe Photoshop, Illustrator, MS Word, and Excel programs. Data entry in Excel and Software. Good typing speed in both Bangla (Bijoy) & English (Minimum 30 WPM). And also skills in Equation typing. Should be dedicated to daily task completion. Skill in Internet Browsing and email correspondence. Keep close coordination with co-workers and update information. Any other task assigns by the management. Would be able to use updated version software. Compensation & Other Benefits Festival Bonus: 2 Salary Review: Yearly Leave Type: Casual, Medical, Wedding, Paternity/Maternity Leave Prayer Place & Arrangement of Prayer with Jamaat Friendly Working Environment and Collaborative Work Culture Other benefits as per organization policy Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Udvash-Unmesh-Uttoron Education Family Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am t"
  },
  {
    "url": "https://bdjobs.com/h/details/1458877?ln=1",
    "company_name": "Zentixsofttech Private Limited",
    "job_title": "Senior Software Developer",
    "location": "Dhaka (Nikunja)",
    "salary": null,
    "experience": "3 to 6 years",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "Senior Software Developer : Zentixsofttech Private Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Zentixsofttech Private Limited Senior Software Developer Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 25 to 48 years Location: Dhaka (Nikunja) Salary: Tk. 35000 - 70000 (Monthly) Experience: 3 to 6 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Experience 3 to 6 years The applicants should have experience in the following business area(s): Software Company, Business-to-Business (B2B) Software and Services Startup Additional Requirements Age 25 to 48 years Responsibilities & Context At Zentixsofttech Limited , we partner with businesses to turn ideas into scalable digital solutions. As a U.S.-based technology startup, we offer software development, growth strategy, digital marketing(SEO,PPC,SMM), sales support, and customer engagement services. Our focus is on building smarter systems, empowering teams, and creating meaningful customer experiences through innovation and automation. Senior Software Developer : Lead and manage a team of software developers in the design, development and maintenance of enterprise transportation management systems. Including custom dispatch/passenger/driver applications and transportation systems for shuttle, non-emergency medical and other transportation services. Oversee end-to-end software development processes, ensuring high-quality delivery of frontend and backend systems using technologies such as react, Java, Spring Boot, Node.js, PHP, Laravel and SQL. Guide system architecture decisions, cloud infrastructure design and DevOps practices within an AWS environment, including EC2, S3, IAM and CloudWatch. Direct the integration of AI/ML solutions, including predictive ETA systems and GraphHopper-based routing tools to enhance real-time navigation and operational efficiency. Collaborate with major clients to gather requirements and deliver tailored solutions, including custom routing logic, reporting tools and transactional systems. Manage CI/CD pipelines and support deployment automation and system monitoring across multiple environments. Mentor junior developers, conduct code reviews and enforce engineering best practices to maintain code quality, performance and scalability. Requirements: BSC in Computer Science, Computer Engineering or a Closely related field of study and 3 to 6 years of experience in software development using React, JQuery, JavaScript, CSS, Java, Spring Boot, Node.js, C#, SQL , DynamoDB, AWS, GraphHopper, PHP, laravel, Machine Learning tools and CI/CD to build custom dispatch/ passenger/driver applications and transportation systems "
  },
  {
    "url": "https://bdjobs.com/h/details/1458890?ln=1",
    "company_name": "Envobyte Ltd.",
    "job_title": "Android Developer (Mid–Senior)",
    "location": "Khulna, Khulna (Khulna Sadar)",
    "salary": null,
    "experience": "At least 3 years",
    "education": null,
    "deadline": "13 Mar 2026",
    "job_description": "Android Developer (Mid–Senior) : Envobyte Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Envobyte Ltd. Android Developer (Mid–Senior) Application Deadline : 13 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 46 years Location: Khulna, Khulna (Khulna Sa... Khulna, Khulna (Khulna Sadar) Salary: Negotiable Experience: At least 3 years Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 3 years The applicants should have experience in the following business area(s): IT Enabled Service, Software Company Additional Requirements Age 20 to 46 years 3–8 years of experience in Android app development Strong proficiency in Kotlin and Android SDK Experience with MVVM / Clean Architecture Experience building full KMP apps or strong willingness to work end-to-end in KMP Ability to handle Android-only and Android+iOS projects Experience with REST APIs, JSON, Firebase, Git, and async programming Good debugging, problem-solving, and communication skills Responsibilities & Context We are looking for Mid-level and Senior Android Developers to work on native Android applications and Kotlin Multiplatform (KMP) mobile apps for Android and iOS. The role involves building native Android apps as well as end-to-end KMP applications with shared business logic and platform-specific UI, delivering production-ready products using modern Kotlin-based architecture. Responsibilities: Develop and maintain native Android applications using Kotlin Build Kotlin Multiplatform (KMP) applications for Android & iOS Implement shared business logic and platform-specific UI in KMP projects Work with REST APIs, third-party SDKs, and Firebase services Debug, test, and optimize applications across platforms Ensure app performance, stability, and scalability Collaborate with designers, backend engineers, and QA Follow clean architecture and best coding practices Additional Responsibilities (Senior Role): Design and own app architecture for native and KMP projects Lead development of complex features and multi-platform releases Optimize performance, build size, and memory usage Review code, mentor developers, and guide technical decisions Skills & Expertise Android application development Android SDK Firebase Git iOS Kotlin native android RESTful API Compensation & Other Benefits Performance bonus Festival Bonus: 2 Lunch Facilities: Partially Subsidize Salary Review: Yearly Quarterly Performance Bonus Annual 10 Casual & 14 Sick Leave 6 Weekly holidays per month 16 Festival Holidays Unlimited tea, coffee, and Snacks Leave Encashment Beautiful Workspace Dedicated space for prayer Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Khulna, Khulna (Khulna Sadar) Job Highlights 2 Festiva"
  },
  {
    "url": "https://bdjobs.com/h/details/1458725?ln=1",
    "company_name": "A Reputed Manufacturing Company",
    "job_title": "Chief Financial Officer (CFO)",
    "location": "Chattogram (Chattogram Sadar)",
    "salary": null,
    "experience": "At least 15 years",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Chief Financial Officer (CFO) : A Reputed Manufacturing Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Manufacturing Company Chief Financial Officer (CFO) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 35 years Location: Chattogram (Chattogram Sa... Chattogram (Chattogram Sadar) Salary: Negotiable Experience: At least 15 years Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Master of Business Administration (MBA) in Finance & Banking Master of Business Administration (MBA) in Accounting Qualified CA / CMA / ACCA / FCA. Experience At least 15 years The applicants should have experience in the following business area(s): Engineering Firms Additional Requirements Age At least 35 years Responsibilities & Context Role Overview: We are looking for a visionary Chief Financial Officer (CFO) to take charge of our financial operations. The ideal candidate will not only manage the numbers but also interpret them to drive strategic growth. You will lead our Accounts & Finance team, ensuring accuracy in reporting while navigating complex banking, tax, and legal landscapes. Key Responsibilities: Strategic Financial Leadership & Analysis and Capital Management: Analyze key financial reports— COGS, P&L, Cash Flow, and Balance Sheet —to provide actionable insights to the Board. Translate financial data into strategic decisions to improve profitability and operational efficiency. Identify cost drivers and revenue opportunities through deep analysis of monthly management reports. Optimize existing financial obligations, reduce high-interest liabilities, and secure cost-effective funding. Team Leadership & Governance: Mentor and guide the Accounts & Finance team , ensuring strict adherence to accounting standards and company policies. Oversee the preparation of timely and accurate financial statements. Establish strong internal controls to prevent leakage and ensure data integrity. Banking, Fund Management & Costing: Lead negotiations with banks or other financial institutions for loan restructuring, interest rate reduction, and low-cost fund sourcing. Oversee product costing to minimize wastage and maximize gross margins in a high-volume manufacturing environment. Taxation, VAT & Legal Compliance: Manage and negotiate corporate Tax, VAT, and Customs matters directly with authorities. Handle legal and regulatory issues proactively to mitigate company risk. Profit Maximization: Lead product costing strategies to improve gross margins in a high-utilization manufacturing environment. Skills : Expert in Financial Reporting: Ability to read \"between the lines\" of financial statements to guide business strategy. Strong Leader: Proven experience in managing and grooming finance teams. Negotiator: Excellent capability to d"
  },
  {
    "url": "https://bdjobs.com/h/details/1422573?ln=1",
    "company_name": "Glorious Consultancy",
    "job_title": "INTERN",
    "location": "Dhaka (Dhanmondi 32), Rajshahi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "INTERN : Glorious Consultancy Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Glorious Consultancy INTERN Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 5 Age: 20 to 40 years Location: Dhaka (Dhanmondi 32), Raj... Dhaka (Dhanmondi 32), Rajshahi Salary: Tk. 7000 - 14000 (Monthly) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Diploma Additional Requirements Age 20 to 40 years Responsibilities & Context INTERN Compensation & Other Benefits Mobile bill,Tour allowance,Profit share Salary Review: Half Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Dhanmondi 32), Rajshahi Company Information Glorious Consultancy Follow Address: house-151, 2nd Floor, LAKE CIRCUS ( LONG LIFE HOSPITAL ROAD, OPPOSITE SHEIKH RASELPARK) KOLABAGAN , DHAKA. Website: www.gloriousconsultancybd.com Business: Glorious Consultancy is One of the Best Study Abroad Agency in Bangladesh. 100% Scholarship Process for Diploma, Bachelor, Master`s & PHD Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458805?ln=1",
    "company_name": "PRAN Group",
    "job_title": "Assistant Manager-Admin(Factory)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "3 to 7 years",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Assistant Manager-Admin(Factory) : PRAN Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List PRAN Group Assistant Manager-Admin(Factory) Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 40 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: 3 to 7 years Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Bachelor’s degree in Business Administration, Management, or a related field. An MBA will be an added advantage Experience 3 to 7 years The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM), Beverage, Dairy, Food (Packaged)/Beverage, Garments, Group of Companies, Manufacturing (FMCG), Manufacturing (Light Engineering and Heavy Industry), Retail Store, Textile Additional Requirements Age 25 to 40 years Strong knowledge of factory administrative processes and facility management Excellent understanding of statutory compliance related to factory operations Proficient in MS Office (Word, Excel, PowerPoint) Outstanding communication, interpersonal, and negotiation skills Proven ability to handle multiple tasks, prioritize effectively, and work under pressure Strong leadership qualities with a proactive and solution-oriented approach Responsibilities & Context Oversee day-to-day administrative functions including front desk, housekeeping, security, and canteen services Ensure compliance with company policies and statutory requirements related to factory administration Maintain and manage factory documentation, records, and reports Supervise the maintenance of factory buildings, offices, utilities (power, water), and other infrastructure Coordinate with the technical/maintenance department for facility upkeep and repairs Manage inventory and procurement of administrative supplies, stationery, and other non-production materials Oversee the factory transport system (employee buses/vehicles) and parking management Ensure a safe, clean, and productive work environment for all employees Implement and monitor security protocols in coordination with security agencies Assist in organizing employee welfare activities and events Liaise with government authorities for licenses, inspections, and renewals related to factory administration Support the implementation of safety standards and protocols across the facility Manage documentation for audits and ensure all administrative areas are audit-ready Lead, train, and motivate the administrative support staff Assign duties and monitor performance to ensure high standards of service Skills & Expertise Administration Compliance Management Factory HR Administration Compensation & Other Benefits Provident fund,Pension policy,Mobile bill,Performance bonus,Insurance Lunch Facili"
  },
  {
    "url": "https://bdjobs.com/h/details/1458881?ln=1",
    "company_name": "Akij Venture Ltd.",
    "job_title": "Operator/Sr. Operator, Preform Machine",
    "location": "Habiganj",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Operator/Sr. Operator, Preform Machine : Akij Venture Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Venture Ltd. Operator/Sr. Operator, Preform Machine Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 35 years Location: Habiganj Salary: Negotiable Experience: At least 5 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma SSC Experience At least 5 years The applicants should have experience in the following business area(s): Beverage, Bicycle, Food (Packaged), Group of Companies, Healthcare/Lifestyle product, Insurance Additional Requirements Age 22 to 35 years Experience in the Husky Preform Machine, X-form (SIPA) Preform Machine and SACMI Closure Machine (CCM) Operating. Responsibilities & Context Husky Preform Machine, X-form (SIPA) Preform Machine. Daily Machine Maintenance (CLIT) Ensuring Product Quality of Each machine ensuring Customer Complaint prevention and Complaint free product ensuring. 5S, GMP and ISO Ensuring. Skills & Expertise Suggested by CCM Operation Customer Complaint Machine Operating Monitoring and Evaluation Compensation & Other Benefits Lunch Facilities: Partially Subsidize Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Habiganj Job Highlights We are seeking a Production Operator/Sr. Operator with a minimum 05 years of experience, for Preform Machine Operations and monitoring, along with strong coordination skills. Company Information Akij Venture Ltd. Follow More jobs from this company Address: Akij House, 198, Bir Uttam Mir Shawkat Sarak, (Gulshan Link Road), Tejgaon, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE"
  },
  {
    "url": "https://bdjobs.com/h/details/1458812?ln=1",
    "company_name": "Central University of Science & Technology (CUST)",
    "job_title": "Deputy Registrar",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "5 to 9 years",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Deputy Registrar : Central University of Science & Technology (CUST) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Central University of Science & Technology (CUST) Deputy Registrar Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Age: At least 30 years Location: Dhaka Salary: Negotiable Experience: 5 to 9 years Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Masters Experience 5 to 9 years The applicants should have experience in the following business area(s): University Additional Requirements Age At least 30 years Minimum 5 to 7 years of relevant experience in university or academic administration. Experience as Assistant Registrar or Registrar will be preferred. Sound knowledge of university rules, regulations, and academic procedures. Strong administrative, coordination, and organizational skills. Ability to prepare official documents, reports, and records. Proficiency in computer applications and office management systems. Excellent communication and interpersonal skills. Administrative expertise will be an advantage. Integrity, leadership, and a high sense of responsibility. Responsibilities & Context Job Context Central University of Science & Technology (CUST) invites applications from qualified, experienced, and dedicated professionals for the position of Deputy Registrar to support and manage the university’s academic and administrative operations in accordance with institutional policies and regulatory requirements. Job Responsibilities Assist the Registrar in overall academic and administrative management Implement university statutes, ordinances, rules, and regulations Coordinate academic records, faculty affairs, and administrative documentation Prepare and maintain official notices, circulars, reports, and correspondence Support admission, examination, convocation, and academic council activities Maintain personnel records and official files Liaise with academic departments, offices, and regulatory bodies (UGC, etc.) Supervise administrative staff and ensure smooth office operations Ensure compliance with university policies and regulatory guidelines Perform any other duties assigned by the university authority Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Central University of Science & Technology (CUST) Follow More jobs from this company Address: Plot: 1/9, Road: 2, Block: D, Section: 15, Mirpur, Dhaka-1216, Bangladesh Website: https://www.cust.edu.bd/ Business: Private University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি প"
  },
  {
    "url": "https://bdjobs.com/h/details/1458749?ln=1",
    "company_name": "Keda Building Materials Industri Ltd",
    "job_title": "ডাইরেক্টর (প্রোডাকশন)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "10 to 12 years",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "ডাইরেক্টর (প্রোডাকশন) : Keda Building Materials Industri Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Keda Building Materials Industri Ltd ডাইরেক্টর (প্রোডাকশন) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Experience: 10 to 12 years Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Master of Business Administration (MBA) Masters Experience 10 to 12 years The applicants should have experience in the following business area(s): Development Agency, Developer Additional Requirements যোগ্যতা ও অভিজ্ঞতা: মাস্টার্স/এমবিএ ডিগ্রী সহ কোন খ্যাতনামা প্রতিষ্ঠানে সংশ্লিষ্ট পদে ১০-১২ বছরের বাস্তব অভিজ্ঞতা সম্পন্ন। অভিজ্ঞ প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য। Responsibilities & Context বাংলাদেশ ও বিদেশী বিনিয়োগে স্থাপিত একটি বিল্ডিং ম্যাটেরিয়াল (এলুমিনিয়াম এর দরজা এবং জানালার লক ও হুইল) প্রস্তুতকারক প্রতিষ্ঠানে অভিজ্ঞতা সম্পন্ন লোক নিয়োগ করা হবে। Compensation & Other Benefits বেতন: বেতন ও অন্যান্য সুযোগ সুবিধা আলোচনা সাপেক্ষে। Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Keda Building Materials Industri Ltd Follow More jobs from this company Address: Room # 23, (1st Floorl), Land view Commercial Centre, Gulshan-2, DHAKA-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App"
  },
  {
    "url": "https://bdjobs.com/h/details/1458655?ln=1",
    "company_name": "Palashipara Samaj Kallayan Samity (PSKS)",
    "job_title": "ব্যবস্থাপক",
    "location": "Chuadanga, Kushtia, Meherpur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "ব্যবস্থাপক : Palashipara Samaj Kallayan Samity (PSKS) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Palashipara Samaj Kallayan Samity (PSKS) ব্যবস্থাপক Application Deadline : 25 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 04 Age: 25 to 35 years Location: Chuadanga, Kushtia, Meher... Chuadanga, Kushtia, Meherpur Salary: Tk. 36782 - 36782 (Monthly) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years পিকেএসএফ-এর সহযোগী সংস্থায় ঋণ-কার্যক্রমের সংশ্লিষ্ট পদে কমপক্ষে 3 (তিন) বছরের বাস্তব অভিজ্ঞতা থাকতে হবে । পিকেএসএফ-এর অর্থায়নে পরিচালিত সহযোগি সংস্থায় ঋণ-কার্যক্রমের শাখা ব্যবস্থাপক ও ব্যবস্থাপক (অডিট/মনিটরিং) পদে অভিজ্ঞতা সম্পন্ন প্রার্থীদের অগ্রাধিকার দেওয়া হবে। কম্পিউটার পরিচালনায় দক্ষতা, ভ্যাট ও ট্যাক্স সংক্রান্ত বিষয়, হিসাব বিভাগের নথিপত্র যাচাইয়ের কাজে পারদর্শী হতে হবে। বয়স ২৫-৩৫ বছর (অধিক অভিজ্ঞ প্রার্থীদের ক্ষেত্রে বয়স শিথিলযোগ্য); মোটর সাইকেল চালানোর বৈধ লাইসেন্স থাকতে হবে; কম্পিউটার চালনায় (এমএস ওয়ার্ড, এক্সেল, পাওয়ারপয়েন্ট, ইমেইল) দক্ষতা থাকতে হবে; জামানত প্রযোজ্য; Responsibilities & Context Job Context: পলাশীপাড়া সমাজ কল্যাণ সমিতি (পিএসকেএস) একটি বেসরকারী উন্নয়ন সংস্থা বিভিন্ন উন্নয়নমূলক কার্যক্রম বাস্তবায়ন করে আসছে। সংস্থার ক্ষুদ্রঋণ কর্মসূচি সম্প্রসারণের লক্ষ্যে জরুরী ভিত্তিতে উল্লেখিত পদে দক্ষ কর্মী নিয়োগের জন্য অভিজ্ঞ প্রার্থীদের নিকট থেকে দরখাস্ত আহবান করা হচ্ছে। Major Responsibility: শাখা অফিস কর্মী কর্তৃক সাপ্তাহিক/মাসিক/ত্রৈমাসিক/ষান্মাসিক/বাৎসরিক প্রদত্ত সকল কাজ কর্ম ও প্রতিবেদন/রিপোর্ট পর্যালোচনা করা ও তাদেরকে প্রয়োজনীয় ফিড ব্যাক দেয়া; কর্মসূচীর সাপ্তাহিক/মাসিক/ত্রৈমাসিক/ষান্মাসিক/বাৎসরিক প্রতিবেদন তৈরী করা ও সময়মত কর্তৃপক্ষকে প্রদান করা । মাঠকর্মীরা সাপ্তাহিক সভা সঠিকভাবে পরিচালনা করছেন কি-না তা পর্যবেক্ষণ করবেন ও প্রয়োজনীয় পরামর্শ প্রদান করবেন। মাঠকর্মীদের নিকট হতে সমিতির সদস্যদের ঋণ প্রস্তাব গ্রহণ করবেন এবং পরবর্তী প্রয়োজনীয় ব্যবস্থা গ্রহণ করবেন। উপকারভোগীদের মধ্যে বিতরণকৃত ঋণ সুষ্ঠুভাবে প্রকল্প অনুযায়ী ব্যবহার হচ্ছে কিনা এবং তা নির্ধারিত শর্তানুযায়ী আদায় হচ্ছে কিনা তা অনুসরণ করবেন এবং প্রয়োজনীয় পদক্ষেপ গ্রহণ করবেন। আর্থিক নির্দেশিকা অনুযায়ী হিসাব নিকাশ পরিচালনা করা এবং সকল নথি সংরক্ষণ নিশ্চিত করা; জেলা ও উপজেলা পর্যায়ের কর্মকর্তা এবং উর্দ্ধতন কর্তৃপক্ষের সাথে সমন্বয় সাধন করা ও তাদেরকে প্রকল্পের কাজকর্ম নিয়মিত অবহিত করা; মাঠে কি কি সমস্যা হচ্ছে তা চিহ্নিত করে সমাধানের চেষ্টা করবেন এবং প্রয়োজনে উর্দ্ধতন কর্তৃপক্ষকে এ সম্পর্কে অবহিত করবেন যাতে সমস্যার সমাধান খুঁজে পাওয়া যায়; শাখা অফিসের চাহিদা অনুযায়ী দ্রব্য-সামগ্রীর চাহিদা নিরুপণ করে কর্তৃপক্ষের অনুমোদন নেয়া করা এবং তদানুযায়ী ক্রয় নিশ্চিত করা; ষ্টোরের মালামাল ও পুরাতন নথিপত্র নির্দেশ মোতাবেক যথাযথভাবে সংরক্ষণ নিশ্চিত করা । শাখা পর্যায়ে সকল কর্মীদের কাজের মূল্যায়ন করা । নিরীক্ষা প্রতিবেদন তৈরী করা;শাখা পর্যায়ে সকল কর্মীদের কাজের মূল্যায়ন করা । সংস্থা ও দাতা সংস্থার নিয়ম-নীতি অনুযায়ী এবং সরকারের চাহিদ"
  },
  {
    "url": "https://bdjobs.com/h/details/1458789?ln=1",
    "company_name": "DBL Pharmaceuticals Ltd.",
    "job_title": "Territory Officer, Sales",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Territory Officer, Sales : DBL Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List DBL Pharmaceuticals Ltd. Territory Officer, Sales Application Deadline : 15 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At most 32 years Location: Anywhere in Bangladesh Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age At most 32 years Graduate in any discipline having Science up to SSC level Willing to work anywhere in Bangladesh Good communication skills both in English & Bangla Responsibilities & Context Promote Pharmaceutical products to Doctors for generating prescriptions Visit chemist shop to collect orders for achieving the sales target Compensation & Other Benefits Attractive compensation package Quarterly incentive Competitive TA & DA Provident fund (PF) Festival bonus Mobile bill allowance Smart phone & motor cycle Training allowance Group insurance Employment Status Full Time Job Location Anywhere in Bangladesh Apply Procedure Email Your CV Send your CV to the given email hr@dbl-pharma.com Company Information DBL Pharmaceuticals Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458792?ln=1",
    "company_name": "Central University of Science & Technology (CUST)",
    "job_title": "Librarian",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Librarian : Central University of Science & Technology (CUST) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Central University of Science & Technology (CUST) Librarian Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Age: 26 to 55 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 55 years Master’s degree in Library and Information Science (MLIS) from a recognized university. Academic qualifications must be acceptable as per UGC private university rules. Relevant experience in a university or higher education institution. Experience in a UGC-approved private university will be highly preferred. Sound knowledge of UGC regulations related to university libraries. Proficiency in computer applications, digital libraries, and academic databases. Ability to prepare official reports and compliance documents. Strong communication, administrative, and leadership skills. Responsibilities & Context Context: Central University of Science & Technology (CUST), a UGC-approved private university, invites applications from qualified and experienced professionals for the position of Librarian. The selected candidate will be responsible for managing the university library in compliance with UGC regulations, accreditation requirements, and institutional academic standards. Responsibilities: Plan, organize, and manage all library operations in line with UGC guidelines Develop and maintain print, digital, and electronic library collections Ensure availability of prescribed books, journals, and reference materials for all academic programs Manage library automation systems (e.g., Koha, DSpace, or similar) Maintain proper cataloguing, classification, circulation, and documentation Provide research and reference support to faculty members and students Prepare library reports, statistics, and documentation for UGC inspection and audit Support accreditation, quality assurance, and ranking-related activities Supervise and evaluate library staff Ensure a disciplined, user-friendly, and academically supportive library environment Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Central University of Science & Technology (CUST) Follow More jobs from this company Address: Plot: 1/9, Road: 2, Block: D, Section: 15, Mirpur, Dhaka-1216, Bangladesh Website: https://www.cust.edu.bd/ Business: Private University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458786?ln=1",
    "company_name": "Quality Feeds Limited",
    "job_title": "Jr. Officer/Officer – Marketing (Franchise & HORECA)",
    "location": "Bogura, Dhaka, Khulna, Sylhet",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Jr. Officer/Officer – Marketing (Franchise & HORECA) : Quality Feeds Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Quality Feeds Limited Jr. Officer/Officer – Marketing (Franchise & HORECA) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 26 to 32 years Location: Bogura, Dhaka, Khulna, Sy... Bogura, Dhaka, Khulna, Sylhet Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 32 years Strong communication, negotiation and interpersonal skills Sound knowledge of franchise operations and HORECA business channels Ability to work independently and meet sales targets Good analytical and reporting skills Willingness to travel extensively within assigned territories Basic computer skills (MS Word, Excel, Email) Responsibilities & Context Quality Integrated Agro Limited, a concern of Quality Feeds Limited, is seeking dynamic and result oriented professionals for the position of Jr Officer/Officer – Marketing (Franchise & HORECA). The role involves developing and managing franchise partners and HORECA (Hotel, Restaurant & Cafe) clients, expanding market presence, increasing sales volume, and maintaining strong customer relationships across assigned territories. Responsibilities Identify, develop and onboard new franchise partners in assigned locations Maintain regular communication with franchise partners to ensure sales growth and brand compliance Monitor franchise performance and provide necessary marketing and operational support Ensure proper product display, branding, and promotional execution at franchise outlets Achieve sales targets by promoting company products to HORECA clients Conduct regular market visits to understand customer needs and competitor’s activities Negotiate pricing, terms, and contracts within company policy Implement approved sales and marketing strategies to increase market penetration Collect market intelligence and provide feedback to management Prepare and submit daily, weekly, and monthly sales and activity reports Skills & Expertise communication and interpersonal skill. Negotiation Compensation & Other Benefits Gratuity,Insurance,Performance bonus,Mobile bill Salary Review: Yearly Festival Bonus: 2 Competitive salary based on experience and performance TA/DA and other benefits as per company rules Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Bogura, Dhaka, Khulna, Sylhet Company Information Quality Feeds Limited Follow More jobs from this company Address: House- 14, Road- 07, Sector-4, Uttara, Dhaka- 1230. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন"
  },
  {
    "url": "https://bdjobs.com/h/details/1458758?ln=1",
    "company_name": "Al Fatah Publications",
    "job_title": "Executive",
    "location": "Dhaka (Malibagh)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Executive : Al Fatah Publications Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Al Fatah Publications Executive Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 26 to 32 years Location: Dhaka (Malibagh) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 32 years Proficiency in MS Office applications (MS Excel, MS Word, MS Outlook). Basic understanding of MIS software and data entry processes. Good verbal communication skills, especially over phone calls. Strong attention to detail and record-keeping ability. Responsibilities & Context To handle incoming and outgoing specimen-related inquiries over phone calls. Make follow-up phone calls to teachers and relevant stakeholders to ensure specimen copies have been properly sent and received. Maintain and update TSO specimen accounts accurately in the MIS software. Ensure timely adjustment and reconciliation of specimen distribution against TSO accounts. Communicate and coordinate regularly with the Audit and Accounts departments to resolve discrepancies. Ensure proper documentation of specimen distribution, confirmations, and adjustments. Prepare regular reports on specimen distribution status and submit them to management. Support the Sales & Marketing team in ensuring transparent and controlled specimen management. Skills & Expertise Call Center Sales & Marketing Telemarketing Compensation & Other Benefits Mobile bill,Provident fund,Profit share Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Malibagh) Company Information Al Fatah Publications Follow Address: 260/1, Malibag, Near of HOSAF Convention Center, Opposite of Dhaka Biggan College, Dhaka -1217 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow "
  },
  {
    "url": "https://bdjobs.com/h/details/1458763?ln=1",
    "company_name": "Keda Building Materials Industri Ltd",
    "job_title": "টেকনিশিয়ান (মেকানিক্যাল)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "টেকনিশিয়ান (মেকানিক্যাল) : Keda Building Materials Industri Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Keda Building Materials Industri Ltd টেকনিশিয়ান (মেকানিক্যাল) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Location: Anywhere in Bangladesh Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements যোগ্যতা ও অভিজ্ঞতাঃ যে কোন শিক্ষা প্রতিষ্ঠান হতে সংশ্লিস্ট বিষয়ে ডিপ্লোমা পাসসহ সংশ্লিষ্ট কাজে ৪-৫ বছরের বাস্তব অভিজ্ঞতা সম্পন্ন। অভিজ্ঞ প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য। Responsibilities & Context বাংলাদেশ ও বিদেশী বিনিয়োগে স্থাপিত একটি বিল্ডিং ম্যাটেরিয়াল (এলুমিনিয়াম এর দরজা এবং জানালার লক ও হুইল) প্রস্তুতকারক প্রতিষ্ঠানে অভিজ্ঞতা সম্পন্ন লোক নিয়োগ করা হবে। Compensation & Other Benefits বেতন: বেতন ও অন্যান্য সুযোগ সুবিধা আলোচনা সাপেক্ষে। Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Keda Building Materials Industri Ltd Follow More jobs from this company Address: Room # 23, (1st Floorl), Land view Commercial Centre, Gulshan-2, DHAKA-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458768?ln=1",
    "company_name": "Global Tech Advantage",
    "job_title": "Sales & Marketing Manager",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Sales & Marketing Manager : Global Tech Advantage Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Global Tech Advantage Sales & Marketing Manager Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Education may be relaxed for experienced candidates Minimum 1 year experience in Domain & Hosting, Internet Bandwidth, or Software Sales Fresh but confident candidates may apply for Executive position Excellent communication and negotiation skills Knowledge of digital marketing and social media platforms Ability to work independently and under pressure Computer literacy (MS Office, Email, CRM tools preferred) Field marketing experience will be an added advantage Responsibilities & Context Global Tech Advantage is a growing technology solutions company providing Domain & Hosting services, Internet Bandwidth solutions, Software Development, and Software Product Sales. We are seeking motivated and experienced Sales & Marketing professionals to expand our business through online and offline marketing channels. Job Location: Dhaka (Office & Field Based) Job Responsibilities Sell and promote Domain, Hosting, Internet Bandwidth, and Software solutions Execute online & offline sales and marketing activities Identify and develop new corporate and individual clients Maintain strong relationships with existing customers Prepare proposals, quotations, and sales reports Achieve assigned monthly and yearly sales targets Coordinate with internal technical and support teams Participate in meetings, marketing campaigns, and client visits Skills & Expertise Suggested by Sales & Marketing Sales Sales target Customer Service Consumer Durables - Sales & Marketing Compensation & Other Benefits Salary Based on experience and performance Sales commission and performance incentives Festival bonuses Career growth opportunity Professional working environment Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply Interested candidates are requested to send their updated CV with a recent photograph or contact directly: Email: [info@gtabd.com](info@gtabd.com) Phone: 01704170303 Please mention \"Sales & Marketing Manager/Executive\" in the subject line. Apply Procedure Email Your CV Send your CV to the given email info@gtabd.com or Email your CV from My Bdjobs account Company Information Global Tech Advantage Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার"
  },
  {
    "url": "https://bdjobs.com/h/details/1458652?ln=1",
    "company_name": "Badal And Company",
    "job_title": "Executive, Administration & Store Management - Garage",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Executive, Administration & Store Management - Garage : Badal And Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Badal And Company Executive, Administration & Store Management - Garage Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Age: 27 to 35 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: 3 to 5 years Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Diploma or training in Automobile / Mechanical / Store Management will be preferred Relevant technical or professional training will be an added advantage. Experience 3 to 5 years The applicants should have experience in the following business area(s): Clearing and Forwarding (C and F) Companies, Freight forwarding Additional Requirements Age 27 to 35 years Minimum 3–5 years of relevant experience in administration and store management. Hands-on experience in workshop/garage handling (mandatory). Strong knowledge of vehicle spare parts and inventory control. Good communication and coordination skills. Ability to work independently and manage pressure. Responsibilities & Context Manage overall administrative operations related to workshop and store. Supervise garage/workshop activities , including vehicle repair, servicing, and maintenance coordination. Control and maintain inventory of vehicle spare parts, tools, lubricants, and consumables . Ensure proper store documentation (GRN, Issue Register, Stock Ledger, Bin Card). Monitor vehicle maintenance schedules and coordinate with mechanics and vendors. Prepare monthly inventory, maintenance, and consumption reports . Ensure compliance with safety, operational, and company policies . Coordinate with transport and operations teams for vehicle availability. Handle vendor communication for spare parts procurement and workshop services. Skills & Expertise Suggested by Administration Management Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Badal And Company Follow Address: RH Home Center (6th Floor) 74/B/1,Green Road, Dhaka-1215 Website: https://www.badalandco.com/ Business: We feel great pleasure to introduce ourselves that, we are Badal® and Company. One of the leading and oldest Freight Forwarding and Customs Clearing & Forwarding (C&F) Agent in Bangladesh. We are Operating & Handling combine extensive customs clearing and forwarding experience with the latest in information technology in this business since 1981. Badal® and Company is offering complete Import and Export customs clearance services at all major air and sea ports in Bangladesh. We have been working in Bangladesh with Dhaka and Chittagong Office. In order to meet the growing demand for a reliable global logistics service moving around in t"
  },
  {
    "url": "https://bdjobs.com/h/details/1458760?ln=1",
    "company_name": "Top Ten Group",
    "job_title": "Junior Executive - VAT",
    "location": "Dhaka (Mirpur 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Junior Executive - VAT : Top Ten Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Top Ten Group Junior Executive - VAT Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 40 years Location: Dhaka (Mirpur 1) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 40 years Proficient in VAT Online System and e-Challan. Skilled in Excel and accounting software. Strong understanding and application of laws and regulations. Excellent communication and coordination skills, particularly with the Commissioner’s office. Strong problem-solving abilities. High level of integrity, confidentiality, and responsibility. Ability to complete tasks within deadlines. Responsibilities & Context 1. VAT Law & Compliance Maintain knowledge of the VAT Act 2012, relevant rules, SROs, and circulars, and ensure proper implementation. Accurately determine HS Codes for goods and services. Keep updated on applicable VAT rates, exemptions, and truncated rates. 2. VAT Registration & Return Filing Assist in BIN registration and renewal processes. Prepare and submit monthly VAT returns (Mushak-9.1) to the National Board of Revenue (NBR). 3. Mushak Forms & Record Keeping Maintain and update all Mushak forms in a timely manner. 4. VAT Challan & Payment Issue VAT challans and utilise the e-Challan system. Prepare and submit monthly VAT payment calculations. Maintain records of VAT challans and tax invoices. 5. Audit & Investigation Support Assist in audits, inspections, and investigations conducted by the VAT office. Prepare and maintain all necessary documents, reports, and statements. 6. Coordination & Reporting Coordinate VAT-related matters with Accounts, Procurement, and Sales teams. Provide management with monthly VAT liabilities and reports. Notify management of any changes in VAT laws. Compensation & Other Benefits Mobile bill Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Other Benefit as per company policy. Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur 1) Company Information Top Ten Group Follow More jobs from this company Address: 13-14 Mollik Tower (1st Floor),Zoo Road,Section-1,Mirpur,Dhaka-1216 Website: https://www.toptengroupbd.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , "
  },
  {
    "url": "https://bdjobs.com/h/details/1458741?ln=1",
    "company_name": "LAMB",
    "job_title": "Internal Auditor (Re-advertisement)",
    "location": "Dinajpur (Parbatipur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Internal Auditor (Re-advertisement) : LAMB Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List LAMB Internal Auditor (Re-advertisement) Application Deadline : 26 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 45 years Location: Dinajpur (Parbatipur) Salary: Tk. 30000 (Monthly) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 45 years At least 3 to 5 years working experience in internal auditing or over 10 years’ experience with multiple donors or projects. At least 3 to 5 years working experience in internal auditing or over 10 years’ experience with multiple donors or projects. Good understanding and training on various kinds of Government laws/ regulations such as VAT and Tax, income tax, etc. Ability to scrutinize large amounts of data and to compile detailed reports. High attention to detail and excellent analytical skills. Preference will be given with external auditing experience in a creditable audit firm in Bangladesh. A valid motorcycle driving license is required. Willingness to travel and stay overnight in field centres as required. Responsibilities & Context LAMB is a well-run major mission Hospital, Community Health Development, Training and Research organization. Services cover more than 6.3 million people in North West Bangladesh. Job Summary: The Internal Auditor is responsible for planning, executing and reporting on operational, financial regulatory and compliance related audits of LAMB departments and projects including government compliance, under the direction of the Finance Director (or Executive Director in his/her absence). Review and examine data, looking for patterns and identifying shortages and loss. Report in English, findings, conclusions and/or recommendations for improvements of processes and procedures (based on policy and best practice) to management of department and projects. Improve LAMB operations through recommendations for bringing systematic and disciplined approaches to the effectiveness of risk management and control processes. Provide support whenever needed or as required by the Finance Director and the Executive Director. Job Responsibilities: Develop a comprehensive internal audit program for LAMB. Plan and perform financial, regulatory, compliance and operational reviews/audits of LAMB departments and projects in accordance with the internal audit program. Assist the Finance Director to determine internal audit scope and develop annual plans including review and updating of annual plans and scheduling for the coming year Review and discuss all audit findings with the Finance Director periodically and other matter at other other such times as necessary. Create, perform and control the full audit cycle including risk"
  },
  {
    "url": "https://bdjobs.com/h/details/1458781?ln=1",
    "company_name": "Rahimafrooz Bangladesh Limited",
    "job_title": "Manager-Internal Audit and Compliance",
    "location": "Dhaka",
    "salary": null,
    "experience": "8 to 10 years",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Manager-Internal Audit and Compliance : Rahimafrooz Bangladesh Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rahimafrooz Bangladesh Limited Manager-Internal Audit and Compliance Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 42 years Location: Dhaka Salary: Negotiable Experience: 8 to 10 years Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Master of Commerce (MCom) in Accounting CA Course Completed (Partly Qualified) from a reputed firm. Experience 8 to 10 years The applicants should have experience in the following business area(s): Automobile, Battery, Storage cell, Group of Companies, Manufacturing (FMCG), Motor Workshop, Power, Super store Additional Requirements Age At most 42 years Responsibilities & Context Internal Audit and Compliance is a key pillar for good corporate governance. The assurance work carried out by internal auditors will play a significant part in the organization's risk management processes. Internal auditing is an independent, objective assurance and consulting activity designed to add value and improve an organisation’s operations. Internal control comprises the methods and means in place to achieve corporate objectives for business sustainability. The Board of Directors has the fundamental obligation to ensure that an effective and efficient system of the internal control is in place. Internal audit is responsible for reviewing and reporting on this control framework to the Board Audit committee, a sub-committee of the Board. ACCOUNTABILITIES: Assisting in developing and maintaining a risk-based compliance/Internal Audit Plan that assesses the adequacy and effectiveness of internal controls and processes and the reliability and integrity of operational and related financial information. Conducting internal audits of various operational processes in line with corporate policies and guidelines, producing reports that highlight audit findings and issues / control weaknesses, making recommendations to improve the efficiency and effectiveness of internal controls. Conducting MIS review, highlighting any accounting issues and related control weaknesses, recommend management accordingly for better financial reporting. Follow-up review of issues identified and addressed to SBU as per their action plan. Review presentations and disclosures of statutory financial statements of SBUs’ (as and when require) and recommend for improvement in line with Financial Reporting Standards and other related laws and regulations Conduct or assist special audit / financial irregularities investigations (as and when require) as advised by Head of Compliance & Audit / Board Audit Committee. Visit to outstation of SBUs as and when required. Skills & Expertise Accounting Audit Business "
  },
  {
    "url": "https://bdjobs.com/h/details/1454878?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458809?ln=1",
    "company_name": "Safwan Bashundhara Global",
    "job_title": "Asst. Executive/Executive (Store) Paper Mills",
    "location": "Narayanganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Asst. Executive/Executive (Store) Paper Mills : Safwan Bashundhara Global Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Safwan Bashundhara Global Asst. Executive/Executive (Store) Paper Mills Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 23 to 35 years Location: Narayanganj Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 23 to 35 years Can do work under pressure Good communication skills. Good report writing skills. Sound knowledge on MS Office Responsibilities & Context If you`re looking for a role where you can continue to make an impression, take the next step at Safwan Bashundhara Global where your contributions will always be valued. We are looking for an ambitious individual to join this team in the role of Asst. Executive/Executive (Store) for Paper Mills. Responsible for FRM & Chemicals inventory, works independently. Properly maintain incoming Raw Materials and chemicals. Responsible for the operation of SAP software. Receive materials and store them systematically. Check the quality of received materials. Physical inventory counting, cycle counting, ensuring SOPs & operational processes are being followed. Distribute store materials to concern units as per requisition. Prepare material requisition and proceed further. To maintain FIFO&LIFO when issuing materials. Keep proper records of received stores and keep track of surplus stores/materials. Skills & Expertise Store/ inventory Store Management Compensation & Other Benefits T/A,Mobile bill,Provident fund,Gratuity Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Other benefits as per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Narayanganj Company Information Safwan Bashundhara Global Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the"
  },
  {
    "url": "https://bdjobs.com/h/details/1458866?ln=1",
    "company_name": "Institute of Applied Health Sciences Hospital(IAHS-H), USTC Complex, Foy’ Lake, Khulshi, Chattogram",
    "job_title": "Deputy Director",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Deputy Director : Institute of Applied Health Sciences Hospital(IAHS-H), USTC Complex, Foy’ Lake, Khulshi, Chattogram Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Institute of Applied Health Sciences Hospital(IAHS-H), USTC Complex, Foy’ Lake, Khulshi, Chattogram Deputy Director Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: At least 35 years Location: Chattogram Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 35 years Good managerial and organizational skills, as well as excellent medical knowledge and training, Responsibilities & Context Applications are invited from energetic, self-motivated and experienced candidates for the  position of Deputy Director, IAHS-H on the prevailing terms  and conditions. Job Responsibilities Supporting Hospital Director to ensure smooth day to day operation. Assisting in planning, organizing, and directing hospital operations. Supporting the development and implementation of hospital policies, procedures, and protocols. Monitoring and evaluating hospital performance metrics (e.g., patient flow, efficiency, costs). Ensuring cross-departmental collaboration for optimal patient care and resource utilisation. Helping to resolve interdepartmental conflicts or issues. Assisting in recruitment, training, and evaluation of hospital staff. Overseeing staffing levels to ensure proper coverage without excessive costs. Promoting staff development, morale, and retention initiatives in coordination with HR. Assisting with budgeting, cost control, and financial reporting. Ensuring adherence to healthcare regulations, safety standards, and accreditation requirements. Participating in quality improvement initiatives and audits. Monitoring infection control and patient safety programs. Contributing to short- and long-term hospital planning. Monitoring patient feedback and satisfaction levels. Working with clinical teams to resolve patient concerns. Ensuring a high standard of patient-centered care. Supporting hospital preparedness for emergencies (eg pandemics, natural disasters). Serving as a key person during crises in the absence of the Director. Acting as a liaison between hospital leadership and external stakeholders (e.g., government agencies, vendors, partners). Executing any other duties assigned by the authority. Workplace Work at office Employment Status Full Time Job Location Chattogram Read Before Apply Application in plain paper along with CV, passport-size photo, copy of NID, educational and experience certificates to the Director, IAHS-H, Foy's Lake, Chattogram by email to iahs-h.apply.24@ustc.ac.bd Photograph must be enclosed with the resume. Only shortlisted candidates will be communicated Apply Procedure Email Your CV Send your CV to the"
  },
  {
    "url": "https://bdjobs.com/h/details/1458757?ln=1",
    "company_name": "Keda Building Materials Industri Ltd",
    "job_title": "জিএম (মার্কেটিং)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "জিএম (মার্কেটিং) : Keda Building Materials Industri Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Keda Building Materials Industri Ltd জিএম (মার্কেটিং) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements যোগ্যতা ও অভিজ্ঞতা: মাস্টার্স/এমবিএ ডিগ্রী সহ কোন খ্যাতনামা প্রতিষ্ঠানে সংশ্লিষ্ট পদে ০৮-১০ বছরের বাস্তব অভিজ্ঞতা সম্পন্ন। অভিজ্ঞ প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য। Responsibilities & Context বাংলাদেশ ও বিদেশী বিনিয়োগে স্থাপিত একটি বিল্ডিং ম্যাটেরিয়াল (এলুমিনিয়াম এর দরজা এবং জানালার লক ও হুইল) প্রস্তুতকারক প্রতিষ্ঠানে অভিজ্ঞতা সম্পন্ন লোক নিয়োগ করা হবে। Skills & Expertise Suggested by Sales & Marketing Business Development Client Relationship Management Market Research Compensation & Other Benefits বেতন: বেতন ও অন্যান্য সুযোগ সুবিধা আলোচনা সাপেক্ষে। Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Keda Building Materials Industri Ltd Follow More jobs from this company Address: Room # 23, (1st Floorl), Land view Commercial Centre, Gulshan-2, DHAKA-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Cl"
  },
  {
    "url": "https://bdjobs.com/h/details/1458699?ln=1",
    "company_name": "Salma Group",
    "job_title": "Executive (Accounts)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Executive (Accounts) : Salma Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Salma Group Executive (Accounts) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 02 Age: 25 to 30 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 30 years Responsibilities & Context Salma Group is a well reputed business conglomerate in Bangladesh with diversified operation in the textile sector, including five spinning mills, alongside trading and real estate ventures. The Group is committed to quality, operational efficiency, and continuous improvement. To strengthen our Accounting function, we are seeking experienced and performance-driven professionals for the position of Executive- Accounts . Petty cash maintain, Payment maintain, Check and verify all kinds of vouchers. Prepare examine and analyse bills/invoices, accounts receivables, accounts payable, accounts records, financial statements, inventory management and others financial report to assess accuracy, completeness and procedural standards. Develop, maintain and analyse budgets, preparing periodic reports that compare budgeted cost to actual costs. To check all accounting documents and post the day-to-day transaction in the accounting system in time. To prepare and review banks reconciliations and the manage discrepancy. To prepare management report, analyze accounting records, financial statements on monthly , quarterly, half yearly and as when necessary and submit the reports to the Management in time. work in a team environment and collaboration with various departments. To face yearly audit by the external auditors. Maintain all sorts of business communication with Banks and Financial Institutes. All other duties as and when assigned by the management. Skills & Expertise Suggested by Accounts and Finance Accounting Software Compensation & Other Benefits Mobile bill,Insurance Salary Review: Yearly Festival Bonus: 2 As per policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Salma Group Follow Address: Anabil Tower,  Floor No.: 14-15, Plot No.: 03, Block: NW (J), Kamal Ataturk Avenue, Gulshan-2, Dhaka-1212. Business: BSB Spinning Mills Limited. Suraiya Spinning Mills Limited. Tamijuddin Textile Mills Limited. Dabiruddin Spinning Mills Limited Humaira Composite Textile Mills Limited. Angan Properties Ltd. Angan Developments Ltd. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458785?ln=1",
    "company_name": "STARDUST Telecom Limited",
    "job_title": "Technical/Software Lead – DevOps",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Technical/Software Lead – DevOps : STARDUST Telecom Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List STARDUST Telecom Limited Technical/Software Lead – DevOps Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experience: 10+ years of professional software development experience with over 6 years in Tech lead roleTechnical Skills Strong expertise in:PythonDjango / Django REST FrameworkAdvanced knowledge of Odoo ERP architecture and full module customization. Strong full-stack development experienceProficiency in frontend frameworks (React / Vue / Angular preferred)Solid understanding of:RESTful APIsSQL & database optimizationGit version controlExperience with Linux-based environments. Leadership & Soft SkillsProven experience leading technical teamsStrong problem-solving and decision-making skillsExcellent communication and documentation skills. Ability to translate business requirements into technical solutionsStrong ownership and accountability mindset Preferred / Nice-to-Have Skills Experience with: Microservices architectureMessage queues (RabbitMQ / Kafka)Caching systems (Redis) Exposure to cloud platforms and DevOps toolsExperience with ERP integrations and data migrationKnowledge of security best practices and performance tuning Prior experience in large-scale enterprise systems Responsibilities & Context Job Purpose The role is responsible for providing technical leadership and hands-on expertise in designing, developing, and maintaining scalable web applications and ERP solutions, with a strong focus on Odoo ERP and full-stack development. The position ensures high-quality system architecture, secure and efficient code, and seamless integration across business systems while aligning technology solutions with organizational goals. Additionally, the role mentor’s development teams, drives best practices, supports Agile delivery, and collaborates with stakeholders to deliver reliable, high-performance, and future-ready digital solutions. Key Responsibilities Technical Leadership Lead end-to-end system architecture, design, and implementation of web and ERP solutions. Define coding standards, best practices, and architectural guidelines . Review and approve technical designs, code, and deployment strategies . Provide technical direction and hands-on support to development teams. Ensure system scalability, performance, security, and maintainability . Full Stack Development Actively participate in hands-on coding using: Python, Django Frontend technologies (React / Vue / Angular / JavaScript, HTML, CSS) Design and develop REST APIs, microservices, and backend "
  },
  {
    "url": "https://bdjobs.com/h/details/1458702?ln=1",
    "company_name": "Rarona International (pvt) Ltd.",
    "job_title": "Sales & Marketing Executive",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 8000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Sales & Marketing Executive : Rarona International (pvt) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rarona International (pvt) Ltd. Sales & Marketing Executive Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 18 to 60 years Location: Anywhere in Bangladesh Salary: Tk. 8000 - 15000 (Monthly) Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 60 years Responsibilities & Context নিয়মিত ও নির্ধারিত সময়ে সাইট ভিজিট করতে হবে। গ্রাহকের সাথে সম্পর্ক স্থাপন করে ব্যাবসার উন্নয়ন নিশ্চিত করতে হবে। নতুন গ্রাহক বাড়ানো এবং নিয়মিত যোগাযোগ রাখতে হবে। কোম্পানী ফরমেট অনুযায়ী ডাটাবেজ তৈরী করে দৈনিক রিপোর্ট প্রদান করতে হবে। কর্মঠ, সৃজসমীল ও দায়িত্বশীল হতে হবে। Skills & Expertise ISP operation Suggested by Sales & Marketing Sales target Customer Service Client Service/ Marketing Workplace Work from home,Work at office Employment Status Freelance Job Location Anywhere in Bangladesh Company Information Rarona International (pvt) Ltd. Follow Address: 14 Nandipara Main Road (Chapa Khana), Khilgaon, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458676?ln=1",
    "company_name": "Central University of Science & Technology (CUST)",
    "job_title": "Lecturer (BBA & CSE)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Lecturer (BBA & CSE) : Central University of Science & Technology (CUST) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Central University of Science & Technology (CUST) Lecturer (BBA & CSE) Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: At least 25 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Additional Requirements Strong teaching and communication skills Familiarity with modern teaching methods and LMS Commitment to academic integrity and student development Responsibilities & Context Job Context We are looking for Full-Time & Part-Time (Visiting). Central University of Science & Technology (CUST) invites applications from qualified and motivated candidates for the position of Lecturer in the Department of Business Administration (BBA) and Department of Computer Science & Engineering (CSE) in accordance with UGC guidelines. Job Responsibilities Conduct undergraduate-level classes (and other classes if required) Prepare lecture notes, course outlines, and assessment materials Evaluate students and maintain academic records Assist in curriculum development and academic activities Provide academic advising and mentoring to students Participate in training, workshops, and academic meetings Use modern teaching tools and LMS Perform other duties assigned by the university authority Skills & Expertise Education Leadership Teaching Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Central University of Science & Technology (CUST) Follow More jobs from this company Address: Plot: 1/9, Road: 2, Block: D, Section: 15, Mirpur, Dhaka-1216, Bangladesh Website: https://www.cust.edu.bd/ Business: Private University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is innacurate.” Back to Top ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register "
  },
  {
    "url": "https://bdjobs.com/h/details/1458795?ln=1",
    "company_name": "Centro Tex Ltd.",
    "job_title": "Senior Tailoring & Pattern Master",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Senior Tailoring & Pattern Master : Centro Tex Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Centro Tex Ltd. Senior Tailoring & Pattern Master Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context Job Context: As the Senior Tailoring & Pattern Master your mission is to transform complex design concepts into perfect, production-ready garments. By balancing traditional tailoring craftsmanship with modern speed, you ensure that every sample meets international fit standards. Job Responsibilities 1. Technical Pattern Development Drafting & Accuracy: Draft, design, and finalize garment patterns based on client measurements, designer sketches, or technical specifications. Ensure accuracy in fit, proportion, and style across all garments. Design Alignment: Ensure pattern Spec does correspond with design. Anatomical Knowledge: Have good understanding of key area of body shape (Menswear, Womenswear, and Childrenswear) and prepare any kinds of spec within short time. Workflow Integration: Possess clear idea about sewing method which will not conflict while creating pattern. 2. Fittings, Adjustments & Grading Silhouette Mastery: Lead fitting sessions with clients or models, making precise alterations to achieve the desired silhouette. Adapt patterns to different body types while maintaining design integrity. Regional Grading: Be capable to grade the pattern from the base size and also have understanding of the appropriate grading rules on various region. Production Advocacy: Act as a bridge between design and production; provide expert pushback and solutions when design elements compromise production feasibility or fit quality 3. Construction & Quality Control Fabric Analysis: Assess fabric behavior (stretch, drape, shrinkage) and adjust patterns accordingly. Technical Consulting: Provide technical input on garment construction methods to optimize quality and durability. Standardization: Oversee cutting and tailoring processes to ensure patterns are executed correctly. Maintain consistency in sizing, finishing, and craftsmanship standards. 4. Leadership & Operational Innovation Mentorship: Supervise and train junior pattern makers and tailors. Share advanced techniques and best practices to elevate team performance. Cross-Department Collaboration: Work closely with designers, production managers, and clients to translate creative concepts into wearable garments. Communicate effectively across departments to meet deadlines and maintain brand standards. Modernization: Introduce modern tools such as CAD pattern-making software while preserving traditional tailoring excellence. Efficiency: Streamli"
  },
  {
    "url": "https://bdjobs.com/h/details/1458843?ln=1",
    "company_name": "A Leading Group of Industries",
    "job_title": "Executive / Sr. Executive – Foreign Procurement (SCM)",
    "location": "Dhaka (Gulshan)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Executive / Sr. Executive – Foreign Procurement (SCM) : A Leading Group of Industries Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Leading Group of Industries Executive / Sr. Executive – Foreign Procurement (SCM) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Dhaka (Gulshan) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Professional training in import/export or supply chain preferred. Good communication skills in EnglishKnowledge of ERP system. Strong computer skills (MS Word, Excel, PowerPoint). Understanding of import documentation and procurement process Responsibilities & Context Prepare LC proposals and coordinate with Accounts for processing and approval Submit LC proposals to banks and maintain proper follow-up Track ETD & ETA of shipments and report updates to management Maintain LC registers and all import-related documents Handle LC amendment, document release, insurance bill, C&F bill, and transport bill Ensure ERP entry and submit B/E to VAT department Coordinate with suppliers and internal departments for smooth import operations Perform duties assigned by the Head of Department Skills & Expertise Plastics Employment Status Full Time Job Location Dhaka (Gulshan) Company Information A Leading Group of Industries Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruite"
  },
  {
    "url": "https://bdjobs.com/h/details/1458804?ln=1",
    "company_name": "DBL Pharmaceuticals Ltd.",
    "job_title": "Executive - R&D/QC/MS&T",
    "location": "Gazipur (Kashimpur)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Executive - R&D/QC/MS&T : DBL Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List DBL Pharmaceuticals Ltd. Executive - R&D/QC/MS&T Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Company Information Summary Vacancy: -- Location: Gazipur (Kashimpur) Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements M.Pharm / Master’s in Chemistry, Biochemistry or Biotechnology from any reputed university; Advanced knowledge in MS Suite; Excellent analytical, problem-solving and communication skills; Ability to work collaboratively across cross-functional teams. Employment Status Full Time Job Location Gazipur (Kashimpur) Company Information DBL Pharmaceuticals Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458861?ln=1",
    "company_name": "Preneur Lab",
    "job_title": "Full Stack Software Developer",
    "location": "Dhaka",
    "salary": "Tk. 25000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Full Stack Software Developer : Preneur Lab Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Preneur Lab Full Stack Software Developer Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 22 to 30 years Location: Dhaka Salary: Tk. 25000 - 35000 (Monthly) Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 30 years Responsibilities & Context Company Overview Preneur Lab Digital is a leading software development company specializing in web, AI, ERP, office management and interactive web applications. We work with local enterprises and international clients across the UK and Canada, delivering reliable, scalable and user focused digital products. Role Overview We are looking for a Full Stack Software Developer to join our core development team in our Dhaka office. Key Responsibilities Design, develop, and maintain front-end interfaces Build and maintain back-end applications and RESTful APIs Integrate front-end applications with back-end services securely and efficiently Optimize applications for performance, scalability, and security Write clean, reusable, and well-documented code Debug, troubleshoot, and resolve technical issues Qualifications Bachelor’s degree in Computer Science & Engineering or a related field Strong skills in HTML, CSS, and JavaScript Solid experience with React.js Back-end development experience using PHP, Python, Node.js Experience with RESTful APIs, JSON, and API integrations Understanding of authentication and authorization (JWT, OAuth, Laravel Sanctum) Experience with databases such as MySQL, PostgreSQL, or MongoDB Familiarity with Git, version control workflows, and deployment basics Strong understanding of responsive design principles Good communication skills and ability to work collaboratively in a team Details Employment Type: Full-time Experience: 1–3 years Vacancy: 2 Work Hours: Saturday – Thursday, 10:30 AM – 6:30 PM (WFH on Saturday) Work Modality: On-site (Dhanmondi 4/A, Dhaka, Bangladesh) Learn more: www.pl.digital Skills & Expertise HTML & CSS PHP Python JavaScript Node.js JSON RESTful API MySQL Employment Status Full Time Job Location Dhaka Company Information Preneur Lab Follow Address: Flat - 4/B, House - 13/B, Road -4/A, Dhanmondi, Dhaka - 1209 Website: https://www.preneurlab.com.bd Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন "
  },
  {
    "url": "https://bdjobs.com/h/details/1458780?ln=1",
    "company_name": "Dekko ISHO Group",
    "job_title": "Officer- Fabric Store (Woven Garments)",
    "location": "Dhaka (Mirpur 7)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Officer- Fabric Store (Woven Garments) : Dekko ISHO Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dekko ISHO Group Officer- Fabric Store (Woven Garments) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (Mirpur 7) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experienced in fabric store operation in any woven garments manufacturing unit Sound knowledge on Fabric closing/reconciliation (physically & reporting) Proficiency in MS Excel/Word/OutlookGood interpersonal and communication skills Responsibilities & Context Maintain accurate records of fabric receiving, inventory, and issuance using register, Excel, and software. Ensure proper storage, handling, and preservation of fabrics. Conduct fabric reconciliation/closing both physically and through system reports. Prepare and maintain documentation and reports related to fabric movement and stock status. Monitor inventory levels and ensure timely fabric availability for production. Support management with reports and analysis on fabric utilization. Compensation & Other Benefits Salary Review: Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur 7) Company Information Dekko ISHO Group Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job"
  },
  {
    "url": "https://bdjobs.com/h/details/1458743?ln=1",
    "company_name": "Retina Health Care",
    "job_title": "Accounts Office",
    "location": "Gazipur (Gazipur Sadar, Sreepur)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Accounts Office : Retina Health Care Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Retina Health Care Accounts Office Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: At least 25 years Location: Gazipur (Gazipur Sadar, S... Gazipur (Gazipur Sadar, Sreepur) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Responsibilities & Context ইনভেন্টরি ও স্টক ম্যানেজমেন্ট (Inventory & Stock) Raw Materials Tracking: ফ্যাক্টরির কাঁচামাল এবং প্যাকেজিং ম্যাটেরিয়ালসের স্টক নিয়মিত পর্যবেক্ষণ করা। Stock Reconciliation: ফিজিক্যাল স্টক (যা বাস্তবে আছে) এবং সফটওয়্যার বা খাতার হিসেবের মধ্যে মিল রাখা। Damage & Waste Analysis: নষ্ট হওয়া পণ্য বা ওয়েস্টেজ আইটেমের সঠিক হিসাব রাখা এবং রিপোর্ট তৈরি করা। Finished Goods Entry: ফ্যাক্টরিতে উৎপাদিত পণ্য স্টকে ঢোকানো এবং তার সঠিক ভ্যালুয়েশন করা। প্যাকেজিং ও প্রোডাকশন কস্টিং (Packaging & Costing) Packaging Inventory: প্যাকেজিং ইউনিটের প্রতিটি আইটেমের (বক্স, লেবেল, কার্টন) ইন-আউট ট্র্যাকিং। Product Costing: একটি পণ্য তৈরিতে কত টাকার ম্যাটেরিয়াল ও প্যাকেজিং খরচ হচ্ছে তা নির্ণয় করা। Supplier Coordination: প্যাকেজিং সাপ্লায়ারদের বিল চেক করা এবং পেমেন্টের ব্যবস্থা করা। অ্যাকাউন্টস ও ডাটা এন্ট্রি (General Accounting) Daily Transaction: প্রতিদিনের আয়-ব্যয়ের ভাউচার তৈরি এবং সিস্টেমে এন্ট্রি দেওয়া। Ledger Maintenance: ক্রেতা (Party) এবং সরবরাহকারীদের (Supplier) লেজার বা খতিয়ান নিয়মিত আপডেট রাখা। Petty Cash: হেড অফিস বা ফ্যাক্টরির ছোটখাটো দৈনন্দিন খরচ (Petty Cash) ব্যবস্থাপনা। Banking: ব্যাংকে টাকা জমা দেওয়া, তোলা এবং ব্যাংক স্টেটমেন্টের সাথে ক্যাশ বুক মিলানো। রিপোর্টিং ও মনিটরিং (Reporting) Weekly/Monthly Reports: প্রতি সপ্তাহ বা মাসের শেষে স্টকের অবস্থা এবং খরচের রিপোর্ট ম্যানেজমেন্টকে জমা দেওয়া। Audit Support: বার্ষিক বা অর্ধবার্ষিক অডিট করার সময় প্রয়োজনীয় তথ্য ও ডকুমেন্ট দিয়ে সহায়তা করা। Head Office Coordination: ফ্যাক্টরির কাজের আপডেট নিয়মিত হেড অফিসে পাঠানো। Skills & Expertise ERP Software Microsoft Excel Microsoft Office Quickbooks Tally Software Suggested by ERP Software Tally Software Tally ERP 9 Employment Status Full Time Job Location Gazipur (Gazipur Sadar, Sreepur) Company Information Retina Health Care Follow Address: Corporate Office: 53, T&T Road, Wareless Gate, Gazipur\nWhat'sApp: 01540800007 Business: Health Care Product Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complai"
  },
  {
    "url": "https://bdjobs.com/h/details/1458803?ln=1",
    "company_name": "Central University of Science & Technology (CUST)",
    "job_title": "Front Desk Officer (Female)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Front Desk Officer (Female) : Central University of Science & Technology (CUST) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Central University of Science & Technology (CUST) Front Desk Officer (Female) Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 23 to 35 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 23 to 35 years Responsibilities & Context Job Context Central University of Science & Technology (CUST) is seeking a smart, well-spoken, and customer-focused Female Front Desk Officer to manage front office operations and provide professional support to students, guardians, faculty members, and visitors. Job Responsibilities Receive and assist students, guardians, visitors, and guests courteously Handle front desk operations, inquiries, and telephone calls Provide accurate information regarding admission, academic programs, and office procedures Maintain visitor records and front office documentation Coordinate with admission, accounts, and academic offices as required Manage incoming and outgoing correspondence Ensure a professional and welcoming front office environment Support administrative tasks as assigned by management Skills & Expertise Administration Communication Telecommunication Typing Skill - Bengali and English Fluent in English Speaking Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka Company Information Central University of Science & Technology (CUST) Follow More jobs from this company Address: Plot: 1/9, Road: 2, Block: D, Section: 15, Mirpur, Dhaka-1216, Bangladesh Website: https://www.cust.edu.bd/ Business: Private University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is innacurate.” Back to Top ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lea"
  },
  {
    "url": "https://bdjobs.com/h/details/1458887?ln=1",
    "company_name": "EDISON GROUP",
    "job_title": "Mobile Repair Engineer",
    "location": "Moulvibazar, Mymensingh, Natore, Sylhet",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Mobile Repair Engineer : EDISON GROUP Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List EDISON GROUP Mobile Repair Engineer Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Location: Moulvibazar, Mymensingh, ... Moulvibazar, Mymensingh, Natore, Sylhet Salary: Negotiable Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experience in using Mobile handset diagnostics tools and expertise in handset repairing level 3.5 Knowledge of mobile operating systems (Android, iOS, etc.) and software troubleshooting. Strong problem-solving skills to address complex technical issues. Good communication skills for interacting with customers and team members. Responsibilities & Context Job Context: SYMPHONY Mobile, a leading mobile handset brand in Bangladesh, is currently seeking potential candidates for the position of Executive Engineer to ensure efficient and high-quality repairs of mobile handsets at our Customer Care centers at out side of Dhaka (Specially for Manikganj, Gopalganj, Sylhet, Rajbari and Munshiganj). The new hire is expected to diagnose, repair, and test devices effectively while maintaining service standards, improving repair processes, and contributing to overall customer satisfaction. Job Responsibilities: Diagnose and repair mobile handsets, ensuring high-quality and on time repair service (up to level 3.5). Maintain Standard Operation Procedure (SOP) during repairing. Perform software updates, system restores, and troubleshooting for devices. Conduct hardware repairs, including screen replacements, battery fixes, and component replacements. Test repaired devices to ensure proper functionality and quality standards. Maintain accurate records of repair activities and customer information. Contribute to improving repair processes and service efficiency. Skills & Expertise Client Service Suggested by Customer Care Software Troubleshooting SOP Development Compensation & Other Benefits Mobile bill,Over time allowance Salary Review: Yearly Festival Bonus: 2 Other Benefits as per company policies. Workplace Work at office Employment Status Full Time Job Location Moulvibazar, Mymensingh, Natore, Sylhet Company Information EDISON GROUP Follow More jobs from this company Address: Rangs Babylonia, Level 6-9, 246, Bir Uttam Mir Shawkat Road (Tejgaon Link Road), Tejgaon I/A,Tejgaon, Dhaka-1208 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না।"
  },
  {
    "url": "https://bdjobs.com/h/details/1458871?ln=1",
    "company_name": "A reputed Garments factory",
    "job_title": "Assistant Manager, Corporate VAT & TAx",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Assistant Manager, Corporate VAT & TAx : A reputed Garments factory Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A reputed Garments factory Assistant Manager, Corporate VAT & TAx Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 35 to 40 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 35 to 40 years Good Liaison with Government Authority. Should be self-motivated, and have strong interpersonal & communication, and leadership qualities. Able to work under pressure when needed. Should have Tax / VAT/ Bond-related training/ workshop. Skills: Strong analytical ability, high proficiency in MS Office (especially Excel). Responsibilities & Context · VAT Management (Mushak): Independently manage, prepare, and file monthly VAT returns (Mushak 9.1) and maintain all registers (Mushak 6.1, 6.2, 6.3, 6.6, 6.8, 4.3) for the head office and factories. · Withholding Tax & VAT (TDS/VDS): Ensure timely deduction and deposit of Tax Deducted at Source (TDS) and VAT Deducted at Source (VDS) from suppliers, contractors, and service providers. · Income Tax & Corporate Tax: Compute monthly/annual corporate income tax, prepare tax returns, manage Tax Provisions, and handle Deferred Tax calculations. · Liaison with NBR & Authorities: Act as the primary contact for VAT circle/division, tax authorities, and Customs, handling hearings, appeals, and assessments. · Audit & Reporting: Coordinate with internal and external auditors for VAT/Tax audits, and prepare detailed tax reports and reconciliations for management. · Commercial Documentation: Prepare landed cost sheets by calculating Customs Duty (CD), Regulatory Duty (RD), Supplementary Duty (SD), and Advance Tax (AT). · Strategic Advisory: Advise management on the tax implications of business decisions, new contracts, and changes in the Finance Act or SROs. · Software Proficiency: Utilize ERP software (e.g., Tally-9) and the NBR’s VAT Online System (IVAS) for submissions. Skills & Expertise Income Tax Practitioner (ITP) VAT and Tax Compensation & Other Benefits Festival Bonus: 1 Other benefits as per company policy. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Read Before Apply The candidate must be certified Income Tax Practitioner (ITP). Company Information A reputed Garments factory Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির ("
  },
  {
    "url": "https://bdjobs.com/h/details/1458867?ln=1",
    "company_name": "NexaCore",
    "job_title": "Team Leader (Full stack Developer)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Team Leader (Full stack Developer) : NexaCore Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List NexaCore Team Leader (Full stack Developer) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 150000 - 200000 (Monthly) Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 25 to 40 years Responsibilities & Context What do you bring? At least five years of experience as a full stack developer, including one to two years in a coaching or leadership role In-depth knowledge of modern frontend and backend technologies such as JavaScript or TypeScript, React, Node.js, .NET or Java, and REST APIs node.js expert! Strong communication skills, a results-driven mindset and a collaborative attitude What do we offer? A challenging and versatile role within a growing tech company Plenty of room for initiative, innovation and leadership Hybrid working options A personal development budget and growth opportunities A close-knit team of passionate colleagues Nice to Have (Bonus Points) Experience developing Shopify apps! Responsibilities & Context Are you an experienced Full Stack Developer with a passion for leadership? Do you have a keen eye for technology, architecture and team development? Then we are looking for you. As a Team Leader Full Stack Development, you will be responsible for leading and coaching a development team. You will combine your technical expertise with strong communication skills to successfully deliver projects. Together with your team, you will work on innovative Shopify apps. What will you do? Lead a team of frontend and backend developers Develop customized Shopify apps (public) A fully remote position with flexible working hours. Contribute technically to projects through hands-on coding, code reviews and architectural decisions Collaborate with stakeholders on technical solutions and roadmap planning Promote knowledge sharing within the team and encourage professional growth Ensure software quality, scalability and security Optimize processes, tools and workflows using Agile, Scrum and CI/CD practices Skills & Expertise React Native | NodeJS | HTML | CSS | JavaScript | Github | Git Compensation & Other Benefits Weekly 2 holidays,Performance bonus,Profit share Salary Review: Half Yearly Festival Bonus: 2 Workplace Work from home Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Job Highlights (Full stack Developer) Read Before Apply Fill in the form to apply - https://docs.google.com/forms/d/e/1FAIpQLSe2oa-k2OVPQV0BP2DwEYLeTaXraJqN1NniyyqadWIKzmwVeA/viewform?usp=publish-editor Company Information NexaCore Follow Address: Remote Business: NexaCore is an IT company that designs a"
  },
  {
    "url": "https://bdjobs.com/h/details/1458114?ln=1",
    "company_name": "Rex Group BD",
    "job_title": "Office Executive",
    "location": "Dhaka (Uttara Sector 7)",
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Office Executive : Rex Group BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rex Group BD Office Executive Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Location: Dhaka (Uttara Sector 7) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Candidate should be honest, polite and courteous. Must be ready to join immediately if selected. Educational qualification won't be matter if you have our preferred skills. Preferred Skills: Beautiful voice, strong presentation & fluently public speaking skills. Experience for picture, reels and basic live conduct skills is must. Responsibilities & Context Job Responsibilities: You have to do live for our products (behind the camera). Look after our products & handle the social media. Perform other tasks assigned by management if needed. Compensation & Other Benefits Weekend: 1 day. Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Uttara Sector 7) Company Information Rex Group BD Follow More jobs from this company Address: Road-35, House-03, Sector-07, Uttara Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458796?ln=1",
    "company_name": "Star Tech & Engineering Ltd.",
    "job_title": "Assistant Manager-Product(Mobile)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Assistant Manager-Product(Mobile) : Star Tech & Engineering Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Star Tech & Engineering Ltd. Assistant Manager-Product(Mobile) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 35 to 45 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 35 to 45 years Ability to work under pressure and meet deadlines. Strong organizational and leadership skills. Passion for technology and innovation. Responsibilities & Context Job Context Star Tech Ltd. is seeking a competent professional for the role of Assistant Manager – Product (Mobile) , responsible for planning, managing, and executing mobile product strategies. The position requires effective coordination with suppliers and internal teams to ensure market-driven product decisions and support business growth. Job Responsibilities Develop and implement mobile product strategies aligned with company goals and market trends. Conduct market research, competitor analysis, and customer demand assessment to guide product decisions. Analyze product performance and recommend improvements, new launches, or discontinuation strategies. Coordinate with mobile brands, suppliers, and distributors for product sourcing and procurement. Negotiate pricing, commercial terms, and supply agreements to ensure competitive procurement. Ensure timely availability of products while maintaining optimal inventory levels. Manage the full product lifecycle from planning, sourcing, and launch to post-launch performance review. Monitor product pricing, margins, and profitability across all sales channels. Work closely with marketing teams to plan product launches, promotions, and campaigns. Prepare product forecasts, sales plans, and demand projections. Track sales performance, stock movement, and market response to ensure target achievement. Identify opportunities to increase sales, market share, and product visibility. Collaborate with sales, marketing, supply chain, and operations teams to ensure smooth execution of product plans. Train internal teams on new mobile products, features, specifications, and competitive positioning. Provide regular product insights and performance reports to management. Skills & Expertise Analytical Skill Email/Internet Proficiency Excellent communication and presentation skills Interpersonal Skill Patience Professionalism Smart and Dedicated Teamwork Compensation & Other Benefits Attractive salary package Leave: Encashment Mobile Allowance Salary Review: Yearly Lunch Facilities: Fully Subsidized Festival Bonus: 2 TA/DA (As per policy) Credit Card Insurance (Life & Health) Umrah Hajj (As per policy) Workplace Work at office Employment Status F"
  },
  {
    "url": "https://bdjobs.com/h/details/1458748?ln=1",
    "company_name": "LAMB",
    "job_title": "Pharmacist (Re-advertisement)",
    "location": "Dinajpur (Parbatipur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Pharmacist (Re-advertisement) : LAMB Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List LAMB Pharmacist (Re-advertisement) Application Deadline : 23 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Dinajpur (Parbatipur) Salary: Tk. 14800 (Monthly) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 1 years of experience in the relevant field. Responsibilities & Context LAMB is a well-run major mission Hospital, Community Health Development, Training and Research organization. Services cover more than 6.3 million people in North West Bangladesh. Responsible for dispensing medicines in proper authorization, compounding medicines as necessary, maintaining accurate records, and ensuring adequate medicine stocks. Responsibilities also include checking medicine expiry dates and helping the pharmacy In-charge with paperwork. JOB Duties: To dispense medicines to patients and other project departments upon receiving proper authorization ( Includes instructing patients how to take Medicines) To keep accurate records of supplies received and medicine dispensed. To assist with the periodic inventory of stock. To notify the business office monthly of taka amount dispensed to various departments and quarterly of Tk. Amount of current inventory. To keep abreast of drugs available and their suppliers. To maintain proper physical environment for medicines, clean store room and temperature control, including monitoring of refrigerator function. To compound medicines as assigned by the pharmacy supervisor. To keep cashiers notified of any price changes. Skills & Expertise Suggested by Pharmaceutical/ Medical Marketing Compensation & Other Benefits Tk. 14,800 per month gross negotiable for experienced candidate . Other benefits include provident fund, festival allowance once per year, and critical illness & death benefit. Workplace Work at office Employment Status Full Time Job Location Dinajpur (Parbatipur) Read Before Apply N.B. Only shortlisted candidates will be notified. Any kind of persuasion will be considered as disqualified. \"Potential woman candidates are strongly encouraged to apply\" LAMB authority holds the right to accept or reject any or all applications without giving any reasons. LAMB is a smoke-free organization. \"At LAMB we are committed to zero tolerance of the abuse or exploitation of children and vulnerable adults.\" Apply Procedure Hard Copy Qualified candidates are requested to apply with a cover letter along with an updated CV (mentioning two references name), all educational & experience certificates, NID and recent passport size photograph to the HR Department, LAMB, P.O. Parbatipur, Dinajpur-5250, Bangladesh; Apply Via Email: email to hrjobs@lambproject.or g; Please me"
  },
  {
    "url": "https://bdjobs.com/h/details/1454219?ln=1",
    "company_name": "Society for Assistance to Hearing Impaired Children (SAHIC)",
    "job_title": "Nurse (ENT Hospital)",
    "location": "Dhaka (Mohakhali)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Nurse (ENT Hospital) : Society for Assistance to Hearing Impaired Children (SAHIC) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Society for Assistance to Hearing Impaired Children (SAHIC) Nurse (ENT Hospital) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 03 Location: Dhaka (Mohakhali) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Good communication skills in Bangla and English. Ability to work in shifts and under pressure Professional attitude and patient-friendly behavior. Responsibilities & Context Provide nursing care to ENT patients in OPD, ward, and operation theatre. Assist ENT specialists during examinations, procedures, and surgeries. Monitor patients’ vital signs and maintain medical records accurately. Ensure proper infection control and hygiene standards. Administer medications as prescribed by physicians. Maintain patient comfort and provide counseling to patients and attendants. Perform other duties as assigned by the hospital authority. Skills & Expertise Suggested by Nurse/ Paramedics Workplace Work at office Employment Status Full Time Job Location Dhaka (Mohakhali) Company Information Society for Assistance to Hearing Impaired Children (SAHIC) Follow More jobs from this company Address: Kha-16, Mohakhali Health Complex, Mohakhali, Dhaka-1212, Bangladesh Business: The Society for Assistance to Hearing Impaired Children (SAHIC) is a well-established voluntary non-government organization founded in 1987 and registered with the Department of Social Services and the NGO Affairs Bureau. Founded by Professor M. Nurul Amin, a distinguished ENT specialist, SAHIC is dedicated to the prevention, early detection, and rehabilitation of hearing-impaired children in Bangladesh.\n\nWith the support of Andheri Hilfe, Germany, and the Ministry of Health and Family Welfare, SAHIC established its permanent centre at Mohakhali, Dhaka, in 1992. The organization operates an ENT Hospital and a Pre-school for Hearing-Impaired Children, providing specialized medical care, hearing and speech services, and early childhood education.\n\nThrough its comprehensive healthcare and education programs, SAHIC continues to play a significant role in improving the quality of life of hearing-impaired children, with support from the Government of the People’s Republic of Bangladesh and various national and international development partners. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে "
  },
  {
    "url": "https://bdjobs.com/h/details/1458811?ln=1",
    "company_name": "US FDA Approved Leading Pharmaceuticals Company",
    "job_title": "Sr. Executive / Executive, International Regulatory Affairs",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Sr. Executive / Executive, International Regulatory Affairs : US FDA Approved Leading Pharmaceuticals Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List US FDA Approved Leading Pharmaceuticals Company Sr. Executive / Executive, International Regulatory Affairs Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: At most 45 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At most 45 years Excellent communication skills, especially in English. Excellent verbal, written and presentation skills. Good computer operating skills. Knowledge of global pharmaceuticals market & regulatory system. Dedication, sincerity, teamwork, management skills. Responsibilities & Context Authoring and compiling high quality CTD dossier across regions. Effectively study, research and collate documentation requirements for dossier compilation. Reviewing and assessing the adequacy of the CMC, administrative & clinical documents. Interpreting CMC data to ensure accuracy in filings. To research and understand up-to-date regional regulatory requirements (Europe, Australia, North and South America & others) to ensure regulatory compliance. Developing Packaging artworks as per country specific requirements. Ensuring ‘Product Lifecycle Management’ by submitting renewals, variations and labeling updates. To be responsible and accountable for overall marketing authorization activities of assigned countries. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information US FDA Approved Leading Pharmaceuticals Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from "
  },
  {
    "url": "https://bdjobs.com/h/details/1458782?ln=1",
    "company_name": "Central University of Science & Technology (CUST)",
    "job_title": "Administrative Officer (IT)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Administrative Officer (IT) : Central University of Science & Technology (CUST) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Central University of Science & Technology (CUST) Administrative Officer (IT) Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: At least 25 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Strong knowledge of network configuration, server management, and system security. Experience with Windows/Linux servers and backup systems. Familiarity with firewall, antivirus, and access control systems. Basic knowledge of website development, content management systems (CMS), and web maintenance. Ability to troubleshoot complex technical issues independently. Good documentation, reporting, and coordination skills. Strong communication and service-oriented attitude Responsibilities & Context Job Context Central University of Science & Technology (CUST) is seeking a skilled and responsible Administrative Officer (IT) with strong networking, server management, and website management expertise to manage and support the organization’s IT infrastructure and ensure uninterrupted IT services for academic and administrative operations. Job Responsibilities Manage day-to-day IT operations and administrative coordination Administer and monitor network infrastructure (LAN/WAN, Wi-Fi, routers, switches) Manage and maintain servers, backups, and system security Provide technical support for hardware, software, and network-related issues Monitor system performance and troubleshoot network/server problems Support academic and administrative software systems Coordinate with vendors for IT equipment, network, and maintenance services Maintain IT inventory, network diagrams, and technical documentation Ensure data security, access control, and regular backups Support online portals, ERP systems, and digital platforms Develop, update, maintain, and regularly manage the university website and related web content Ensure website functionality, security, and timely content updates in coordination with concerned departments Perform any other IT-related duties assigned by the authority Skills & Expertise Database Administrator (DBA) Examination Controller Web Developer/ Web Designer Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Central University of Science & Technology (CUST) Follow More jobs from this company Address: Plot: 1/9, Road: 2, Block: D, Section: 15, Mirpur, Dhaka-1216, Bangladesh Website: https://www.cust.edu.bd/ Business: Private University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458777?ln=1",
    "company_name": "Israq Spinning Mills Ltd.",
    "job_title": "Assistant Manager (Security) / Security In charge",
    "location": "Gazipur (Sreepur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Assistant Manager (Security) / Security In charge : Israq Spinning Mills Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Israq Spinning Mills Ltd. Assistant Manager (Security) / Security In charge Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Gazipur (Sreepur) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context Job Context: Israq Spinning Mills Ltd. (sister concern of Ahmed group), a leading figure in the textile industry of Bangladesh, is looking for smart, honest and career-oriented enthusiastic individuals for the security department. Job Responsibilities: Ensure the overall security and safety of the factory premises, employees, and assets. Supervise and manage the performance of the security team, including training and duty allocation. To check all the registers those are being maintained in the security posts. Monitor and maintain access control systems, CCTV operations, and perimeter security measures. Conduct routine inspections, audits, and drills to ensure readiness in case of emergencies. Develop and implement security policies and procedures to align with organizational goals. Coordinate with local law enforcement and other authorities for incident handling and compliance. Investigate security breaches, thefts, and other incidents, preparing detailed reports. Provide support for fire safety measures, evacuation plans, and emergency response protocols. Any others task assigned by the Management. Skills & Expertise Suggested by Security Security Management Compensation & Other Benefits Mobile bill Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Gazipur (Sreepur) Company Information Israq Spinning Mills Ltd. Follow Address: Sylvania apartment , H # Ka-6/A, Nodda (Near Nodda Bus stand), Kalachandpur Road, Gulshan, Dhaka-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500"
  },
  {
    "url": "https://bdjobs.com/h/details/1458882?ln=1",
    "company_name": "Akij Venture Ltd.",
    "job_title": "Operator/Sr. Operator, Closure Machine",
    "location": "Habiganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Operator/Sr. Operator, Closure Machine : Akij Venture Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Venture Ltd. Operator/Sr. Operator, Closure Machine Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 35 years Location: Habiganj Salary: Negotiable Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 35 years Experience in the Husky Preform Machine, X-form (SIPA) Preform Machine and SACMI Closure Machine (CCM) Operating. Responsibilities & Context Closure Machine Operation and monitoring. Daily Machine Maintenance (CLIT) Ensuring Product Quality of Each machine, ensuring Customer Complaint prevention and Complaint free product ensuring. 5S, GMP and ISO Ensuring. Skills & Expertise Suggested by CCM Operation Customer Complaint Machine Operating Monitoring and Evaluation Compensation & Other Benefits Lunch Facilities: Partially Subsidize Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Habiganj Job Highlights We are seeking a Production Operator/Sr. Operator with a minimum 05 years of experience of Closure Machine Operations and monitoring, along with strong coordination skills. Company Information Akij Venture Ltd. Follow More jobs from this company Address: Akij House, 198, Bir Uttam Mir Shawkat Sarak, (Gulshan Link Road), Tejgaon, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibilit"
  },
  {
    "url": "https://bdjobs.com/h/details/1458759?ln=1",
    "company_name": "AL HASANAIN",
    "job_title": "Child Psychologist (Female)",
    "location": "Chattogram, Chattogram (Chattogram Sadar, Chittagong Politechnic Institute)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Child Psychologist (Female) : AL HASANAIN Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List AL HASANAIN Child Psychologist (Female) Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Chattogram, Chattogram (C... Chattogram, Chattogram (Chattogram Sadar, Chittagong Politechnic Institute) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experienced in a school environment and familiarity with working in an Islamic setting will get preference. Responsibilities & Context Provide psychological assessment, counseling, and emotional support to students while promoting positive behavior in accordance with Islamic values. Work closely with teachers and parents to develop and implement strategies that support students’ mental well-being and character development. Skills & Expertise Child Care Counseling Early Childhood Development (ECD) Education Counseling Mental Health and Psychosocial Support (PSS) Psychiatric Nursing Psychological Counselling Psychologist Psychology Student Counseling Suggested by Psychology Health/ Medical Medical Record Keeping Psychological Counselling Compensation & Other Benefits Performance bonus,Weekly 2 holidays,Medical allowance Lunch Facilities: Full Subsidize Salary Review: Yearly Female-Only Environment Strict adherence to Sharyee Porda in the workplace. Workplace Work at office Employment Status Part Time Gender Only females are allowed to apply. Job Location Chattogram, Chattogram (Chattogram Sadar, Chittagong Politechnic Institute) Company Information AL HASANAIN Follow More jobs from this company Address: Road No- 03, Cosmopolitan R/A, \n2 No. Gate, East Nasirabad, Chattogram. Website: https://www.alhasanain.edu.bd Business: “AL HASANAIN”, An English Medium Islamic Institute in Chattogram, Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. M"
  },
  {
    "url": "https://bdjobs.com/h/details/1458825?ln=1",
    "company_name": "SIMEC Foundation",
    "job_title": "Coordinator",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Coordinator : SIMEC Foundation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SIMEC Foundation Coordinator Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 26 to 40 years Location: Dhaka (Uttara) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 40 years Strong communication and negotiation skills Ability to prepare proposals and reports Good networking and relationship management skills Proficiency in MS Office applications Good command of English and Bangla Responsibilities & Context Job Title Sales & Marketing Coordinator Vacancy 2 Job Context We are looking for a dynamic and experienced Sales & Marketing Coordinator to lead sales and business development activities for training and skill development programs. The role involves working with NGOs, government projects, donor-funded programs, and corporate clients to generate revenue and partnerships. Job Responsibilities ·         Lead and coordinate the sales team to achieve enrollment and revenue targets. ·         Develop and implement sales and marketing strategies. ·         Identify new business opportunities with NGOs, government agencies, donor-funded projects, and corporate clients. ·         Prepare proposals, concept notes, and presentations for training and skill development projects. ·         Build and maintain relationships with institutional and corporate partners. ·         Represent the organization in meetings, workshops, and networking events. ·         Coordinate marketing and promotional activities for training programs. ·         Conduct market research and track project and tender opportunities. ·         Prepare regular sales and business development reports. ·         Maintain proper sales records and documentation. Employment Status Full-time Educational Requirements ·         Bachelor’s degree in Business Administration, Marketing, Development Studies, or relevant discipline. ·         Master’s degree will be preferred. Experience Requirements ·         Minimum 3 years of experience in Sales, Marketing, or Business Development. ·         Experience in training, education, TVET, NGO, or development sector will be preferred. ·         Experience working with NGOs, government, or donor-funded projects is an advantage. Additional Requirements ·         Strong communication and negotiation skills. ·         Ability to prepare proposals and reports. ·         Good networking and relationship management skills. ·         Proficiency in MS Office applications. ·         Good command of English and Bangla. Job Location Uttara, Dhaka, Bangladesh Salary Negotiable Compensation & Other Benefits ·         Provident Fund ·         Lea"
  },
  {
    "url": "https://bdjobs.com/h/details/1458799?ln=1",
    "company_name": "Central University of Science & Technology (CUST)",
    "job_title": "Digital Marketing Executive",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Digital Marketing Executive : Central University of Science & Technology (CUST) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Central University of Science & Technology (CUST) Digital Marketing Executive Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: At least 25 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Strong knowledge of Facebook Ads Manager and Google Ads. Practical experience with SEO, SEM, and lead generation strategies. Familiarity with tools like Google Analytics, Meta Business Suite, CRM/Lead tools. Basic knowledge of graphic design tools (Canva, Photoshop) will be a plus Excellent communication and content-writing skills. Ability to work under pressure and meet deadlines. Target-oriented and result-focused mindset Responsibilities & Context Job Context Central University of Science & Technology (CUST) is looking for a dynamic and results-driven Digital Marketing Executive to plan, implement, and manage the university’s digital marketing activities, generate qualified leads , and enhance brand visibility, student recruitment, and online engagement. Job Responsibilities Plan and execute digital marketing campaigns across social media, Google, and other online platforms Manage official social media pages (Facebook, YouTube, LinkedIn, etc.) Create, schedule, and publish engaging digital content (text, image, video) Manage paid advertisements (Facebook Ads, Google Ads) and optimize performance Generate student leads through digital campaigns and ensure lead quality Track, manage, and optimize leads for admissions and promotional campaigns Monitor website traffic, lead performance, and campaign effectiveness using analytics tools Coordinate with admission, academic, and media teams for lead conversion and promotional activities Maintain and update website content in coordination with IT/design teams Prepare regular performance, lead, and analytics reports Ensure brand consistency across all digital platforms Skills & Expertise Digital Marketing (Social Media Marketing) SEO and Digital Marketing YouTube Creative content writing Content Creation Content Marketing Content Management Content Developer Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Central University of Science & Technology (CUST) Follow More jobs from this company Address: Plot: 1/9, Road: 2, Block: D, Section: 15, Mirpur, Dhaka-1216, Bangladesh Website: https://www.cust.edu.bd/ Business: Private University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন "
  },
  {
    "url": "https://bdjobs.com/h/details/1458851?ln=1",
    "company_name": "Nutrition Depot",
    "job_title": "Sr Executive, Accounts",
    "location": "Dhaka (Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Sr Executive, Accounts : Nutrition Depot Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nutrition Depot Sr Executive, Accounts Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 45 years Location: Dhaka (Uttara) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 45 years Qualifications & Skills Bachelor’s/Master’s in Accounting, Finance, or related field Experience in Odoo Accounting Module Excellent knowledge of VAT, compliance, and reporting High integrity, ownership mindset, and attention to detail Ability to manage multi-brand financial operations Responsibilities & Context Key Responsibilities: Accounts & Financial Management Take full ownership of financial management across all ND brands Transition all accounting operations to Odoo ERP , eliminating parallel Excel systems Ensure accurate bookkeeping, compliance, and financial discipline Expense Management Authorize, control, and report all expenses (internal & external) Maintain expense lists, payables, and due dates Prepare and manage requisition logs and obtain management approvals Record all expenses with proper documentation in Expense Logs Maintain receipts, bills, and expense statements Manage petty cash and prepare Daily Cash Statements Handle bank withdrawals, deposits, cheques, and online transfers Safeguard company cheques and mitigate financial risks Oversee accounts & petty cash of: ND Banani Store & Warehouse SAND Apparel Factory Sales Collection Management Ensure 100% sales collection from all revenue channels: Retail, Online, Pathao, Daraz, Foodpanda, Wholesale, B2B, Events, Damage Sales Verify all sales deposits with proper proof Identify discrepancies and immediately follow up on pending collections Recover courier losses/damage overdues Manage all accounts receivables and overdues Financial Planning & Budgeting Prepare 3, 6, and 12-month cash flow forecasts Prepare yearly and quarterly budgets Control expenses against approved budgets Identify and recommend cost-saving opportunities Loan & Banking Ensure timely repayment of all bank loans Source new loan opportunities and reduce interest costs Process loan documentation and applications Maintain strong relationships with banks Financial Reporting Weekly financial update every Saturday Monthly Profit & Loss Statement Balance Sheet preparation Monthly closing within first 10 days Submit monthly financial summary to CEO: P&L, Cash Flow, Loans, Receivables, Payables Weekly bank reconciliation Track and analyze financial KPIs Manage business profit transfers Import, Costing & Audit Handle import LC documentation Prepare COGS reports for supplements & apparel Conduct stock aud"
  },
  {
    "url": "https://bdjobs.com/h/details/1458869?ln=1",
    "company_name": "A reputed Knit Composite Garments Head Office",
    "job_title": "Deputy General Manager (DGM) – Group Finance & Accounts",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Deputy General Manager (DGM) – Group Finance & Accounts : A reputed Knit Composite Garments Head Office Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A reputed Knit Composite Garments Head Office Deputy General Manager (DGM) – Group Finance & Accounts Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 40 to 45 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 40 to 45 years At least 10 year(s) working experience in 100% Export oriented Knit Composite Garments Industries. The applicants should have experience in the following area(s): Dealing with Income Tax Authorities-Income Tax Assessment or any other tax matters/VAT/Customs Duty/RJSC Matters/Secretarial Matters-Holding AGM, EGM, Directors Meeting, Meeting Minutes, Maintaining Share Register/Any Other Regulatory Matters. The applicants must have experience in working in 100% Export Oriented Knit Composite Garments Industry. Strong interpersonal skills, ability to communicate and manage well at all levels of the organization and with the stake holders. Strong problem solving and creative skills and the ability to exercise sound judgment and make decisions based on accurate and timely analyses. High level of integrity and dependability with a strong sense of urgency and results-orientation. Should have sound and updated knowledge on TAX & VAT and such related acts. Should have experience in ERP based accounting & production system. Should be sincere, polite, dynamic, hardworking & willing to work under pressure. Responsibilities & Context 1. Financial Reporting & Strategic Planning · Finalization of Accounts: Ensure timely and accurate preparation of monthly, quarterly, and annual financial statements, including balance sheets, P&L, and cash flow statements in compliance with IFRS and local laws. · MIS Reporting: Prepare and present Management Information System (MIS) reports, including variance analysis (actual vs. budget) for top management. · Budgeting: Coordinate the annual budgeting process, including setting cost-reduction objectives and financial forecasts. 2. Treasury & Working Capital Management · Fund Management: Monitor daily cash operations and ensure working capital availability. 3. Compliance & Regulatory Affairs (VAT, Tax & RJSC) · Ensure handling VAT & Income Tax related matter of different concerns of the group to ensure the measures that comply with all fiscal laws including Income Tax, VAT & Company Law. ·  Ensure proper documentation, control and maintain necessary records with respect to income tax-related issues, TDS, VDS, VAT & AIT & other hearing-related documents. · Matters related to RJSC - to prepare necessary documents for filing of annual return with"
  },
  {
    "url": "https://bdjobs.com/h/details/1458736?ln=1",
    "company_name": "A leading Liaison Office in Bangladesh",
    "job_title": "Print Technician",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Print Technician : A leading Liaison Office in Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A leading Liaison Office in Bangladesh Print Technician Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 28 to 45 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 28 to 45 years Skills Required: Ability to communicate effectively, ability to work as a team, Ability to Work Under Pressure, Communication in English Experience Requirements 4 to 5 year(s) The applicants should have experience in the following business area(s): Design/Printing/Publishing Additional Requirements Should possess enhanced Marketing skills. Proficiency in Microsoft Office applications, Adobe Illustrator and mail communication. Responsibilities & Context Job Context : A leading Liaison Office in Bangladesh Job Responsibility : Artwork & Design Coordination Risk Identification & Escalation Print Development & Approval Printing Process Control Quality Control during Printing ensure sample 100% as per buyer expectations, not factory assumption. Wash & Durability Performance Bulk Production Follow-up Documentation & Record Keeping Compliance & Safety Preferable who is handling license product and controlling factory as per customer requirement within the time frame. Compensation & Other Benefits Mobile bill Salary Review: Yearly Festival Bonus: 2 EPF\nGroup Insurance\nOther facilities will be provided as per company policy. Employment Status Full Time Job Location Dhaka Company Information A leading Liaison Office in Bangladesh Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Nee"
  },
  {
    "url": "https://bdjobs.com/h/details/1458176?ln=1",
    "company_name": "CM Trust Ltd",
    "job_title": "Manager - Accounts And Finance",
    "location": "Dhaka (Mohammadpur)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Manager - Accounts And Finance : CM Trust Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List CM Trust Ltd Manager - Accounts And Finance Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 24 to 35 years Location: Dhaka (Mohammadpur) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Age 24 to 35 years Responsibilities & Context 🔹 Financial Management & Control Oversee all finance and accounting operations of the super shop / retail chain/cafe/pharmacy/others Ensure accurate recording of sales, purchases, expenses, assets, and liabilities Maintain cash book, bank book, general ledger, sub-ledger, trial balance, and financial statements Monitor daily cash flow, bank balances, and working capital 🔹 Budgeting & Financial Planning Prepare annual budgets, forecasts, and cash flow projections Analyze budget variances and recommend corrective actions Support management with financial planning and cost optimization 🔹 Accounting & Compliance Ensure compliance with accounting standards, tax laws, VAT/GST, and company policies Prepare and submit statutory returns (VAT, Tax, Withholding, etc.) Coordinate with auditors for internal and external audits Maintain proper documentation for regulatory inspections 🔹 Revenue & Sales Accounting Monitor daily sales reconciliation (POS vs ERP vs bank) Ensure accurate recording of discounts, promotions, returns, and refunds Analyze sales trends and profitability by department 🔹 Inventory & Cost Control Coordinate with operations and inventory teams to ensure stock accuracy Monitor inventory valuation, shrinkage, wastage, and write-offs Implement cost control measures to reduce losses and improve margins 🔹 Expense Management Approve staff claims, vendor bills, and operational expenses Ensure timely and accurate payments to suppliers and employees 🔹 Banking & Treasury Manage bank accounts, reconciliations, and fund transfers Maintain relationships with banks and financial institutions Handle financing, credit facilities, and LC (if applicable) 🔹 ERP / System Management Ensure proper use of ERP / accounting software Improve financial processes through automation and system controls Train finance staff on systems and compliance requirements 🔹 Reporting & Management Support Prepare monthly, quarterly, and annual financial reports Support strategic decision-making with financial analysis 🎯 Key Skills & Competencies Strong knowledge of accounting standards & tax laws Retail / Super Shop finance experience ERP & POS system expertise Skills & Expertise Suggested by Accounts and Finance Data analysis Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mohammadpur) Company Informatio"
  },
  {
    "url": "https://bdjobs.com/h/details/1458689?ln=1",
    "company_name": "Badal And Company",
    "job_title": "Executive / Senior Executive- Business Development",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Executive / Senior Executive- Business Development : Badal And Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Badal And Company Executive / Senior Executive- Business Development Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 3–7 years of relevant experience in Business Development Must have hands-on experience in Logistics, C&F, and Freight Forwarding Strong understanding of freight forwarding processes (Air/Sea/Land)Knowledge of C&F documentation, customs procedures, and incoterms Excellent negotiation, communication, and presentation skills Ability to work independently and meet targets Willingness to travel as required Responsibilities & Context Identify and develop new business opportunities in Logistics, Transport, C&F, and Freight Forwarding services. Prepare and submit commercial proposals, quotations, and tenders . Maintain strong relationships with existing clients, shippers, importers, exporters, and agents . Coordinate with operations, documentation, and accounts teams to ensure smooth service delivery. Conduct market research to analyze competitors, pricing, and service trends. Achieve assigned sales targets and revenue growth . Follow up on leads and ensure timely contract closing . Prepare weekly and monthly sales and performance reports . Represent the company in meetings, negotiations, and client visits. Skills & Expertise Suggested by Sales & Marketing Business Development Market Research and Development Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Badal And Company Follow Address: RH Home Center (6th Floor) 74/B/1,Green Road, Dhaka-1215 Website: https://www.badalandco.com/ Business: We feel great pleasure to introduce ourselves that, we are Badal® and Company. One of the leading and oldest Freight Forwarding and Customs Clearing & Forwarding (C&F) Agent in Bangladesh. We are Operating & Handling combine extensive customs clearing and forwarding experience with the latest in information technology in this business since 1981. Badal® and Company is offering complete Import and Export customs clearance services at all major air and sea ports in Bangladesh. We have been working in Bangladesh with Dhaka and Chittagong Office. In order to meet the growing demand for a reliable global logistics service moving around in the world with our dedicated global partners in 168 countries. Badal® and Company is a global partner of BDP Global Network Services and furthermore we are also member of BAFFA, FIATA & IAM. We have a team of professionals who have a lot of experience in t"
  },
  {
    "url": "https://bdjobs.com/h/details/1458865?ln=1",
    "company_name": "Institute of Applied Health Sciences Hospital (IAHS-H),USTC Complex, Foy’ Lake, Khulshi, Chattogram",
    "job_title": "Director",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Director : Institute of Applied Health Sciences Hospital (IAHS-H),USTC Complex, Foy’ Lake, Khulshi, Chattogram Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Institute of Applied Health Sciences Hospital (IAHS-H),USTC Complex, Foy’ Lake, Khulshi, Chattogram Director Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Age: At least 40 years Location: Chattogram Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 40 years Good managerial and organizational skills, as well as excellent medical knowledge and training, Responsibilities & Context Job Context Applications are invited from energetic, self-motivated and experienced candidates for the  position of Director, IAHS-H on the prevailing terms  and conditions. Job Responsibilities Reviewing healthcare laws and regulations to implement in daily practices, monitoring facility or department budgets and developing strategies to improve communication between medical professionals and patients. Overseeing daily operations of a healthcare facility. Monitoring  and evaluating hospital performance metrics (e.g., patient flow, efficiency, costs etc). Managing the budget of IAHS-H. Assisting in the training and promotion of the medical staff of IAHS-H. Ensuring that the medical staff and facility comply with the, DGME, CMU, BMDC rules, regulations and codes. Ensuring adherence to healthcare regulations, safety standards, and accreditation requirements; Enhancing cooperation between Nurses, Physicians and relevant departments. Evaluating the coordination of the medical team to ensure the success of the institution. Recruiting and managing physicians, nurses, paramedics, and other medical and non-medical staff. Examining and coordinating the facilities to ensure quality service. Assisting with training, continuing education, and promotion of subordinate staff. Liaising with medical and non-medical departments and enhancing relationships with vendors. Updating, amending, and replacing medical policies with the advice of BoD of IAHS-H. Developing cooperation between physicians, paramedics, nurses, and medical departments of IAHS-H. Evaluating and managing any dysfunction of medical units. Keeping medical knowledge, experience, and licenses are up to date. Updating the facilities using latest technologies and modern automated medical equipment. Executing any other duties assigned by the authority. Workplace Work at office Employment Status Full Time Job Location Chattogram Read Before Apply Application in plain paper along with CV, passport-size photo, copy of NID, educational and experience certificates to the Chairman, Board of Directors, IAHS-H, Foy's Lake, Chattogram by email to iahs-h.apply.24@ustc.ac.bd Photograph must be enclosed with the resum"
  },
  {
    "url": "https://bdjobs.com/h/details/1458773?ln=1",
    "company_name": "PRAN Group",
    "job_title": "Assistant Depot In-Charge(ADIC)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Assistant Depot In-Charge(ADIC) : PRAN Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List PRAN Group Assistant Depot In-Charge(ADIC) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Age: 22 to 32 years Location: Anywhere in Bangladesh Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 22 to 32 years Strong leadership and problem-solving skills Good Communication Skills Good Knowledge in MS Office Applications(Excel, Word, Power point) Knowledge of safety and compliance standards Responsibilities & Context Supervise day-to-day depot operations, including receiving, storing, and dispatching goods Ensure proper stock management, documentation, and record-keeping Monitor inventory levels and prevent stock shortages or overstocking Coordinate with the Head Office, transport, and sales teams for smooth distribution Maintain depot cleanliness, safety, and compliance standards Prepare daily, weekly, and monthly reports on stock and operations Support and manage depot staff to achieve operational efficiency Handle customer or distributor queries professionally Skills & Expertise Distribution Good Knowledge in MS Office and G Suite Store Management Compensation & Other Benefits Mobile bill,Provident fund Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Other facilities as per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information PRAN Group Follow More jobs from this company Address: PRAN Center, 105 Middle Badda, Dhaka- 1212. Website: www.pranfoods.net; www.chorkatextile.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning R"
  },
  {
    "url": "https://bdjobs.com/h/details/1458878?ln=1",
    "company_name": "Zentixsofttech Private Limited",
    "job_title": "English Speaking Call Center Executive",
    "location": "Dhaka (Nikunja)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "English Speaking Call Center Executive : Zentixsofttech Private Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Zentixsofttech Private Limited English Speaking Call Center Executive Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Age: 18 to 45 years Location: Dhaka (Nikunja) Salary: Tk. 15000 - 30000 (Monthly) Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 45 years Responsibilities & Context Customer Service Agents (US Process – Sales & Customer Support) Location: Nikunja 2, Dhaka (On-site) Company: Zentixsofttech Limited – US-Based Software & Business Solutions Company (Bangladesh Office) Employment Type: Full-time / Part-Time (Night Shift Preferred – US Hours) Salary Range: BDT 15,000 – 35,000 (Based on experience) Probation Period: 1–2 months Vacancy: 6 Positions (Day/Night Shifts – US Hours) Full Time/Part Time About Zentixsofttech Limited: At Zentixsofttech , we partner with businesses to turn ideas into scalable digital solutions. As a U.S.-based technology startup, we offer software development, growth strategy, digital marketing(SEO,PPC,SMM), sales support, and customer engagement services. Our focus is on building smarter systems, empowering teams, and creating meaningful customer experiences through innovation and automation. Educational Requirements ● Minimum A‑Levels ● Bachelor’s degree preferred ● MBA or other advanced degrees is a plus Job Responsibilities ●     Handle inbound and outbound calls from clients globally regarding travel bookings, airline reservations, chauffeur services, car rentals, and taxi bookings. ●     Book and manage flight tickets, hotel reservations, and ground transportation services while addressing customer inquiries. ●     Perform sales, upselling, and lead qualification for travel-related software, services, and packages. ●     Provide professional customer support via phone, following standardized scripts and service protocols. ●     Maintain accurate call records, CRM updates, and customer data related to transportation and travel services. ●     Coordinate with internal teams including reservations, sales, marketing, Inbound/Outbound cold calling and technical support to ensure seamless customer experience. ●     Meet daily/weekly call quality and performance targets, including booking accuracy, response time, and customer satisfaction metrics. Experience Requirements ●     Min 6mo -1 year experience in international call center / BPO / telemarketing ●     Experience in sales, lead generation, or appointment setting ●     Experience working with CRM software and call management systems ●      Proven organizational and interpersonal skills. ●      Able to speak clearly"
  },
  {
    "url": "https://bdjobs.com/h/details/1458856?ln=1",
    "company_name": "Fiber @ Home Ltd.",
    "job_title": "People Analytics Specialist (Manager/Deputy Manager)",
    "location": "Dhaka (GULSHAN 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "People Analytics Specialist (Manager/Deputy Manager) : Fiber @ Home Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fiber @ Home Ltd. People Analytics Specialist (Manager/Deputy Manager) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 30 to 37 years Location: Dhaka (GULSHAN 1) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Age 30 to 37 years Bachelor’s or Master’s degree in HR, Statistics, Business Analytics, MIS, Data Science, or related field. Advanced proficiency in MS Office, exposure to Power Query, Power BI or DAX will be treated as added advantage. Strong analytical, stakeholder management, and communication skills. Prior experience in Telecom/IT or large conglomerates preferred. Ability to translate complex data into simple business insights. Responsibilities & Context HR Analytics Develop and maintain HR dashboards and reports (headcount, attrition, hiring, performance, cost etc.). Analyze workforce trends and provide predictive insights for manpower planning. Support talent analytics, including hiring effectiveness, time-to-fill, and quality of hire, etc. Conduct attrition and engagement analysis and recommend data-backed actions. Ensure data accuracy, integrity, and governance within HR systems. Collaborate with C&B, Talent Acquisition, and Learning & Development teams on analytics needs. Automate HR reports using Excel, Power Pivot, Power BI or DAX. Prepare management-ready insights and presentations. Work closely with internal software team to ensure data integrity, upgradation, development initiatives in HRIS. Stakeholder & Leadership Support Act as a subject matter expert on HR analytics for people management and cross-functional stakeholders. Provide analytical support for budgeting, manpower planning, cost optimization and other developmental initiatives. Upon requirement, provide analytical support to the functions of other departments of the organization. Compensation & Other Benefits Competitive Salary Contributory Provident Fund Medical Insurance Two Festival Bonuses Annually Two weekly holidays Group Life Insurance Annual Salary Review Subsidized Lunch End-of-Service Benefits Workplace Work at office Employment Status Full Time Job Location Dhaka (GULSHAN 1) Company Information Fiber @ Home Ltd. Follow More jobs from this company Address: House # 7/B, Road # 13, Gulshan-1, Dhaka-1212 Business: Fiber @ Home Ltd. is the company which acquired the NTTN (Nationwide Telecommunication Transmission Network) & ITC (International Terrestrial Cable )  license, issued by the GOB. Fiber @ Home has been formed with the professionals and financial backing from leading telecommunication entrepreneurs of the country and in the venture of laying out fiber optic network "
  },
  {
    "url": "https://bdjobs.com/h/details/1458767?ln=1",
    "company_name": "Emam Travels & Tours Ltd.",
    "job_title": "Marketing Executive",
    "location": "Dhaka (Badda, Banani, Kalachandpur, Khilgaon, Khilkhet, Kochukhet, Merul Badda, Mirpur, Mohakhali, Rampura, Vatara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Marketing Executive : Emam Travels & Tours Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Emam Travels & Tours Ltd. Marketing Executive Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 18 to 34 years Location: Dhaka (Badda, Banani, Kal... Dhaka (Badda, Banani, Kalachandpur, Khilgaon, Khilkhet, Kochukhet, Merul Badda, Mirpur, Mohakhali, Rampura, Vatara) Salary: Tk. 10000 - 20000 (Monthly) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 34 years Responsibilities & Context Promote overseas and local job vacancies to attract suitable candidates. Create and publish job advertisements on social media, job portals, and other marketing channels. Generate leads and maintain regular follow-up with interested candidates. Counsel candidates about job roles, salary, duty hours, benefits, and visa process. Coordinate interview schedules and inform candidates about date, time, and required documents. Assist candidates with documentation such as CV, passport, medical, and other requirements. Communicate with foreign employers, agents, and recruitment partners regarding manpower demand. Achieve monthly and project-based recruitment and marketing targets. Conduct market research on manpower demand, salary trends, and competitor activities. Visit others Travels Agency, institutes, and field areas to source candidates. Handle walk-in clients, phone calls, and online inquiries professionally. Maintain and update candidate databases and follow-up records. Coordinate closely with processing, visa, and operations teams. Promote company brand image and maintain transparency and trust with candidates. Prepare daily, weekly, and monthly marketing and recruitment reports. Independently shoot and create advertisement promotion content (photos and videos) for job marketing. Skills & Expertise Suggested by Sales & Marketing Target Oriented Customer Relations Compensation & Other Benefits T/A,Mobile bill,Gratuity,Performance bonus Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Badda, Banani, Kalachandpur, Khilgaon, Khilkhet, Kochukhet, Merul Badda, Mirpur, Mohakhali, Rampura, Vatara) Company Information Emam Travels & Tours Ltd. Follow Address: 93/2 Chowdhury Complex (4th Floor), Bir Uttam Jiaur Rahman Road, Banani (Kakoli), Dhaka-1213. Business: Company Information Emam Travels & Tours Ltd. Address : 87 Jahan Bhaban (3rd Floor), Bir Uttam Jiaur Rahman Road, Banani (Kakoli), Dhaka-1213. Web : www.emamtravel.com Business : Emam Travels & Tours Ltd. is proud to be one of the leading private limited company of Bangladesh, a trusted name in the service sector. The company was founded in 1997, at the dawn of an age when B"
  },
  {
    "url": "https://bdjobs.com/h/details/1454315?ln=1",
    "company_name": "Society for Assistance to Hearing Impaired Children (SAHIC)",
    "job_title": "Speech Therapist / Senior Speech Therapist",
    "location": "Dhaka (Mohakhali)",
    "salary": "Negotiable",
    "experience": null,
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Speech Therapist / Senior Speech Therapist : Society for Assistance to Hearing Impaired Children (SAHIC) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Society for Assistance to Hearing Impaired Children (SAHIC) Speech Therapist / Senior Speech Therapist Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 03 Location: Dhaka (Mohakhali) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Preferred: 7/8 years of experience as a Speech Therapist in hospitals, special schools, or rehabilitation centers. Strong communication, counseling, and interpersonal skills. Ability to work effectively in a multidisciplinary team environment. Good documentation, reporting, and record-keeping skills. Experience working with children with special needs is an advantage. Patience and a patient-centered approach to care Ability to manage workload and maintain therapy schedules. Willingness to work in hospital, school, or field settings if required. Commitment to professional ethics and institutional policies. Basic computer literacy, including MS Word, Excel, and ERP systems. Responsibilities & Context Conduct primary screening, assessment, and evaluation of patients referred by physicians. Plan and conduct speech and language therapy sessions according to patient age, diagnosis, and condition. Provide specialized therapy services for autism, cochlear implant users, and other special cases. Prepare therapy materials, documents, and teaching aids based on individual patient needs. Deliver quality therapy services ensuring adequate session time and patient engagement. Monitor patient progress and conduct parent/caregiver counseling sessions. Maintain therapy diaries, patient lists, and daily appointment schedules. Schedule therapy sessions and assist in fee collection and coordination processes. Prepare and submit therapy session reports in prescribed formats. Supervise, mentor, and train junior therapists and team members. Inspect speech therapy rooms, equipment, and therapeutic environment on a daily basis. Workplace Work at office Employment Status Full Time Job Location Dhaka (Mohakhali) Company Information Society for Assistance to Hearing Impaired Children (SAHIC) Follow More jobs from this company Address: Kha-16, Mohakhali Health Complex, Mohakhali, Dhaka-1212, Bangladesh Business: The Society for Assistance to Hearing Impaired Children (SAHIC) is a well-established voluntary non-government organization founded in 1987 and registered with the Department of Social Services and the NGO Affairs Bureau. Founded by Professor M. Nurul Amin, a distinguished ENT specialist, SAHIC is dedicated to the prevention, early detection, and rehabilitation of hearing-impaired children in Bangladesh.\n\nWith the support of Andheri Hilfe, Germany, an"
  },
  {
    "url": "https://bdjobs.com/h/details/1458814?ln=1",
    "company_name": "Square Food & Beverage Ltd.",
    "job_title": "Sales Officer",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Sales Officer : Square Food & Beverage Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Square Food & Beverage Ltd. Sales Officer Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At most 29 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At most 29 years Experience in FMCG industry will get preference Highly motivated to work anywhere in Bangladesh Responsibilities & Context Square Food & Beverage Ltd. is a leading, fast growing and ISO standard company in Bangladesh. We offer a challenging work environment, diverse job opportunities with competitive salaries and benefits. To support its continuous growth, we are looking for a smart, energetic and hard-working team member for the below position. Key Responsibilities: To ensure monthly sales target. To implement all trade and consumer end offer & program. To secure & make order from parties as per permanent journey plan (PJP) and ensure delivery through distributor’s manpower. Continuous feedback to superiors regarding market activities. Skills & Expertise Suggested by Client Management Client Relationship Management Client Service/ Marketing Sales & Marketing Sales target Customer Service Compensation & Other Benefits An attractive and competitive benefits package will be offered as per company policy. Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Square Food & Beverage Ltd. Follow More jobs from this company Address: SFBL Tower, 11/C Banani, Road No: 27, Dhaka - 1213 Business: Square Food & Beverage Limited (SFBL), a sister concern of Square Group, is the leading corporate house in Bangladesh. For its obsession with quality management, the company had obtained the international quality standard ISO 9001 in 2005 and ISO 22000 for its food safety management system in 2010. Square Food & Beverage Ltd. has introduced five popular brands in the market namely Radhuni, Ruchi, Chashi, Chopstick and Aaram, while Radhuni is the company`s flagship brand. SFBL now exports its international standards products to 48 countries all around the globe. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the"
  },
  {
    "url": "https://bdjobs.com/h/details/1458761?ln=1",
    "company_name": "Keda Building Materials Industri Ltd",
    "job_title": "এজিএম / ডিজিএম (মার্কেটিং)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "এজিএম / ডিজিএম (মার্কেটিং) : Keda Building Materials Industri Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Keda Building Materials Industri Ltd এজিএম / ডিজিএম (মার্কেটিং) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements যোগ্যতা ও অভিজ্ঞতা: মাস্টার্স/এমবিএ ডিগ্রী সহ কোন খ্যাতনামা প্রতিষ্ঠানে সংশ্লিষ্ট পদে ০৬-০৭ বছরের বাস্তব অভিজ্ঞতা সম্পন্ন। অভিজ্ঞ প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য। Responsibilities & Context বাংলাদেশ ও বিদেশী বিনিয়োগে স্থাপিত একটি বিল্ডিং ম্যাটেরিয়াল (এলুমিনিয়াম এর দরজা এবং জানালার লক ও হুইল) প্রস্তুতকারক প্রতিষ্ঠানে অভিজ্ঞতা সম্পন্ন লোক নিয়োগ করা হবে। Skills & Expertise Suggested by Sales & Marketing Sales target Customer Service Client Relationship Management Business Development Compensation & Other Benefits বেতন: বেতন ও অন্যান্য সুযোগ সুবিধা আলোচনা সাপেক্ষে। Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Keda Building Materials Industri Ltd Follow More jobs from this company Address: Room # 23, (1st Floorl), Land view Commercial Centre, Gulshan-2, DHAKA-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable "
  }
]