[
  {
    "url": "https://bdjobs.com/h/details/1464174?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464185?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464129?ln=1",
    "company_name": "Liz Fashion Industry Ltd.",
    "job_title": "Junior Executive/Executive-Welfare",
    "location": "Gazipur",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Junior Executive/Executive-Welfare : Liz Fashion Industry Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Liz Fashion Industry Ltd. Junior Executive/Executive-Welfare Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At least 26 years Location: Gazipur Salary: Negotiable Experience: At least 2 years Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor’s or Master’s degree in any discipline Experience At least 2 years Additional Requirements Age At least 26 years Only Female 2 to 6 years of hands-on experience in employee welfare management. Strong interpersonal and communication skills. Good knowledge of labor laws and statutory compliance. Knowledge of employee engagement strategies. Responsibilities & Context Employee Welfare & Well-being: Responsibilities to ensure good relationship communication bridge between employees & management. Conduct daily workers counseling, provide motivation to ensure workers satisfaction & to reduce absenteeism & migration. Observing different facilities including, canteen, waiting room, childcare center, adequate number of toilets and latrines, drinking water etc. Look after the child care center and monitor the babysitter’s work. Worker’s canteen/dinning & prayer room management. Counseling & Employee Support: Helping the workers for having leaves granted with salary facilities and informing the workers about all kinds of leaves and other relevant regulations. Providing necessary help and advice to the workers and the Management Authority in order to implement the regulations of the factory. To provide guidance in view to provide them due leave and any other legal benefits as applicable by law. Grievance Handling: Responsible for collect the grievances from workers & grievance box & ensure all the grievance is solved as per company grievance procedure as well as Bangladesh labor law. To counsel the workers on general issues as like, company rules, regulations, policies, procedures and discipline. Conduct of PC, Safety, Canteen & Grievance Committee meeting. Record grievances and ensure proper and timely resolution. Maternity Issue: Make the list of maternity workers and follow up them. Prepare maternity bill and Make payments considering company procedure. To follow up subordinates day-to-day Activities to ensure Maternity benefits. Prepare maternity summary. Training & Awareness Sessions: Responsibilities to make monthly training calendar & provide training to all the workers such as all kind of compliance training, maternity benefits, health & safety & buyer COC as well as factory’s implemented policy training with kept the training documents. Conduct daily, weekly internal audits for ensure compliance standards such as social, technic"
  },
  {
    "url": "https://bdjobs.com/h/details/1464137?ln=1",
    "company_name": "Epic Group",
    "job_title": "GM - Planning",
    "location": "Dhaka (Tejgaon)",
    "salary": "Negotiable",
    "experience": "12 to 14 years",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "GM - Planning : Epic Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Epic Group GM - Planning Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Dhaka (Tejgaon) Salary: Negotiable Experience: 12 to 14 years Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor’s degree in Industrial Engineering / Textile Engineering / Business Administration or relevant field. Experience 12 to 14 years The applicants should have experience in the following business area(s): Garments Responsibilities & Context Prepare monthly, quarterly, and annual production plans. Ensure accurate capacity booking based on SMV, efficiency, and line capability. Balance order loading across lines to avoid bottlenecks. Monitor daily production vs. plan and take corrective actions. Align planning with merchandising to ensure feasible delivery dates. Monitor T&A (Time & Action) calendar compliance. Ensure 100% on-time shipment performance. Identify risk orders early and develop recovery plans. Coordinate with Merchandising, IE, Production, Cutting, Sewing, Finishing, and QA. Work closely with the Commercial team for shipment planning. Support factory management in decision-making through planning data analysis. Implement planning tools, ERP, and digital dashboards. Develop SOPs for planning and monitoring processes. Improve forecast accuracy and reduce last-minute changes. Lead and mentor planning team members. Develop succession planning within the department. Ensure accountability and performance management. Workplace Work at office Employment Status Full Time Job Location Dhaka (Tejgaon) Company Information Epic Group Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joysh"
  },
  {
    "url": "https://bdjobs.com/h/details/1462844?ln=1",
    "company_name": "Niduslab",
    "job_title": "Intern (Paid) to Senior Marketing Executive",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "25 Mar 2026",
    "job_description": "Intern (Paid) to Senior Marketing Executive : Niduslab Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Niduslab Intern (Paid) to Senior Marketing Executive Application Deadline : 25 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 20 to 32 years Location: Dhaka Salary: Negotiable Experience: 1 to 3 years Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor of Business Administration (BBA) in Marketing Bachelor of Science (BSc) in Computer Engineering Bachelor of Business Studies (BBS) Bachelor in Engineering (BEngg) Experience 1 to 3 years The applicants should have experience in the following business area(s): Direct Selling/Marketing Service Company, Market Research Firms Freshers are also encouraged to apply. Additional Requirements Age 20 to 32 years Responsibilities & Context Intern (Paid) → Senior Marketing Executive High-Performance Marketing Bootcamp Program Company: NidusLab Industry: AI-powered HR SaaS, Job Marketplace, Digital Solutions Location: Bangladesh Type: Full-time, On-site Program Nature: Structured Career Acceleration (Not a regular job) This Is Not for Everyone. This is a merit-driven, high-performance marketing bootcamp built to develop future marketing leaders inside NidusLab. If you want comfort, routine hours, or slow growth—this program is not for you. If you want accelerated responsibility, real execution, and leadership progression , read on. 🎯 Who This Program Is Designed For We are intentionally selective. We’re looking for candidates with hunger, discipline, and learning velocity : Fresh graduates Professionals with 1–2 years of experience Career switchers with a strong growth mindset Low-commitment applicants will self-filter here—and that’s by design. 📈 Structured Promotion Roadmap (Merit-Based) Your growth is measured by performance, output, and leadership potential —not tenure. 1️⃣ Intern (Paid) Duration: 6-8 months Stipend: BDT 10,000 2️⃣ Junior Marketing Executive (Probation) Duration: 6–8 months Salary: BDT 18,000–22,000 + performance incentives 3️⃣ Junior Marketing Executive (Confirmed) Duration: 12–18 months Salary: BDT 25,000–35,000 + performance incentives 4️⃣ Senior Marketing Executive Salary: BDT 40,000–60,000 + performance incentives ➡️ Promotions are earned. Every stage is performance-gated. 🎓 Education Requirement Bachelor’s degree in any discipline from a reputed institution Marketing or business background preferred , not mandatory 🛠 Core Skills We Expect (or Will Sharpen Fast) Canva & basic design execution Digital marketing fundamentals (content, performance, funnels) Video editing (short-form & promotional content) Clear communication & presentation Negotiation, outreach & lead engagement Strong willingness to learn and execute under pressure ⚡ Work Culture Transparency (Read Carefully) We value honesty over hype"
  },
  {
    "url": "https://bdjobs.com/h/details/1464153?ln=1",
    "company_name": "Boropool Limited",
    "job_title": "Client Acquisition Executive (Student Visa & Work Permit Services)",
    "location": "Dhaka (GULSHAN 2)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Client Acquisition Executive (Student Visa & Work Permit Services) : Boropool Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Boropool Limited Client Acquisition Executive (Student Visa & Work Permit Services) Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 42 years Location: Dhaka (GULSHAN 2) Salary: Tk. 40000 - 60000 (Monthly) Experience: 1 to 3 years Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Experience 1 to 3 years The applicants should have experience in the following business area(s): Call Center, Coaching Center, Direct Selling/Marketing Service Company, Immigration and Education Consultancy Service, Immigration/Visa Processing, Manpower Recruitment, Real Estate, Tour Operator, Training Institutes, Travel Agent Freshers are also encouraged to apply. Additional Requirements Age 22 to 42 years We are looking for candidates who: - Are confident and persuasive communicators - Are comfortable working with monthly sales targets - Are active on social media and networking - Enjoy target-based work environment - Want long-term career in sales and client acquisition - Are disciplined and comfortable working in an office environment Responsibilities & Context Job Context BOROPOOL LTD is a premium Global Mobility & Migration Firm helping Bangladeshi students and professionals study and work abroad. We are hiring target-driven Client Acquisition Executives whose main responsibility is to bring new clients for our Student Visa and Skilled Work Permit services. This is a performance-focused, target-based role . Candidates must be comfortable working with monthly targets. Core Responsibility 👉 Your main job is to bring new clients to BOROPOOL and achieve monthly sign-up targets. You are NOT responsible for visa processing or documentation. Your role is purely focused on client acquisition and sign-ups. Job Responsibilities Client Acquisition & Target Achievement: Find and bring new clients interested in student visa and work permit services Convert prospects into signed clients Achieve assigned monthly client sign-up targets Lead Generation Activities: Generate leads using Facebook, TikTok and other social media platforms Participate in online LIVE sessions and content activities Use personal network and referrals to generate prospects Follow up interested leads regularly Service Knowledge Requirement: Learn and understand BOROPOOL services clearly Explain the basic process and benefits confidently to potential clients Represent the company professionally in online and offline communication Performance Measurement: Performance will be evaluated based on: Monthly client sign-up target achievement Lead generation activity Skills & Expertise Business Development Client Acquisition "
  },
  {
    "url": "https://bdjobs.com/h/details/1464130?ln=1",
    "company_name": "Vintage Denim Apparels  Ltd.",
    "job_title": "Welfare Officer",
    "location": "Gazipur (Sreepur)",
    "salary": "Negotiable",
    "experience": "1 to 4 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Welfare Officer : Vintage Denim Apparels  Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Vintage Denim Apparels  Ltd. Welfare Officer Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Age: At most 30 years Location: Gazipur (Sreepur) Salary: Negotiable Experience: 1 to 4 years Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor/Honors IRI Training Welfare Training Experience 1 to 4 years The applicants should have experience in the following business area(s): Garments Additional Requirements Age At most 30 years Only Female Strong communication and interpersonal skills to effectively deal with factory workers and management. Good English communication skills are mandatory. Sound understanding & knowledge of factory compliance, labour law and worker welfare practices will be an added advantage. Ability to handle worker grievances, disciplinary issues, and welfare-related matters with empathy and professionalism. Proficiency in MS Office applications, reporting and documentation handling.Ability to maintain confidentiality and responsibly manage sensitive worker and compliance-related information. Responsibilities & Context Maintain effective communication with workers and address welfare-related issues. Handle employee concerns related to harassment, maternity, health & Safety and absenteeism. worker counselling for improvement of attendance, leave and productivity. Arrange worker awareness regarding company rules and regulations. Ensure proper documentation, reporting and record keeping of worker grievance. Follow up absent worker, pregnant worker and sick workers. Follow up medical related purchase and maintain inventory record. Coordinate with HR and management on employee welfare activities. Follow up injury and maintain compliance way Support a positive and compliant working environment. Employment Status Full Time Gender Only females are allowed to apply. Job Location Gazipur (Sreepur) Company Information Vintage Denim Apparels  Ltd. Follow Address: Boherarchala, Sreepur, Gazipur. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Ta"
  },
  {
    "url": "https://bdjobs.com/h/details/1464145?ln=1",
    "company_name": "Intertek Bangladesh",
    "job_title": "Supervisor/Assistant Manager - Accessories Sales, Dhaka",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "4 to 8 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Supervisor/Assistant Manager - Accessories Sales, Dhaka : Intertek Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Intertek Bangladesh Supervisor/Assistant Manager - Accessories Sales, Dhaka Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Dhaka Salary: Negotiable Experience: 4 to 8 years Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Experience 4 to 8 years Additional Requirements Educational Requirement - Bachelor’s degree in Business Administration, Marketing, Textile Engineering, or related field. Experience Requirement - 4–8 years of experience in B2B sales / Business Development. - Prior experience in accessories, trims, packaging, softlines, or garment-related industry preferred. - Proven track record of revenue generation and new market development. - Strong negotiation and customer relationship management skills. Responsibilities & Context Develop and execute a dedicated sales strategy for accessories segment revenue Identify and develop new customers and market opportunities Manage existing accounts and expand accessories portfolio penetration. Conduct proactive customer visits, product presentations, and negotiations. Coordinate with sourcing, operations, and global teams for portfolio alignment. Track sales pipeline, revenue forecasting, and monthly performance reporting. Monitor market trends and industry activities Skills & Expertise Communication Skills Collaboration and Teamwork Working under pressure Proactive and Positive attitude Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Intertek Bangladesh Follow More jobs from this company Address: Phoenix Tower, (2nd & 3rd Floor) 407, Tejgaon Industrial Area, Dhaka-1208, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্র"
  },
  {
    "url": "https://bdjobs.com/h/details/1464146?ln=1",
    "company_name": "BJIT Ltd.",
    "job_title": "Junior Electrical Engineer",
    "location": "Japan",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "13 Mar 2026",
    "job_description": "Junior Electrical Engineer : BJIT Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List BJIT Ltd. Junior Electrical Engineer Application Deadline : 13 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Age: 20 to 29 years Location: Japan Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Electrical & Electronic Engineering Additional Requirements Age 20 to 29 years Responsibilities & Context BJIT is Hiring on behalf of SUNTEC! Job Title : Junior Electrical Engineer Company : SUNTECH Location : Japan Vacancy : 10 Job Type : Full-time Application Deadline: 13th March 2026 Job Summary: Embark on a transformative journey as a Junior Electrical Engineer! One-year training in Dhaka, followed by a dynamic career in Japan awaits. Seize the opportunity to shape the future of electrical engineering. Apply now and spark your career with us! Required qualification and experience: ·        Acquired a degree majoring in Electrical engineering at the university ·        Are willing to receive Japanese Language and technical training for 1 year ·        Suitable candidates must be ambitious and able work in Japan after the training completes. ·        Must be comfortable working in both desk & construction site in Japan. ·        Are willing to engage in electrical equipment construction engineering working in Japan ·        Have a medical examination including tuberculosis check-up and hepatitis inspection. Supplementary Explanation on Working in Dhaka: ① One-year training period time in Dhaka the Japanese language school will assign homework. This homework will be checked at the Japanese language school on Sunday. ② Working hours: Sunday - Thursday 8: 30 － 17: 30 (break time 13: 00-14: 00) Prioritize the Japanese language training schedule. Conditions for Transfer to Japan ① During Japanese language training period, each candidate must take Japanese language Proficiency Test and get N5 and N4 qualification. Examination fees will be paid by the Company. If each candidate passes, the Company provides a reward of 2,000Tk each. ② Each candidate must obtain a driver’s license in Bangladesh by the later of either one year after joining the Bangladesh branch or the completion of the Japanese language school training. If a candidate does not fulfill the above conditions ① and ②, the candidate will not be able to transfer to Japan, and the employment contract will be terminated. Supplementary Explanation on Working in Japan: ① After being transferred to the head office in Japan, you must obtain the following two qualifications within one year: ・Japanese Language Proficiency Test (JLPT) N3 ・A second-class Electrician Certification If you fail to obtain these qualifications by the deadline, you will not be able to work in Japan and will have to return to Bangladesh. ② Install"
  },
  {
    "url": "https://bdjobs.com/h/details/1464164?ln=1",
    "company_name": "WISH COIN",
    "job_title": "Executive - Marketing & Sales",
    "location": null,
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Executive - Marketing & Sales : WISH COIN Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List WISH COIN Executive - Marketing & Sales Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: At least 25 years Location: Dhaka, Dhaka (Lalmatia) Salary: Negotiable Published: 27 Feb 2026 Application Insights View Requirements Education Diploma Bachelor/Honors Masters Additional Requirements Age At least 25 years Only Male Responsibilities & Context Job Responsibilities: Generate new clients and maintain strong relationships with existing clients Promote interior design services and achieve sales targets Conduct client meetings and site visits Prepare quotations and follow up with potential customers Coordinate with design and project teams Educational Qualification: Minimum Graduate or Diploma Completed (any discipline) Requirements: Good communication and negotiation skills Smart, energetic and self-motivated Basic knowledge of MS Office Previous experience in marketing/sales will be preferred Job Location: Flat-4A, House: 5/9, Block-B, Lalmatia, Dhanmondi Salary & Benefits: Salary: Negotiable (Based on experience and performance) 02 Festival Bonuses per year. Probation Period: 04 months (Permanent position will be confirmed based on performance) Yearly Increment based on performance evaluation Interested candidates are requested to send their CV to: wishcoinbd@ gmail.com Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka, Dhaka (Lalmatia) Job Highlights We are looking for energetic, self-motivated freshers to join as Marketing & Sales Executives. A great opportunity to learn, achieve targets, and grow your career in a dynamic professional environment. Company Information WISH COIN Follow Address: House: 5/9, Block-B, Lalmatia, Dhaka Website: http://wishcoinbd.com Business: We do Interior & Exterior Design of Residential, Commercial, Landscape and any kind of space. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certif"
  },
  {
    "url": "https://bdjobs.com/h/details/1464155?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463828?ln=1",
    "company_name": "Gono Unnayan Prochesta (GUP)",
    "job_title": "সহ-সমন্বয়কারী-আই.টি",
    "location": "Faridpur, Madaripur",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "28 Mar 2026",
    "job_description": "সহ-সমন্বয়কারী-আই.টি : Gono Unnayan Prochesta (GUP) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Gono Unnayan Prochesta (GUP) সহ-সমন্বয়কারী-আই.টি Application Deadline : 28 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Age: At most 38 years Location: Faridpur, Madaripur Salary: Tk. 42000 - 47800 (Monthly) Experience: At least 5 years Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering কম্পিউটার সাইন্স এন্ড ইন্জিনিয়ারিং স্নাতক । Experience At least 5 years The applicants should have experience in the following business area(s): NGO, Development Agency, Micro-Credit Additional Requirements Age At most 38 years জি-ব্যাংকারে  অথবা মাইক্রোফিন-360 সফটওয়্যারে নুন্যতম 5 বছরের কাজের অভিজ্ঞতা বাস্তব থাকতে হবে। এমআইএস এআইএস সহ পিকেএসএফ ও এমআরএএর চাহিদা মোতাবেক সকল রিপোর্ট তৈরির বাস্তব অভিজ্ঞতা থাকতে হবে। MS Excel, database Management, এবং Data Analysis এ দক্ষ হতে হবে। 05 বছর যে কোন এনজিও এমআইএস অফিসার হিসাবে কাজ করার অভিজ্ঞতা থাকতে হবে। মোটর সাইকেল চালনায় পারদর্শী এবং বৈধ ড্রাইভিং লাইসেন্স এবং নিজস্ব মোটর সাইকেল থাকতে হবে। অধিকতর যোগ্যতা  সম্পন্ন প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা ও বয়স শিথিলযোগ্য। Responsibilities & Context গণ উন্নয়ন প্রচেষ্টা ১৯৭৩ সাল থেকে জাতীয় পর্যায়ের একটি বেসরকারী উন্নয়ন সংস্থা। সংস্থাটি মাইক্রোক্রেডিট রেগুলেটরী অথিরিটি কর্তৃক সনদপ্রাপ্ত, সনদ নম্বর ০০৭৬৮-০০৬৪৭-০০৪০৩। সংস্থাটি পিকেএসএফ এর অর্থায়নে ঢাকা, গোপালগঞ্জ, মাদারীপুর, ফরিদপুর, শরীয়তপুর, বরিশাল, চট্টগ্রাম, কক্সবাজার জেলার বিভিন্ন উপজেলায় ঋণ কর্মসূচীর শাখা বৃদ্ধির লক্ষ্যে জরুরী ভিত্তিতে উদ্যোমী ও দক্ষ কর্মকর্তা/কর্মচারী নিয়োগের জন্য আগ্রহী প্রার্থীদের নিকট থেকে দরখাস্ত আহবান করছে। প্রধান দায়িত্ব এবং ক্ষমতা বাস্তবায়ন: প্রতিমাসে কর্ম পরিকল্পনা অনুযায়ী শাখা পরিদর্শন করা সফটওয়্যার এর সকল প্রকার কারিগরী সহযোগিতা প্রদান করা। শাখা হিসাবরক্ষকদের প্রশিক্ষণের মাধ্যমে দক্ষ করে গড়ে তোলা। এমআইএস/মাসিক প্রতিবেদন তৈরী করে সংশ্লিষ্ট ডেস্কে প্রেরণ করা। শাখার পারফরমেন্স এর উপর ভিত্তি করে পরিদর্শনকৃত শাখার প্রতিবেদন তৈরী করে সমন্বয়কারী-আইটি কে প্রদান করা। পিকেএসএফ, এমআরএ ও সিডিএফ সহ সকল প্রকার প্রতিবেদন চাহিদা মোতাবেক তৈরি করা। কম্পিউটার ডাটা সমূহ এবং অন্যান্য এমআইএস তথ্য সব সময় আপডেট রাখা। সংস্থার সকল কম্পিউটার এর হার্ডওয়্যার ও সফটওয়্যার এর সচলতা নিশ্চিত করা। Skills & Expertise Suggested by Microcredit Microfinance program Data Management Compensation & Other Benefits বেতন-প্রবেশনকালীন সময়ে সর্বসাকুল্যে 42,০০০/= টাকা। প্রবেশনকাল 06 মাস  সমাপ্ত হলে মূল্যায়ন পরবর্তী সংস্থার নিয়মিত বেতন স্কেলে (গ্রেড-০৯) 47,800/= প্রদান করা হবে । সংস্থার নিয়মিত কর্মী হিসাবে স্থায়ীকরণের পর প্রভিডেন্ট ফান্ড, গ্রাচ্যুইটি , উৎসব ভাতা এবং বৈশাখী ভাতা প্রদান করা হবে। Employment Status Full Time Job Location Faridpur, Madaripur Apply Procedure Hard Copy আগ্রহী প্রার্থীদের পাসপোর্ট সাইজের ২ কপি সদ্য তোলা রঙিন ছবি, সকল শিক্ষাগত যোগ্যতার সনদপত্রের "
  },
  {
    "url": "https://bdjobs.com/h/details/1464169?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464144?ln=1",
    "company_name": "Barnali Textile & Printing Industries (Pvt.) Ltd.",
    "job_title": "Deputy Manager/ Manager- Planning & Control (Knit Composite Industry)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "At least 7 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Deputy Manager/ Manager- Planning & Control (Knit Composite Industry) : Barnali Textile & Printing Industries (Pvt.) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Barnali Textile & Printing Industries (Pvt.) Ltd. Deputy Manager/ Manager- Planning & Control (Knit Composite Industry) Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Experience: At least 7 years Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education B.Sc in Textile Engineering OR Graduate in any discipline. Experience At least 7 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements Must be Experienced in large Knit Composite Industries. Must be Computer literate, especially in Microsoft Office, Excel, ERP Software. Responsibilities & Context 100 % Honest in all aspect Responsible to monitor and evaluate raw materials, manpower planning, production recording and follow up. Production planning according to capacity and 100% capacity utilization in minimum cost. Capable to handle and manage plan for 35 sewing lines. Setting the production targets for knitting, dyeing, garments according plan and archives on time. Follow up sampling, pre-production activities, cutting, sewing, printing and finishing according to plan. Update production planning time to time according to the current situation. Work to implement planning and reduce plan vs actual gap. Distribute production planning to all related production staff and meetings to implement planning. Monitor daily production; make daily production report and tracking section wise production. Achieve on-time shipment maintaining production work sequence. Work with merchandising team to QC file as per production lead time and monitor trims-accessories and fabrics in-house status. Closely monitoring all pre-production activities and priority-based work progressing. Chase the finishing team for on-time final arrangement and ship the goods. Implement production planning and update time to time. Skills & Expertise Garments Planning Production planning Compensation & Other Benefits Festival Bonus Earn Leave Group Insurance Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Barnali Textile & Printing Industries (Pvt.) Ltd. Follow More jobs from this company Address: 285, (147/3, New) Hajaribag, Godnail, Narayangonj - 1432 Business: 100% Export oriented Knitwear Industries. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট "
  },
  {
    "url": "https://bdjobs.com/h/details/1463942?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464176?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464172?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464161?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464162?ln=1",
    "company_name": "PM SOURCING",
    "job_title": "Merchandiser - Knit, Woven And Sweater",
    "location": "Dhaka (Uttara)",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Merchandiser - Knit, Woven And Sweater : PM SOURCING Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List PM SOURCING Merchandiser - Knit, Woven And Sweater Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 40 years Location: Dhaka (Uttara) Salary: Negotiable Experience: 3 to 5 years Published: 27 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Experience 3 to 5 years The applicants should have experience in the following business area(s): Garments, Buying House Additional Requirements Age 25 to 40 years Only Male Responsibilities & Context ·         We require a Merchandiser with good buyer contacts with potential immediate order placement capacity. ·         The Merchandiser will have to perform the complete task from Beginning to ORDER EXECUTION (EXPORT). The Merchandiser has to take full responsibility from to order execution. Supervised by the CEO of the company. ·         Candidate will get preferred whoever currently working with reputed brand/buying/Liaison office. ·         Should have basic knowledge about woven and knits, including high specification taped waterproof and padded garments. ·         Candidate idea of liaising with various suppliers in Bangladesh. ·         Computer literacy & Good in English. ·         Able to work proactively. ·         Proficient in MS Office (Word, Excel, PowerPoint, Access). ·         Able to communicate effectively with all levels. ·         Confident with \"Can do\" attitude. ·         Strong interpersonal skill. ·         Presentation, report producing skill and influencing. ·         Attention to detail, Drive to achieve, Impact & Influence. ·         Information seeker, Maintain teamwork. ·         Must adhere to company health & safety policies at all the times. ·         Responsible for keeping own work area safe and free from hazards. Skills & Expertise Garments Merchandising Compensation & Other Benefits Mobile bill,Tour allowance Salary Review: Yearly Festival Bonus: 2 ·         Service Benefits (in like manner of gratuity). ·         Earn Leave Facilities. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Uttara) Job Highlights ·         The applicants should have experience in the following area(s): Garments Merchandising/ Buying house Merchandising. ·         The applicants should have experience in the following business area(s): Garments & Garments Accessories. Company Information PM SOURCING Follow Address: Flot: 3, Road: 10/B, Sector-09, Uttara, Dhaka-1230. Website: https://pmspl-bd.com/ Business: Buying House Bangladesh | Export Garments Directory | Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন "
  },
  {
    "url": "https://bdjobs.com/h/details/1464173?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464148?ln=1",
    "company_name": "Intertek Bangladesh",
    "job_title": "Supervisor/Senior Officer - Customer Relationship Management, Dhaka & Chattogram",
    "location": "Chattogram, Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Supervisor/Senior Officer - Customer Relationship Management, Dhaka & Chattogram : Intertek Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Intertek Bangladesh Supervisor/Senior Officer - Customer Relationship Management, Dhaka & Chattogram Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 3 Location: Chattogram, Dhaka Salary: Negotiable Published: 27 Feb 2026 Application Insights View Requirements Experience Additional Requirements Masters / MBA, BBA from any reputed University. Minimum 2-5 years sales experience in RMG industry will be preferable Candidate should know the product and market Responsibilities & Context Ensure Best service support for CRM Vendor’s (Zero hindrance at Intertek in services) CRM to build strong rapport with their vendors to gain 100% trust on Intertek so to ensure continuous improvement in customer satisfaction & market share. Daily Analysis and reporting (Report Due List/ Delivery Status/ Hold Progress Update/ Payment collection update etc) Market visit on regular basis to maintain close relationship and arrange Customer engagement program. Help to increase Market Share and report value increase To ensure report delivery TAT up to 80% by office time Close hold the sample following TAT policy. Work on credit collection to support credit Team for CRM Customer getting the report on time. Determining work targets for team members/ reportees and controlling the extent of the work. Skills & Expertise Good English communication skills (verbal and Written) relationship building Teamwork willing to work under pressure and meet dead lines Workplace Work at office Employment Status Full Time Job Location Chattogram, Dhaka Company Information Intertek Bangladesh Follow More jobs from this company Address: Phoenix Tower, (2nd & 3rd Floor) 407, Tejgaon Industrial Area, Dhaka-1208, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das "
  },
  {
    "url": "https://bdjobs.com/h/details/1464186?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464127?ln=1",
    "company_name": "Avian BPO & IT",
    "job_title": "Software Engineer (RUET/KUET/BUET/CUET) - Fresher",
    "location": "Dhaka, Dhaka (DOHS Mirpur)",
    "salary": "Tk. 45000 - 45001 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "Software Engineer (RUET/KUET/BUET/CUET) - Fresher : Avian BPO & IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Avian BPO & IT Software Engineer (RUET/KUET/BUET/CUET) - Fresher Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 5 Location: Dhaka, Dhaka (DOHS Mirpur... Dhaka, Dhaka (DOHS Mirpur) Salary: Tk. 45000 - 45001 (Monthly) Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Responsibilities & Context Develop and maintain Android applications using Java or Kotlin . Collaborate with UI/UX designers and backend engineers to build clean, high-performance apps. Write readable, modular, and scalable code following best engineering practices. Test, debug, and optimize app performance across devices and OS versions. Continuously learn new tools, frameworks, and technologies to improve product quality. Participate in daily stand-ups, code reviews, and agile development cycles. Familiarity with iOS development is considered good, but not mandatory Workplace Work at office Employment Status Full Time Job Location Dhaka, Dhaka (DOHS Mirpur) Company Information Avian BPO & IT Follow Address: Level 3, Ventura Iconia\r\nRoad: 11, Banani, Dhaka\r\n\r\n\r\n?????? ? ??????? ???? ???? ????/???  ???? ???? \r\n?????? ? ???? ???? ???? ???? ?? Website: https://avianbpo.com/ Business: Avian™ is a trusted brand in Bangladesh Tech industry. Avian™ provides BPO and IT services Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow B"
  }
]