[
  {
    "url": "https://bdjobs.com/h/details/1453669?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Deputy Manager - Legal",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Deputy Manager - Legal : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Deputy Manager - Legal Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 5 years Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Law (LLB) যেকোনো স্বনামধন্য ও স্বীকৃত বিশ্ববিদ্যালয় থেকে আইন বিষয়ে স্নাতক (LL.B) আইন বিষয়ে মাস্টার্স (LL.M) ডিগ্রিধারীদের অগ্রাধিকার দেওয়া হবে। Experience At least 5 years The applicants should have experience in the following business area(s): Law Firm, Manufacturing (FMCG) Additional Requirements সংশ্লিষ্ট ক্ষেত্রে ন্যূনতম ৫ বছরের বাস্তব অভিজ্ঞতা থাকতে হবে। এককভাবে নিম্ন আদালতে দেওয়ানি ও ফৌজদারি মামলা পরিচালনায় কমপক্ষে ৫ বছরের অভিজ্ঞতা। মামলা প্রস্তুতি, কেস ফাইলিং, কজলিস্ট ফলো-আপ ও শুনানিতে উপস্থিতির বাস্তব দক্ষতা। লিগ্যাল নোটিশ, চুক্তিপত্র (Agreement), ডিড, মতামত (Legal Opinion) প্রস্তুত করণে পারদর্শিতা। কোম্পানির আইনগত ঝুঁকি বিশ্লেষণ ও পরামর্শ প্রদানে সক্ষমতা। সরকারি দপ্তর, আদালত ও আইনজীবীদের সাথে সমন্বয় করে কাজ করার অভিজ্ঞতা। MS Office ও প্রয়োজনীয় লিগ্যাল ডকুমেন্টেশন কাজে দক্ষতা। Responsibilities & Context কোম্পানির সকল লিগ্যাল বিষয় তদারকি ও ব্যবস্থাপনা দেওয়ানি ও ফৌজদারি মামলার কার্যক্রম পরিচালনা ও ফলো-আপ চুক্তিপত্র ও আইনগত নথি পর্যালোচনা ও প্রস্তুতকরণ কর্পোরেট লিগ্যাল কমপ্লায়েন্স নিশ্চিত করা Skills & Expertise Suggested by Deed of agreement Legal Affairs Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now"
  },
  {
    "url": "https://bdjobs.com/h/details/1461664?ln=1",
    "company_name": "Ever Skin Care",
    "job_title": "Customer Service Executive",
    "location": "Dhaka, Dhaka (Kawran Bazar, Mirpur, Uttara)",
    "salary": "Tk. 15000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Customer Service Executive : Ever Skin Care Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ever Skin Care Customer Service Executive Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 10 Age: 20 to 35 years Location: Dhaka, Dhaka (Kawran Baza... Dhaka, Dhaka (Kawran Bazar, Mirpur, Uttara) Salary: Tk. 15000 - 30000 (Monthly) Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Additional Requirements Age 20 to 35 years Responsibilities & Context Providing guidance and support to team members to ensure effective performance. Developing plans aligned with the unit’s goals and ensuring their execution. Maintaining high standards of quality in all operations and services. Create regular progress reports. Analyze performance and suggest improvements. Address challenges quickly and effectively. Make decisions to keep operations running smoothly. Maintain communication with clients, suppliers, and stakeholders. Ensure smooth coordination between departments. Respond to customer inquiries via phone, email, or in person. Help solve customer problems or complaints effectively. Give accurate information about products or services. Guide customers in understanding features, pricing, and processes. Ensure works are completed accurately and efficiently. Maintain detailed records of customer interactions. Document issues and solutions for future reference. Follow up with customers to ensure satisfaction. Provide updates on issues or requests they’ve raised. Stay polite, calm, and helpful in all interactions. Represent the company positively at all times. Skills & Expertise Suggested by Client Service Customer Relations Customer Service Reporting and Documentation Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka, Dhaka (Kawran Bazar, Mirpur, Uttara) Company Information Ever Skin Care Follow Address: House No: 11/C-3 Modina Tower Mirpur-1. Business: Ever Skincare is a clean, nature-inspired skincare brand that combines high-quality botanical ingredients with science-backed formulas to deliver safe, effective, and visible results. Our dermatologist-tested, cruelty-free products are designed to enhance natural beauty while being gentle on the skin and kind to the planet. We believe skincare should be simple, joyful, and purposeful—free from harsh chemicals and full of skin-loving benefits for real, everyday results. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন "
  },
  {
    "url": "https://bdjobs.com/h/details/1458988?ln=1",
    "company_name": "Bangladesh School of Excellence",
    "job_title": "Marketing Officer / Marketing Executive",
    "location": "Dhaka (Uttara Model Town)",
    "salary": "Tk. 16000 - 31000 (Monthly)",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Marketing Officer / Marketing Executive : Bangladesh School of Excellence Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bangladesh School of Excellence Marketing Officer / Marketing Executive Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 02 Age: 26 to 38 years Location: Dhaka (Uttara Model Town) Salary: Tk. 16000 - 31000 (Monthly) Experience: At least 2 years Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Masters Experience At least 2 years The applicants should have experience in the following business area(s): Direct Selling/Marketing Service Company, School Additional Requirements Age 26 to 38 years Location in Uttara Should have releavnt experience Responsibilities & Context Plan and implement marketing strategies to increase student admissions. Conduct field marketing, school visits, and promotional campaigns. Develop and maintain relationships with guardians and community stakeholders. Manage social media platforms and digital marketing activities. Coordinate events, seminars, and promotional programs. Prepare marketing reports and admission progress updates. Assist in branding and communication initiatives of the institution. Candidate should have experience. Skills & Expertise Field Work Sales & Marketing Event/ Campaign Coordination communication and interpersonal skill. Relationship Marketing Digital Marketing (Social Media Marketing) Counselling Brand Planning/ Development Target Oriented Parent Communication Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara Model Town) Company Information Bangladesh School of Excellence Follow Address: Sector #7, Uttara, Dhaka Website: https://www.bsedhaka.com Business: BSE is an English-medium school located in Uttara, Dhaka. \nBSE follows the globally recognized Cambridge curriculum, offering education from Pre-Play (early years) up to O Level. \nThe campus is safe and individual, with an open playground — aiming to provide a comfortable learning environment.\n\nBSE aims to provide a nurturing and engaging environment where students develop strong self-esteem and a passion for lifelong learning, to reach their full potential as 21st-century citizens. \nTheir vision emphasizes educational and moral excellence, preparing students both academically and ethically for the future. \nBSE focuses not just on academic success but also on overall development: fostering critical thinking, creativity, moral values, and social responsibility. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প"
  },
  {
    "url": "https://bdjobs.com/h/details/1453676?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Officer-Legal",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 3 years",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Officer-Legal : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Officer-Legal Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 3 years Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Law (LLB) যেকোনো স্বনামধন্য ও স্বীকৃত বিশ্ববিদ্যালয় থেকে আইন বিষয়ে স্নাতক (LL.B)। আইন বিষয়ে মাস্টার্স (LL.M) ডিগ্রিধারীদের অগ্রাধিকার দেওয়া হবে। Experience At least 3 years The applicants should have experience in the following business area(s): Manufacturing (FMCG) Additional Requirements সংশ্লিষ্ট ক্ষেত্রে ন্যূনতম ৩ বছরের বাস্তব অভিজ্ঞতা। এককভাবে নিম্ন আদালতে দেওয়ানি ও ফৌজদারি মামলা পরিচালনায় কমপক্ষে ৩ বছরের অভিজ্ঞতা। মামলা প্রস্তুতি, কেস ফাইলিং, কজলিস্ট ফলো-আপ ও শুনানিতে অংশগ্রহণে দক্ষতা। লিগ্যাল নোটিশ, চুক্তিপত্র (Agreement), ডিড ও অন্যান্য আইনগত নথি প্রস্তুত ও পর্যালোচনায় সক্ষমতা। কোম্পানির আইনগত বিষয় ও কমপ্লায়েন্স সংক্রান্ত কাজে সহায়তা করার অভিজ্ঞতা। আদালত, আইনজীবী ও সরকারি দপ্তরের সাথে সমন্বয় করে কাজ করার সক্ষমতা। MS Office ও প্রয়োজনীয় লিগ্যাল ডকুমেন্টেশন কাজে দক্ষতা। ভালো যোগাযোগ দক্ষতা, বিশ্লেষণধর্মী ক্ষমতা ও দায়িত্বশীল মনোভাব। Responsibilities & Context প্রতিষ্ঠানের দৈনন্দিন লিগ্যাল কার্যক্রম পরিচালনায় সহায়তা করা। দেওয়ানি ও ফৌজদারি মামলার ফাইলিং, ফলো-আপ ও রিপোর্ট প্রস্তুত করা। চুক্তিপত্র ও আইনগত নথি ড্রাফট ও রিভিউ করা। কর্পোরেট লিগ্যাল কমপ্লায়েন্স নিশ্চিত করতে সহায়তা করা। Skills & Expertise Suggested by Deed of agreement Legal Affairs Legal Drafting Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Aud"
  },
  {
    "url": "https://bdjobs.com/h/details/1461659?ln=1",
    "company_name": "ICON CARE LIMITED",
    "job_title": "Male Attendant / Ward Boy",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Male Attendant / Ward Boy : ICON CARE LIMITED Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ICON CARE LIMITED Male Attendant / Ward Boy Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Age: 20 to 35 years Location: Dhaka Salary: Tk. 14000 - 16000 (Monthly) Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education SSC Additional Requirements Age 20 to 35 years উচ্চতা সর্ব নিম্ন ৫.৭ হতে হবে । দির্ঘক্ষণ কাজ করার জন্য শারিরীকভাবে সক্ষম হতে হবে। ডিউটি অবস্থায় মোবাইল ব্যবহার করা যাবেনা। ১২ ঘন্টা ডে ৭ দিন ১২ ঘন্টা নাইট ৭ দিন করার সক্ষমতা থাকতে হবে। মানসিক এবং মাদকাসক্ত রোগী দের নিয়ে কাজ করার মানসিকতা থাকতে হবে। মাদক মুক্ত হতে হবে। মানসিকভাবে সুস্থ হতে হবে এবং সুন্দর মনের অধিকারি হতে হবে। ধৈর্য নিয়ে কাজ করার মানসিকতা থাকতে হবে । সকল নিয়ম কানুন মেনে যারা আগামি মার্চ ১ তারিখ থেকে কাজে যোগদান করতে পারবে শুধু তারা আবেদন করার জন্য বলা হলো । Responsibilities & Context আইকন কেয়ার লিমিটেড একটি আন্তর্জাতিক মানের ISO 9001:2015 সার্টিফিকেটপ্রাপ্ত, সুপরিচিত মানসিক ও মাদকাসক্ত নিরাময় হাসপাতাল। আমরা বিশ্বমানের সেবা ও পরিচর্যার মাধ্যমে রোগীদের সুস্থ জীবন ফিরিয়ে দিতে বদ্ধপরিকর। আমরা আমাদের সেবাদানকারী টিমে যোগদানের জন্য যোগ্য ও প্রতিশ্রুতিবদ্ধ প্রার্থীদের খুঁজছি। প্রশিক্ষণ (Training) চাকুরির সকল শর্তপূরণ সাপেক্ষে নিয়োগ প্রক্রিয়া শেষে নিজের ব্যবস্থাপনায় ৩ / ৭ দিন ট্রেনিং করানো হবে । দায়িত্ব ও কর্তব্য: হাসপাতালে ভর্তি মানসিক রোগী এবং মাসকাসক্ত রোগীদের সার্বক্ষণিক নিবিড় পর্যবেক্ষণ, যত্ন ও পরিচর্যা নিশ্চিত করা। রোগীদের ব্যক্তিগত পরিচ্ছন্নতা এবং দৈনন্দিন কাজে (যেমন: খাবার গ্রহণ, গোসল) সহায়তা করা। চিকিৎসক ও নার্সিং স্টাফের নির্দেশিত ঔষধ ও সেবার সঠিক প্রয়োগ নিশ্চিত করা। রোগীর কক্ষ ও হাসপাতালের পরিবেশ পরিষ্কার-পরিচ্ছন্ন ও শৃঙ্খলাবদ্ধ রাখতে সহযোগিতা করা। রোগীর নিরাপত্তা নিশ্চিত করা এবং জরুরী পরিস্থিতিতে দ্রুত ও দক্ষতার সাথে পরিস্থিতি সামাল দেওয়া। Skills & Expertise Hospital and clinic Hospitality Patient Care Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 ওভার টাইম কাজ করার সুবিধা ডিউটির সময় নাস্তা (Snacks) প্রদান। বছরে ২টি (দুটি) উৎসব বোনাস (ফ্যাস্টিভাল বোনাস) প্রদান। কোম্পানির নীতিমালা অনুযায়ী বাৎসরিক ইনক্রিমেন্ট এবং অন্যান্য সুযোগ-সুবিধা প্রযোজ্য হবে। দুইমাস পর পর ৬ দিনের ছুটি মাসে ১ দিন ছুটি প্রদান করা হবে Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights উচ্চত সর্বনিম্ন ৫.৭ ইঞ্চি এবং উজন ৬০ কেজি হতে হবে নিজস্ব ব্যবস্থায় থাকা ও খাওয়ার ব্যবথা করে নিতে হবে । ১২ ঘন্টা ৭ দিন ডে ৭ দিন নাইট ডিউটি করতে হবে । Company Information ICON CARE LIMITED Follow Address: House: 45,Road:19, Sector11, Uttara,Dhaka1230 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানা"
  },
  {
    "url": "https://bdjobs.com/h/details/1461692?ln=1",
    "company_name": "Platinum Overseas",
    "job_title": "Customer Support/Call Center Executive",
    "location": "Dhaka (Kakrail)",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Customer Support/Call Center Executive : Platinum Overseas Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Platinum Overseas Customer Support/Call Center Executive Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Age: 20 to 35 years Location: Dhaka (Kakrail) Salary: Negotiable Experience: 1 to 5 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education HSC Bachelor/Honors Experience 1 to 5 years The applicants should have experience in the following business area(s): BPO/ Data Entry Firm, Call Center, Consulting Firms, Embassies/Foreign Consulate, Immigration and Education Consultancy Service, Immigration/Visa Processing, Manpower Recruitment, Overseas Companies, Travel Agent, Web Media/Blog Additional Requirements Age 20 to 35 years Who have experience in manpower agency / travel agency / consultancy agency he/she will get preference. Responsibilities & Context Answering incoming calls from customers and ensuring instant customer satisfaction Respond to customer inquiries Receiving customer complaints and inputting those in the system for necessary measures and providing them information about the resolution of the same Troubleshoot/ helping to resolve customer service problems Provide general information Maintaining a high standard of call quality as per the requirement of the organization Skills & Expertise Call Center Call Operation Client Service Customer Service Customer Service Management Customer Support through Phone Facebook Live Presenter Facebook Presenter Compensation & Other Benefits Performance bonus,Over time allowance Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Kakrail) Read Before Apply Who have experience in manpower agency / travel agency / consultancy agency he/she will get preference. Company Information Platinum Overseas Follow More jobs from this company Address: 80 Kakrail (Rupayan Karim Tower) Lift 9A,Dhaka-1000,Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tar"
  },
  {
    "url": "https://bdjobs.com/h/details/1461657?ln=1",
    "company_name": "Quantanite Bangladesh Limited",
    "job_title": "Quality Assurance Lead",
    "location": "Dhaka",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Quality Assurance Lead : Quantanite Bangladesh Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Quantanite Bangladesh Limited Quality Assurance Lead Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At least 26 years Location: Dhaka Salary: Negotiable Experience: 3 to 5 years Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Experience 3 to 5 years The applicants should have experience in the following business area(s): IT Enabled Service, BPO/ Data Entry Firm Additional Requirements Age At least 26 years Leadership certification, Quality Assurance certification, Business Administration, or a related field. Project management certification or experience using project management tools/methodologies (e,g Agile). Certification in quality management (e.g, Lean Six Sigma) is a plus. Responsibilities & Context About Quantanite Quantanite is a leading Business Process Outsourcing (BPO) and Customer Experience (CX) solutions provider, empowering fast-growing companies and global brands to optimize their operations. By combining automation with human expertise, we deliver seamless customer experiences and exceptional business outcomes. With operations across four continents, we are a diverse, dynamic, and ambitious team looking for individuals who share our values and vision. We currently have over 1,500+ professionals supporting global clients worldwide. Job Summary The Quality Assurance Lead supports the Quality Assurance Manager in overseeing the quality assurance processes and ensuring that service meets company standards and regulatory requirements. This role involves managing a team of QA Team Leaders and QA specialists, developing and implementing quality control procedures, and continuously improving quality systems. Working Conditions Work from office Working shifts will be based on global time Flexibility in work hours may be necessary to meet project deadlines or address urgent issues. Key Responsibilities Assist in Management: Support the QA Manager in daily operations and supervision of the QA team. Help to develop, implement, and manage QA procedures and policies. Team Leadership: Assist in training and mentoring QA team members. Conduct performance evaluations and provide feedback to ensure high levels of performance and professional growth. Quality Control: Oversee and ensure compliance with quality standards throughout the production process. Monitor and analyze quality metrics and implement corrective actions as needed. Process Improvement: Identify areas for improvement within the quality management system and suggest and implement improvements to enhance efficiency and product quality. Documentation and Reporting: Ensure accurate and thorough documentation of quality control processes, includin"
  },
  {
    "url": "https://bdjobs.com/h/details/1461654?ln=1",
    "company_name": "Bashundhara Ready Mix & Construction Industries Ltd.",
    "job_title": "Executive/Sr. Executive (Production), Bashundhara Ready Mix & Construction Industries Ltd.",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Executive/Sr. Executive (Production), Bashundhara Ready Mix & Construction Industries Ltd. : Bashundhara Ready Mix & Construction Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bashundhara Ready Mix & Construction Industries Ltd. Executive/Sr. Executive (Production), Bashundhara Ready Mix & Construction Industries Ltd. Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 26 to 40 years Location: Dhaka Salary: Negotiable Experience: At least 2 years Published: 20 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Civil Engineering Diploma in Civil Experience At least 2 years The applicants should have experience in the following business area(s): Cement, Real Estate Additional Requirements Age 26 to 40 years Preference will be given to candidates who bring solid experience in Ready Mix Concrete production, and such applicants are highly encouraged to apply. Responsibilities & Context If you're looking for a role where you can continue to make an impression, take the next step at Bashundhara Ready Mix & Construction Industries Limited where your contributions will always be valued. We are currently seeking an ambitious individual to join this team in the role of Executive/ Sr. Executive (Production) for Bashundhara Ready Mix & Construction Industries Ltd. Job Responsibilities: Plan, schedule, and coordinate daily concrete production operations to ensure timely deliveries in full compliance with customer specifications and quality standards. Continuously monitor plant performance and proactively optimize production levels in line with demand forecasts and operational priorities. Oversee raw material inventory—including cement, aggregates, admixtures, and related inputs—and coordinate timely replenishment to ensure uninterrupted production. Collaborates with quality control, maintenance, logistics, and sales teams to streamline workflows, troubleshoot issues, and achieve production targets. Maintain accurate and up-to-date production records, inventory logs, and operational reports to support planning, traceability, and management review. Promptly identify, report, and coordinate the resolution of equipment or process-related issues to minimize downtime and maintain optimal plant efficiency. Plan and allocate manpower across multiple plants to meet daily operational requirements while ensuring productivity and compliance. Carry out any additional duties or responsibilities as assigned by management in support of overall operational objectives. Skills & Expertise Client Management Communication Industrial Production Engineering MSOffice applications Product Development Production/ Operation Management Ready Mix Concrete Situation based decisionmaking Compensation & Other Benefits Mobile bill,T/A,Gratuity "
  },
  {
    "url": "https://bdjobs.com/h/details/1461631?ln=1",
    "company_name": "Bangladesh Thalassemia Foundation",
    "job_title": "Medical Technologist (Laboratory, Blood Bank & Reporting)",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Medical Technologist (Laboratory, Blood Bank & Reporting) : Bangladesh Thalassemia Foundation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bangladesh Thalassemia Foundation Medical Technologist (Laboratory, Blood Bank & Reporting) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 35 years Location: Dhaka Salary: Negotiable Experience: At least 2 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Science (BSc) Diploma in Medical Technology Experience At least 2 years The applicants should have experience in the following business area(s): Diagnostic Centre, Healthcare/Lifestyle product, Hospital, NGO, Research Organization Additional Requirements Age At most 35 years Strong knowledge & at least 2 years’ experience in blood banking procedures & laboratory management. Proficient in MS Word, MS Excel & Email. Experience in working with MS Excel for data management and report preparation. Ability to prepare and format laboratory reports. Ability to maintain confidentiality of patient/ donor information. Basic email handling and digital documentation skills. Strong organizational & time management skills. Exceptional communication & interpersonal skills. Ability to handle stressful situations & work under pressure while maintaining a high level of accuracy. Responsibilities & Context Perform blood collection procedures and laboratory tests, ensuring adherence to appropriate protocols and safety measures. Collect blood samples from patients, with particular expertise in handling critical pediatric cases. Process and prepare blood components such as Red Blood Cells (RBC), Platelets, and Fresh Frozen Plasma (FFP) for transfusions, following Standard Operating Procedures (SOPs). Conduct antibody screening and compatibility testing on blood samples, using advanced laboratory equipment and techniques. Perform Blood typing and Antigen testing to determine donor-recipient compatibility. Evaluate and interpret laboratory test results, recording and reporting findings accurately. Must know how to operate fully automated & semi-automated lab machines (ELISA system, Biochemistry, Hematology, including microscopes, centrifuges, etc.) Ensuring that laboratory equipment is calibrated and functioning correctly and verifying the quality and expiration dates of chemicals and reagents. Ensuring proper inventory management. Adhere to Quality Control (QC) and Quality Assurance (QA) processes. Follow established safety protocols and maintain a clean and organized work environment. Accurately enter patient and donor data. Prepare, format and print laboratory reports. Update records using laboratory/ blood bank software. Handle official email correspondence and documentation. Prepare w"
  },
  {
    "url": "https://bdjobs.com/h/details/1461355?ln=1",
    "company_name": "Patriot Group",
    "job_title": "Sr Manager / General Manager (Compliance,HR,Admin)",
    "location": "Gazipur (Tongi)",
    "salary": null,
    "experience": "10 to 20 years",
    "education": null,
    "deadline": "19 Mar 2026",
    "job_description": "Sr Manager / General Manager (Compliance,HR,Admin) : Patriot Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Patriot Group Sr Manager / General Manager (Compliance,HR,Admin) Application Deadline : 19 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 40 to 55 years Location: Gazipur (Tongi) Salary: Negotiable Experience: 10 to 20 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Master of Business Administration (MBA) in HRM Master's PGD in Compliance Experience 10 to 20 years The applicants should have experience in the following business area(s): Buying House, Garments, Textile Additional Requirements Age 40 to 55 years Responsibilities & Context Ensure compliance with local labor laws, international standards, and buyer codes of conduct. • Lead and manage audits including SEDEX (4 Pillar), NIRAPON, HIGG FEM & FSLM, ISO 14001, GRS, GOTS, and Buyer CoC. • Maintain updated documentation and ensure readiness for external audits covering labor, safety, environmental, and ethical standards. • Oversee renewal and maintenance of legal permits (Trade, Fire, Factory, Environmental, Generator, Explosive licenses). • Conduct job safety analyses, risk assessments, and deliver compliance and safety training programs. • Supervise ZDHC and environmental compliance testing (water, wastewater, emissions, noise, lighting). • Manage chemical inventories and MSDS updates, ensuring strict chemical safety measures. • Lead sustainability initiatives related to energy, water, and waste management. • Coordinate compliance reporting through customer and government web portals. • Act as liaison with Fire & Civil Defense, Labor Office, Factory Inspectorate, and Environmental authorities. Skills & Expertise Skills & Expertise Compliance Management HR and Administration Compensation & Other Benefits Mobile bill Festival Bonus : 2 Competitive salary and benefits. Workplace Work at office Employment Status Full Time Job Location Gazipur (Tongi) Company Information Patriot Group Follow Address: Plot #B-35,B-50,BSCIC Industrial Estate,Tongi Gazipur Business: GARMENTS Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 90"
  },
  {
    "url": "https://bdjobs.com/h/details/1454143?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Officer-Land",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Officer-Land : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Officer-Land Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Published: 26 Jan 2026 Application Insights View Requirements Education Bachelor/Honors স্বীকৃত বিশ্ববিদ্যালয় থেকে স্নাতক ডিগ্রি। Additional Requirements কর্পোরেট অফিস/রিয়েল এস্টেট/ডেভেলপমেন্ট প্রতিষ্ঠানে প্রাসঙ্গিক কাজের অভিজ্ঞতা সম্পন্ন প্রার্থীদের অগ্রাধিকার দেওয়া হবে। মুসলিম ফারাজি আইন ও হিন্দু আইনসহ জমিজমা সংক্রান্ত দলিল, খতিয়ান/পর্চা, নামজারি ও নকশা বিষয়ে বাস্তব অভিজ্ঞতা ও জমি যাচাই-বাছাই (Land Verification) করার দক্ষতা। সাব-রেজিস্ট্রি অফিস, ভূমি অফিস, ডিসি অফিসসহ সংশ্লিষ্ট সরকারি দপ্তরের কাজের প্রক্রিয়া সম্পর্কে পরিষ্কার ধারণা রাখা।ভূমি আইন ও নিয়মাবলী সম্পর্কে প্রাথমিক জ্ঞান।প্রয়োজন অনুযায়ী মাঠ পর্যায়ে কাজ করার মানসিকতা। MS Word ও Excel-এ কাজ করার সক্ষমতা। ভালো যোগাযোগ দক্ষতা ও দলগতভাবে কাজ করার মানসিকতা। সৎ, দায়িত্বশীল ও সময়ানুবর্তী হওয়া। Responsibilities & Context জমি সংক্রান্ত যাবতীয় নথিপত্র যাচাই ও সংরক্ষণ করা। ভূমি ক্রয়-বিক্রয় সংক্রান্ত কার্যক্রমে সহায়তা প্রদান। ভূমি সংক্রান্ত নিয়মিত রিপোর্ট প্রস্তুত ও হালনাগাদ রাখা। Skills & Expertise Suggested by Land Land Law Land Purchase Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course "
  },
  {
    "url": "https://bdjobs.com/h/details/1461629?ln=1",
    "company_name": "Regent Group Ltd.",
    "job_title": "Head of Marketing",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "At least 10 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Head of Marketing : Regent Group Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Regent Group Ltd. Head of Marketing Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Experience: At least 10 years Published: 20 Feb 2026 Application Insights View Requirements Experience At least 10 years Responsibilities & Context About Regent Group Ltd. Regent Group Ltd. is a fast-growing and diversified business group in Bangladesh, with major operations in real estate, construction materials, hospitals, hotels, travel agencies, and other strategic sectors. The Group is on a continuous path of expanding its operations and investment portfolio. In this context, the Group is seeking a competent and experienced marketing leader who can drive brand growth, strengthen investor confidence, and accelerate business expansion through strategic marketing and investment-focused campaigns. Key Responsibilities • Develop and implement investment-focused marketing strategies to drive share sales and attract investors • Present company projects to investors as safe, profitable, and suitable for long-term investment • Lead the company’s brand strategy and market positioning, enhancing brand credibility and premium value • Build and maintain strategic partnerships with investors, sponsors, and relevant government or institutional stakeholders • Represent the company at investment forums, exhibitions, and high-level business events • Oversee integrated marketing functions, including branding, digital marketing, communications, and creative activities • Lead, mentor, and develop the marketing team, ensuring alignment with the Group’s growth objectives • Manage marketing budgets, agencies, and KPIs to ensure ROI and overall effectiveness Skills and Competencies • Strong leadership and mentoring capabilities with proven team management and coordination skills • Hands-on experience in implementing premium brand development and investment growth strategies • Strong ability to build and maintain high-level investor communications and relationships • Excellent analytical skills with the ability to make data-driven decisions • Creative, strategic, and results-oriented mindset that contributes to business growth • Proven experience in handling high-pressure or crisis situations Reporting Line This position will report directly to the CEO / Managing Director. Career Opportunity This role offers a unique opportunity to contribute to the Group’s long-term investment growth, strengthen investor confidence, and provide strategic leadership in the continued expansion of Regent Group Ltd. Office Address House No: 770/771 Avenue No: 06 Road No: 10 Mirpur DOHS, Dhaka-1216 Workplace Work at office Employment Status Full Time Job Location Dhaka Apply Procedure Email Your CV Send your CV to the given email"
  },
  {
    "url": "https://bdjobs.com/h/details/1455887?ln=1",
    "company_name": "Platinum Overseas",
    "job_title": "Digital Content Creator",
    "location": "Dhaka (Kakrail)",
    "salary": "Negotiable",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "Digital Content Creator : Platinum Overseas Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Platinum Overseas Digital Content Creator Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 6 Age: 18 to 30 years Location: Dhaka (Kakrail) Salary: Negotiable Experience: At least 1 year Published: 01 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Bachelor`s Degree in Marketing, Media, Communication, English, or any relevant discipline English-medium background preferred Experience At least 1 year The applicants should have experience in the following business area(s): Call Center, Consulting Firms, Embassies/Foreign Consulate, Immigration and Education Consultancy Service, Immigration/Visa Processing, Individual/Personal Recruitment, Manpower Recruitment, Market Research Firms, Overseas Companies, Travel Agent Freshers are also encouraged to apply. Additional Requirements Age 18 to 30 years Smart, presentable, and professional in appearance Camera friendly with confidence to appear in videos- Excellent communication skills in Bangla and English (verbal and written) Creative mindset with attention to detail Strong interpersonal skills with a positive and proactive attitude Comfortable working collaboratively with marketing, counseling, and management teams Skills & Expertise Content Creation Copywriting Social Media Management Basic Video Editing English language proficiency (verbal and written) Canva / CapCut / Adobe tools (preferred) Responsibilities & Context Create engaging digital content on Facebook, Instagram, LinkedIn, YouTube, and TikTok Appear on camera for promotional and branding videos Write captions, scripts, and posts in Bangla and English suitable for applicants Plan and maintain a content calendar aligned with marketing campaigns and academic timelines Support production of video content including reels, shorts, event coverage, and basic editing Collaborate with marketing, manpower counseling, and management teams to develop content. Monitor engagement metrics and suggest improvements to maximize reach and impact Ensure all content aligns with Platinum Overseas branding and professional communication standards Stay updated with digital marketing trends, social media best practices, and student-focused content strategies Assist in campaigns, workshops, and other promotional or awareness activities Skills & Expertise Canva Pro Capcut Content Creation Content writing Digital Marketing (Social Media Marketing) Fluent in English Speaking Marketing Public Speaking and Presentation Video content creating Video Marketing Suggested by Content Creation Digital Content Development Video Editing Workplace Work at office Employment Status Full Time Job Location Dhaka (Kakrail) Company Information Platinum Ove"
  },
  {
    "url": "https://bdjobs.com/h/details/1461637?ln=1",
    "company_name": "Ceragem",
    "job_title": "Customer Care Representative (Female)",
    "location": "Dhaka (Dhanmondi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Customer Care Representative (Female) : Ceragem Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ceragem Customer Care Representative (Female) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 8 Age: 18 to 45 years Location: Dhaka (Dhanmondi) Salary: Tk. 10000 - 15000 (Monthly) Published: 20 Feb 2026 Application Insights View Requirements Education SSC HSC Additional Requirements Age 18 to 45 years Responsibilities & Context সেরাজেম একটি দক্ষিণ কোরিয়ান কোম্পানি যা থার্মাল ম্যাসাজ বেড এবং অন্যান্য স্বাস্থ্য ও সুস্থতা পণ্যে বিশেষজ্ঞ। তাদের ডিভাইসগুলি দূর-ইনফ্রারেড তাপ, জেড রোলার, আকুপ্রেশার এবং স্পাইনাল স্ক্যানিং প্রযুক্তির সমন্বয়ে থেরাপিউটিক সুবিধা প্রদান করে। গ্রাহক সহায়তা: গ্রাহকদের শুভেচ্ছা ও সহায়তা করুন, তাদের জিজ্ঞাসার সমাধান করুন এবং সেরাজেম পণ্যের বৈশিষ্ট্য এবং সুবিধাগুলির মাধ্যমে তাদের নির্দেশনা দিন। অ্যাপয়েন্টমেন্ট সমন্বয়: গ্রাহক অ্যাপয়েন্টমেন্টের সময়সূচী এবং পরিচালনা করুন, ক্লায়েন্ট এবং পরামর্শদাতাদের মধ্যে কার্যকর যোগাযোগ নিশ্চিত করুন। পরিষেবা সুবিধা: পণ্য প্রদর্শন, থেরাপি সেশন এবং বিক্রয়োত্তর সহায়তা সহ বিভিন্ন পরিষেবার মাধ্যমে গ্রাহকদের নির্দেশনা দিন। প্রতিক্রিয়া সংগ্রহ: পরিষেবার উন্নতির ক্ষেত্রগুলি চিহ্নিত করতে গ্রাহকদের প্রতিক্রিয়া সংগ্রহ করুন এবং এই তথ্য ব্যবস্থাপনা দলের কাছে রিলে করুন। প্রশাসনিক কাজ: গ্রাহকদের মিথস্ক্রিয়ার সঠিক রেকর্ড বজায় রাখুন, ডকুমেন্টেশন পরিচালনা করুন এবং প্রয়োজন অনুসারে অন্যান্য প্রশাসনিক দায়িত্ব পালন করুন। Compensation & Other Benefits Lunch Facilities: Full Subsidize Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Dhanmondi) Company Information Ceragem Follow Address: 115\\priyojon tower, monohorpur, cumilla-3500 Website: https://ceragembangladesh.com.bd/ Business: Ceragem is a global health care company that sells medical devices, personal thermal massagers, and other products. Ceragem has a global presence with branches in many countries. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Cer"
  },
  {
    "url": "https://bdjobs.com/h/details/1461651?ln=1",
    "company_name": "Arriva Soft",
    "job_title": "Video Editor & Presenter (Creative Ads)",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 15000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Video Editor & Presenter (Creative Ads) : Arriva Soft Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Arriva Soft Video Editor & Presenter (Creative Ads) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 18 to 30 years Location: Anywhere in Bangladesh Salary: Tk. 15000 - 30000 (Monthly) Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Experience Additional Requirements Age 18 to 30 years Strong portfolio (mandatory) Responsibilities & Context We are looking for a performance-focused Video Editor experienced in presenter-based ad production. Key Focus: Short-form conversion ads Hook-based editing Talking-head / SaaS explainer videos Motion graphics & retention optimization Type: Contract / Part-Time Location: Remote / Dhaka Skills & Expertise Communication Creative Design Video Editing Suggested by Video Editing Facebook Live Presenter facebook ads Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Arriva Soft Follow Address: Home # 8/2, N/S Road, Block A, Banasree, Rampura Website: https://www.arrivasofts.com/ Business: Arriva Soft is a modern software development company delivering high-quality, scalable, and secure digital solutions for startups, e-commerce, e-learning, SMEs, and enterprises. We specialise in SaaS development, web and mobile applications, custom software, and cloud-based systems using cutting-edge technologies.\n\nOur team follows a structured product-building approach, focusing on clean architecture, performance, security, and long-term scalability. From idea validation to deployment and ongoing support, Arriva Soft partners with clients to transform ideas into reliable, business-ready software products. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Ski"
  },
  {
    "url": "https://bdjobs.com/h/details/1453695?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Senior Officer-Recovery",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Senior Officer-Recovery : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Senior Officer-Recovery Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements কমপক্ষে ৫টি থানায় তদন্তকারী কর্মকর্তা (Investigation Officer) হিসেবে কাজ করার বাস্তব অভিজ্ঞতা। রিকভারি ও ফিল্ড অপারেশন সংক্রান্ত কাজে দক্ষতা। আইনানুগ প্রক্রিয়া অনুসরণ করে বকেয়া আদায় কার্যক্রম পরিচালনার সক্ষমতা। মাঠ পর্যায়ে কাজ করার মানসিকতা এবং প্রয়োজন অনুযায়ী ভ্রমণের আগ্রহ। শক্তিশালী যোগাযোগ দক্ষতা ও আলোচনার (Negotiation) ক্ষমতা। টিমের সাথে সমন্বয় করে কাজ করার সক্ষমতা। দায়িত্বশীল, সৎ ও ফলাফলমুখী মনোভাব। Responsibilities & Context বকেয়া আদায় সংক্রান্ত মাঠ পর্যায়ের কার্যক্রম বাস্তবায়ন করা। সংশ্লিষ্ট পক্ষ ও স্থানীয় প্রশাসনের সাথে সমন্বয় রক্ষা করা রিকভারি কার্যক্রমের অগ্রগতি নিয়মিত রিপোর্ট করা। প্রতিষ্ঠানের নীতিমালা ও আইনানুগ নির্দেশনা অনুসরণ নিশ্চিত করা। Skills & Expertise Suggested by Credit Recovery Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT T"
  },
  {
    "url": "https://bdjobs.com/h/details/1453682?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Senior Manager / Manager - Recovery",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Senior Manager / Manager - Recovery : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Senior Manager / Manager - Recovery Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Retired Major or Captain from the Bangladesh Army Leadership mindset for recovery and field operations Ability to perform under pressure and make timely decisions Willingness to work in the field and travel as needed Strong communication and coordination skills Responsibilities & Context Plan, supervise, and manage the organization’s recovery operations Lead field teams and monitor day-to-day activities Develop and implement strategies for outstanding recovery Prepare regular recovery reports and present to management Ensure compliance with company policies and legal procedures Skills & Expertise Suggested by Compliance Management Record Keeping Recovery Reporting and Documentation Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq "
  },
  {
    "url": "https://bdjobs.com/h/details/1461684?ln=1",
    "company_name": "Naturo",
    "job_title": "IT Executive",
    "location": "Dhaka (Dhaka Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "IT Executive : Naturo Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Naturo IT Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 35 years Location: Dhaka (Dhaka Sadar) Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 35 years Qualifications & Requirements: ·     Bachelor’s degree in Computer Science, Information Technology, or a related field. ·     2 years of experience in IT support, network administration, or system maintenance (factory or multi-site preferred). ·     Strong knowledge of hardware troubleshooting, networking (LAN/WAN), Windows OS, and CCTV systems.·     Experience with DVR/NVR setup, IP camera installation, and network cabling. ·     Basic understanding of VoIP, ERP, and CRM systems preferred. ·     Excellent problem-solving, communication, and time-management skills. ·     Ability to work under pressure and respond to issues across multiple sites. ·     Willingness to travel between factory and head office as required. Key Competencies: ·     Technical troubleshooting and analytical ability ·     Team collaboration and user support orientation ·     Confidentiality and data integrity awareness ·     Proactive maintenance and issue prevention mindset ·     Strong organizational and reporting skills Responsibilities & Context Purpose: The IT Executive is responsible for ensuring the smooth operation, maintenance, and support of all IT systems, hardware, software, and network infrastructure across the factory, head office, and call center. The role also includes managing the full cycle of CCTV system maintenance, and service to ensure operational efficiency and data security. Key Responsibilities: 1.      General IT Operations ·    Provide day-to-day IT support to all users in factory, head office, and call center. ·    Install, configure, and maintain desktop PCs, laptops, printers, and other IT peripherals. ·    Manage user accounts, access controls, and system backups. ·    Ensure smooth operation of LAN/WAN, Wi-Fi, and internet connectivity. ·    Monitor and troubleshoot network issues to minimize downtime. ·    Maintain IT asset inventory and perform regular audits. ·    Install and update software and operating systems as required. 2.      Factory IT Support ·    Maintain and support production-related systems, and label printers. ·    Coordinate with production and engineering teams to resolve system or network issues affecting manufacturing operations. 3.      Head Office IT Support ·    Manage office network, printers, and server connectivity. ·    Support management systems, email configurations, and communication tools. ·    Ensure data security and backup management in coordination with the ma"
  },
  {
    "url": "https://bdjobs.com/h/details/1454140?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Officer-Recovery",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Officer-Recovery : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Officer-Recovery Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements বাংলাদেশ সেনাবাহিনী হতে অবসরপ্রাপ্ত সার্জেন্ট পদমর্যাদার কর্মকর্তা। সাধারণ মানুষের সাথে সরাসরি কাজ করার বাস্তব অভিজ্ঞতা রিকভারি ও ফিল্ড অপারেশন সংক্রান্ত কাজে আগ্রহ ও সক্ষমতা।শৃঙ্খলাবোধ, দায়িত্বশীলতা ও পেশাদার আচরণ। মাঠ পর্যায়ে কাজ করার মানসিকতা এবং প্রয়োজনে ভ্রমণের আগ্রহ।ভালো যোগাযোগ দক্ষতা ও সমন্বয় করার সক্ষমতা। সৎ,পরিশ্রমী ও ফলাফলমুখী মনোভাব। Responsibilities & Context বকেয়া আদায় সংক্রান্ত মাঠ পর্যায়ের কার্যক্রম পরিচালনা করা। গ্রাহক ও সংশ্লিষ্ট পক্ষের সাথে পেশাদার আচরণ বজায় রেখে যোগাযোগ করা। রিকভারি কার্যক্রমের অগ্রগতি নিয়মিত রিপোর্ট করা। প্রতিষ্ঠানের নীতিমালা ও আইনানুগ প্রক্রিয়া অনুসরণ নিশ্চিত করা। Skills & Expertise Suggested by Recovery Backup and Disaster Recovery Solutions Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now L"
  },
  {
    "url": "https://bdjobs.com/h/details/1461652?ln=1",
    "company_name": "MUNIA OVERSEAS (RL-2452)",
    "job_title": "Digital Marketing Cum Content Creator (ডিজিটাল মার্কেটিং কাম কনটেন্ট ক্রিয়েটর)",
    "location": "Dhaka (Uttara Sector 17)",
    "salary": null,
    "experience": "2 to 6 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Digital Marketing Cum Content Creator (ডিজিটাল মার্কেটিং কাম কনটেন্ট ক্রিয়েটর) : MUNIA OVERSEAS (RL-2452) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MUNIA OVERSEAS (RL-2452) Digital Marketing Cum Content Creator (ডিজিটাল মার্কেটিং কাম কনটেন্ট ক্রিয়েটর) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 20 to 35 years Location: Dhaka (Uttara Sector 17) Salary: Tk. 20000 - 40000 (Monthly) Experience: 2 to 6 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience 2 to 6 years Additional Requirements Age 20 to 35 years কাজের অভিজ্ঞতার উপরে স্যালারি রিভিউ হবে। কোম্পানির সকল সুযোগ সুবিধা দিয়ে থাকিবে। ফেসবুক, ইন্সট্রাগ্রাম ও অন্যান্য সোশাল মিডিয়ায় অনলাইন মার্কেটিং সম্পর্কে পারদর্শী হতে হবে। Responsibilities & Context ফেসবুক, ইন্সট্রাগ্রাম ও অন্যান্য সোশাল মিডিয়ায় অনলাইন মার্কেটিং সম্পর্কে পারদর্শী হতে হবে। ফেসবুক কমার্স ম্যানেজার ম্যানেজ করতে হবে। সকল ধরনের সামাজিক মাধ্যমে এক্টিভ থাকতে হবে। (LinkedIn,Twitter) অবশ্যই কনটেন্ট ক্রিয়েট করতে জানতে হবে। অবশ্যই ভিডিও এডিটিং জানতে হবে। উত্তরা বসবাসকারী প্রার্থিকে অগ্রাধিকার দেওয়া হবে। ভয়েস সুন্দর হতে হবে। কনটেন্ট ক্রিয়েট করতে যানতে হবে। গুগল এডস (Google Ads)সম্পর্কে পুরোপুরি ধারণা থাকতে হবে। (Ad scene Account) ফেসবুক এডস (Facebook Ads-set, Ad manager, Audience) তৈরিতে পারদর্শী হতে হবে। ইউটিউব (Youtube Channel Customization) চ্যানেল ব্যবহারে পারদর্শী হতে হবে। Adobe Premier Pro, সফটওয়্যার ব্যবহারে পারদর্শী হতে হবে। কম্পিউটারের প্রাথমিক সমস্যাগুলো সমাধান করার ধারণা থাকতে হবে। ভিডিও এডিটিং করতে জানতে হবে। Monitorization সম্পর্কে ধারণা থাকতে হবে। Skills & Expertise Dhaka Compensation & Other Benefits Mobile bill,Performance bonus Lunch Facilities: Full Subsidize Salary Review: Half Yearly Festival Bonus: 2 কাজের অভিজ্ঞতার উপরে স্যালারি রিভিউ হবে। কোম্পানির সকল সুযোগ সুবিধা দিয়ে থাকিবে। ফেসবুক, ইন্সট্রাগ্রাম ও অন্যান্য সোশাল মিডিয়ায় অনলাইন মার্কেটিং সম্পর্কে পারদর্শী হতে হবে। Employment Status Full Time Job Location Dhaka (Uttara Sector 17) Company Information MUNIA OVERSEAS (RL-2452) Follow More jobs from this company Address: Plot-02, Block-J, Road-6/A, Sector-17, Uttara, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certifi"
  },
  {
    "url": "https://bdjobs.com/h/details/1460936?ln=1",
    "company_name": "Healthcare Chemicals Limited",
    "job_title": "Officer, Quality Assurance",
    "location": "Munshiganj (Gazaria)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Officer, Quality Assurance : Healthcare Chemicals Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Healthcare Chemicals Limited Officer, Quality Assurance Application Deadline : 28 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Munshiganj (Gazaria) Published: 20 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Experience requirements: 1-2 years of relevant experience is preferred. Fresh candidates are also encouraged to apply. Skills & Competencies Willingness to learn and follow instructions. Good documentation and communication skills. Teamwork and discipline. Ability to work under stress. Responsibilities & Context Healthcare Chemicals Limited (HCL), a sister concern of Healthcare Pharmaceuticals Limited, located in API Park, besides Dhaka-Chittagong Highway in Gazaria upazila of Munshiganj, envisions manufacturing world class pharmaceutical raw materials for the local and foreign markets. HCL would like to reduce dependency on foreign sourcing of raw materials for the pharmaceuticals industry and save valuable foreign currency of the country. HCL will manufacture Active Pharmaceutical Ingredients (APIs) and related key chemicals required for the pharmaceuticals industry. We are looking for dynamic, self-motivated individuals for the following position in HCL. Job Description/responsibility: Ensure compliance with cGMP, SOPs, and regulatory requirements in manufacturing and packaging areas. Perform line clearance, IPQC, BMR and logbook checking, and handling of retention sample. Prepare and control SOPs and ensure QMS-related documentation is maintained. Compile batch documents and perform batch release activities. Conduct sampling of intermediate and finished products, including cleaning and process validation samples. Conduct investigations for deviations, incidents, non-conformances, market complaints, and OOS/OOT results. Prepare the Annual Product Quality Review (APQR). Handle the Market Compliant, Deviation, Incident, CAPA, NCR & rejections. Coordinate change control activities and follow up on associated actions. Follow up on CAPA and evaluate its effectiveness. Coordinate and conduct training activities. Job function: Quality Assurance Location: API Industrial Park Gazaria, Munshiganj Bangladesh Schedule: Full time Job type: Permanent Skills & Expertise Suggested by cGMP SOP Workplace Work at office Employment Status Full Time Job Location Munshiganj (Gazaria) Apply Procedure Hard Copy We request you to send your CV to HR Department; Corporate Head Office; Nasir Trade Centre [Level 8), 89 Bir Uttam CR Datta Road, Bangla Motor, Dhaka-1205 or e-mail to info@hpl.com.bd. Please mention the name of the position in the subject-line of email or top of the envelope. \"We offer a career, not a Job. We are an equal opportunity employer.\" Apply URL: https://hris.h"
  },
  {
    "url": "https://bdjobs.com/h/details/1454142?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Assistant Manager - Recovery",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 10 years",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Assistant Manager - Recovery : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Assistant Manager - Recovery Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Experience: At least 10 years Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors ন্যূনতম স্নাতক ডিগ্রি মাস্টার্স ডিগ্রি প্রার্থীদের অগ্রাধিকার দেওয়া হবে Experience At least 10 years The applicants should have experience in the following business area(s): Manufacturing (FMCG) Additional Requirements কমপক্ষে ৩টি থানায় ভারপ্রাপ্ত কর্মকর্তা হিসেবে কাজ করার বাস্তব অভিজ্ঞতা। রিকভারি ও ফিল্ড অপারেশন সংক্রান্ত কাজে দক্ষতা। আইনশৃঙ্খলা রক্ষাকারী বাহিনীতে কাজের অভিজ্ঞতার আলোকে সমস্যা সমাধানে সক্ষমতা। মাঠ পর্যায়ে কাজ করার মানসিকতা এবং প্রয়োজন অনুযায়ী ভ্রমণের আগ্রহ। যোগাযোগ দক্ষতা ও Negotiation সক্ষমতা। টিমের সাথে সমন্বয় করে কাজ করার সক্ষমতা। Responsibilities & Context রিকভারি কার্যক্রম বাস্তবায়নে মাঠ পর্যায়ের তদারকি করা। বকেয়া আদায় সংক্রান্ত কার্যক্রম সমন্বয় ও ফলো-আপ করা। স্থানীয় প্রশাসন ও সংশ্লিষ্ট পক্ষের সাথে যোগাযোগ রক্ষা করা। নিয়মিত রিকভারি রিপোর্ট প্রস্তুত ও আপডেট প্রদান করা। প্রতিষ্ঠানের নীতিমালা ও আইনানুগ প্রক্রিয়া অনুসরণ নিশ্চিত করা। Skills & Expertise Suggested by Credit Recovery Recovery Compensation & Other Benefits Attractive compensation package will be offered Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply We offer career just not the job Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Int"
  },
  {
    "url": "https://bdjobs.com/h/details/1461099?ln=1",
    "company_name": "Learnvault",
    "job_title": "Admissions Officer",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 25000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "Admissions Officer : Learnvault Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Learnvault Admissions Officer Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 28 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 25000 - 35000 (Monthly) Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Experience Additional Requirements Age 28 to 40 years Responsibilities & Context Position Overview: We are seeking a proactive, organised, and student-focused Admissions & Student Support Officer to join our team. This role is responsible for managing the end-to-end admissions process while providing ongoing support to students to ensure a smooth enrolment experience and positive student journey, in line with compliance and organisational requirements. Key Responsibilities Process domestic and international student applications accurately and within required timeframes. Assess applications, verify documentation, and ensure eligibility requirements are met in accordance with policies and regulatory standards. Issue Letters of Offer and related admission documentation. Respond to enquiries from prospective students, education agents, and internal departments via phone, email, and live chat in a professional and timely manner. Assist students with completing admission requirements, including documentation, eligibility checks, and fee payments. Maintain accurate and up-to-date records in the Student Management System (SMS). Follow up with applicants and enrolled students regarding outstanding documents, payments, or academic requirements. Provide support to students from enrolment through to course completion, including guidance on policies, procedures, and available support services. Identify students who may require additional academic or welfare support and refer matters appropriately. Ensure all tasks are completed in line with standard operating procedures and compliance obligations. Collaborate with team members to meet admissions, compliance, and student retention goals. Stay open to feedback and continuously improve performance and service delivery. Skills & Expertise Accuracy Communication in English Efficient Good English communication skills (verbal and Written) Problem solving and decision making Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Learnvault Follow Address: Level 1, 126 Charles St, Launceston, Tasmania 7250, Australia. Business: Located in Melbourne, Victoria, and Launceston, Tasmania,  Australian Federation College (AFC) is dedicated to providing high-quality education in a range of fields. With a focus on Human Welfare, Leadership and Management, Information Technology, Kitchen Management, Hospitality Management, and Agriculture and Horticu"
  },
  {
    "url": "https://bdjobs.com/h/details/1461148?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Head of Security (Retired Army Officer – Major Preferred)",
    "location": "Chattogram",
    "salary": "",
    "experience": null,
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Head of Security (Retired Army Officer – Major Preferred) : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Head of Security (Retired Army Officer – Major Preferred) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Chattogram Published: 21 Feb 2026 Application Insights View Requirements Education Additional Requirements Retired Army Officer (Rank: Major preferred). Experience in industrial/factory security management. Additional training in industrial security, safety management, or compliance will be considered an advantage. Strong decision-making ability, crisis handling capability, and administrative control skills. Physically fit, mentally resilient, and of unquestionable integrity. Responsibilities & Context Lead and control the entire factory security function with full command responsibility. Develop and implement comprehensive security policies, SOPs, and risk mitigation strategies. Ensure strict access control, gate discipline, visitor management, and vehicle inspection procedures. Oversee CCTV surveillance systems and conduct security audits regularly. Prevent theft, pilferage, sabotage, and internal irregularities. Coordinate with local administration, law enforcement agencies, and regulatory authorities when required. Lead emergency response planning including fire safety and crisis management. Supervise and train security personnel to maintain high discipline standards. Submit structured reports to top management on security performance and risk assessments. Skills & Expertise Security Security Management Workplace Work at office Employment Status Full Time Job Location Chattogram Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management "
  },
  {
    "url": "https://bdjobs.com/h/details/1461660?ln=1",
    "company_name": "NetCom Learning Global",
    "job_title": "Manager - Asset & Legal Affairs",
    "location": "Dhaka (Dhanmondi, GULSHAN 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Manager - Asset & Legal Affairs : NetCom Learning Global Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List NetCom Learning Global Manager - Asset & Legal Affairs Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 26 to 45 years Location: Dhaka (Dhanmondi, GULSHAN... Dhaka (Dhanmondi, GULSHAN 1) Salary: Tk. 70000 - 80000 (Monthly) Published: 20 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 26 to 45 years Responsibilities & Context Role Overview We are seeking a highly sophisticated, reliable, and discreet Property & Estate Manager to oversee a diverse portfolio of real estate assets, legal interests, and personal initiatives. This role requires a unique blend of operational oversight, legal coordination, and long-term project planning. You will act as the primary point of contact for all non-business property matters, ensuring that assets are maintained, staff are productive, and community-focused legacy projects are moved forward. Key Responsibilities 1. Land & Property Asset Management Legal Oversight: Act as the lead coordinator for all land-related legal cases. Collaborate with legal counsel to monitor filings, attend hearings if necessary, and ensure all documentation is meticulously organized. Conflict Resolution: Implement long-term strategies to resolve property disputes and protect the integrity of the land portfolio. 2. Residential & Commercial Oversight Russell Sarder Tower: Oversee daily operations, maintenance schedules, and security. Manage on-site staff to ensure the property is functioning at peak efficiency. Dhanmondi Apartment: Complete management of both floors, including maintenance, utility management, and ensuring the premises are guest-ready or occupied according to ownership needs. 3. Team Leadership & Personnel Management Directly supervise a team of three full-time support staff. Coordinate daily errands, schedules, and performance reviews. Ensure a high standard of accountability and \"no-fail\" execution for all personal support tasks. 4. Community & Legacy Projects Strategic Development: Provide administrative and operational support for long-term initiatives in the family’s ancestral village. Project Planning: Assist in the early-stage planning of a community school and other village development projects intended to benefit the local community. 5. Executive Personal Support Execute sensitive, non-business-related requests with total discretion. Manage a wide range of personal logistics, ensuring the Principal’s domestic and personal affairs run seamlessly. Candidate Requirements Communication: Fluency in English is mandatory. You must be able to communicate complex legal and operational updates directly to the Principal with clarity. Judgment: Exceptional decision-making skill"
  },
  {
    "url": "https://bdjobs.com/h/details/1461677?ln=1",
    "company_name": "Studyfly Associates Bangladesh-SAB",
    "job_title": "Marketing Manager - Admission And Counseling",
    "location": "Dhaka, Dhaka (Badda, Gulshan, Khilkhet, Mirpur, Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Marketing Manager - Admission And Counseling : Studyfly Associates Bangladesh-SAB Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Studyfly Associates Bangladesh-SAB Marketing Manager - Admission And Counseling Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Location: Dhaka, Dhaka (Badda, Guls... Dhaka, Dhaka (Badda, Gulshan, Khilkhet, Mirpur, Uttara) Salary: Negotiable Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Responsibilities & Context 1. Create strong bonding and maintain long-term professional relationships with agents and sub-agents. 2. Maintain regular communication and follow-up with existing agents. 3. Identify, recruit, and onboard new agents in different districts. 4. Conduct field visits to existing and potential agents when required. 5. Ensure smooth coordination between agents and the admission team. 6. Provide agents with regular updates on university requirements, visa policies, and deadlines. 7. Resolve agent queries and operational issues efficiently. 8. Manage and handle the company Facebook Page for agent communication. 9. Create, post, and monitor updates regarding partner universities, intakes, commission offers, and deadlines. 10. Respond to agent inquiries via Facebook, Messenger, and WhatsApp. 11. Share promotional materials and official updates with agents digitally. 12. Collect and maintain agent database (location, contact details, capacity, monthly potential). 13. Monitor application flow and performance of each agent. Skills & Expertise Customer Relationship Management communication and interpersonal skill. agent marketing Digital Market or Facebook Page Monitoring and Reporting Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka, Dhaka (Badda, Gulshan, Khilkhet, Mirpur, Uttara) Company Information Studyfly Associates Bangladesh-SAB Follow Address: Uttara Priyanka City, Sector 12, Road 02, House 11, Dhaka-1230 Website: www.studyflybd.com Business: We are a professional education consultancy firm providing end-to-end guidance for international study opportunities.\nOur services include student counseling, university admissions, documentation support, and visa assistance.\nWe work closely with reputed institutions to ensure suitable academic placements.\nOur goal is to help students make informed decisions and build successful global careers. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকর"
  }
]