[
  {
    "url": "https://bdjobs.com/h/details/1461614?ln=1",
    "company_name": "Offshore Staffing Solution",
    "job_title": "UI/UX Designer & Creative Support",
    "location": "Dhaka (Savar)",
    "salary": null,
    "experience": "At most 1 year",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "UI/UX Designer & Creative Support : Offshore Staffing Solution Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Offshore Staffing Solution UI/UX Designer & Creative Support Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 20 to 28 years Location: Dhaka (Savar) Salary: Tk. 18000 - 22000 (Monthly) Experience: At most 1 year Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Diploma in Engineering in Computer Science & Engineering Experience At most 1 year The applicants should have experience in the following business area(s): IT Enabled Service Freshers are also encouraged to apply. Additional Requirements Age 20 to 28 years Responsibilities & Context Join Our Team at Offshore Staffing Solutions LTD ! Job Type: Full-Time (Only Night Shift) Working Days: Monday - Friday Working Hours: 10:00 PM - 07:00 AM Location: 4th Floor, Akran Bazar Rd, (Opposite Peace School, before Akran Bazar from Birulia Bridge), Samair Dhaal, Birulia, Savar-1345, Dhaka *Transportation facility available from Mirpur 11.5 or Uttara center metro railway station We are looking for a talented UI/UX designer who has a passion for creating seamless user experiences. While your primary focus will be on designing and building our digital products (websites, apps, and dashboards), we are a dynamic team where versatility is valued. And also some graphic designing skills are required. Responsibilities Ui/Xi designer responsibilities: • Lead the design of user interfaces for our [website/app/platform]. •     Create wireframes, storyboards, user flows, process flows, and site maps to effectively communicate interaction and design ideas. • Conduct user research and evaluate user feedback to iterate on designs. • Establish and maintain a consistent design language and component library. Creative Support responsibilities • Create basic social media posts and banners to support our marketing team. • Assist with minor graphic design tasks to ensure brand consistency across all visual touchpoints. What We’re Looking For • Proven Experience: A strong portfolio showcasing your UI/UX process (wireframes, prototypes, and final designs) for digital products. • The Tools: Proficiency in Figma, Sketch, Adobe XD, or similar. Working knowledge of the Adobe Creative Suite (Photoshop/Illustrator) for basic graphic design tasks. • User-Centered Mindset: You don’t just make things look good; you understand why they work for the user. Skills & Expertise UI/UX Design Creative and innovative Compensation & Other Benefits T/A,Provident fund,Over time allowance,Weekly 2 holidays Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Provident fund, Overtime allowance Weekly 2 holidays Salary Review: Yearly Atten"
  },
  {
    "url": "https://bdjobs.com/h/details/1461711?ln=1",
    "company_name": "Aasceend Property Development Limited",
    "job_title": "CMO / CSO (Land, Hotels & Resorts) Real Estate Sales",
    "location": "Dhaka (DOHS Baridhara)",
    "salary": null,
    "experience": "12 to 20 years",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "CMO / CSO (Land, Hotels & Resorts) Real Estate Sales : Aasceend Property Development Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aasceend Property Development Limited CMO / CSO (Land, Hotels & Resorts) Real Estate Sales Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 40 to 45 years Location: Dhaka (DOHS Baridhara) Salary: Negotiable Experience: 12 to 20 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Master of Business Administration (MBA) in Marketing Experience 12 to 20 years The applicants should have experience in the following business area(s): Real Estate, Developer Additional Requirements Age 40 to 45 years Minimum 5 years in senior leadership role. Proven experience in land project launch and installment sales model. Strong understanding of Bangladesh land registration and documentation process. Experience handling high-value corporate and institutional clients. Responsibilities & Context Job Summary The Chief Marketing Officer (CMO) / Chief Sales Officer (CSO) will lead the strategic planning and execution of marketing and sales operations for the company’s land development projects and hotel/resort properties in Bangladesh. The role is responsible for revenue generation, project launch strategy, installment-based sales management, hospitality revenue optimization, brand positioning, and channel development in compliance with applicable local laws and business practices. Core Responsibilities 1. Strategic & Commercial Leadership Develop annual sales and marketing strategy aligned with company revenue targets. Lead go-to-market strategy for land project launches. Develop market penetration strategies for domestic and NRB (Non-Resident Bangladeshi) buyers. Ensure compliance with applicable land, real estate, tourism, and business regulations in Bangladesh. Monitor competitor developers and hospitality brands within Dhaka and key tourist zones. 2. Land Sales Management (Bangladesh Context) Design installment-based payment structures (booking money, down payment, EMI schedule). Oversee plot booking, allotment, and customer documentation process. Coordinate with Legal for land mutation, registration, and deed execution. Supervise sales offices, site sales teams, and channel partners. Develop corporate and broker network across Dhaka and divisional cities. Ensure timely collection of receivables and reduce overdue accounts. 3. Hotels & Resorts Sales Strategy Develop occupancy and revenue strategy considering peak/off-peak seasons. Manage corporate bookings, group sales, event sales, and government contracts. Build partnerships with tour operators and online travel agencies. Drive wedding, conference, and destination event sales (high-demand segment in Bangladesh). Monitor gues"
  },
  {
    "url": "https://bdjobs.com/h/details/1461738?ln=1",
    "company_name": "BRAC",
    "job_title": "Senior Project Officer, PSS Counsellor, Humanitarian Development Coexistence Nexus, HCMP",
    "location": "Cox`s Bazar (Teknaf, Ukhia)",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "02 Mar 2026",
    "job_description": "Senior Project Officer, PSS Counsellor, Humanitarian Development Coexistence Nexus, HCMP : BRAC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List BRAC Senior Project Officer, PSS Counsellor, Humanitarian Development Coexistence Nexus, HCMP Application Deadline : 02 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Cox`s Bazar (Teknaf, Ukhi... Cox`s Bazar (Teknaf, Ukhia) Salary: Negotiable Experience: At least 2 years Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Bachelor’s in Psychology, Clinical Psychology, MBBS, Public Health or any other relevant discipline form a reputed university/institution Experience At least 2 years The applicants should have experience in the following business area(s): Development Agency, NGO Additional Requirements 1 year working experience as a PSS Counsellor KNOWLEDGE: Understanding of psychosocial support frameworks. Knowledge of trauma-informed care and GBV protection principles. Awareness of Rohingya culture and contextual psychosocial challenges. SKILLS: Strong counselling and facilitation skills. Case management and psychosocial assessment skills. Training facilitation and capacity-building skills. Strong interpersonal and communication abilities. Report writing and documentation skills. COMPETENCIES: Emotional resilience and active listening. Cultural sensitivity and gender awareness. Problem-solving and conflict resolution. Teamwork and collaboration. Ethical integrity and safeguarding accountability. Responsibilities & Context BRAC is an international development organisation founded in Bangladesh in 1972 that partners globally with over 100 million people living with inequality and poverty to create opportunities to realise their potential. The Senior Project Officer, PSS Counsellor will be responsible for delivering individual and group-based psychosocial support (PSS) services to vulnerable populations, particularly women and adolescents, following the 4-tier PSS intervention framework. The role involves structured PSS planning, referrals, capacity-building, and community-based psychosocial activities to address mental health needs and emotional well-being of beneficiaries in the humanitarian context. Direct Psychosocial Support Services •\tProvide individual and group-based psychosocial support sessions to affected individuals, especially emotionally vulnerable women and adolescent girls. •\tDevelop care and safety plans with clients based on their immediate and long-term psychosocial needs. •\tRefer complex cases to psychiatrists or mental health professionals as needed. •\tConduct psychological assessments and maintain confidential case documentation. PSS Programme Implementation and Community Engagement •\tDesign monthly and weekly PSS activity schedules based on PSS framework. •\tFacilitate"
  },
  {
    "url": "https://bdjobs.com/h/details/1461704?ln=1",
    "company_name": "Eduwires",
    "job_title": "Education Consultant (UK / Australia / New Zealand)",
    "location": "Dhaka (Dhanmondi)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Education Consultant (UK / Australia / New Zealand) : Eduwires Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Eduwires Education Consultant (UK / Australia / New Zealand) Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 26 to 35 years Location: Dhaka (Dhanmondi) Salary: Negotiable Experience: 1 to 3 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service Additional Requirements Age 26 to 35 years Responsibilities & Context Student Counseling & Guidance Provide professional counseling to students interested in studying in UK, Australia, New Zealand, and other partner countries . Understand student goals, academic background, financial capability, and English proficiency. Suggest suitable universities and career-focused courses. Explain intakes (UK: Jan/May/Sep | Australia: Feb/July/Nov | NZ: Feb/July), tuition fees, scholarships, and deadlines. Guide students regarding living costs, accommodation, part-time work rights, and post-study work opportunities. Lead Handling & Conversion Manage fresh leads from Facebook, website, walk-ins, and CRM. Conduct counseling sessions (online & offline). Follow up regularly via phone, WhatsApp, and email. Convert inquiries into registered applicants. Maintain daily follow-up logs in CRM. Achieve monthly student enrollment targets. Admission & Offer Management Assist with university application submissions. Explain conditional & unconditional offers. Guide on CAS (UK), COE (Australia), Offer of Place (NZ). Support tuition fee payment and enrollment confirmation. Coordinate with university admission teams for updates. Visa Guidance & Compliance Guide students on financial documents and sponsor requirements. Assist with: UK Student Route visa Australia Subclass 500 visa New Zealand Student Visa Prepare visa checklist and conduct mock interviews (if required). Assist with TB test, OSHC, IHS, medical & biometrics booking. Ensure documentation accuracy and compliance. CRM & Reporting Update CRM / Excel sheet daily with lead, follow-up, and application status. Prepare weekly & monthly performance reports. Coordinate with marketing team regarding lead quality. Additional Responsibilities Create short educational videos for social media. Attend seminars, education fairs, workshops, and partner training. Maintain strong relationships with university representatives and alumni students. Skills & Expertise Computer Literacy FLUENCY IN ENGLISH LANGUAGE Student Consultancy Student Visa Processing Compensation & Other Benefits Mobile bill,Performance bonus Festival Bonus: 2 Salary Review: Yearly Attractive "
  },
  {
    "url": "https://bdjobs.com/h/details/1461701?ln=1",
    "company_name": "VIC GLOBAL",
    "job_title": "Receptionist ( Front Desk Officer )",
    "location": "Dhaka, Dhaka (Farmgate, PanthaPath)",
    "salary": null,
    "experience": "At least 1 year",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Receptionist ( Front Desk Officer ) : VIC GLOBAL Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List VIC GLOBAL Receptionist ( Front Desk Officer ) Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: At least 22 years Location: Dhaka, Dhaka (Farmgate, P... Dhaka, Dhaka (Farmgate, PanthaPath) Salary: Tk. 12000 - 12000 (Monthly) Experience: At least 1 year Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Higher Secondary Bachelor/Honors Diploma Experience At least 1 year The applicants should have experience in the following business area(s): Manpower Recruitment, Call Center, Direct Selling/Marketing Service Company, Shop/Showroom, Shopping mall, Grocery shop Additional Requirements Age At least 22 years Responsibilities & Context Greet and assist visitors and clients in a professional manner Manage clients scheduling and meeting arrangements. Keep attendance, leave, and basic HR/admin records. Organize files, maintain confidentiality, and update contact lists. Coordinate with vendors and service providers for office needs. Support management with day-to-day administrative tasks. Any other task assigned by the HR Dept. Organize travel, accommodation, and logistics for local and overseas trips. Professional communication social media comments and messages. Shifting duty 7am-3pm or 3pm-11pm. Skills & Expertise Microsoft Office MS Office Computer Literacy Social Media Management Communication Sales & Marketing Receptionist/ Front Desk Compensation & Other Benefits T/A,Tour allowance,Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Increment Workplace Work at office Employment Status Part Time Gender Only males are allowed to apply. Job Location Dhaka, Dhaka (Farmgate, PanthaPath) Company Information VIC GLOBAL Follow More jobs from this company Address: Chandrashila Suvastu Tower, 5th-B, 69/1, Panthapath, Dhaka-1205 Website: https://www.youtube.com/@VisaInformation Business: VIC Global RL2556 is a recruiting agency in Bangladesh. Government Approved International Recruiting License No RL2556. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT J"
  },
  {
    "url": "https://bdjobs.com/h/details/1461751?ln=1",
    "company_name": "27 Shaptak Square",
    "job_title": "Facility Manager",
    "location": "Dhaka (Dhanmondi)",
    "salary": "Negotiable",
    "experience": "At least 5 years",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Facility Manager : 27 Shaptak Square Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List 27 Shaptak Square Facility Manager Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: At least 25 years Location: Dhaka (Dhanmondi) Salary: Negotiable Experience: At least 5 years Published: 21 Feb 2026 Application Insights View Requirements Education Diploma Bachelor/Honors Experience At least 5 years Additional Requirements Age At least 25 years Responsibilities & Context ভবনের দৈনন্দিন কার্যক্রম তত্ত্বাবধান করা। একাউন্টিং এ দক্ষ এর পারদর্শী, হিসাবরক্ষণে খুবই পারদর্শী হতে হবে। নিরাপত্তা, পরিচ্ছন্নতা ও রক্ষণাবেক্ষণ কার্যক্রম নিশ্চিত করা। ইলেকট্রিক্যাল, মেকানিক্যাল এবং প্লাম্বিং সিস্টেম এর কার্যকারিতা তদারকি করা। ভবনের অগ্নি নির্বাপন ব্যবস্থার ধারাবাহিক পর্যবেক্ষণ এবং কার্যকারিতা নিশ্চিতকরণ। ভবনের ভাড়াটিয়া এবং স্টাফদের সাথে সমন্বয় সাধন। জরুরী পরিস্থিতিতে দ্রুত সিদ্ধান্তগ্রহণ এবং সমাধান প্রদান। মাসিক রক্ষা নিবেক্ষণ পরিকল্পনা তৈরি এবং বাজেট তৈরি করন। ভবনের পরিসেবা সরবরাহকারীদের কার্যক্রম পর্যবেক্ষণ এবং মূল্যায়ন। সেবার জন্য সার্ভিস চার্জ তৈরি, গ্রহণ এবং হিসাব সংরক্ষণ। ভবন কতৃপক্ষ হিসাবে নিয়োজিত ভবন মালিকের সমিতি নির্দেশনা অনুযায়ী কাজ করা। যোগ্যতা: ন্যূনতম স্নাতক ডিগ্রি । বাণিজ্যিক ভবন ব্যবস্থাপনার কাজে ৩-৫ বছরের অভিজ্ঞতা। ইলেকট্রিক্যাল এবং মেকানিক্যাল সিস্টেম সম্পর্কে বেসিক জ্ঞান থাকা আবশ্যক । লিডারশিপ স্কিল এবং সমস্যা সমাধানে দক্ষতা। মাইক্রোসফট অফিস অ্যাপ্লিকেশন ব্যবহারে দক্ষতা। বাংলা ও ইংরেজিতে যোগাযোগে সাবলীল। বেতন ও সুযোগ-সুবিধা: আকর্ষণীয় বেতন। উৎসব ভাতা। আবেদন পদ্ধতি: আগ্রহী প্রার্থীদের 27shaptaksquare@ gmail.com এই ইমেইলে সর্বশেষ জীবনবৃত্তান্ত (CV) এবং এক কপি ছবি পাঠানোর অনুরোধ করা হচ্ছে। Skills & Expertise Accounting facility management Maintenance Workplace Work at office Employment Status Full Time Job Location Dhaka (Dhanmondi) Job Highlights Expert in leadership, Expert in Building Management Company Information 27 Shaptak Square Follow Address: 27 Shaptak Square, Dhanmondi-27 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Ce"
  },
  {
    "url": "https://bdjobs.com/h/details/1461612?ln=1",
    "company_name": "Offshore Staffing Solution",
    "job_title": "App Developer (React Native)",
    "location": "Dhaka (Savar)",
    "salary": null,
    "experience": "At most 1 year",
    "education": null,
    "deadline": "14 Mar 2026",
    "job_description": "App Developer (React Native) : Offshore Staffing Solution Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Offshore Staffing Solution App Developer (React Native) Application Deadline : 14 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 20 to 28 years Location: Dhaka (Savar) Salary: Tk. 18000 - 22000 (Monthly) Experience: At most 1 year Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Diploma in Engineering in Computer Science & Engineering Experience At most 1 year The applicants should have experience in the following business area(s): IT Enabled Service Freshers are also encouraged to apply. Additional Requirements Age 20 to 28 years Responsibilities & Context Join Our Team at Offshore Staffing Solutions LTD ! Job Type: Full-Time (Only Night Shift) Working Days: Monday - Friday Working Hours: 10:00 PM - 07:00 AM Location: 4th Floor, Akran Bazar Rd, (Opposite Peace School, before Akran Bazar from Birulia Bridge), Samair Dhaal, Birulia, Savar-1345, Dhaka Partial transportation facility available from Mirpur 11.5 or Uttara center metro rail station Responsibilities 1. Maintain, and deploy high-quality mobile applications for iOS and Android 2. Write clean, maintainable, and well-documented code 3. Implement responsive UI components that work across different devices and screen sizes 4. Integrate with third-party APIs and services Skills & Expertise Mobile App Development React Native Compensation & Other Benefits Provident fund,T/A,Weekly 2 holidays,Over time allowance Salary Review: Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Provident fund Overtime allowance Weekly 2 holidays Salary Review: Yearly Attendance Bonus Food Allowance Snacks & Coffee Annual retreats 2 Festival Bonuses (Based on Eligibility Criteria) Birthday event celebrations Quarterly award ceremonies Team outings Family Medical Loan House Loan Vehicle loan General Fancy Loan Workplace Work at office Employment Status Full Time Job Location Dhaka (Savar) Job Highlights Provident fund Overtime allowance Weekly 2 holidays Annual retreats Birthday event celebrations Quarterly award ceremonies Team outings Family Medical Loan House Loan Vehicle loan Company Information Offshore Staffing Solution Follow More jobs from this company Address: 4th floor, Akran Bazar Rd (located just before & opposite building of Peace School, when traveling from Birulia Bridge towards Akran Bazar), Samair Dhaal, Birulia, Savar-1345, Dhaka, Bangladesh, Savar, Bangladesh, 1345 Website: https://offshorestaffingsolutions.com/ Business: Offshore Staffing Solutions LTD, a stalwart in the industry for 10 years, excels in IT-enabled client management. Our success is rooted in a dynamic team of amazing employees. We are on the lookout for deter"
  },
  {
    "url": "https://bdjobs.com/h/details/1461706?ln=1",
    "company_name": "HelloDoctor.org",
    "job_title": "Telemarketing Executive",
    "location": "Khulna",
    "salary": "Tk. 11000 - 12000 (Monthly)",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Telemarketing Executive : HelloDoctor.org Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List HelloDoctor.org Telemarketing Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 24 to 40 years Location: Khulna Salary: Tk. 11000 - 12000 (Monthly) Experience: 1 to 2 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Higher Secondary Experience 1 to 2 years The applicants should have experience in the following business area(s): Direct Selling/Marketing Service Company Additional Requirements Age 24 to 40 years Responsibilities & Context Job Responsibilities Call leads/customers to explain services and create interest Follow up to confirm bookings/consultations Handle common questions and objections professionally When needed, connect customers with customer support or an on-duty doctor Maintain daily call logs and update outcomes (call status, follow-up notes, results) Requirements Minimum HSC pass Telemarketing experience preferred Confident, polite, and clear communication over phone Basic knowledge of smartphone/computer and must have own smartphone Stable internet and punctual work habits Comfortable working with targets (incentives available) Skills & Expertise Sales & Marketing Workplace Work at office Employment Status Full Time Job Location Khulna Company Information HelloDoctor.org Follow Address: 55-56 shahid shangbadik selena Parvin road, Boro magbazar, Dhaka Business: HelloDoctor.org connects patients in Bangladesh with verified doctors for convenient online consultations through chat, voice, or video—focused on privacy, quality care, and a commission-free model. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on"
  },
  {
    "url": "https://bdjobs.com/h/details/1461707?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Officer / Sr. Officer – Commercial (Shipping)",
    "location": "Dhaka",
    "salary": "",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Officer / Sr. Officer – Commercial (Shipping) : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Officer / Sr. Officer – Commercial (Shipping) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 2 years Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Experience At least 2 years Additional Requirements Familiarity with shipping documentation, port procedures, and customs formalities. Good organizational, communication, and negotiation skills. Ability to manage multiple shipments and resolve operational challenges efficiently. Knowledge of international shipping practices is an advantage. Responsibilities & Context Coordinate with shipping lines, C&F agents, and freight forwarders for import and export shipments. Prepare, verify, and manage shipping and commercial documentation: bills of lading, invoices, packing lists, and customs documents. Track shipments to ensure timely delivery and resolve discrepancies proactively. Liaise with internal teams (Production, Procurement, Accounts) to align shipment schedules and commercial requirements. Monitor freight charges, insurance, and contractual terms with shipping and logistics partners. Support cost control and optimization of logistics and shipping operations. Maintain accurate records and submit regular reports on shipments, costs, and operational KPIs. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate co"
  },
  {
    "url": "https://bdjobs.com/h/details/1461013?ln=1",
    "company_name": "Renown Group of Company",
    "job_title": "AGM/DGM - Supply Chain",
    "location": "Dhaka (GULSHAN 1)",
    "salary": null,
    "experience": "At least 15 years",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "AGM/DGM - Supply Chain : Renown Group of Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Renown Group of Company AGM/DGM - Supply Chain Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 35 years Location: Dhaka (GULSHAN 1) Salary: Negotiable Experience: At least 15 years Published: 21 Feb 2026 Application Insights View Requirements Education Bachelor of Science (BSc) in Textile Engineering B.Sc in Textile Engineering/Industrial Engineering/Supply Chain/ International Business Experience At least 15 years The applicants should have experience in the following business area(s): Dyeing Factory, Spinning, Sweater Industry Additional Requirements Age At least 35 years Responsibilities & Context Job Context: We are seeking a highly experienced and strategic professional to lead the procurement and supply chain operations of our Yarn Dyeing & Spinning (double yarn/ sweater making yarn). The ideal candidate will oversee the entire procurement cycle—from sourcing raw materials (yarns, chemicals) to vendor management, import coordination, inventory control, and timely material availability to support smooth and cost-efficient production. Job Responsibilities: Develop and implement procurement strategies aligned with business goals and production timelines. Ensure efficient sourcing of yarns, chemicals, trims, packaging, and machine parts. Identify and qualify new vendors/ suppliers(international and local); negotiate prices, terms, and contracts. Lead MRP (Material Requirement Planning) based on production forecasts and ensure stock optimization. Monitor the supply pipeline, including imports, LC processing, customs clearance, and delivery. Maintain optimum stock as required for business to balance finance cost, production & sales. Push the sales team to clear old stock. Ensure compliance with company procurement policy, buyer standards, and audit requirements. Work closely with production, planning, commercial, finance, and QA/QC teams. Train, guide, and supervise the supply chain/procurement team; drive performance and accountability. Continuously explore cost-saving opportunities and supply chain process improvements. Skills & Expertise Market trend analysis Supply Chain and Procurement Yarn Sourcing Compensation & Other Benefits Provident fund,Gratuity Lunch Facilities: Full Subsidize Alternative saturday dayoff Office transport: Morning pick. Conditional- based on the route. Workplace Work at office Employment Status Full Time Job Location Dhaka (GULSHAN 1) Company Information Renown Group of Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জব"
  },
  {
    "url": "https://bdjobs.com/h/details/1461690?ln=1",
    "company_name": "Creative Tech Park",
    "job_title": "Field Sales Executive (Software Install)",
    "location": "Dhaka (Merul Badda)",
    "salary": null,
    "experience": "At least 1 year",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "Field Sales Executive (Software Install) : Creative Tech Park Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Creative Tech Park Field Sales Executive (Software Install) Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Age: 18 to 50 years Location: Dhaka (Merul Badda) Salary: Tk. 12000 - 16000 (Monthly) Experience: At least 1 year Published: 21 Feb 2026 Application Insights View Requirements Experience At least 1 year Additional Requirements Age 18 to 50 years If you can't go out and sell in stores, there's no need to apply. Responsibilities & Context Read first, then apply.->> Visit small & medium shops (fashion houses, cosmetic shops, grocery stores, pharmacies, sanitary stores, etc.). Talk directly with shop owners Explain Takar Hisab accounting app in simple Bangla Onboard users on the spot (create account + first entry) Help shop owners understand baki, sales & report Collect basic info and submit daily activity report Follow up with users via WhatsApp / phone Skills & Expertise Field Officer Field Sales Field SR Field Supervision Field Work Marketing and Sales Retail Sales Sales target Customer Service Salesman Suggested by Sales & Marketing Strategic Planning Target Oriented Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Commission on every successful onboarding. Performance Bonus: Per successful onboarding Workplace Work at office Employment Status Full Time Job Location Dhaka (Merul Badda) Company Information Creative Tech Park Follow Address: Imperial Irish Kingdom, Mo-03 (3rd Floor), Merul Badda, Dhaka 1212. Website: https://creativetechpark.com Business: Creative Tech Park is the Best Website Design and Development Company in Dhaka, Bangladesh known for its creative team of developers and custom programming expertise for the past 8 years. Creative Tech Park is one stop and solution for the entire requirements in the web industry. Our services include Website Design and Development, Software Development, Creative Design, Digital Marketing, Domain and Hosting, Search Engine Optimization (SEO). Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project C"
  },
  {
    "url": "https://bdjobs.com/h/details/1461702?ln=1",
    "company_name": "MS CONSULTING ENGINEERS",
    "job_title": "Admin Assistant",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Admin Assistant : MS CONSULTING ENGINEERS Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MS CONSULTING ENGINEERS Admin Assistant Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Location: Anywhere in Bangladesh Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor/Honors Responsibilities & Context fluent in english (listening, speaking and writing) taking client calls from Australia office and pass it to relevant employee handling emails Liaison with clients/ Australia office/team members 3 to 6 months but possibility of permanent role in future Compensation & Other Benefits Weekly 2 holidays,Over time allowance victoria public holidays working days- monday to friday Workplace Work from home Employment Status Contractual Job Location Anywhere in Bangladesh Apply Procedure Email Your CV Send your CV to the given email mkc98135@yahoo.com or Email your CV from My Bdjobs account Company Information MS CONSULTING ENGINEERS Follow Address: Monoj Chowdhury, VILLAGE: KALITOLA, P.S.- KOTWALI, P.O.- DINAJPUR, Business: This company was established in 2018 with the aim to assist in residential engineering design across Australia Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রে"
  },
  {
    "url": "https://bdjobs.com/h/details/1461749?ln=1",
    "company_name": "Akij Sourcing Ltd.",
    "job_title": "Sales Officer - SO",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "2 to 4 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Sales Officer - SO : Akij Sourcing Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Sourcing Ltd. Sales Officer - SO Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 20 to 30 years Location: Anywhere in Bangladesh Salary: Negotiable Experience: 2 to 4 years Published: 21 Feb 2026 Application Insights View Requirements Education Diploma in Mechanical Diploma in Electrical Diploma in Power Experience 2 to 4 years Freshers are also encouraged to apply. Additional Requirements Age 20 to 30 years Responsibilities & Context Achieve monthly, quarterly and annual sales targets in the assigned territory. Develop and maintain strong relationships with distributors and retailers. Identify new business opportunities and grow the market share. Effectively implement all promotional programs to increase sales. Prepare and submit daily, weekly, and monthly sales reports. Follow all the rules and regulations of the company. Skills & Expertise Communication Skills Water Pump Compensation & Other Benefits Provident fund,Medical allowance,Gratuity Salary Review: Yearly Festival Bonus: 2 TA/DA Commission Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Akij Sourcing Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Reg"
  },
  {
    "url": "https://bdjobs.com/h/details/1455575?ln=1",
    "company_name": "Labaid Firetech Solution Ltd.",
    "job_title": "Assistant Manager - Sales & Marketing",
    "location": "Dhaka (Dhanmondi)",
    "salary": "Negotiable",
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Assistant Manager - Sales & Marketing : Labaid Firetech Solution Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Labaid Firetech Solution Ltd. Assistant Manager - Sales & Marketing Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka (Dhanmondi) Salary: Negotiable Experience: 3 to 5 years Published: 31 Jan 2026 Application Insights View Requirements Education Bachelor of Science (BSc) Bachelor’s degree in EEE, Mechanical, or relevant Engineering discipline (Preferred) OR Bachelor’s degree in Business Administration/Marketing with strong technical exposure Experience 3 to 5 years Additional Requirements Qualifications & Experience 3–5 years of experience in technical / project-based / B2B sales & marketing Proven record in lead generation and sales conversion Proficiency in MS Office; CRM experience is an advantage Key Skills & Competencies Strong pipeline and lead management capability Target-driven mindset with disciplined follow-up Technical understanding and solution-selling approach Excellent communication, presentation, and negotiation skills Ability to work independently under pressure and meet deadlines Responsibilities & Context Position: Assistant Manager – Sales & Marketing Department: Sales & Marketing Reports To: Sales & Marketing Manager / Head of Business Development Job Summary Labaid Firetech Solution Ltd. is looking for a dynamic, target-driven, and technically sound professional to join our Sales & Marketing team as Assistant Manager . The ideal candidate will have an engineering background (EEE/Mechanical or relevant) with proven experience in technical or project-based B2B sales . This role focuses on lead generation, sales conversion, client engagement, and achievement of sales targets in a solution-oriented engineering environment. Key Responsibilities Sales & Business Development Generate qualified leads through market mapping, client visits, networking, and digital channels Convert leads into opportunities and achieve monthly, quarterly, and annual sales targets Identify new projects, key accounts, consultants, and decision-makers Prepare and follow up on proposals, quotations, and techno-commercial offers Support price negotiation, contract finalization, and order booking Marketing & Lead Support Support marketing campaigns for lead generation and brand visibility Assist in updating corporate profiles, brochures, and presentations Conduct market research on competitors, trends, and upcoming projects Support seminars, exhibitions, roadshows, and client engagement programs Coordination & Reporting Coordinate with engineering, project, and operations teams for smooth project handover Maintain CRM records, lead pipelines, and sales documentation Prepare sales reports, conversion reports, and target achievement reports Skills & Expertise Suggested by Bu"
  },
  {
    "url": "https://bdjobs.com/h/details/1461689?ln=1",
    "company_name": "Elon IT",
    "job_title": "Video Editor & Content Creator",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "Video Editor & Content Creator : Elon IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Elon IT Video Editor & Content Creator Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 24 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 24 years Responsibilities & Context We are seeking two highly creative and detail-oriented Video Editors to join our team. The selected candidates will be responsible for producing high-quality video content using modern editing techniques and AI-powered workflows. Key Responsibilities: Edit high-quality videos using Adobe Premiere Pro Perform advanced colour correction and cinematic grading Utilize AI tools for video enhancement, automation, and creative storytelling Create engaging social media content and promotional advertisements Work closely with the creative and marketing teams to understand project objectives Manage multiple projects while meeting deadlines Organise and maintain project files systematically Ensure consistency in branding and visual storytelling Deliver optimised final outputs for different platforms (YouTube, Instagram, Facebook, Ads, etc.) Skills & Expertise Adobe After Effects Adobe Photoshop Adobe Premiere Pro Artificial intelligence (AI) DaVinci Resolve Suggested by Video Editing Content Creation Content Editing Compensation & Other Benefits Tour allowance,Performance bonus Festival Bonus: 2 Salary Review: Yearly Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Elon IT Follow Address: House # 33(4B Floor), Road # 3, Sector # 9, Uttara, Dhaka-1230. Website: https://www.elonit.com/ Business: ?? Exciting News! Elon IT is Now Open for Business! ?? We are thrilled to announce the launch of Elon IT, your new destination for cutting-edge software solutions! ?? At Elon IT, we specialize in: ?? Mobile App Development (Flutter, React Native, Kotlin, Swift) ?? Website Development (HTML, CSS, Bootstrap, Tailwind, React.js, Vue.js) ?? Software Development (Laravel, Node.js) ?? SEO & Digital Marketing Our team of experts is dedicated to delivering innovative solutions to help your business thrive in the digital age. Whether you need a stunning website, a powerful mobile app, or effective digital marketing strategies, we`ve got you covered! ?? Visit us at: 4B, House 33, Road 3, Sector 9, Uttara, Dhaka, Bangladesh ?? Contact us: 01770099496 (WhatsApp) ?? Email: info@elonit.com ?? Website: www.elonit.com Follow us for updates, tips, and more! Let`s take your business to new heights together. ?? Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি"
  },
  {
    "url": "https://bdjobs.com/h/details/1456395?ln=1",
    "company_name": "Labaid Insuretech Company Ltd.",
    "job_title": "Product Executive (Life & Non-Life)",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Product Executive (Life & Non-Life) : Labaid Insuretech Company Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Labaid Insuretech Company Ltd. Product Executive (Life & Non-Life) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Location: Dhaka (Dhanmondi) Salary: Negotiable Published: 02 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements 1–3 years of experience in insurance, banking, fintech/Insuretech, or product support Understanding of Life & Non-Life insurance concepts preferred Strong documentation and analytical skills Ability to simplify technical insurance language Excel/Sheets proficiency for product MIS Coordination skills across partners and internal teams Customer-centric and detail-oriented mindset Responsibilities & Context Labaid Insuretech Company Ltd. Shape digital insurance products that customers can understand, trust, and buy with ease. We are hiring a Product Executive to support lifecycle management of Life & Non-Life insurance offerings across digital channels, partners, and customer touchpoints. 🎯 Job Summary The Product Executive will assist in designing, documenting, positioning, and improving insurance products for digital distribution. The role blends market research, product documentation, partner coordination, and performance tracking to ensure products are competitive, compliant, and customer-friendly. 🔑 Key Responsibilities Product Documentation & Design Prepare product notes, benefit structures, eligibility, exclusions, and pricing summaries Translate insurer terms into customer-friendly product briefs for digital use Maintain updated product repository and version control Market & Competitor Analysis Conduct comparisons of Life & Non-Life plans in the market Identify gaps and recommend feature enhancements Support pricing and positioning analysis Digital Journey & Partner Coordination Work with tech/CRM teams to align product features with digital onboarding flows Coordinate with insurer partners for product updates and clarifications Ensure accurate product configuration in CRM/ERP Performance Monitoring Track product-wise sales, conversion, and customer feedback Prepare monthly product performance MIS and insights Recommend improvements based on data and user behavior Training & Sales Enablement Prepare product guides, FAQs, and training decks Support sales/business teams with product knowledge sessions 📊 KPI & Performance Indicators (SMART) Timely update of product documentation (100% accuracy) Product MIS and performance reporting cycle adherence Reduction in product-related onboarding errors Number of product improvements/updates implemented quarterly Training sessions conducted for sales teams 📍 Job Location: Dhaka (Office Based) Skills & Exp"
  },
  {
    "url": "https://bdjobs.com/h/details/1461762?ln=1",
    "company_name": "Shatarupa Weaving Mills Ltd.",
    "job_title": "SR. Executive ( HR & ADMIN )",
    "location": "Gazipur (Tongi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Mar 2026",
    "job_description": "SR. Executive ( HR & ADMIN ) : Shatarupa Weaving Mills Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shatarupa Weaving Mills Ltd. SR. Executive ( HR & ADMIN ) Application Deadline : 23 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 27 to 35 years Location: Gazipur (Tongi) Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 27 to 35 years 4–5 years’ proven experience in HR & Admin (Manufacturing, FMCG, Textile, Retail, Transport, Warehouse, Online Retail Startup). Prior experience in HR execution (recruitment, payroll, admin, compliance) is a must HR Operations & HRIS Management Recruitment & Selection Employee Discipline & Engagement Training & Development Coordination Policy Implementation & Reporting Responsibilities & Context Be a Change-Maker in the World of Fabrics Manufacturing & Innovation! Join Shatarupa Group , a renowned fabrics manufacturing FMCG company, and play a pivotal role in shaping the future of a dynamic, innovative, and employee-centric organization. We are seeking an experienced HR & Admin - SR Executive to lead, inspire, and transform our people operations and establish world-class HR practices. Job Context: As the SR Executive - HR & Admin at Shatarupa Group, you will drive the development and implementation of HR strategies and initiatives aligned with the company’s mission and vision. You will ensure smooth HR operations, foster a positive work culture, and implement modern HR practices to attract, retain, and nurture talent. If you are passionate about organizational development, performance management, and people empowerment, this is the ideal role for you. Key Responsibilities: Conduct job analysis and design updated Job Structures, Designations, and Job Descriptions. Develop and implement organizational SOPs through DNA mapping. Build and strengthen leadership teams aligned with company mission & vision. Perform regular SWOT analysis to identify organizational gaps and improvement areas. Develop KPI & Scorecards for employees to ensure accountability and performance management. Execute end-to-end recruitment: job posting, shortlisting, interviewing, and onboarding. Monitor employee discipline, attendance, and compliance with company rules. Organize and coordinate training, coaching, counseling, mentoring, and workshops. Maintain HR records, HRIS data, payroll, and employee files. Execute administrative tasks: office management, logistics support, and documentation. Restructure and revise HR policies to ensure modern and sustainable practices. Prepare HR analytics and reports for management decisions. Foster a positive, disciplined, and collaborative work culture. Skills & Expertise Employee Management HR & Trainin"
  },
  {
    "url": "https://bdjobs.com/h/details/1461545?ln=1",
    "company_name": "SUPREME BALORA HOSPITAL",
    "job_title": "Brand Manager",
    "location": "Dhaka (Dhanmondi 27)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "Brand Manager : SUPREME BALORA HOSPITAL Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SUPREME BALORA HOSPITAL Brand Manager Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 28 years Location: Dhaka (Dhanmondi 27) Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age At least 28 years Mandatory practical experience in Digital Marketing Experience in the Hospital / Healthcare / Aesthetic / Clinic industry will be strongly preferred Proven experience in managing social media platforms and paid digital campaigns Responsibilities & Context Job Context Supreme Balora Hospital Aesthetic Care is seeking a dynamic, strategic, and highly experienced Brand Manager to strengthen and expand the hospital’s brand presence within the competitive aesthetic and healthcare industry . This role requires strong Digital Marketing expertise , combined with proven experience in brand planning, execution, and performance-driven marketing initiatives. Job Responsibilities Brand Strategy & Marketing Develop and execute comprehensive brand and marketing strategies aligned with the hospital’s business objectives Prepare annual and monthly marketing plans and calendars to enhance brand exposure, patient acquisition, and lead generation Analyze market trends, competitive landscape, and profitability of laser and aesthetic services Digital Marketing & Performance Management Plan, manage, and optimize digital marketing activities , including social media marketing, Google & Facebook ads, SEO, content marketing, and online campaigns Monitor digital campaign performance, ROI, and patient engagement metrics to ensure measurable results Utilize data and analytics to continuously improve brand visibility and sales performance Brand Communication & Consistency Ensure consistent brand identity across all platforms, including website, social media, print materials, outdoor advertising, and in-hospital branding Lead brand communication for aesthetic, dermatology, and healthcare services in line with hospital values and ethical standards Social Media Management Build and enhance brand presence across social media platforms Develop, manage, and publish engaging content to create strong interaction with existing and potential patients Grow audience reach, engagement, and conversion through strategic content planning Events & Activation Plan and execute both online and offline events , awareness programs, workshops, and promotional campaigns Prepare event-related creatives such as posters, newsletters, and promotional materials Support event execution to maximize patient engagement and brand recall Partnership & Stakeholder Management Coordinate closely with docto"
  },
  {
    "url": "https://bdjobs.com/h/details/1456396?ln=1",
    "company_name": "Labaid Insuretech Company Ltd.",
    "job_title": "Associate, Claim (Life & Non-Life)",
    "location": "Dhaka (Dhanmondi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Associate, Claim (Life & Non-Life) : Labaid Insuretech Company Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Labaid Insuretech Company Ltd. Associate, Claim (Life & Non-Life) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Location: Dhaka (Dhanmondi) Salary: Negotiable Published: 02 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements 1–3 years of experience in insurance claims, TPA, hospital billing, or banking operations Understanding of Life & Non-Life claim documentation preferred Strong attention to detail and document scrutiny Clear communication and customer handling skills Familiarity with CRM/ERP data entry and tracking Time management and follow-up discipline Basic understanding of medical bills/insurance paperwork (advantage) Responsibilities & Context 📣 Job Opportunity — Associate, Claim (Life & Non-Life) Labaid Insuretech Company Ltd. Ensure fast, fair, and accurate claim processing in a digital Insuretech environment. We are looking for a meticulous and service-oriented Associate, Claim to manage end-to-end claim coordination for Life & Non-Life policies across digital and partner channels. 🎯 Job Summary The role is responsible for receiving, verifying, coordinating, and tracking insurance claims with insurer partners while ensuring proper documentation, customer communication, and CRM updates. Accuracy, empathy, and turnaround time are critical success factors. Key Responsibilities Claim Intake & Verification Receive claim intimation and guide customers on required documents Verify completeness of forms, policy details, bills, and reports Log claims accurately in CRM/ERP Insurer & Partner Coordination Submit verified documents to insurer partners within SLA Follow up regularly for assessment status and approvals Clarify queries raised by insurers and update customers Customer Communication Keep claimants informed about status, gaps, and timelines Provide clear guidance on additional documentation if required Handle customer queries with empathy and professionalism Documentation & Compliance Maintain digital and physical claim files with proper indexing Ensure adherence to policy terms, compliance, and audit readiness Track TAT and maintain claim registers/reports Reporting & MIS Prepare daily/weekly/monthly claim status MIS Monitor approval rates, rejection reasons, and turnaround metrics Recommend improvements to reduce processing delays KPI & Performance Indicators (SMART) Claim logging accuracy (100%) Average claim submission TAT within defined SLA Reduction in claim rejection due to documentation gaps Daily CRM update compliance Customer query response time Skills & Expertise Suggested by Claims Processing (Insurance) Compensation & Other Benefits Practical expo"
  },
  {
    "url": "https://bdjobs.com/h/details/1461709?ln=1",
    "company_name": "Ismartu Technology BD Ltd.",
    "job_title": "Electrician",
    "location": "Narayanganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "Electrician : Ismartu Technology BD Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ismartu Technology BD Ltd. Electrician Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: 24 to 32 years Location: Narayanganj Salary: Negotiable Published: 21 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 24 to 32 years Computer Knowledge. Electrical ABC , Supervisor license. Strong Knowledge about Compliance. Responsibilities & Context Technical Expertise: Strong understanding of electrical engineering principles, Including SMT, Assembley, Battery charger, CTP floor macchine power systems, control systems, Generator, Compressor, Chiller, Substation, Solar, LT HT Panel and electrical design. Problem-Solving: Ability to analyze and solve complex technical problems. Communication: Excellent written and verbal communication skills. Collaboration: Ability to work effectively in a team environment. Project Management: Basic understanding of project management principles. Safety Awareness: Commitment to safe working practices and compliance with safety regulations. 6S : Strong Knowledge about 6S Standard. Ability : Ability to work under pressure Compensation & Other Benefits Mobile bill,Medical allowance,Profit share,Provident fund,Insurance,Over time allowance,Gratuity Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Narayanganj Company Information Ismartu Technology BD Ltd. Follow More jobs from this company Address: Plot No. 09, Meghna Industrial Economic Zone, Tripordi, Mograpara, Sonargaon, Narayanganj. Business: ISMARTU  TECHNOLOGY BD LTD  is a China based large Mobile Assembling Company in Bangladesh which is a concern of TRANSSION Holdings  a global company  dedicated to providing most favored mobile communication products and mobile internet services for local consumers in emerging markets. The company is best-known for its leading technology brands, including TECNO, ITEL and INFINIX. After 15 years of expansion, TRANSSION is now a leading player in the mobile industry, with a market share of over 40% in Africa`s six major countries. Its cumulative sales volume has reached a landmark of more than 246 million Dual-SIM handsets. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complai"
  },
  {
    "url": "https://bdjobs.com/h/details/1456370?ln=1",
    "company_name": "Labaid Insuretech Company Ltd.",
    "job_title": "Business Associate",
    "location": "Dhaka (Dhanmondi)",
    "salary": null,
    "experience": "1–3 years of experience in sales, marketing, insurance, banking, or fintech/InsuretechFresh graduates with strong communication skills and sales interest are encouraged to apply",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Business Associate : Labaid Insuretech Company Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Labaid Insuretech Company Ltd. Business Associate Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (Dhanmondi) Salary: Negotiable Published: 02 Feb 2026 Application Insights View Requirements Education Additional Requirements Experience Requirements 1–3 years of experience in sales, marketing, insurance, banking, or fintech/Insuretech Fresh graduates with strong communication skills and sales interest are encouraged to apply Required Competencies Excellent communication and persuasion skills Target-driven and self-motivated Basic understanding of insurance products (Life & Non-Life preferred) Comfortable using mobile apps, CRM systems, and digital tools Ability to work in field and office environment KPI & Performance Indicators (SMART) Monthly lead generation target Policy conversion ratio Partner onboarding numbers CRM update accuracy (100%) Client follow-up turnaround time Contribution to monthly revenue target Responsibilities & Context Labaid Insuretech Company Ltd. Join a technology-driven insurance solutions company transforming how people access Life & Non-Life insurance services. We are looking for energetic, target-oriented, and digitally savvy professionals to grow with our fast-expanding Insuretech operations. Job Summary The Business Associate will play a frontline role in lead generation, partner coordination, client onboarding, and sales conversion of digital insurance products (Life & Non-Life). The role requires strong communication skills, market mapping ability, and comfort working with digital platforms and CRM tools. Key Responsibilities Business Development & Lead Generation Identify potential clients, partners, and corporate prospects through field visits, networking, and digital channels Generate qualified leads and maintain a healthy sales pipeline Promote digital insurance solutions to individuals and organizations Client Acquisition & Conversion Explain product features, benefits, and policy coverage clearly to clients Assist customers in completing digital onboarding and documentation Follow up on leads and convert prospects into policyholders Partner & Corporate Coordination Build relationships with hospitals, corporates, agents, and business partners Support in developing B2B and B2C insurance channels CRM & Reporting Update daily activities, leads, and conversions in CRM/ERP system Prepare daily/weekly/monthly performance reports Maintain proper documentation of client records Marketing Support Assist in campaign execution, promotional activities, and awareness programs Participate in events, roadshows, and partner engagement programs Skills & Expertise Suggested by Business Development Client Acquisition lead generation Compen"
  },
  {
    "url": "https://bdjobs.com/h/details/1461705?ln=1",
    "company_name": "Abul Khair Group",
    "job_title": "Recovery In-Charge (Retired Army Officer – Major Preferred)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Recovery In-Charge (Retired Army Officer – Major Preferred) : Abul Khair Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Abul Khair Group Recovery In-Charge (Retired Army Officer – Major Preferred) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Published: 21 Feb 2026 Application Insights View Requirements Education Additional Requirements Retired Major or Captain from the Bangladesh Army. Leadership mindset for recovery and field operations. Ability to perform under pressure and make timely decisions. Willingness to work in the field and travel as needed. Strong communication and coordination skills. Responsibilities & Context Plan, supervise, and manage the organization’s recovery operations. Lead field teams and monitor day-to-day activities. Develop and implement strategies for outstanding recovery. Prepare regular recovery reports and present to management. Ensure compliance with company policies and legal procedures. Compensation & Other Benefits Attractive compensation package will be offered. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Abul Khair Group Follow More jobs from this company Address: D. T. Road, Pahartali, Chittagong Business: Abul Khair Group is one of the leading business conglomerates in the country. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Co"
  },
  {
    "url": "https://bdjobs.com/h/details/1461723?ln=1",
    "company_name": "Advanced Chemical Industries PLC (ACI)",
    "job_title": "Prescription Survey Officer | ACI Animal Health",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Prescription Survey Officer | ACI Animal Health : Advanced Chemical Industries PLC (ACI) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Advanced Chemical Industries PLC (ACI) Prescription Survey Officer | ACI Animal Health Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Negotiable Published: 21 Feb 2026 Application Insights View Requirements Education Experience Responsibilities & Context Conduct prescription surveys to gather insights on product usage and market demand. Visit doctors, farmers, and chemists to assess their satisfaction with services and strengthen relationships. Evaluate field force effectiveness by reviewing customer coverage, satisfaction levels, frequency and quality of visits, product quality, delivery timelines, and other key service indicators. Document customer complaints, detailing the issue, resolution steps, and follow-up actions taken. Gather intelligence on competitor activities through market visits and interactions. Prepare and submit weekly and monthly audit reports summarizing findings and recommendations. Conduct additional operational and quality audits as needed to support continuous improvement initiatives. Skills & Expertise Market Survey Prescription Prescription Reading Skill Communication Survey Compensation & Other Benefits T/A,Mobile bill,Medical allowance,Performance bonus,Profit share,Provident fund,Insurance,Gratuity Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Job Highlights ACI Animal Health is country`s one of the leading marketers of premium quality veterinary nutrients, preventives, anthelmintics, analgesics, anti-histaminic, anti-pyretic, vaccines etc. We offer performance-based career growth to our employees. Company Information Advanced Chemical Industries PLC (ACI) Follow More jobs from this company Address: ACI Centre, 245 Tejgaon Industrial Area, Dhaka-1208. Business: Pharmaceuticals; Agribusiness; Consumer Brands. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professional"
  },
  {
    "url": "https://bdjobs.com/h/details/1461746?ln=1",
    "company_name": "Akij Plastics Ltd.",
    "job_title": "Assistant Officer - Transport",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Assistant Officer - Transport : Akij Plastics Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Plastics Ltd. Assistant Officer - Transport Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 24 to 32 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 21 Feb 2026 Application Insights View Requirements Education Additional Requirements Age 24 to 32 years 2-3 years experience on depot transport management will get preference Freshers are also encouraged to apply. Responsibilities & Context Oversee routine maintenance, repairs, and inspections of vehicles to ensure operational safety and reliability. Coordinate daily transport operations, schedule drivers, and optimize routes to improve efficiency. Ensure compliance with local traffic regulations, transport laws, and company safety policies. Maintain accurate records of fuel consumption, vehicle mileage, maintenance history, and driver logs. Train, supervise, and evaluate drivers to ensure performance standards are met. Prepare and submit regular transport reports to management. Perform any other duties assigned by management as required. Skills & Expertise communication and interpersonal skill. MS Excel MS Word Reporting and Documentation Warehouse Transportation Management Compensation & Other Benefits Provident fund,Gratuity,Medical allowance Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Akij Plastics Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Registe"
  },
  {
    "url": "https://bdjobs.com/h/details/1461753?ln=1",
    "company_name": "Akij Resources",
    "job_title": "Officer/Senior Officer - Spot Purchase of Grain Crops(Corn, Soybeans, Paddy, Mustard seeds etc)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Officer/Senior Officer - Spot Purchase of Grain Crops(Corn, Soybeans, Paddy, Mustard seeds etc) : Akij Resources Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Resources Officer/Senior Officer - Spot Purchase of Grain Crops(Corn, Soybeans, Paddy, Mustard seeds etc) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 5 Age: 25 to 38 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 38 years Practical experience in spot buying of grain crops (corn, soybean, paddy, mustard, etc.) Sound knowledge of grain quality parameters (moisture, impurities, grading, storage risks, rejection control) Working knowledge of Buy–Sale trading processes, including pricing, margin calculation, settlement, and documentation Ability to support senior management in supplier sourcing, negotiation, and market execution Strong communication, coordination, and supplier relationship skills Willingness to travel frequently and work in field-based sourcing markets Responsibilities & Context Job Context Nobayon Traders Limited (a concern of Akij Resource Ltd.) is looking for field-oriented Officer / Senior Officer – Spot Purchase of Grain Crops to support spot procurement activities for grain crops such as corn, soybeans, paddy, mustard seeds, and other seasonal crops based on business demand. The role requires strong market awareness, supplier coordination, quality assessment capability, and accurate documentation to ensure timely sourcing with the right quality and competitive landed cost. The position is field-intensive and involves close coordination with procurement, logistics, inventory, QA, and finance teams to support smooth Buy–Sale trading operations. Key Responsibilities Source and purchase grain crops from farmers, traders, and local suppliers as per demand and market availability Visit sourcing markets regularly to assess crop availability, quality, and pricing trends Support price negotiation and purchasing decisions under guidance of senior management Monitor market trends, seasonal factors, and local demand-supply movements and report findings Inspect grain quality at purchase points and ensure compliance with company QA/QC standards Coordinate with QA teams to resolve quality deviations at receiving points Maintain and strengthen supplier relationships to ensure consistent supply continuity Coordinate with logistics and transport teams for timely delivery to warehouses or factories Prepare and maintain accurate documentation related to purchase orders, delivery, stock movement, and agreements Compensation & Other Benefits T/A,Provident fund,Gratuity,Mobile bill,Insurance Salary Review: Yearly Festival Bonus: 2 Workplace "
  }
]