[
  {
    "url": "https://www.linkedin.com/jobs/view/4321491975/",
    "job_id": "4321491975",
    "source": "linkedin",
    "company_name": "BSL",
    "job_title": "Senior Financial Analyst",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "This position is for professional with experience in electricity and water utility company with background in business development and electricity and water Tariff.Key Responsibilities: Responsible for all the activities and strategy for Financial Close Resolve all Commercial Disputes during IPP/IWPP commercial operation period Represent the Corporation in the clarifications and negotiations with IWPP bidders and Preferred Bidders through to project Financial Close. Draft tender documents (RFB compilation) for PPP projects, clarifications, Bid Evaluation, Contract Negotiation and finalization of Project Agreements such as Power & Water Purchase Agreement (PWPA), Power Purchase Agreement (PPA), Water Purchase Agreement (WPA) and all other project related Agreements; JVA, Common Terms Agreement, Government Guarantee, Fuel Supply Agreement, Financing Documents and etc. Thorough audit and analysis of Bidders’ Financial Model for bid evaluation and ranking Development and compilation of Request for Bid documents for Advisory Service contract and manage entire tender process upto contract execution. Manage and supervise Advisors (external consultants) and review and approve advisor’s works Study and analyze the existing IWPP tariff structures as a basis for comparison and negotiation of the tariffs of new IWPP’s. Recommend methods for optimizing the overall Tariff structures of all Electricity &Water purchases. Contribute the required financial analysis and reporting for the quarterly Corporate Performance Report Contribute to the Budgeting for the Corporation including the assessment of the economic feasibility for all major projects & Business Plans Analysis and advice re Capital Projects Evaluation for Water and Electricity Network Expansion. Updating current models and Developing new Tariff Models and Corporate Financial Models for the Corporation Resolve all commercial issues arising from executed PWPA. Provide analysis, assessment and advice regarding the financial and commercial risk aspects of Power and Water Purchase Agreements (PWPA) Prepare mid-long term Financial Projections for the Corporation and the Business Plans Prepare analyses and reports for presentation to Higher Management. Provide the experience and credibility to represent the Corporation at a senior level, both internally and externally. Contribute to the development and updating of Process Documentation of the department’s responsibilities and activities. Develop ad-hoc analysis reports to the Higher Management for corporate strategy and decision Performs valuation analysis on a wide range of target investment opportunities using accepted and relevant approaches and theory Establishes the future cost of power (MW, MWh) and Water (M3) based on the available market data with changing fuel and other costs and conditions Develops new financial models and enhances existing models in order to provide more accurate financial analysis for sound financial decisions. Studies and analyses the existing tariff structure and recommend methods of optimizing the overall tariff in line with overall organization objectives Provides analysis, assessment, and advice on the financial and commercial risk aspects of power and water sales agreements Studies and analysis the current commercial agreements and identify the key challenges and gaps of company’s agreements benchmark against global best practices in a similar environment. Assists senior management to appoint external Consultants and to contribute to the management of the consultancy services RequirementsEducation and Experience: Must have achieved minimum bachelor’s degree business, accounting, finance, economics, or related field from a reputed university. CFA certificate preferred. Minimum 10 years’ Experience in a similar role in the Utility sector, with minimum 5 years experience preferably in GCC countries . Must have experience from Off-Taker, International Developer or advisory firm. Proven track record in Project Finance Structuring and assessment of Project Bankability Preferably can build Tier-3 (Advanced/Specialized) financial model and conduct sensitivity analysis. Ability to interpret and apply IFRS, GAAP, and other relevant accounting standards. Experiences in being in charge of Interest Rate Swap transactions inclusive of preparation of Hedging Protocol. Preferred to have experiences in analyzing ISDA master agreement Deep understanding, in commercial/financial negotiations of IWPP projects Proficiency with spreadsheets, databases, and financial software applications. Presentation, reporting, and communication skills. Proven knowledge of financial forecasting and diagnosis, corporate finance, and information analysis. Proficient in Word, Excel, and PowerPoint. Ability to present financial information to a non-financial audience. Working knowledge of financial strategies. Strong organizational and multitasking skills. Detail-oriented and able to perform in a high-pressure environment. Fl",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4281939106/",
    "job_id": "4281939106",
    "source": "linkedin",
    "company_name": "SSC HR Solutions",
    "job_title": "General Ledger",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368250204/",
    "job_id": "4368250204",
    "source": "linkedin",
    "company_name": "Acara Solutions, An Aleron Company",
    "job_title": "Jr. Accountant/ Payroll Administrator",
    "location": "Markham, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369015804/",
    "job_id": "4369015804",
    "source": "linkedin",
    "company_name": "AURUM Group of Companies",
    "job_title": "Account Executive",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321492753/",
    "job_id": "4321492753",
    "source": "linkedin",
    "company_name": "The Total Office",
    "job_title": "Business Development /Sales Account Manager",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368594323/",
    "job_id": "4368594323",
    "source": "linkedin",
    "company_name": "AppliedAI",
    "job_title": "Senior Project & Account Manager",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354848319/",
    "job_id": "4354848319",
    "source": "linkedin",
    "company_name": "talabat",
    "job_title": "Key Account Manager",
    "location": "Qesm El Maadi, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355761007/",
    "job_id": "4355761007",
    "source": "linkedin",
    "company_name": "SMDC",
    "job_title": "Project Accountant",
    "location": "Las Piñas, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367346420/",
    "job_id": "4367346420",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "Tax & Legal Services - International Tax/ M&A - Senior Associate (Qatar)",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367729306/",
    "job_id": "4367729306",
    "source": "linkedin",
    "company_name": "IDEMIA Public Security",
    "job_title": "Accounts Payable Analyst",
    "location": "Manila, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321367869/",
    "job_id": "4321367869",
    "source": "linkedin",
    "company_name": "Estithmar Holding",
    "job_title": "Director of Treasury",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284541104/",
    "job_id": "4284541104",
    "source": "linkedin",
    "company_name": "SSC HR Solutions",
    "job_title": "Finance Manager",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368494681/",
    "job_id": "4368494681",
    "source": "linkedin",
    "company_name": "Abou Ghaly Motors",
    "job_title": "SAP HCM Consultant",
    "location": "Qesm El Obour, Al Qalyubiyah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368606612/",
    "job_id": "4368606612",
    "source": "linkedin",
    "company_name": "Abou Ghaly Motors",
    "job_title": "SAP Business one consultant",
    "location": "Qesm El Obour, Al Qalyubiyah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363686066/",
    "job_id": "4363686066",
    "source": "linkedin",
    "company_name": "Allianz Commercial",
    "job_title": "Executive Underwriter - Marine",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Your Team Allianz Commercial (AzC) is one of the largest marine insurers in the world and is a leader in inland marine insurance and related property coverage across North America and various worldwide locations. With a depth and breadth of marine capabilities that are unmatched in the industry. Allianz offers a broad portfolio of highly customizable products and an almost unlimited appetite for complex marine accounts that demand innovative solutions.Our Inland Marine and Related Property Insurance solutions cover over 100 classes of business, covering all aspects of moving or movable property. Whether it's a building under construction or a shipment of an original Picasso, our inland marine insurance underwriters provide flexible and creative solutions for the most challenging of inland marine exposures.The Impact You Will Have Reporting to the Head of Marine Canada, this position will underwrite profitable new and renewal business to meet the marine line of business targets in accordance with underwriting guidelines and underwriting authority. Negotiate price, and terms and conditions. Ownership of key accounts/clients. Develop and maintain strong relationships with producers and clients in partnership with Market Management.Some of your specific responsibilities could include: Participate in the development and execution of regional Underwriting strategy for LoB(s). Work closely with Market Management, Claims, and other product lines to achieve key marketing strategies, including cross-selling.Underwrite new and renewal accounts to meet top and bottom-line targets. Negotiate price and terms and conditions with producers. Proactively manage capacity. Underwrite and evaluate Natural Catastrophe Accumulation, ensuring an understanding of catastrophe modelling and interpretation of scenarios (for relevant LOBs). Underwrite International Insurance Programs (for relevant LOBs). Positively represent AzC externally to the market. Proactively drive involvement of functional areas in Underwriting process, including e.g. MMC, ARC, Claims, Operations. Develop and maintain strong relationships with key producers and clients and other relevant stakeholders (e.g. risk managers).Ensure accurate policy documentation issued to producers (where AzC responsibility to do so) or producers has issued documentation (where producer responsibility). File maintenance – ensure file is established (whether electronic or paper) and maintained for each risk and transaction handled. Proactively support completion of policy administration and credit control processes.Proactively support acquisition of new business and retention of existing business (including client and producer negotiations where necessary). Proactively liaise with MMC on market management initiatives.Participate / contribute to key projects. Training and development of underwriters in Lob, e.g. Associate Underwriters and Underwriters. Referral point for other underwriters. Participate in cross regional activities as required / requested.What You’ll Bring to the Role – Proven track record in underwriting profitable inland marine business with 11 plus years’ experience. In depth understanding of its products and portfolio. In depth understanding of regional/local LoB insurance markets and competitor landscape. Demonstrable, established relationships with brokers at peer group level and established within local market.Ideal candidate will have worked as an underwriter or account executive and be well versed in multiple inland marine products such as construction, transportation, miscellaneous coverages, and property (i.e., builder’s risk, contractor’s equipment, motortruck cargo, physical damage, mono line property for small to medium risks, and scheduled property floaters). Preferably a bachelor’s degree in Risk Management, Insurance, Business Administration, Finance or Economics. And completion of a professional insurance qualification.Ability to assess risk inherent exposures and natural hazards relevant to LoB. Manage the underwriting books. Analyze trends and scenario plans from which portfolio strategies can be developed and implemented. Analyze current performance against various benchmarks with a view to ensure adequate progress and satisfactory performance.Apply knowledge of how the market operates and functions, the business and customer needs.Ability to analyze highly complex data from multiple sources, in detail; identify and resolve issues before they transpireAbility to express ideas and messages clearly, both written and verbally. Ability to “sell” an improvised or prepared audience winning story. Ability to persuade and motivate others to act, without executive authority.Use of general office application tools (i.e. PowerPoint, Excel, Word).The ability to utilize AI tools to support day-today tasks, improve efficiency, and contribute to data-driven decision-making is valuable. A willingness to learn and explore how AI can enhance your role and the broade",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284456782/",
    "job_id": "4284456782",
    "source": "linkedin",
    "company_name": "SSC HR Solutions",
    "job_title": "Assistant Director of Finance",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369026944/",
    "job_id": "4369026944",
    "source": "linkedin",
    "company_name": "Urban Resilience Hub by UN-Habitat's CRGP",
    "job_title": "Intern - Administrative Support Job ID : 271302",
    "location": "Nairobi, Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367768913/",
    "job_id": "4367768913",
    "source": "linkedin",
    "company_name": "CÔNG TY TNHH DƯỢC PHẨM VÀ TTBYT HOÀNG ĐỨC",
    "job_title": "[[HCM]] - Nhân viên Hành Chính Lễ tân",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355853543/",
    "job_id": "4355853543",
    "source": "linkedin",
    "company_name": "SITA Egypt Smart Information Technology Applications",
    "job_title": "Senior Odoo Functional Consultant",
    "location": "Qesm 2nd 6 October, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321532519/",
    "job_id": "4321532519",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Officer, Inward Remittance, Cash Management Operations",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Key ResponsibilitiesTo process Inward Remittance and to provide a high-quality product delivery capability to the Corporate, Consumer and Institutional Banking Customer base. In addition to the above Directly responsible for adherence of the Group and Bangladesh Bank’s policies, procedures, service standards, which support the centralised outward remittance processing in Bangladesh. To ensure compliance with internal and external requirements. To provide quality in service delivery.Business To provide high quality service to customers. Establish service standards and ensure that they are achieved.Processes Ensure processing of inward remittance in accordance with the Group guidelines and within risk parameters using standardised procedures and processes to ensure that the best practices are always adapted and migrated. On behalf of all branches, to ensure that all outward payments instructions are fully complied with and transfer is undertaken to customer’s satisfaction and to perform the verification of all SWIFT payment messages- checking for accuracy, completeness and proper authorisation. To ensure re-engineer current processes. To ensure that the customer’s documents are delivered to the respective processing unit within agreed time and provide quality services to customers.People and Talent Have open channels of communication with staff. Maintain high levels of motivation amongst staff.Risk Management Ensure Group Sanction policies have been strictly complied. Keep updated on sanction procedures as and when those are revised. Ensure that the department gets an audit rating of at least “Improvement required “in all areas. Ensure to be engaged in AML measures, ensure that staff receives required AML training, monitor suspicious transactions and report it through the SAR Process.Governance Ensure to develop. promulgate and maintain operating procedures impacting payment operations across the country Manage the audit & risk control standards associated with the operationsRegulatory & Business Conduct Display exemplary conduct and live by the Group’s Values and Code of Conduct. Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct. Ensure compliance with the Laws of the land, implement and exercise local banking regulations, and build strong relationships with the Central Bank.Key StakeholdersInternal BOSMs / Manager Branches / RMs Treasury Dealers.External Central Bank - Audits & inspection and Govt. Accounts Dept. Regulators and other Government bodies.Other Responsibilities Responsible for working with the Bank to ensure a safe and Healthy workplace for all. Take reasonable care for the health & safety of co-workers and those who may be affected by your actions or your omissions. Cooperate with management to support and promote Health and Safety in the workplace. Your actions do not put others at risk. Work in a healthy and safe manner. Encourage others to work in a healthy and safe manner. Report all accidents, and incidents. Bring to the attention of management any hazard in the workplace.QualificationsKnowledge & Skills Understanding of Banking product, policies, Group guidelines and Central Bank guidelines. Basic knowledge of remittance rules and regulations are preferred. Self-motivated, independent and possesses excellent interpersonal and communication skills Experience with MIS reporting with MS Office (Word, Excel, Access, etc.) Have good analytical skills. Have good interpersonal communication skills.EducationHaving completed graduation from a reputed university (preferable in Business). Experience in relevant financial sector will be an added advantage.Skills And Experience Analytical Skills Communication Skills Spreadsheets / Data Management /MIS MS Office Local RegulationAbout Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 170 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents and we can't wait to see the talents you can bring us.Our purpose, to drive commerce and prosperity through our unique diversity, together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion.Together WeDo the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we doNever settle, conti",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321373528/",
    "job_id": "4321373528",
    "source": "linkedin",
    "company_name": "Scotiabank",
    "job_title": "Senior Manager, International Compliance GBM&T Program - Global Compliance",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4261413864/",
    "job_id": "4261413864",
    "source": "linkedin",
    "company_name": "Sankore Investments",
    "job_title": "Legal and Compliance Analyst",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4279462174/",
    "job_id": "4279462174",
    "source": "linkedin",
    "company_name": "Müller's Solutions",
    "job_title": "Treasury Manager-Core Finance",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365769747/",
    "job_id": "4365769747",
    "source": "linkedin",
    "company_name": "MR DIY International",
    "job_title": "Assistant Manager Finance",
    "location": "Seri Kembangan, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365931414/",
    "job_id": "4365931414",
    "source": "linkedin",
    "company_name": "ONE-VALUE CAREERS",
    "job_title": "M&A MANAGER (DEALS ADVISORY, INVESTMENT, FINANCE)",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355732626/",
    "job_id": "4355732626",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Student File processing- For Economic Consortium Ltd.- Job ID: 1453244",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355785568/",
    "job_id": "4355785568",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Admin & Operation - (For Metal Core Limited) - Job ID - 1453239",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356474036/",
    "job_id": "4356474036",
    "source": "linkedin",
    "company_name": "Capture Consulting Malaysia",
    "job_title": "Senior Financial Planning and Analyst",
    "location": "Petaling Jaya, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369073385/",
    "job_id": "4369073385",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Audit Manager",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366321299/",
    "job_id": "4366321299",
    "source": "linkedin",
    "company_name": "HFG Insurance Recruitment",
    "job_title": "Senior Compliance Manager",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356496977/",
    "job_id": "4356496977",
    "source": "linkedin",
    "company_name": "TIENS Europe Region",
    "job_title": "Product Coordinator (m/w/d)",
    "location": "Istanbul, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354858652/",
    "job_id": "4354858652",
    "source": "linkedin",
    "company_name": "Wiley",
    "job_title": "Accountant (6-Month Contract)",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionAccountant (6-Month Contract)Location:Colombo, LKAOur mission is to unlock human potential. We welcome you for who you are, the background you bring, and we embrace individuals who get excited about learning. Bring your experiences, your perspectives, and your passion; it’s in our differences that we empower the way the world learns.About The RoleManage day-to-day finance operations and Corporate Accounting deliverables, along with your immediate manager. Key responsibilities include, but are not limited to, accurate and timely financial reporting to meet Corporate and statutory requirements, as well as performing vendor management, including accounts payable and reconciliations. This position will also support some of the regional financial activities of the Singapore finance team.Job ResponsibilitiesManage accounting transactions on a daily and monthly basis.Manage monthly, quarterly, and year-end closing activities with immediate reporting supervisor.Preparing bank reconciliations for bank accounts.Preparing reconciliations for balance sheet accounts on Blackline.Preparing invoices for intercompany transactions.GL scrutinization regularly.Ensuring timely payments every week and on an ad-hoc basis.Assist in preparing VAT schedules (input and output) monthly.Filing tax returns - Stamp Duty quarterly, SVAT (when required), SSCL quarterly, WHT annually. Remitting taxes such as WHT (Monthly), stamp duty (quarterly).Visiting the Inland Revenue Department if required.Working on various ERP systems (SAP, Concur, Blackline, & Ariba)Maintain finance clearance records properly for each employee.Managing fixed asset register movementsRequired QualificationsDegree in Accounting, ACCA/CA/CIMA, or its equivalent (Past finalist/Partly qualified)2-3 years of experience in finance and accounting.Strong written and verbal communication skills in EnglishKnowledge of ERP systems (SAP, Concur, Blackline, & Ariba), and MS OfficeStrong technical knowledge of accounting and International Financial Reporting Standards (IFRS).Ability to work from the office independently.About WileyWiley is a trusted leader in research and learning, our pioneering solutions and services are paving the way for knowledge seekers as they work to solve the world's most important challenges. We are advocates of advancement, empowering knowledge-seekers to transform today's biggest obstacles into tomorrow's brightest opportunities.With over 200 years of experience in publishing, we continue to evolve knowledge seekers' steps into strides, illuminating their path forward to personal, educational, and professional success at every stage. Around the globe, we break down barriers for innovators, empowering them to advance discoveries in their fields, adapt their workforces, and shape minds.Wiley is an equal opportunity/affirmative action employer. We evaluate all qualified applicants and treat all qualified applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national origin, disability, protected veteran status, genetic information, or based on any individual's status in any group or class protected by applicable federal, state or local laws. Wiley is also committed to providing reasonable accommodation to applicants and employees with disabilities. Applicants who require accommodation to participate in the job application process may contact tasupport@wiley.com for assistance.We are proud that our workplace promotes continual learning and internal mobility. Our values support courageous teammates, needle movers, and learning champions all while striving to support the health and well-being of all employees. We offer meeting-free Friday afternoons allowing more time for heads down work and professional development, and through a robust body of employee programing we facilitate a wide range of opportunities to foster community, learn, and grow.We are committed to fair, transparent pay, and we strive to provide competitive compensation in addition to a comprehensive benefits package. It is anticipated that most qualified candidates will fall within the range, however the ultimate salary offered for this role may be higher or lower and will be set based on a variety of non-discriminatory factors, including but not limited to, geographic location, skills, and competencies. Wiley proactively displays target base pay range for United Kingdom, Canada and USA based roles.When applying, please attach your resume/CV to be considered. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321486907/",
    "job_id": "4321486907",
    "source": "linkedin",
    "company_name": "Selby Jennings",
    "job_title": "Equity Research Analyst",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361439062/",
    "job_id": "4361439062",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Manager - Technology Consulting - Oracle - HCM or Finance - Riyadh - KSA",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356057715/",
    "job_id": "4356057715",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Officer (For SHANGHAI FOOD & BEVERAGE CO. LTD.)-Job ID: 1454531",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369081556/",
    "job_id": "4369081556",
    "source": "linkedin",
    "company_name": "International Work Finder",
    "job_title": "Senior Accountant",
    "location": "Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Cautam un Senior Contabil motivat si orientat spre rezultate, care sa coordoneze activitatea financiar-contabila si sa asigure acuratetea si conformitatea proceselor interne. Rolul este potrivit unei persoane proactive, analitice si capabile sa gestioneze eficient echipe si fluxuri financiare complexe intr-un mediu dinamic.Responsabilitati principale:Coordoneaza si supervizeaza activitatea departamentului financiar-contabil;Asigura intocmirea corecta si la timp a situatiilor financiare si raportarilor fiscale;Monitorizeaza fluxurile financiare si bugetele companiei;Gestioneaza relatia cu autoritatile fiscale si partenerii externi (audit, banca etc.);Analizeaza si propune optimizari fiscale si financiare;Supervizeaza inchiderile lunare/anuale si inventarierea.Profilul candidatului ideal:Experienta relevanta de minimum 5 ani in domeniul financiar-contabil, inclusiv intr-un rol de coordonare;Studii superioare in domeniul economic;Cunostinte solide de legislatie fiscala si contabila;Experienta cu ERP-uri si sisteme contabile moderne;Abilitati excelente de comunicare, organizare si leadership;Atitudine orientata spre solutii, atentie la detalii si gandire strategica.Ce oferim:Rol cu impact direct asupra dezvoltarii companiei;Mediu de lucru profesionist si suportiv;Pachet salarial competitiv si beneficii suplimentare;Oportunitati de dezvoltare continua si implicare in proiecte strategice.Daca te regasesti in descriere si iti doresti sa contribui la cresterea unei organizatii in continua evolutie, asteptam cu interes aplicatia ta! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361423391/",
    "job_id": "4361423391",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Essent hiring Staff Accountant (Entry Level) in Radnor, PA",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370970458/",
    "job_id": "4370970458",
    "source": "linkedin",
    "company_name": "Sigmar Recruitment",
    "job_title": "Finance Manager",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Finance Manager North County Dublin3 days in officeSalary 75k plus packageAbout your new employerWe’re partnering with a growing, well-established organisation to hire an experienced Finance Manager to lead the finance function and work closely with the Senior Leadership Team.This is a broad, senior role combining financial control, commercial insight, team leadership, and strategic input.The role:Own monthly, quarterly and annual reporting, budgets and forecastsBuild pricing models and support commercial decision-makingLead statutory accounts and ensure compliance with IFRS / FRS102Manage cashflow, working capital and financial planningOversee payroll, controls, audit and tax compliance (VAT, CT, etc.)Lead, mentor and develop the finance teamPartner with senior stakeholders on strategy, projects and process improvementsAbout you:Qualified Accountant (ACA/ACCA/CPA/CIMA) or equivalentRecent relevant experience in a similar position is essentialDemonstrable experience of budgeting, forecasting and development of pricing models requiredWhy consider this Finance Manager role?Commercially focused roleOpportunity to partner with Senior Leadership TeamNext steps?To apply for this role please submit your CV via the link below to Natasha at Sigmar Recruitment",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370680008/",
    "job_id": "4370680008",
    "source": "linkedin",
    "company_name": "Hays",
    "job_title": "Finance Administrator",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Your new company A growing facilities management company based in South Dublin is seeking to hire a Finance/Office Administrator with strong experience in previous finance and administration roles. This is a full-time position offered on a permanent basis. A salary of €45,000 to €50,000 is offered, depending on experience. This role is a great opportunity to join a growing organisation with a competitive salary and exposure to various business functions. Your new role Your new role involves supporting both the office management and finance functions of the business. You will manage end-to-end accounts payable and receivable processes, assist in the processing of purchase invoices and liaising with suppliers, monthly bank reconciliations, assist with payroll processing and queries as required, and assist with month-end, year-end close and management accounts. You will also manage general office administration, which will include duties such as answering phones, handling emails, greeting visitors, maintaining office records, filing systems, and documentation, and assisting with organising meetings. What you'll need to succeed The successful candidate will have a minimum of two years' experience in a similar role, and proficiency in MS Office, particularly Excel. Exposure to accounting software such as Xero and Sage is a distinct advantage. You will need strong attention to detail, and excellent organisational, communication, and time management skills. The ability to work both independently and as part of a team is also vital for this role. A valid permit and/or visa to work in Ireland is essential.What you'll get in return You will be offered a competitive salary based on your experience, along with the opportunity to join a dynamic and growing business. You will be eligible for pension contributions following successful completion of the first year with the team. Parking available on-site. Please note this position is full-time in-office.What you need to do now If you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now.If this job isn't quite right for you, but you are looking for a new position, please contact us for a confidential discussion about your career.Hays Ireland is a trading division of Hays Specialist Recruitment (Ireland) Limited and acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T&C's, Privacy Policy and Disclaimers which can be found at hays.co.uk",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366878815/",
    "job_id": "4366878815",
    "source": "linkedin",
    "company_name": "Harry Hope. Canada",
    "job_title": "Fiscaliste",
    "location": "Greater Quebec City Metropolitan Area",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Enchantée ! Yassemine du cabinet Harry Hope. Canada, je suis mandatée par mon client pour un poste de Fiscaliste en contrat permanent. Cette opportunité offre un environnement propice au développement professionnel, avec l’accès à des avantages sociaux compétitifs ainsi qu’à des programmes de formation interne permettant une évolution continue des compétences et des perspectives de carrière.Vos responsabilités seront Assurer la conformité fiscale des opérations et déclarations (impôts directs et indirects), en veillant au respect des obligations légales et réglementaires en vigueurParticiper à la planification fiscale des activités, en proposant des solutions adaptées aux objectifs Intervenir dans des projets de réorganisation juridique et fiscale (restructurations, fusions, acquisitions, transmissions, etc.)Apporter un conseil fiscal opérationnel aux équipes internes et aux décideursRéaliser des recherches et analyses techniques, rédiger des notes et recommandations fiscalesAssurer une veille fiscale et réglementaire afin d’anticiper les évolutions législatives et jurisprudentiellesAccompagner les échanges avec les administrations fiscales, notamment dans le cadre de contrôles ou de demandes spécifiquesQualificationsTitre CPA et/ou Maitrise en Fiscalité en cours 2-3 années d'expérience sur un poste de fiscalisteCe que mon client offre Poste permanentAssurances collectivesREERPolitique de télétravailHoraires flexiblesÉvènements d'entrepriseAu plaisir de vous lire très prochainement ! :)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375837515/",
    "job_id": "4375837515",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375362666/",
    "job_id": "4375362666",
    "source": "linkedin",
    "company_name": "Cool Caps Industries",
    "job_title": "Chartered Accountant",
    "location": "Kolkata, West Bengal, India",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4280673293/",
    "job_id": "4280673293",
    "source": "linkedin",
    "company_name": "For Sino Bangladesh Trade ...",
    "job_title": "Accountant & Finance Officer",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4174322490/",
    "job_id": "4174322490",
    "source": "linkedin",
    "company_name": "For Gram Unnayan Karma (GUK ...",
    "job_title": "Accounts and Finance Officer",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4206752287/",
    "job_id": "4206752287",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4137383121/",
    "job_id": "4137383121",
    "source": "linkedin",
    "company_name": "For LAMB (Job ID",
    "job_title": "Finance Coordinator (Re-advertisement)",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363836830/",
    "job_id": "4363836830",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Accounting & Tax Manager [Vietnam]",
    "location": "Củ Chi, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368296370/",
    "job_id": "4368296370",
    "source": "linkedin",
    "company_name": "Navigos Search",
    "job_title": "Finance Business Partner",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365505366/",
    "job_id": "4365505366",
    "source": "linkedin",
    "company_name": "Micrologic",
    "job_title": "Adjoint(e) à la vice-présidence",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333938298/",
    "job_id": "4333938298",
    "source": "linkedin",
    "company_name": "iRely",
    "job_title": "Technical Business Analyst",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320938155/",
    "job_id": "4320938155",
    "source": "linkedin",
    "company_name": "RAKBANK",
    "job_title": "Operations Officer (Emiratised Role)",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368783759/",
    "job_id": "4368783759",
    "source": "linkedin",
    "company_name": "Sliner",
    "job_title": "Accounting Associate",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description Sliner International is a full-service consulting company specializing in connecting Vietnamese businesses to global markets and assisting international companies in entering Southeast Asia, particularly Vietnam. With a focus on creating tailored solutions, Sliner addresses local challenges and delivers measurable impacts for clients. The company prioritizes building trust and fostering long-term partnerships, believing that mutual collaboration and shared success are vital for growth. At Sliner, the success of clients inspires our purpose and fuels our passion. Role Description This is a full-time on-site role, located in Hanoi, for an Accounting Associate. The Accounting Associate will be responsible for maintaining accurate financial records, preparing financial statements, managing journal entries, and ensuring compliance with accounting standards. Additionally, the role involves using accounting software, analyzing financial data, and supporting the finance team in daily operations. Collaboration with other teams to ensure accuracy and efficiency in financial processes will be expected. Qualifications Strong knowledge of Financial Statements and proficiency in preparing and analyzing themExperience with Journal Entries and practical Accounting principlesWell-developed Analytical Skills for identifying trends and solving financial challengesProficiency in Accounting Software and experience in Finance-related activitiesStrong attention to detail and problem-solving skillsExcellent organizational and communication skillsBachelor's degree in Accounting, Finance, or a related fieldProfessional certifications (e.g., ACCA, CPA) are a plus Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365778724/",
    "job_id": "4365778724",
    "source": "linkedin",
    "company_name": "UEM Lestra Berhad",
    "job_title": "Manager, Governance, Risk & Compliance",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "JOB PURPOSETo be responsible for developing, implementing, and to ensure the highest standards of governance frameworks, risk management processes, and compliance programs to support the company’s strategic objectives in the renewable energy sector. This role will ensure that business operations comply with regulatory requirements, internal policies, and industry best practices, while also supporting a strong risk culture across the organization.JOB ACCOUNTABILITIES / KEY RESULT AREA1) GovernanceDevelop, review, and implement governance frameworks, policies, and procedures in line with regulatory and corporate requirements.Ensure proper documentation, reporting, and adherence to Board and Management governance standards.Provide guidance to management including Board of Directors/ Board’s Committee and staff on governance and compliance matters.2) Risk ManagementLead the development and implementation of the company’s risk management framework, policies, and processes.Identify, assess, monitor, and report key business risks, including operational, financial, regulatory, new business and project-related risks.Partner with project teams to evaluate risks in renewable energy projects (solar, wind, hydro, waste-to-energy, etc.) from feasibility through operations.Conduct periodic risk assessments, scenario analysis, and recommend mitigation strategies including facilitate risk appetite setting and monitoring in line with Board approved framework.Prepare regular risk reports for Management, Risk Committee, and the Board.3) ComplianceMonitor and ensure compliance with laws, regulations, licenses, and guidelines relevant to the renewable energy sector (e.g., SEDA, Energy Commission, DOE, Bursa Malaysia if applicable).Develop and maintain compliance monitoring plans, including audits and periodic reviews.Manage regulatory reporting and liaise with authorities on compliance-related matters.Drive compliance awareness programs and training across the organization.Oversee investigations and resolution of compliance breaches, reporting outcomes to management.4) Internal Control & AssuranceDevelop and enhance internal control processes to safeguard company assets and ensure integrity in financial and operational reporting.Collaborate with Internal Audit on audit reviews and ensure timely closure of audit findings.Support the requirements under Section 17A of MACC Act 2009 and the implementation of ISO standards (e.g., ISO 37001 Anti-Bribery, ISO 9001, ISO 14001, ISO 45001) where relevant.5) Reporting& MiscellaneousUndertake any tasks or directives assigned by the superior in relation to governance, risk, and compliance matters, as and when required.Conduct identification, assessment, analysis and reporting of Governance, Risk and Compliance related information to the relevant stakeholders to ensure effective execution of the plans for the Investment Risk Management, Portfolio Risk Management.MINIMUM ESSENTIAL QUALIFICATIONS & TECHNICAL COMPETENCESBachelor’s degree in Law, Finance, Accounting, Risk Management, Business Administration, or related discipline. Professional certifications such as CRMA, CIA, CIRM, ICA, or IIA certifications are an advantage.Minimum 7–10 years of relevant experience in governance, risk, and compliance.Prior experience in the renewable energy, utilities, or infrastructure sectors preferred.Exposure to regulatory frameworks in Malaysia (SEDA, Energy Commission, Bursa, MACC, etc.) is an advantage.Strong knowledge of GRC frameworks and best practices.Good understanding of renewable energy project lifecycle risks (EPC, regulatory, operational, environmental, health & safety).Excellent stakeholder management and communication skills (Board, regulators, management, project teams).Strong analytical, problem-solving, and report-writing skills.High integrity, professional judgment, and ability to maintain confidentiality. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346219032/",
    "job_id": "4346219032",
    "source": "linkedin",
    "company_name": "Mapa Group",
    "job_title": "Procurement Lead – (MNG Group of Companies Esmaş - Located in Dubai)",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368950758/",
    "job_id": "4368950758",
    "source": "linkedin",
    "company_name": "Data Nest",
    "job_title": "Partnership Business Analyst",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367431675/",
    "job_id": "4367431675",
    "source": "linkedin",
    "company_name": "ORLEN S.A.",
    "job_title": "Specjalista / Specjalistka w Dziale Analiz Rynkowych i Kapitałowych Upstream",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330629332/",
    "job_id": "4330629332",
    "source": "linkedin",
    "company_name": "Forum International Management Consulting",
    "job_title": "Investment Counsellor",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4281936457/",
    "job_id": "4281936457",
    "source": "linkedin",
    "company_name": "Müller's Solutions",
    "job_title": "SAP Finance Project Manager",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About Müller's Solutions:Müller's Solutions is a premier SAP consulting firm committed to delivering high-quality SAP implementations and optimizations tailored to the specific needs of our clients. With a focus on innovation and excellence, we guide businesses through their digital transformation journeys with tailored solutions that enhance operational efficiency and drive success.Job Overview:We are looking for a skilled SAP Finance Project Manager to lead our finance-related projects. In this role, you will oversee the planning, execution, and delivery of SAP finance projects, ensuring they align with our clients' needs and objectives. You will manage project teams and collaborate closely with clients, stakeholders, and other departments to achieve desired results while adhering to budgetary and time constraints.RequirementsRequirements:Bachelor's degree in Finance, Business Administration, Computer Science, or a related fieldMinimum of 7 years of experience in project management, specifically within SAP finance projectsProven track record of successfully managing SAP FI/CO implementations and upgradesStrong understanding of finance and accounting principles, along with knowledge of financial reporting and complianceExceptional project management skills, with experience using methodologies such as Agile and WaterfallExcellent leadership abilities to motivate and guide project teams toward achieving objectivesOutstanding communication, negotiation, and interpersonal skills to effectively engage with clients and stakeholdersProficient in project management tools and softwareSAP certification in project management (e.g., PMP) or SAP Finance is a plusAbility to adapt to changing project requirements and manage multiple priorities effectively Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324807072/",
    "job_id": "4324807072",
    "source": "linkedin",
    "company_name": "Noventiq Hungary",
    "job_title": "Chief Accountant",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352562887/",
    "job_id": "4352562887",
    "source": "linkedin",
    "company_name": "Electrum",
    "job_title": "Account Payable Accountant",
    "location": "Jakarta Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job PurposeThe Accounts Payable (AP) Accountant is responsible for managing end-to-end accounts payable activities, ensuring timely and accurate processing of vendor invoices, maintaining accurate financial records, and supporting month-end, audit, and reconciliation processes. This role works closely with internal stakeholders and external vendors to ensure compliance, efficiency, and continuous improvement in AP operations.Key ResponsibilitiesAccounts Payable OperationsReceive, review, and process vendor invoices and supporting documents, ensuring accuracy, completeness, and proper authorization prior to paymentMaintain accurate and up-to-date records of all accounts payable transactions, including posting entries in the AP ledgerReconcile vendor statements, compare system reports with account balances, and resolve discrepancies or outstanding items in a timely mannerMonitor and analyze expenses, track account balances, and ensure payments are processed in accordance with agreed termsVendor & Stakeholder ManagementRespond to vendor inquiries related to invoices, payment status, and discrepancies in a professional and timely mannerMaintain positive working relationships with vendors to support smooth operational processesMaintain and update vendor master data, including vendor profiles, terms of payment (TOP), and bank informationWork closely with Controlling, Tax, Treasury, and other business units on accounts payable–related matters to ensure alignment and accuracyReconciliation & ReportingPrepare, review, and approve monthly reconciliation reports, including bank reconciliation, petty cash reconciliation, and interface system reconciliationEnsure proper documentation and filing of General Ledger (GL)–related documents in accordance with internal controls and audit requirementsSystems & Process ImprovementOptimize the use of ERP and other accounting systems to improve efficiency and accuracy in AP processesCoordinate with IT or relevant teams to resolve system issues related to accounting softwareProactively identify and propose process improvements to enhance AP workflows and controlsAudit & ComplianceSupport internal and external audit processes by preparing required documentation, schedules, and reportsEnsure AP activities comply with company policies, accounting standards, and regulatory requirementsAd-hoc ResponsibilitiesAssist the supervisor with additional tasks, projects, or responsibilities as assignedQualificationsBachelor’s degree in Accounting or a related field.Minimum of 5 years of relevant experience in accounting, with strong exposure to accounts payable processes.Proficient in ERP systems and Microsoft Office Suite, particularly Microsoft Excel; experience with Odoo is an advantage.Strong attention to detail with a high level of accuracy in financial recording, reconciliation, and data processing.Demonstrated ability to work effectively with automated accounting and data processing systems, including handling large volumes of numerical data accurately.Excellent written and verbal communication skills, with the ability to interact professionally with internal teams, management, and external parties.Strong English proficiency, both written and spoken.Able to work effectively under pressure and meet tight deadlines in a fast-paced environment.Proven ability to lead and manage a team, including providing guidance, task delegation, and performance oversight.Experience with a Big Four accounting firm is considered a strong advantage. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366433487/",
    "job_id": "4366433487",
    "source": "linkedin",
    "company_name": "PT LIUGONG FINANCE INDONESIA",
    "job_title": "Finance Accounting Intern",
    "location": "North Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367438205/",
    "job_id": "4367438205",
    "source": "linkedin",
    "company_name": "PT SMART Tbk",
    "job_title": "Tactical Tax Manager",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job Descriptions Summary:Tactical tax ensures tax strategy execution and compliance across assigned companies, monitor tax liabilities and drive tax optimization in assigned companies, and representing companies to Tax Office and relevant Authorities in Tax Resolution (e.g, SP2DK, Tax Audit, Objection, Appeal, etc).Job Descriptions:Implementation of Tax Strategy and Business Plan in accordance with taxation.Maximize utilization of tax incentives provided by the Indonesian Government.Representing companies to Tax Office and relevant Authorities.Together with Tax Resolution, to be in charge in Tax Resolution cases such as Tax Audit, Tax Objection, Tax Appeal in Tax Court and Supreme Court.Monitor and review tax liabilities, annual and monthly tax compliance reporting, and tax restitution regularly.Advise BU related to taxation and customs matters.Job Requirements:A minimum of 7 years of work experience in TaxationBachelor’s Degree in Accounting, Finance, or equivalentBackground from Big 4 is an advantageHaving Brevet and USKP are an advantage\"Our company has never levied any fees for the recruitment process nor has it required to order tickets and accommodation through a certain travel agent or certain person\" Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320934498/",
    "job_id": "4320934498",
    "source": "linkedin",
    "company_name": "Morgan Stanley",
    "job_title": "Credit Risk Reporting Specialist",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329508563/",
    "job_id": "4329508563",
    "source": "linkedin",
    "company_name": "Bureau Veritas Group",
    "job_title": "FSC CoC Auditor #CER",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360572961/",
    "job_id": "4360572961",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Travel Finance Operations Specialist- For Trip Narrative Ltd.- Job ID: 1456843",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365034910/",
    "job_id": "4365034910",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Fund Accountant",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367375583/",
    "job_id": "4367375583",
    "source": "linkedin",
    "company_name": "Juru Holdings",
    "job_title": "Business Analyst",
    "location": "Stellenbosch, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Our client, a leading payment aggregator and provider of secure payment solutions is looking for aBusiness Analyst to join their growing team.They offer innovative and customer-focused payment solutions for both banked and unbankedindividuals. Their team specialises in convenient and secure payment solutions for retailers, digitalsolutions, banking institutions, wallets, and informal vendors across Southern Africa.Responsibilities IncludeGather and document business requirements from both internal and external stakeholders.Bridge the gap between business and technical teams by translating business requirements into requirements and plans.Assist business in documenting operational procedures and presentation flows.Assist in gathering and documenting reporting requirements.Maintain and manage changes to requirements during a project phase.Work closely within PMO to support priority projects and manage backlog grooming with the product owners and project manager.Manage and update BA artifacts and ensure that requirements are approved by stakeholders.Constantly review requirements gathering process and tools and suggest changes to ensure efficiencies.Support UAT and testing requirements to ensure that features were delivered as per documented requirements and within acceptable quality standards.Required Skills And Experience2 – 3 years’ business analysis experience.Self-starter that can work individually as well as in teams.Ability to engage with all levels of stakeholders to include senior management and developers.Understanding of systems and the technical software development environmentExperience in the payments or financial industry required.Understanding of the end-to-end payments’ environment (retailers, digital, banking, card schemes, EFT, settlement, acquiring, etc.) beneficial.Relevant qualification.Full understanding of the Microsoft suite, Draw.IO, Jira, Confluence and Visio.Driver’s license.Fluent in English and ideally Afrikaans. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360060337/",
    "job_id": "4360060337",
    "source": "linkedin",
    "company_name": "Undelucram.ro",
    "job_title": "Senior Accountant",
    "location": "Bucharest, Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357820157/",
    "job_id": "4357820157",
    "source": "linkedin",
    "company_name": "iGaming Ontario",
    "job_title": "Anti-Money Laundering Risk Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365754341/",
    "job_id": "4365754341",
    "source": "linkedin",
    "company_name": "AKIJ iBOS",
    "job_title": "Senior Business Analyst",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371105806/",
    "job_id": "4371105806",
    "source": "linkedin",
    "company_name": "The Organic Valley Private Limited",
    "job_title": "Quality Systems & Compliance Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description:The Organic Valley Private Limited (TOV) was established in 2011 to make a significant difference in the field of organic agro-production and trading. Its corporate office lies in Bakhundole, Lalitpur. TOV is one of the pioneers in promoting Organic Agriculture and food practices in Nepal. It has been the first of its kind to Trade Organic Products from Nepal to various countries in the World. TOV has been involved in various projects as well as product research and diversification since its inception.Role Description:Location: Lalitpur basedEmployment Type: Full-timeSector: Agriculture, Food Processing & TradeWe are seeking a highly system-oriented Quality Systems & Compliance Officer who can design, implement, and sustain integrated compliance systems aligned with regulatory, certification, and organizational requirements.This role requires a professional who can analyze regulatory intent, translate it into practical systems, enable people to follow those systems, and ensure consistent compliance beyond audits.Key ResponsibilitiesStandards & Regulatory SystemsAnalyze, contextualize, and operationalize applicable standards, certification requirements, and regulatory obligationsAssess applicability of requirements and define clear, organization-wide compliance expectationsMonitor regulatory and certification updates and ensure system alignmentSystem Design & StructuringDesign, implement, and maintain integrated compliance systems aligned with operational workflowsDevelop and control SOP hierarchies, work instructions, formats, records, and control mechanismsEstablish clear responsibility, accountability, and escalation structures for compliance activitiesGap Analysis & Risk-Based PlanningConduct structured gap analysis against applicable standards and internal systemsIdentify compliance risks, system weaknesses, and improvement areasDevelop and monitor corrective and preventive action plansTraining & System EnablementDesign and deliver structured training programs for relevant internal and external stakeholdersEnable supervisors and line managers to implement and enforce compliance through their teamsEvaluate training effectiveness and ensure ongoing capability buildingImplementation Control & MonitoringEmbed compliance systems into routine operational practicesConduct internal audits, inspections, and monitoring activitiesTrack non-conformities, corrective actions, and system performance indicatorsDocumentation, Audit & Certification ManagementMaintain controlled documentation, records, and traceability systemsCompile audit evidence and maintain audit readinessPlan and coordinate internal and external auditsLiaise with certification bodies, auditors, and regulatory authoritiesSupport audit conduct, respond to non-conformities, and ensure timely closureQualifications:Key Skills & CompetenciesCore CompetenciesStrong systems thinking and structured problem-solving abilityCapability to analyze regulatory and certification requirements and translate intent into operational controlsExperience designing and maintaining compliance systems rather than isolated documentsStrong documentation discipline and audit preparedness mindsetEffective communication with authorities, auditors, and internal stakeholdersAbility to manage compliance through structure, accountability, and influence rather than direct authorityHigh integrity and consistency in compliance managementEducational BackgroundBachelor’s degree in Food Technology, Food Science, or related field preferredCandidates with other relevant academic backgrounds may be considered if they demonstrate strong system implementation experienceExperience RequirementsProven experience implementing and maintaining compliance or certification systems (e.g., Organic standards, HACCP, ISO 9001 / ISO 22000, GMP/GHP, or similar)Experience in conducting gap analysis, internal audits, training, and corrective action managementExposure to certification, regulatory, or customer auditsIdeal Candidate ProfileHighly system-oriented and process-drivenComfortable working across multiple functions and levelsAble to simplify complex requirements into practical actionsPersistent in follow-up and continuous improvementCalm, logical, and confident during audits and compliance discussionsHow to ApplyInterested candidates should apply with their CV, reference, PP size photo, and a brief note describing: One compliance or quality system you have designed, implemented, or managed, including scope and audit exposure. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372192801/",
    "job_id": "4372192801",
    "source": "linkedin",
    "company_name": "KPMG Canada",
    "job_title": "Learning Administrator (18-months Contract)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371568551/",
    "job_id": "4371568551",
    "source": "linkedin",
    "company_name": "Astra-North Infoteck Inc. ~ Conquering today’s challenges, achieving tomorrow’s vision!",
    "job_title": "BSA– Banking & Client Onboarding, KYC",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Experience Required: 4–6 Years Domain: Banking & Client Onboarding Environment: Agile / Hybrid DevelopmentEssential Skills & Requirements 4–6 years of hands-on experience as a Business Systems Analyst (BSA) within an Agile/Hybrid development environment Strong domain experience in Banking and Client Onboarding Deep understanding of: Client Onboarding processes KYC (Know Your Customer) frameworks Regulatory workflow setup Workflow rules and dependency management Proficiency in: SQL / PL-SQL Data analysis and validation Strong technical aptitude with the ability to: Understand application integrations Support external data capture processes Analyze downstream reporting systems Excellent verbal and written communication skills Ability to bridge the gap between technical and non-technical stakeholders Experience in application migrations Preference for On-Prem to SaaS migrations Fenergo (FenX) experience – Highly Preferred Technical Skills SQL PL/SQL Data Migration Workflow Configuration Regulatory Systems",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364723126/",
    "job_id": "4364723126",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer (RJSC and Accounts)- For SA LEGAL COUNSEL- Job ID: 1459104",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "SA LEGAL COUNSEL is looking for Officer (RJSC and Accounts)Job Description / ResponsibilityPrepare and file all necessary documents for company registration with RJSC.Draft and review Memorandum of Association (MOA) and Articles of Association (AOA).Handle annual return filing and statutory returns to RJSC.Educational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in AccountingSkills Required: Legal Affairs, Company Law, RJSC, Accounts and audit, Return Submission RJSC ExperienceJob LocationDhaka (DOHS Baridhara)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370319213/",
    "job_id": "4370319213",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Finance Manager",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366912423/",
    "job_id": "4366912423",
    "source": "linkedin",
    "company_name": "Thinkingbox",
    "job_title": "Office Coordinator - Thinkingbox",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359567729/",
    "job_id": "4359567729",
    "source": "linkedin",
    "company_name": "World of Tanks",
    "job_title": "Office Manager (Czech + English)",
    "location": "Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job OverviewThe Office Manager is responsible for overseeing day-to-day office operations and facility management, ensuring teams are well supported and able to focus on creating great games. This role builds strong relationships with key stakeholders across both local and global teams, gaining a clear understanding of their needs and priorities.Success in this position requires navigating a matrixed organization, working effectively across local and global structures as well as product groups and support functions. The Office Manager also plays an important role in fostering collaboration, teamwork, and a strong “One Company” culture within the workplace.Reports toEurope Regional Location Manager (based in Prague office)What will you do?There are 5 groups of Activities which form the core of the role as follow:Keep WG SafeEnsure the security of people and facilitiesMaintain compliance with local laws, regulations, and office rulesEnforce global health, safety, and security policiesBe the face of Wargaming in PragueAct as the primary point of contact for local suppliers and service providersWelcome and support visitors, including reception coordinationPartner with the Travel Team to support local transportation, hotels, restaurants, and visitor recommendationsManaging the WorkplaceServe as the main point of contact with the building manager, landlord, and neighboring tenantsUnder the delegation of the regional location Manager:plan and manage the Workplace and ensures proper utilization and maintenance of the facilities (Under the delegation of the regional location Manager)propose and coordinate workplace changes with local teams and the CFO teammaintain and update the office space management tool twice per year, coordinating changes with ITregularly review space plans (room sizes, allocations, etc.) to ensure accuracy and proper assignment to teamsEnsuring a friendly and efficient WorkplaceBuild strong relationships with all on-site teams, including product groups and support functionsPropose and implement employee-friendly office improvementsAct as the local point of contact for planning and running employee events that support engagement and satisfactionSupport onboarding of new Wargamers by coordinating local policies and processes in partnership with IT, Finance, and HRBudget Management (under the delegation of the Regional Location Manager)Manage the building lease, including coordinating terms and renewals with the CFOOwn and manage the local office budget, including supplies, events, and local procurementOversee office inventory, supplies, and incoming/outgoing postal and courier servicesManage location and office cost centersOrganize events in support of local management needs, ensuring delivery within approved budgetsWhat are we looking for?Office management, or workplace coordination background with direct people management experience.Proactive and persistent personality: someone who follows up, makes things happen, and is comfortable negotiating with suppliers and vendors.Excellent communication and Interpersonal skills: able to represent Wargaming with professionalism and build positive relationships with employees and external partners.Strong organizational skills with the ability to manage invoices, purchase orders, budgets, and space planning.Health & Safety knowledge / compliance awareness: familiarity with H&S practices, office safety standards, or willingness to quickly learn them is required.Event planning mindset: enjoys and has experience organizing team gatherings and creating an engaging workplace environment.Languages: Native level Czech + Fluent English.International mindset: comfortable working in a multicultural environment.What additional skills will help you stand out?Passion for video gamesPrevious experience in a matrix or international organization, working with both local and global stakeholdersFamiliarity with office management tools (space planning tools, ticketing systems, inventory tools, vendor portals, etc.)Basic understanding of procurement processes (vendor onboarding, contract handling, approvals)Work modeOnsite (5 days per week)Typical working hours: 8:30 am - 5:00 pm (with some room for flexibility)This role isn't eligible for relocation & immigration supportBenefitsBenefits and perks are tailored to the local market and culture. Our benefits in Prague include:5 weeks of Annual Leave per calendar yearAdditional paid time off Sick Leave Compensation, Maternity & Paternity Leave Benefits Career development and education opportunities within the companyMeal card contributionPublic transportation allowancePremium private healthcareMental well-being program (iFeel)Multisport Employee discountsPersonal Gaming Account Coffee, fruits, and snacks in the officeCompany eventsSeniority Awards Referral program - You can recommend the best talents to the company and receive a reward Please submit your CV in English to ensure smooth processing and review.About WargamingWargami",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373016123/",
    "job_id": "4373016123",
    "source": "linkedin",
    "company_name": "EWOR",
    "job_title": "Novel Energy Co-Founder / CFO (100 % remote) (m/f/d)",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We are looking to hire ambitious entrepreneurs to start and scale their own startups.We are serial entrepreneurs, for example Paul Müller (founder Adjust, €1.2B exit) and Petter Made (founder SumUp, €8B) who are eager to support outlier personalities and serial entrepreneurs to build €1B+ companies.Our offer:A salary while you build your startup as you will directly be employed by us. Alternatively, you can opt for up to €500k in funding.1:1 sparring with unicorn founders on a weekly basisCommunity: Access to the top 0.1% of founders, peers and investorsTeam building: Hiring top notch talent supported through our network (over 50,000 professionals)Distribution: Support in reaching product-market-fit and building up a sales force / marketing machineFunding support for securing a multi-million euro funding round within 12 months (on average, EWOR Fellows raise > €2M after our Grand Pitch)One of our fellows set a record for Europe’s largest pre-seed round by a first-time founder, securing a €12M pre-seed investment.TasksYou will own, build, and run your startup in fields such as Novel EnergyYou will embark on an extensive personal development journey crafted by unicorn founders and follow a fully customised programme enhancing your goal, time, and energy managementYou will receive support in hiring through our network to over 50,000 professionals and advice as well as best practices from serial entrepreneursYou will receive intensive coaching to make your startup ready to raise millions in fundingYou will iterate your product with us until having reached product-market-fit and receive support in building up a sales force or creating a marketing engine respectivelyRequirementsYou are based in Europe or the Americas or open to relocateYou are willing to take full responsibility for your own startup and scale it to €100M+ in revenuesYou have excellent communication skills in the English language",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369818832/",
    "job_id": "4369818832",
    "source": "linkedin",
    "company_name": "Ontario Power Generation",
    "job_title": "Private Markets",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373812330/",
    "job_id": "4373812330",
    "source": "linkedin",
    "company_name": "Concept Piscine Design",
    "job_title": "Stagiaire en comptabilité",
    "location": "Val-Bélair, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Salaire : 17,86 $ à 20,62 $ CA / heureLieu : En présentielDisponibilité à se déplacer : 100 % (obligatoire)Description du posteVoici une excellente opportunité de te joindre à une entreprise familiale en pleine croissance, qui célébrera ses 35 ans cette année. Nous offrons un stage rémunéré à compter de la mi-mars à temps partiel, avec une transition vers un poste à temps plein dès le mois de mai, et ce, pour toute la période estivale.Tu es à l’aise avec les chiffres, organisé(e), fiable et reconnu(e) pour ton attitude positive. Nous recherchons une personne motivée qui souhaite s’impliquer et acquérir une expérience de travail concrète et enrichissante!Ce que nous t’offronsUn emploi à temps plein durant tout l’étéUne expérience de travail enrichissante dans un domaine axé sur le bonheur et le bien-être : piscines, spas, meubles de jardin et plus encoreLe soutien d’une équipe compétente et accueillanteUn environnement de travail dynamique où tu pourras développer des compétences concrètes AvantagesCongés payésBanque d'heuresN’hésite pas à postuler dès maintenant!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369839252/",
    "job_id": "4369839252",
    "source": "linkedin",
    "company_name": "Vaco by Highspring",
    "job_title": "Senior Accountant",
    "location": "Markham, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Our client is looking for a Senior Trust Fund Accountant for a 6-month contract with potential to be hired full-time.The Senior Trust Fund Accountant is responsible for managing a book of trust fund clients.About the OpportunityPrepare journals and maintain up-to-date GL transactions.Reconcile all balance sheet and income statement accounts.Prepare monthly, quarterly, and annual financial statementsPrepare government remittances.Monitor cash flow and prepare bank transfers for surplus funds.Reconcile investment accounts with statements from custodian/investment managers and handle investment transfers between custodian, investment managers, and the bank account of the trust fund clientsPrepare cash flow, investment, and other reports as required by clients.Prepare working papers and assist during annual audits.Evaluate and handle client-related inquiries.Handle day-to-day accounting duties for the clients.About You5 or more years of experience in full-cycle accounting, financial statement preparation and investment managementCollege or University Diploma in business administration, with a focus on accounting; a CPA student or qualification is an assetExcellent computer skills, including MS Office applications with intermediate to advanced levels in MS Excel.Co-operative team player with strong math skills and accounting knowledge.Good communication skillsExperience with Accpac/Sage is an assetHow to ApplyClick the “Apply Now” button and follow the instructions to submit your resume. Please note that we only accept documents in MS Word or Rich Text formats. When referencing this job, quote #468613. ----- DISCLAIMERS ----- This position for employment is for a current vacancy with Highspring’s client. You must currently reside within the Greater Toronto Area and be permitted to work in Canada to be considered for this opportunity. A recruiter will be in touch with you if your profile meets our client’s requirements for this role. By submitting to this position, you agree that you will be giving Vaco by Highspring the exclusive right to present you as a candidate for the foregoing position. Additionally, you agree to be included in our talent pool for future hiring for similarly qualified positions. You further agree that you have represented information about yourself accurately and have not affirmatively misrepresented your qualifications. Lastly, you also agree to maintain as confidential, to the fullest extent permitted by law, any information you learn from Vaco by Highspring about the position and you will limit disclosure of information about the position only to the extent necessary to perform any obligations in furtherance of your application. In exchange, Vaco by Highspring agrees to exercise reasonable efforts to represent you through all solicitation, job screening and resume dispersal. Vaco by Highspring values a diverse workplace and strongly encourages women, people of colour, LGBTQ+ individuals, people with disabilities, members of ethnic minorities, foreign-born residents, and veterans to apply. The company is also committed to ensuring that persons who need them are provided with reasonable accommodations; if one is needed to participate in the job application or interview process, please contact HR@vaco.com . Vaco by Highspring respects your privacy and is committed to providing transparent notice of our policies in English here and in French here. Additionally, the company uses AI to perform preliminary screenings, focused on ensuring minimum job requirements noted in the position are satisfied. Further assessment of candidates beyond this initial phase will be conducted by recruiters and hiring managers. Vaco/Highspring does not know and cannot opine on if its client’s use of AI products in hiring. Pay Transparency Notice Determining compensation for this role (and others) at Vaco by Highspring depends upon a wide array of factors including but not limited to: the individual’s skill sets, experience and training; licensure and certification requirements; office location and other geographic considerations; other business and organizational needs. Having said that Vaco by Highspring believes that the salary range referenced reasonably estimates the base compensation for an individual hired into this position. The individual may also be eligible for discretionary bonuses and/or participation in medical, dental, and vision benefits as well as the company’s retirement plan (or similar retirement benefits).",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355716564/",
    "job_id": "4355716564",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Security In-Charge / Supervisor - (For Synergies Sourcing Bangladesh Ltd.) - Job ID - 1453370",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375728889/",
    "job_id": "4375728889",
    "source": "linkedin",
    "company_name": "Talenna Services",
    "job_title": "Contrôleur adjoint",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373778792/",
    "job_id": "4373778792",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Monitoring Officer - For Mukti Cox's Bazar - Job ID: 1460377",
    "location": "Cox’s Bazar, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Mukti Cox's Bazar is looking for Monitoring OfficerKey PointsMonitoring & Evaluation.Accountability & Learning.Documentation and Reporting.Project data management.Established complaint feedback system.Job Description / ResponsibilityJob Context:The Monitoring Officer will work under the direct supervision of the MEAL Department and partial supervision under Project Head . The role is for day-to-day field monitoring to ensure quality project implementation and compliance with project standards. The Monitoring Officer will maintain a two-way flow of communication on project progress and implementation issues. The position will support the development of data collection tools and reporting templates in line with MEAL system requirements, and will lead baseline, endline, and outcome assessments. The Monitoring Officer will conduct regular data quality assessments and develop and operationalize accountability tools and frameworks, ensuring effective functioning of the accountability system and timely accountability reporting.Job Responsibilities:Monitoring & Evaluation:Conduct regular field monitoring for programme quality assurance. Allocate maximum time for field visit.Develop monitoring tools and implement progress measured in line with the project log frame.Support to develop the M&E framework aligned with the reporting requirement and sector guideline.Develop Indicator Performance Tracking Table (IPTT) tool to track progress through indicator-specific segregated data.Ensure accountability mechanism in place for the project.Able to design survey tools in digital platforms and manage collected data for the project.Ensure timely and periodic data submission and MIS update including data quality, accuracy, and completeness.Develop data collection tools to collect data and reporting templates to meet the requirements of the MEAL system.Lead and Conduct Data Quality assessments as per need.Regular sharing of MEAL findings with staff, Donor, primary stakeholders, and MCB Management as well as MEAL reports update to the decision structures for future actions.Ensure compliance and quality of data in line with MCB and donor requirements.Conduct On-site distribution monitoring (ODM), Post Distribution Monitoring (PDM) & knowledge exercise, and share the key learning internally and externally.Conduct Project outcome assessment & end line assessment and share the report with MCB management & Donor.Conduct satisfaction survey and share the report with MCB management and Donor.Conduct community consultation survey, Adhoc survey and follow up Hotline Number.Data visualization and Dashboard preparation.Accountability & Learning:Work closely with programme colleagues to functionalize the community`s complaint and feedback handling mechanism, which links to wider M&E and Accountability processes.Provide technical guidance for maintaining standardized information-sharing systems and handling complaint feedback and response mechanisms (CFRM), etc.Develop and update CFRM monitoring tools according to CFRM guidelines.Ensure the use of accountability tools at all levels in the organization and stakeholders.Orient new and existing CFRM tools to the staff, stakeholders and project participants to ensure the use of accountability tools at all levels in the organization and stakeholders.Facilitate collecting community feedback, compiling and sharing with management and MEAL Department.Ensure accountability practice at downward, peer and upward level by the staff, project participants and stakeholders in the entire project management cycle i.e. project development, planning, implementation, monitoring, evaluation and reporting.Assist project management through delivering accountability-related contextual data and information during development of new projects.Regular field visit to follow up the accessibility and use accountability system by the project participants and ensure information is coming to the established complaint feedback system.Documentation and Reporting:Regularly support updating project data management system.Conduct process monitoring and share report with MCB MEAL Department & Project Head (PH).Ensure that all MEAL-related information and documents are stored in secure locations (online and offline) in line with the donor requirements.Prepare Monthly, Quarterly, & Final project reports and share with the MCB management & Donor as per the requirement.Collect monthly CFRM data and analyze data and sharing project management and MEAL.Collect case stories and assist PH with reporting.Document good practices, lessons, challenges and communicate as appropriate.Integrate the field visit based reports, complaints system, toll free hotline and feedback of the project participants in the accountability information management and reporting system.Develop monthly and quarterly accountability reports and share with the MEAL and project management.Develop quarterly MEAL progress reports and share with the MEAL and project managem",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4312261176/",
    "job_id": "4312261176",
    "source": "linkedin",
    "company_name": "Internal Audit (For RFL Group)",
    "job_title": "Trainee Executive",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345773313/",
    "job_id": "4345773313",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Audit & Assurance (For A Renowned Chartered Accountants Firm ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4228750882/",
    "job_id": "4228750882",
    "source": "linkedin",
    "company_name": "Meghna Group of Industries (MGI)",
    "job_title": "Internal Auditor",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4111010275/",
    "job_id": "4111010275",
    "source": "linkedin",
    "company_name": "For Ventura Leatherware Mfy (BD) Ltd",
    "job_title": "Intern",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]