[
  {
    "url": "https://www.linkedin.com/jobs/view/4373787989/",
    "job_id": "4373787989",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager/Manager (Marketing Operation)- For Rupayan Group- Job ID: 1460978",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Rupayan Group is looking for Deputy Manager/Manager (Marketing Operation)Job Description / ResponsibilityDevelop annual marketing plan aligned with business targetsDefine target segments (Residential, Commercial, Corporate Office, Hospitality etc.)Competitor analysis and market positioningBudget planning & ROI forecastingMaintain brand identity (logo, color, tone, visual style)Portfolio development (before–after projects, 3D renders, walkthrough videos)Website & company profile developmentClient testimonial managementSocial media management (Facebook, Instagram, LinkedIn, YouTube)Paid ads campaign management (Google Ads, Meta Ads)Content marketing (design trends, project highlights, blog posts)Lead sourcing from digital campaigns, portals & referralsCRM data entry & pipeline monitoringLead assignment to sales/design teamConversion tracking & follow-up analysisWeekly marketing-to-sales performance reportProject site branding (Hoardings, banners, brochures)Participation in property fairs & exhibitionsCorporate networking events and channel partner relationship managementCoordination with digital agencies, printing vendors & production partnersPhotography & videography teams collaborationPerformance review of external partners and campaign performance analysisCost per Lead (CPL) & Cost per Acquisition (CPA) analysisROI measurementMonthly marketing dashboard presentation to managementAlign marketing campaigns with project launchesProvide marketing materials for sales presentationCapture completed project visuals for promotionClient feedback collection for brandingEducational RequirementsMaster of Business Administration (MBA) in MarketingSkills Required: Relationship Marketing, Marketing, Market Analysis, Market Survey, Lead management, Data analysis and presentation, Business Planning and BudgetingExperience Requirements8 to 10 year(s)The applicants should have experience in the following business area(s):Advertising Agency, Newspaper/Magazine, Real Estate, Group of Companies, DeveloperJob LocationDhaka (Uttara Sector 12)SalaryTk. 50000 - 70000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374235872/",
    "job_id": "4374235872",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive (VAT & Tax) - (For Zaman Group of Industries)-Job ID: 1461257",
    "location": "Gazipur District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Zaman Group of Industries is looking for Senior Executive (VAT & Tax)Job Description / ResponsibilityJob SummaryThe VAT & Tax Executive will be responsible for ensuring compliance with VAT, tax, and regulatory requirements under prevailing laws. The role involves preparation, submission, and coordination of all VAT & tax-related returns, records, and correspondence with relevant authorities.Reporting To: GM – Accounts & VatJob Location: Tepir Bari, Mawna , Sreepur, GazipurKey ResponsibilitiesPrepare and submit monthly VAT returns (Mushak 9.1) accurately and on timeMaintain VAT registers, Mushak forms, and related documentationCalculate and deposit VAT, AIT, and other statutory taxesPrepare withholding tax (AIT) returns and certificatesAssist in preparation and submission of annual income tax returnsEnsure compliance with VAT & Tax Act, Rules, and SROsCoordinate with tax consultants, auditors, and NBR officials when requiredSupport VAT & tax audits and inspectionsMaintain proper documentation for input VAT credit and adjustmentsAssist in tax planning to ensure lawful tax efficiencyKeep updated with changes in VAT & tax laws and regulationsEducational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceBachelor’s degree in Accounting / Finance / Business AdministrationPartly qualified CA / CMA / ACCA will be an added advantageExperience Requirements3 to 4 year(s)Additional RequirementsMinimum 3–4 years of relevant experience in VAT & TaxExperience in manufacturing sector will be preferredSkills & CompetenciesStrong knowledge of Bangladesh VAT & Tax lawsProficiency in MS Excel and accounting softwareGood analytical and problem-solving skillsAbility to work independently and meet deadlinesStrong communication and coordination skillsJob LocationGazipur (Sreepur)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375344769/",
    "job_id": "4375344769",
    "source": "linkedin",
    "company_name": "KHAN Ayub, Chartered Accountants",
    "job_title": "Deputy Manager",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionEstablished in 2007, KHAN Ayub, Chartered Accountants specializes in auditing, taxation, and consultancy services to address complex business challenges. With a robust network of expertise and resources, the firm is committed to meeting the evolving needs of its diverse clientele. By focusing on tailor-made solutions, KHAN Ayub ensures efficiency and effectiveness for its clients, fostering long-term partnerships. The organization is dedicated to delivering exceptional services that support sustainable business growth.Role DescriptionThis is a full-time, on-site role for a Deputy Manager based at our office in Dhaka, Bangladesh. The Deputy Manager will oversee the successful execution of client engagements, while ensuring compliance with relevant laws and standards. Key responsibilities include managing teams, assisting with audits, financial reviews, and preparing reports. The role also includes supervising junior staff and maintaining effective client relationships to provide high-quality service delivery.Education & Qualifications:• ACCA Affiliate/ ACCA member• CA (ICAB) Partly Qualified (Professional Level).Professional Experience:• 3-4 years of experience in audit or relevant field",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376522419/",
    "job_id": "4376522419",
    "source": "linkedin",
    "company_name": "UNDP Careers",
    "job_title": "Project Associate (ICT) - Short-term (NPSA 6)",
    "location": "Khulna, Khulna, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionTiered ApproachIn Line With The Commitment To Safeguard Capacity And Support Personnel Already In The Organization, a Majority Of UNDP UNCDF/UNV Vacancies Are Advertised Using a Tiered Application Process WherebyTier 0: UNDP/UNCDF/UNV IP staff holding permanent (PA) and fixed-term (FTA) appointments, whose posts will be abolished, or contracts will be terminated or not renewed during 2026.Tier 1: Other UNDP/UNCDF/UNV staff holding permanent (PA) and fixed-term (FTA) appointmentsTier 2: UNDP/UNCDF/UNV staff holding temporary appointments (TA), personnel on regular PSA contracts, and Expert and Specialist UN VolunteersTier 3 or no tier indicated: All other contract types from UNDP/UNCDF/UNV and other agencies, and other external candidatesPlease make note of the Tier(s) indicated in the vacancy title, if any, and ensure that you satisfy the eligibility to apply.BackgroundClimate change, manifesting in the form of intensified cyclones, storm surges, and sea-level rise (SLR), is accelerating saltwater intrusion into the fresh water resources of the coastal belt of Bangladesh. Climate change-induced soil and water salinity is projected to adversely impact freshwater dependent agricultural livelihoods (leading to loss of productivity or livelihoods) as well as the availability and quality of drinking water in the vulnerable coastal communities. Furthermore, given the crucial role that women play in water security and household level resilience, and their socio-economic marginalization, the climate change-induced threat to agricultural livelihoods and drinking water security of the affected coastal communities disproportionately affects women and girls.Therefore, the key objective of the proposed project is to support the Government of Bangladesh (GoB) in strengthening the adaptive capacities of coastal communities, especially women, to cope with impacts of climate change-induced salinity on their livelihoods and water security. GCF resources will be combined with GoB co-financing to address information, technical, financial and institutional barriers to implementing and managing resilient livelihoods and drinking water solutions for the vulnerable communities in the Southwestern coastal districts of Khulna and Satkhira. An estimated 719,229 people (about 245,516 direct and 473,713 indirect) will benefit from the proposed project interventions.The proposed project will empower target communities, especially women, as ‘change-agents’ to plan, implement, and manage resilient livelihoods and drinking water solutions. The project will enable those communities to address climate change risks on livelihood and drinking water security to promote synergistic co-benefits. It will enhance the adaptive capacities of these communities in the face of worsening impacts of climate-change induced salinity on their freshwater resources which in turn adversely affect livelihood and drinking water requirements. GCF resources will be invested in promoting a diversification from currently non-adaptive, freshwater-reliant livelihoods of small-scale farmers, fishers, and agro-labourers towards climate-resilient agricultural livelihoods. GoB co-financing is leveraged to support adoption and scale of these alternative, climate-resilient agricultural livelihoods through strengthened value-chains and market linkages for their long-term viability in the face of increasing salinity and extreme weather. The project also utilizes GCF and GoB resources to support investments in and management of climate-resilient drinking water solutions to secure year-round, safe drinking water supplies for the targeted communities. Access to reliable, safe drinking water enables the communities, especially women and girls in targeted households, to invest the resulting time and cost savings and health co-benefits in enhanced livelihoods and income generating and/or educational opportunities. In turn, the enhanced incomes and livelihoods will enable the communities to sustain the investments in the drinking water supply solutions in the long-term. Finally, through investments in institutional capacities, knowledge dissemination and evidence-based learning, the project will enable pathways for replication and scale of project impact to secure livelihoods and drinking water across the vulnerable districts of the southwest coast of Bangladesh. The project yields significant environmental, social (including gender), and economic co-benefits including enhanced integrity of coastal ecosystems and freshwater resources; improved gender norms and women empowerment; and increased income and health benefits, estimated at USD15 million and USD4 million respectively over the project lifetime.The project contributes towards GoB’s achievement of priorities outlined in the Nationally Determined Contributions (NDC) and its climate change strategies. The project objective speaks to the top five key near-term areas of intervention identified by the INDC to address ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376375426/",
    "job_id": "4376375426",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "Associate_CMAAS_Audit_Assurance_Dhaka",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374245129/",
    "job_id": "4374245129",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer-Finance (For Noman Group.) - Job ID : 1460740",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374208024/",
    "job_id": "4374208024",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Digital Marketing & Brand Growth Specialist (For Fellas)-Job ID: 1460731",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374228949/",
    "job_id": "4374228949",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager, F&A (For Radiant Distributions Ltd.)-Job ID: 1461333",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371901075/",
    "job_id": "4371901075",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer/ Senior Officer, Internal Audit and Compliance (For A Group of Industries)-Job ID: 1459145",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374209392/",
    "job_id": "4374209392",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Assistant Manager/Deputy Manager - OPEX, Akij Light Engineering Ltd.",
    "location": "Nārāyanganj, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374228869/",
    "job_id": "4374228869",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant/Deputy Manager (Financial Analysis) - (For A Leading Textile & RMG Group at Chattogram)-Job ID: 1461439",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374258333/",
    "job_id": "4374258333",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager - ICC (Internal Control & Compliance) - For Akij Resources- Job ID: 1461397",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374206047/",
    "job_id": "4374206047",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Officer -Fixed Assets Management - For Akij Insaf Group - Job ID: 1460919",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Akij Insaf Group is looking for Senior Officer -Fixed Assets ManagementJob Description / ResponsibilityAkij Insaf is one of the leading names in the industrial sector of Bangladesh. It has been managing its overall business activities through 13000++ manpower including various levels of employees. The company are sincerely created an ideal safe working environment and dignified profession for all employees of the organization through practicing integrity, nurturing ability, sincerity, positive attitude, and fairness. Akij Insaf various industrial products have already managed to attract positive attention among customers across the country. The company is known for its diversified business portfolio, including Food, Textile, Printing & Packages, and Life style products. Now, we are seeking a dynamic & energetic person to join us as “Senior Officer -Fixed Assets Management”.The candidate has to perform following responsibilities:Ensure proper tagging and barcoding for proper tracking of organization’s assets.Conducting asset utilization evaluation and asset feasibility studyDeveloping KPI for asset monitoring and evaluation. Assisting in development of strategic asset management policyRecord fixed asset acquisitions and dispositions in the accounting system. Managing asset management and disposition of inactive and obsolete assets by tracking inventory, costs, movement and dispositionCalculate depreciation for all fixed assets, review and update the detailed schedule of fixed assets and accumulated depreciation. Subsequently, reconcile the balance in the fixed asset subsidiary ledger to the summary-level account in the general ledger.Prepare audit schedules and reports relating to fixed assets, and assist the auditors and management in their inquiries through analysis and reports.Conduct periodic impairment reviews for intangible assets.Conduct periodic physical counts of fixed assets by travelling to factory sites.Track company expenditures for fixed assets in comparison to the capital budget and management authorizations. Oversee the procurement and disposition of surplus assetsEnsure that all physical assets are in compliance with safety, environmental, and building codes,Reviews asset information, such as warranties, manufacturer warranties, maintenance and service agreements, and regulatory compliance (EPA, OSHA etc.)Play pivotal role in software development regarding assets in order to proper distribution and revaluation of assets.Any other task assigned by the management.Educational RequirementsMaster of Business Administration (MBA)Bachelor of Business Administration (BBA)Master of Commerce (MCom)Experience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s):Group of CompaniesAdditional RequirementsAt least 5 years working experience including 2 years in the said positionACCA part qualified or CA/CC (Professional level candidate of ICAB)Must have excellent knowledge on fixed asset related IAS/IFRSs (IAS 16, 36,38,40, IFRS 5 etc.)Should have hand on experience in fixed assets management during article ship period or post article ship period.Prior experience in preparing fixed asset database and fixed assets software implementation would be an added advantage.Computer literacy: ERP Software (Oracle), data management software (Power BI, Tableau), Office packages (especially Power point)Strong business writing communication skill is a must.Must be willing to travel at factory sites frequently.Advanced Excel skill is a mustJob LocationDhaka (Tejgaon)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374249031/",
    "job_id": "4374249031",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Jr. Officer / Officer - Factory Audit (For Quality Feeds Limited)-Job ID: 1461236",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Quality Feeds Limited is looking for Jr. Officer / Officer - Factory AuditJob Description / ResponsibilityThe Factory Auditor will be responsible for conducting operational, financial, and compliance audits at the factory level to ensure smooth running of operations, proper internal control, inventory accuracy, cost efficiency, and adherence to company policies and statutory requirements.Responsibilities:Conduct regular factory audits covering production, inventory, procurement, store, and dispatch operations.Monitor daily operational activities and ensure compliance with SOPs.Identify operational inefficiencies and recommend corrective actions.Verify raw material consumption and production output reconciliation.Review factory accounts, vouchers, bills, and supporting documents.Ensure proper recording of financial transactions as per accounting standards.Verify cost sheets, production costing, and wastage analysis.Monitor budget utilization and report variances.Conduct physical stock verification of raw materials, finished goods, spare parts, and packaging materials.Reconcile physical stock with ERP/system records.Ensure FIFO/FEFO compliance where applicable.Ensure compliance with company policies, internal control procedures, and statutory regulations.Prepare audit reports with findings, risks, and recommendations.Assist management in special audits or investigation assignments as required.Educational RequirementsMinimum Graduation in Accounting/Finance from a reputed institution (public or well-recognized private university).Professional qualification (CA-CC, CMA part qualified, or equivalent) will get preference.Skills Required: AUDIT AND INSPECTIONExperience Requirements2 to 4 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Group of CompaniesAdditional RequirementsStrong knowledge of accounting principles and audit procedures.Good understanding of manufacturing operations and production costing.Proficiency in ERP/accounting software and MS Office.Strong analytical and reporting skills.Ability to work independently and handle factory-level responsibilities.Willingness to stay and work in other factory locations.Job LocationBogura",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374239192/",
    "job_id": "4374239192",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive/Senior Executive - Audit (For Meghna Executive Holdings)-Job ID: 1461188",
    "location": "Gazipur District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Meghna Executive Holdings is looking for Executive/Senior Executive - AuditJob Description / ResponsibilityWe are looking for some hardworking & dynamic internal audit personnel for our Meghna Knit Composite Limited. Perform and control the full audit cycle including risk management and control management over operations effectiveness, financial reliability and compliance with all applicable directives and regulations. Knit garments person will be a great preference.Determine internal audit scope and develop annual plans.Obtain, analyze and evaluate accounting documentation, previous reports, data, flowcharts etc.Prepare and present reports that reflect audit`s results and document process.Act as an objective source of independent advice to ensure validity, legality and goal achievement. Identify loopholes and recommend risk aversion measures and cost savings.Maintain open communication with management and audit committee.Document process and prepare audit findings memorandum.Conduct follow up audits to monitor management`s interventions.Educational RequirementsBachelor of Commerce (BCom) in AccountingExperience Requirements2 to 5 year(s)The applicants should have experience in the following business area(s):GarmentsJob LocationGazipur",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374798240/",
    "job_id": "4374798240",
    "source": "linkedin",
    "company_name": "Ministère des Affaires étrangères français",
    "job_title": "Directeur (F/H) de l'Alliance française de Chittagong - Bangladesh",
    "location": "Chattogram, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Description synthétique du posteSous l'autorité du conseiller de coopération et d'action culturelle (COCAC) et sous la responsabilité du Conseil d'administration (CA) de l’Alliance française de Chittagong (AFC) , association de droit local, vous êtes responsable de l’exécution du projet d’établissement et vous assurez le bon fonctionnement et développement de l’Alliance ainsi que le suivi de l’ensemble des actions qui y sont menées, en conformité avec les lois locales. Trois mois suivant votre prise de fonction vous vous verrez remettre votre lettre de mission cosignée par la Direction générale de la mondialisation (DGM), le président de l'Alliance et la Fondation des Alliances françaises. Au plus tard six mois après votre prise de fonction, vous devrez présenter un projet d'établissement et un plan d'action soumis à l‘approbation du conseil d’administration et visé par l'ambassade, qui couvrira la durée de votre mission.Activités principalesL'AFC comprend une Médiathèque répartie sur plusieurs espaces dans l’établissement, un auditorium de 130 places (projections, spectacles, expositions), 5 salles de cours, un café, deux bureaux administratifs. Elle gère également une maison d’hôte, le Bungalow Numéro 2, qui accueille des résidences artistiques et compte trois hébergements. Dans ce cadre, vous devrez assurer les : Elaboration, proposition et impulsion de la stratégie de l’établissement ; Fidélisation des étudiants (environ 1800 par an) avec un marketing des cours innovant (usage des réseaux sociaux et du site internet de l’établissement); Développement des cours extérieurs (représentant deux tiers des apprenants), auprès des forces armées, en universités et établissements d’enseignement secondaire notamment ; Formation continue des enseignants FLE et suivi de leurs habilitations à assurer pour le DELF/DALF et le TCF (environ 410 candidats Delf- Dalf par an) ; Travail conjoint avec Campus France Bangladesh pour l’organisation d’événements de promotion des études en France ; Consolidation du public (environ 4000 visiteurs / spectateurs par an aux événements relayés largement dans les médias) ; Application d’une offre programmatique pluridisciplinaire et transversale répondant à la fois aux grands sujets de société (environnement, droits humains), à l’appui aux équipes artistiques locales et à la diffusion des artistes et intellectuels francophones. Développer des partenariats professionnels avec la France, dans les domaines des industries culturelles et créatives, notamment le film documentaire. Participation à l’élaboration du budget, à la gestion du personnel et à la mise en place d’outils d’analyse, de suivi et d’évaluation en liaison avec le conseil d’administration et veille sur la maintenance et l’entretien du bâtiment ; Établissement d’étroites relations avec les réseaux professionnels et les autorités du pays afin de promouvoir l’établissement (Université de Chittagong, Institut des beaux-arts, Chambre de Commerce, associations culturelles et ONG locales). Préparation et remise de rapports réguliers d’activité au conseil d’administration, à la Fondation Alliance française et au conseiller de coopération et d'action culturelle.Diplômes ou expérience professionnelle recommandée pour exercer les fonctionsMaster 2 ou équivalent. Expérience avérée de direction d’un établissement public ou privé, de préférence à l’étranger, dans des institutions culturelles ou des collectivités territoriales",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374254014/",
    "job_id": "4374254014",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager / Assistant Manager - Cost & Management Accounting (For Lintas Bangladesh Co. Ltd.)-Job ID: 1461278",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Lintas Bangladesh Co. Ltd. is looking for Manager / Assistant Manager - Cost & Management AccountingJob Description / ResponsibilityAnalyze production costs and propose cost-control initiatives to improve profitability.Prepare comprehensive cost reports and financial analyses for management review.Work closely with cross-functional teams to identify cost-related challenges and recommend strategic solutions.Monitor budget versus actual performance and report variances with proper analysis.Prepare investment feasibility reports as required by management.Develop financial forecasts and annual budgets.Educational RequirementsMaster of Business Administration (MBA) in Cost & Management AccountingProfessional qualification (CA/CMA – Inter level preferred).Skills Required: Cost reduction, Cost Management, Cost and budget, Cost management Accounting, Cost and Inventory ManagementExperience RequirementsAt least 6 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Multinational Companies,GarmentsJob LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374252110/",
    "job_id": "4374252110",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Officer/Assistant Manager - Internal Audit (Factory Operation) - For Akij Insaf Group - Job ID: 1461114",
    "location": "Gazipur District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374248585/",
    "job_id": "4374248585",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Jr. Officer / Officer - Accounts - For Quality Feeds Limited - Job ID: 1461197",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374250101/",
    "job_id": "4374250101",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts (For Edison Real Estate Limited) - Job ID : 1460865",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Edison Real Estate Limited is looking for Executive - AccountsJob Description / ResponsibilitySupport preparation of financial statements, monthly/quarterly/annual reports, and management information reports.Ensure accuracy and timeliness of financial records.Post daily payments, receipts, and journal vouchers in ERP/TallyReview and reconcile bank statements with accounting records.Execute daily banking activities, including fund transfers and account balance checks.Maintain proper documentation of all banking transactions.Oversee daily cash transactions, collections, and reconciliations.Monitor cash flow and maintain updated cash flow reports.Assist in fund transfers, cash deposits/withdrawals, and maintain proper records.Prepare all types of payment and expense vouchersExecute all daily banking activities including deposits, withdrawals, fund transfers, and payments.Ensure accuracy and compliance with company policies during every transaction.Educational RequirementsBachelor of Business Administration (BBA) in AccountingSkills Required: MS Office, ERP Software, Financial Reporting, Bank ReconciliationExperience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):Real Estate,Group of Companies,Developer",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374235836/",
    "job_id": "4374235836",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Executive/Executive - Audit Department (For Assurance Farm OPC) - Job ID : 1460182",
    "location": "Bhaluka Upazila, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374235715/",
    "job_id": "4374235715",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accountant - For Esho Desh Gori (EDG)- Job ID: 1461494",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Esho Desh Gori (EDG) is looking for AccountantJob Description / ResponsibilityAbout UsEsho Desh Gori (EDG) is a non-governmental organization committed to social development, community empowerment, and sustainable initiatives in Bangladesh. We are seeking a qualified and experienced Accountant to manage our financial operations with transparency and professionalism.Job Location: 5/8 Lalmatia, Block-B, Mohammadpur, Dhaka, BangladeshJob Responsibilities:Maintain accurate financial records and bookkeepingPrepare monthly, quarterly, and annual financial reportsManage budgeting, forecasting, and fund allocationHandle NGO project accounts and Donar reportingEnsure compliance with government regulations and NGO AffairsPrepare audit reports and coordinate with external auditorsManage payroll, VAT, and tax-related mattersEducational RequirementsBachelor of Business Administration (BBA) in FinanceBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in FinanceMaster of Business Administration (MBA) in AccountingBachelor’s or Master’s degree in Accounting/FinanceProfessional certificationSkills Required: Language skills both in Bengali and EnglishExperience Requirements5 to 10 year(s)The applicants should have experience in the following business area(s):NGORequirements:Strong knowledge of accounting software and MS Excel, accountant software like tally.Good understanding of Bangladesh tax and VAT lawsHigh level of integrity and attention to detailJob LocationDhaka (Lalmatia)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374226901/",
    "job_id": "4374226901",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Financial Accountant (For DPS Express)-Job ID: 1461394",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374235743/",
    "job_id": "4374235743",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Assistant (For Caritas Regional Office)-Job ID: 1461505",
    "location": "Bandarban District, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Caritas Regional Office is looking for Accounts AssistantJob Description / ResponsibilityCaritas Bangladesh (CB) is a national and nonprofit development organization that has been operating in Bangladesh since 1967. It has its Central Office in Dhaka and eight Regional Offices (Barishal, Chattogram, Dhaka, Dinajpur, Khulna, Mymensingh, Rajshahi, and Sylhet Region). CB is currently operating 88 projects covering 185 Upazilas focusing on eight main priorities: i) Social Welfare and Service of Love for Vulnerable Communities, ii) Ecological Conservation, Climate Justice and Sustainable Food System, iii) Humanitarian Response and Disaster Management, iv) Education, Skill Development and Employment Creation, v) Health Care, Nutrition and Education, vi) Development of Indigenous Peoples, vii) Integral Human Development and viii) Institutional Development and Sustainability.Caritas Bangladesh (CB)’s Chattogram Regional Office is looking for suitable candidate for the project of “Promotion of comprehensive social inclusion of vulnerable groups especially Senior Citizens and People with Disabilities (SDDB) 2025-27” Project and also to generate a panel for future recruitment.The details of the positions including job responsibilities, educational qualification and other qualities/ competency required for the above position are given below as ready reference:This position is based in the Regional office. Responsible to support the overall finance and fund management and addressing compliance issues of the SDDB project level.Financial monitoring and supervision of the project. Provides accounts and financial guidance to the project team. Preparation of monthly financial report, preparation of modification, and reviews.Key responsible person to keep and maintain all account records of the project in soft as well as in hard form. The responsibilities are as follows;Reporting to:Sr. Accounts and Admin Officer with close collaboration with Field Officer- SDDB.Job Nature: Contractual/ TemporaryJob location: Regional office, Chattogram.Study and adhere to the donor’s and organizational financial policies and regulations, including the stipulations outlined in the sanctioned budget.Check all hard copies of vouchers (e.g., voucher number, date, budget head) along with supporting documents with the voucher list.Ensure all supporting documents are attached to the vouchers as per the guidance of the reporting supervisor.Provide English translations on vouchers, if required.Scan all vouchers according to the donor’s guidelines.Cross-check scanned vouchers received from the field offices with the tally and voucher list.Assist with other related tasks as required.Assist in preparing financial report of SDDB project.Financial monitoring visit to the project’s field areas.Well communication with Region and Central level concern department.Perform any other duties/responsibilities assigned by the competent authority.Educational RequirementsBachelor/HonorsMinimum bachelor’s degree, in Commerce discipline preferably in Accounting from any recognized university in Bangladesh/abroad.Experience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): NGOAdditional RequirementsEducational qualifications & age may be flexible for highly experienced, skilled & competent candidates.Experience Requirements:Work experience with NGOs/INGOs is preferable with a minimum of 2 years of experience particularly on Accounts keeping and financial reporting.Ability to produce high quality work under tight timeframes.Evidence of undertaking similar assignments.Good report writing skillsKnowledge on computer operation, including MS Word, Excel, Power Point.Demonstrated results implementing and tracking field-based activities.Knowledge of local context.Ability to work in a multi-cultural environment.Good time management skills with ability to work on multiple tasksGood communication and interpersonal skills.Work with the team as per management requirement.Ability to travel extensively to working locations and willing to stay at field;Job LocationChattogramSalaryTk. 30000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374204114/",
    "job_id": "4374204114",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer/Sr. Officer - ICT - For GPH Ispat Limited - Job ID: 1460995",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "GPH Ispat Limited is looking for Officer/Sr. Officer - ICTJob Description / ResponsibilityProvide Level 1/Level 2 support for hardware, software, and network issues.Install, configure, and maintain desktops, laptops, printers, and other IT equipment.Manage user accounts, email configurations, and access controls.Monitor network performance and troubleshoot connectivity issues.Maintain IT inventory and asset records.Ensure data backup and system security compliance.Provide end-user support for SAP modules (MM, SD, FICO, PP, HCM, etc.)Analyze and resolve SAP tickets within SLA timelines.Maintain and update master data in SAP.Assist in SAP configuration, testing, and documentation.Support SAP report generation and data validation.Coordinate with external vendors for IT-related services.Educational RequirementsBachelor of Science (BSc) in Computer Science & EngineeringBachelor of Science (BSc) in Information TechnologyBachelor’s degree in IT, Computer Science, MIS, or related field.Skills Required: IT Support Service, SAP SoftwearExperience RequirementsAt least 1 year(s)The applicants should have experience in the following business area(s):Manufacturing (Light Engineering and Heavy Industry),IT Enabled Service,Computer Hardware/Network Companies,Group of Companies,SteelAdditional RequirementsHands-on experience with at least one SAP module.Strong knowledge of networking basics (LAN/WAN, routers, switches).Good understanding of Windows OS and MS Office.Problem-solving and analytical skills.Good communication and teamwork skills.Job LocationChattogram (Sitakunda)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374220876/",
    "job_id": "4374220876",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Accountant- For Kewra Seafood Limited- Job ID: 1461571",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Kewra Seafood Limited is looking for Assistant AccountantJob Description / ResponsibilityMaintain the Accounts of the Company.Educational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in AccountingSkills Required: Tally SoftwareExperience Requirements2 to 5 year(s)The applicants should have experience in the following business area(s):FisheriesJob LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373794220/",
    "job_id": "4373794220",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive/Assistant Manager, Finance & Accounts- For A Reputed Company- Job ID: 1460832",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374240619/",
    "job_id": "4374240619",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager/Manager - Project Structured and Sustainability Finance - For LankaBangla Finance PLC. - Job ID: 1461288",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372363418/",
    "job_id": "4372363418",
    "source": "linkedin",
    "company_name": "Neufast",
    "job_title": "Business Analyst",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Neufast is fast becoming a leader in HR-Tech in South East Asia and Hong Kong. With the use of our proprietary AI technology and cloud technology, we have developed the best candidate assessment and training platform in the region. Our clients include MNC, Universities and major listed companies. BENEFITS:· Competitive salary with ESOP pool for good performance· A promising and fast-growing market· Flexible working time· Friendly and supporting environment MAJOR RESPONSIBILITIES:· Conduct meetings with diverse stakeholders to gather essential information.· Produce comprehensive and actionable documentation based on stakeholder input.· Translate business requirements from clients into clear and detailed functional specifications· Ensure all project fundamentals are thoroughly covered, including scope, deliverables, timelines, costs, issues, risks, and change management· Develop, review, and edit requirements, specifications, business processes, and recommendations related to proposed solutions· Analyze products in the market and suggest functional solutions in collaboration with UX/UI Designer.· Analyze and elevate existing business processes.· Anticipate future requirements and identify areas for operational improvements.· Collaborate with cross-functional teams to ensure timely and effective implementation of solutions.· Monitor project progress and address any deviations from the plan. QUALIFICATIONS:· Bachelor’s degree in Computer Science, Information Technology, Business Administration, or a related field preferred.· Candidates from other disciplines with substantial IT knowledge will also be considered.· Minimum of 2 years of experience in technology-related fields or business analysis roles.· Excellent verbal and written communication skills in English· Highly organized with the ability to manage multiple tasks efficiently under tight deadlines.· Strong analytical and problem-solving skills with attention to detail.· Highly responsible, quick learner, and self-motivated with a proactive attitude.· Familiarity with business analysis tools and methodologies. Interested parties, please email your resume with availability to dennis.lee@neufast.com",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373926019/",
    "job_id": "4373926019",
    "source": "linkedin",
    "company_name": "Gildan",
    "job_title": "Business Analyst, Manufacturing",
    "location": "Savar, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who we are Gildan is a leading apparel manufacturing company, with a strong portfolio of brands, including Gildan®, American Apparel®, Comfort Colors®, GOLDTOE®, Peds®, and under the Under Armour® brand through a sock licensing agreement. With close to four decades of developing global manufacturing expertise, Gildan is one of the world’s most efficient, ethical, and sustainable apparel manufacturers. Founded in Canada, Gildan operates out of roughly 30 locations worldwide and sells its products in 60+ markets globally. Together with its 50,000+ employees, Gildan operates with a proven commitment to industry-leading Environmental, Social, and Governance (ESG) practices throughout its supply chain in accordance with its comprehensive ESG program embedded in the Company's long-term business strategy. More about the company at gildancorp.com. The opportunityAs a Business Analyst, you will be responsible for in-depth business process requirements analysis, business process re-design, and translation of business-related requirements into functional specifications resulting in configuration and/or development of effective systems solutions. This mandate will also include analysis and resolution of production issues and user support. You will also lead and/or participate in the following activities: Testing, preparation of training guides and other supporting documents, training business users, deployment of solutions, as well as post go-live support when required. The roleUnderstand manufacturing business processes in JDE E1 9.2 environment.Act as a subject matter expert in manufacturing modules in JD Edwards by performing design, configuration, testing, and training.Analyze and provide business solutions to support the manufacturing aspects of the core business processes, such as but not limited to textile manufacturing and sewing.Provide daily support for Gildan production systems including investigating and resolving complex user questions related to manufacturing systems.Document new processes or procedures, create testing documentation, and create specifications or proposals.Provide J.D. Edwards technical expertise to support operations and service.Address support and enhancement requests.Develop simplified/lean process improvements or operating practices which best utilize the systems to improve quality; increase productivity; and supports business goals.Conduct reviews, walkthroughs and solution testing to ensure that deliverables are achieved within accepted SDLC and PMO guidelines.Participate in integrated testing when needed.Develop, write, and conduct training to end users and IT personnel.Provide post-implementation support Stay aware of current and upcoming J.D. Edwards systems changes and improvements.The requirementKnowledge & Professional ExperienceAt least Bachelor Degree in Industrial Engineering & Production (IPE) or Industrial Engineering (IE) from a reputed public or private university with a minimum of 5 years of experience.AttributesExcellent knowledge of manufacturing JD Edwards Enterprise One implementation/upgrade and analysis experience.ERP Implementation experience in performing business requirements & fit-gap analysis, prototyping, retrofitting of modifications, system configuration, data conversion & integration testing, conference room pilot, regression testing, system health check, user training & development of functional design documents.Ability to handle multiple projects in a fast-paced environment.Agile and flexible to accommodate changes in business.Ability to solve problems, consider alternatives before making decisions, display intuitive judgment, timeliness in making recommendations and decisionsAbility to propose solutions and negotiate in the best interest of the organization.Ability to multi-task and assume various positions on team projects.Ability to work independently with minimal oversight.Strong interpersonal skills and desire to work with a wide variety of peopleStrong organizational, and communication skillsAbility to foster teamworkAvailable to travel 20% of the time, as requiredWhat's in it for you?Join a publicly traded company dual-listed on NYSE and TSX with great potentialBe part of a workplace where meaningful connections and teamwork are celebratedFrom local to international, be ready to work alongside a diverse group of colleaguesBenefit from mentorship and continuous development opportunitiesTake advantage of our attractive benefits packages You don't meet all criteria outlined above? Include your transferrable skills and unique experience in your application! We thank all applicants for their interest, however only those selected for interviews will be contacted. Come as you are:Join a company that recognizes the importance of diversity, equity, and inclusion to create a successful and collaborative work environment. As a an equal-opportunity employer, we value and embrace all the characteristics that make you uniquely you and seek to provide everyone ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371964129/",
    "job_id": "4371964129",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "General Manager - IT & SAP (Head of the department) - For Unique Group - Job ID: 1459854",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375837515/",
    "job_id": "4375837515",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375840483/",
    "job_id": "4375840483",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375845110/",
    "job_id": "4375845110",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375825960/",
    "job_id": "4375825960",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3925583341/",
    "job_id": "3925583341",
    "source": "linkedin",
    "company_name": "Business Globalizer",
    "job_title": "Tax Accountant Specialist",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3375383916/",
    "job_id": "3375383916",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Daraz hiring Tax Manager- Finance in Dhaka, Bangladesh",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4044647912/",
    "job_id": "4044647912",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "MetLife Bangladesh hiring Manager, Tax in Dhaka ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4019347283/",
    "job_id": "4019347283",
    "source": "linkedin",
    "company_name": "Field Nation নিয়োগ",
    "job_title": "TAX Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3772273618/",
    "job_id": "3772273618",
    "source": "linkedin",
    "company_name": "MN TRADE LIMITED নিয়োগ",
    "job_title": "Accountant",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3969017264/",
    "job_id": "3969017264",
    "source": "linkedin",
    "company_name": "(For Palmal Group of ...",
    "job_title": "Production Accountant (Narayanganj AEPZ)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364796721/",
    "job_id": "4364796721",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive / Jr. Executive - Customer Care - For A Reputed Company- Job ID: 1459613",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Reputed Company is looking for Executive / Jr. Executive - Customer CareJob Description / ResponsibilityCommunicate with buyers and respond to their inquiries via email, phone, or meetings.Receive and process orders from customers, ensuring accuracy and timeliness.Coordinate with production, planning, and store teams to ensure smooth order execution.Prepare delivery schedules and follow up to meet on-time delivery.Maintain order tracking, delivery status, and customer feedback.Assist in resolving customer complaints or issues in a professional manner.Maintain and update customer database and documentation properly.Support internal departments with customer-related updates or requirements.Ensure compliance with customer specifications and company quality standards.Educational RequirementsBachelor of Business Administration (BBA)Bachelor/HonorsSkills Required: Customer Service, Buyer HandlingExperience RequirementsAt most 2 year(s)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356561312/",
    "job_id": "4356561312",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Medical Assistant, Skin Therapist",
    "location": "Narayanganj Sadar Upazila, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company Name: Bio-Xin CosmeceuticalsLocation: Chattogram, Narayanganj, Dhaka (Banani, Savar)Job Type: Full-TimeWorkplace Type: On-SiteJob ID: IJOB202606631Medical Assistant, Skin Therapists are experts in therapeutic facial and body care, with a strong understanding of key body systems, skin biology, anatomy and cosmetic chemistry. Using this knowledge, Skin Therapists provide a range of Medical/non-medical face, body treatments customized to a client`s needs, and recommend appropriate products and after-care. While Skin Therapists can perform therapies to address specific conditions such as acne, Acne Scar, Spot, Dead Cells, Wrinkle, Anti-aging, Pores, fine lines, face and body contouring, they do not diagnose these conditions.A Skin Therapist will work with a range of equipment and products, such as performing microdermabrasion or using Light based devices, and must be trained in their correct usage and handling to perform these treatments safely.Perform different skin care treatment procedure with state of the art machines available at Bio-Xin Cosmeceuticals Skin Care Clinics.Treatments involve face and body care includes Acne, acne scar, dead cells, spot, wrinkle, fine lines, permanent hair removal, body and face contouring etc.As a Skin Therapist, you would spend time with people and help them talk about their skin related problems and feelings.Requirements Experience: At least 1 year Education: diploma in midwifery Skills: aesthetic sense, Customer Service, Good communication skills in both English and Bangla, Nurse/ Paramedics, Nursing, Staff Nurse Last Date of Application: 11 February 2026",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373801384/",
    "job_id": "4373801384",
    "source": "linkedin",
    "company_name": "Silverado Technologies",
    "job_title": "Accounting Assistant",
    "location": "Tucson, AZ",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Introduction to SilveradoSilverado Technologies is an award-winning, woman-owned Information Technologies firm that has been supporting businesses throughout Southern Arizona for more than twenty years. We empower business growth through technology. Providing our clients with real solutions and world class service that starts with understanding - and more importantly really caring about - the client's goals and concerns.At Silverado, our most valuable resource is our people. Our team is made of skilled, passionate professionals that are always learning and mentoring. We value teamwork as well as a positive and collaborative environment. Our culture encourages, supports, and celebrates our staff by valuing work-life synergy, offering flexible time off and promoting community involvement with staff-selected charities. Regularly hosted company social events during office hours encourage our staff to connect and get to know each other in a relaxed setting.SummaryThe Accounting Assistant plays a vital role in supporting the finance department by handling a variety of accounting tasks related to invoicing, expenses, and financial reporting. This position requires attention to detail, strong organizational skills, and the ability to manage multiple priorities while providing excellent service to internal and external stakeholders.Duties And ResponsibilitiesAssists in recording numerical and financial data to produce financial records. Enters journal entries to debit and credit the company's accounts. Generates accounting and audit reports for cash receipts, accounts payable and receivable, expenditures, and profits and losses. Reconciles and reports differences or issues found in financial recordsEnter and reconcile transactions in QuickBooksPrepare invoices, statements, and payment recordsSupport payroll processing and expense trackingMaintain organized financial files and documentationCommunicate with vendors, clients, and internal teams as neededProvide general administrative support to the accounting departmentHelp maintain accurate financial records and assist in the implementation of new financial systems or upgradesPerform other accounting-related tasks as assigned by the Finance ManagerIT Technical Experience a plus!Tools and Software preferred experience with:QuickBooks Online or other accounting softwareMicrosoft Excel and other Microsoft Office applicationsConnectwise Manage Education And ExperienceAssociate's degree in Accounting, Finance, or related field is preferred5+ years of experience in an accounting or bookkeeping roleStrong attention to detail and accuracy in data entryExcellent verbal and written communication skillsAbility to work effectively both independently and as part of a teamStrong organizational and time management skillsRequirementsPhysical Requirements Ability to sit for long periods while working at a desk and using a computer May be required to lift up to 25lbs for filing or organizing documents Required to work in an office environment, with some flexibility for hybrid or remote work optionsBenefitsHealth Care Plan, partially subsidized by Silverado (Medical, Dental, & Vision)Matching 401k Retirement PlanFlexible Paid Time Off (Vacation, Sick, & Public Holidays)Company Paid Life InsuranceGroup Rates for Critical Illness Insurance, Individual Life Insurance, Disability Income Insurance, Accident InsurancePaid Training & DevelopmentHybrid Office ModelInclusive Company Culture",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322024071/",
    "job_id": "4322024071",
    "source": "linkedin",
    "company_name": "Bankers Financial Corporation",
    "job_title": "Senior Accountant",
    "location": "St. Petersburg, FL",
    "employment_type": "",
    "date_posted": "",
    "job_description": "DecisionHR is a Professional Employer Organization (PEO) located in St Petersburg, FL. Since our inception in 1996, we have empowered our clients with industry-leading human resource solutions they need to drive their business. We assist our clients in the areas of payroll, worker’s compensation, human resources, and benefits. We remove the administrative burden of running their business and allow our clients to focus on their revenue-producing activities. Our goal is to deliver customizable, practical workforce solutions that increase profits, reduce costs and liability, and attract, develop, and retain long-term employees.Our Core Values IncludeCollaboration: working together is critical to achieving organizational goals.Innovation: growth happens when we can absorb and implement new ideas that provide unique solutions and superior customer service.Performance: we believe in providing our employees with the tools and support they need to grow, succeed, and make an impact.Social Responsibility: we place charity and volunteer work at the core of our organization.Trust: we build and maintain trust with our employees and clients by embodying integrity, transparency, and ‘doing the right thing.’Company Value StatementsIn the performance of their respective tasks and duties, all employees are expected to demonstrate the following:Acting with the highest level of honesty, trust, character, and transparency.Making a unified effort to achieve the goals of the organization; embracing accountability for exceptional performance every day.Commitment to excellence in reaching our full potential as individuals and as an organization, surpassing the ordinary and the expectations of our stakeholders.Approaching every challenge with creative energy, discovering unique solutions to maximize success; focus on creating and delivering compelling customer value.Belief in the power of a diverse workforce and in creating a positive impact on both the environment and our community.Job SummaryThe Senior Staff Accountant plays a key role in maintaining the integrity of the company’s financial records across multiple entities. This position is responsible for general ledger reconciliations, journal entries, and month-end, quarter-end, and year-end closings. The role will also support financial reporting, audits, and process improvements. The ideal candidate will be detail-oriented, analytical, and comfortable working in a fast-paced PEO environment that involves intercompany activity and multi-entity reporting.Key Responsibilities Perform and review general ledger account reconciliations and analyses across multiple entities. Prepare and maintain accruals, prepaids, fixed assets, and depreciation schedules. Execute and document journal entries to support monthly, quarterly, and annual close cycles. Conduct account variance analysis and provide clear explanations of fluctuations and trends. Assist with intercompany reconciliations, clearing accounts, and payroll-related liabilities such as taxes, benefits, and workers’ compensation. Support tax, cash and bank reconciliations. Participate in audit preparation and provide support to external auditors. Contribute to process documentation, system improvements, and automation initiatives. Ensure compliance with GAAP and internal control procedures.Physical attendance is required at the worksite 3 days a week, 8 am to 5 pm.Qualifications 4–7 years of progressive accounting experience, preferably in a multi-entity or PEO setting. Solid understanding of GAAP, reconciliations, and month-end close processes. Strong Excel skills: experience with BlackLine or similar reconciliation tools is a plus. Familiarity with accounting systems/ERP platforms. Excellent analytical, communication, and organizational skills. The preceding position description has been designed to indicate the general nature of the work performed; the level of knowledge and skills typically required; and the usual working conditions of this position. It is not designed to contain or be interpreted as a comprehensive, complete, or exclusive list of the duties of the position. Additional and different duties may be assigned from time to time. We are an E-Verify company.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364964148/",
    "job_id": "4364964148",
    "source": "linkedin",
    "company_name": "Kforce Inc",
    "job_title": "Senior Accountant",
    "location": "St Louis, MO",
    "employment_type": "",
    "date_posted": "",
    "job_description": "ResponsibilitiesOur Kforce client, a top investment management firm located in the St. Louis, MO area, is seeking a highly skilled Senior Accountant to manage full cycle accounting for a portfolio of investment entities and support the development of junior accounting staff. This role is ideal for someone who excels in a fast paced environment, has strong technical accounting abilities, and enjoys improving processes and collaborating with internal and external partners. The client offers salary and benefits, as well as excellent work/life environment, parking perks, six months in office for training, hybrid after. Duties: Manage full cycle accounting, including journal entries, reconciliations, financial statements, and cash flow monitoring Review and approve disbursements, loan schedules, and financial transactions (wires/ACH) Provide training, guidance, and issue resolution support to staff accountants Serve as a key contact for partners and clients regarding accounting policies and entity compliance Review closing and legal documents; coordinate with attorneys and internal teams to resolve discrepancies Support audits, tax preparation, and investor reporting Contribute to process improvements and occasional ad hoc projectsRequirements Bachelor's degree in Accounting or related field (or equivalent experience) Experience with full cycle accounting and general ledger maintenance Strong Excel proficiency and analytical skills Ability to manage multiple priorities and meet deadlines Excellent communication and customer service skills Leadership or mentoring experience Basic tax knowledgeThe pay range is the lowest to highest compensation we reasonably in good faith believe we would pay at posting for this role. We may ultimately pay more or less than this range. Employee pay is based on factors like relevant education, qualifications, certifications, experience, skills, seniority, location, performance, union contract and business needs. This range may be modified in the future.We offer comprehensive benefits including medical/dental/vision insurance, HSA, FSA, 401(k), and life, disability & ADD insurance to eligible employees. Salaried personnel receive paid time off. Hourly employees are not eligible for paid time off unless required by law. Hourly employees on a Service Contract Act project are eligible for paid sick leave.Note: Pay is not considered compensation until it is earned, vested and determinable. The amount and availability of any compensation remains in Kforce's sole discretion unless and until paid and may be modified in its discretion consistent with the law.This job is not eligible for bonuses, incentives or commissions.Kforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.By clicking “Apply Today” you agree to receive calls, AI-generated calls, text messages or emails from Kforce and its affiliates, and service providers. Note that if you choose to communicate with Kforce via text messaging the frequency may vary, and message and data rates may apply. Carriers are not liable for delayed or undelivered messages. You will always have the right to cease communicating via text by using key words such as STOP.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4240867448/",
    "job_id": "4240867448",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "Accounts & Finance (For Bangladesh SEZ Ltd.)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4283328476/",
    "job_id": "4283328476",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Heritage School নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4232258722/",
    "job_id": "4232258722",
    "source": "linkedin",
    "company_name": "Job ID ...",
    "job_title": "Accounts & Finance (For A Reputed Group of Company)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3719930270/",
    "job_id": "3719930270",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ADA নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4046505558/",
    "job_id": "4046505558",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Institute of Business Administration, University of Dhaka নিয়োগ ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]