[
  {
    "url": "https://www.linkedin.com/jobs/view/4364529300/",
    "job_id": "4364529300",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Accounts And Finance- For Akashbari Holidays- Job ID: 1459623",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Akashbari Holidays is looking for Manager - Accounts And FinanceJob Description / ResponsibilityDaily accounts ledger and book-keepingAnnual Financial ReportsOversee and maintain accurate financial records, ledgers, and accounts.Ensure timely and accurate posting of transactions in the accounting system.Maintaining Accounts Payable & ReceivableSupervise vendor payments, staff reimbursements, and supplier settlements.Supervise bank reconciliation.Budgeting & Forecasting.Monitor budget utilization and report variances.Banking & Cash Flow Management.Ensure smooth cash flow management for operational needs.Maintain compliance with statutory payments (e.g., VAT, tax, employee income tax etc.Liaise with auditors, tax consultants, and regulatory bodies.Management of Financial ReportingPreparing daily, monthly, quarterly, and annual financial statements.Fixed Asset ManagementSupport internal and external audit processes.Guide and train junior accounting staff.Educational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceBachelor of Business Administration (BBA)Skills Required: Accounting, VAT and Tax, Financial Reporting, Cost Management, Balance Sheet, Cost and profit analysis, CashX, Proficiency in Accounting Software (Tally ERP9 Quick Book)Experience Requirements6 to 12 year(s)The applicants should have experience in the following business area(s):Travel Agent, Immigration and Education Consultancy ServiceAdditional RequirementsPrevious experience in a managerial role is mustSound knowledge of CashX accounting software.Experience Group of the Company’s accounts managementStrong interpersonal and communication skillsAbility to work both independently and as part of a teamProficiency in using accounting software and tools, Cashx Software.Proficiency in using Microsoft Office, especially MS Excel and Google SheetsAt least 2 years in a managerial / supervisor positionJob LocationDhaka (Banani)SalaryTk. 45000 - 50000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364587497/",
    "job_id": "4364587497",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Accountant - For AJI Group- Job ID: 1459460",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "AJI Group is looking for Junior AccountantJob Description / ResponsibilityAssist with accounts payable and accounts receivablePrepare and post journal entriesReconcile bank statements and general ledger accountsSupport month-end and year-end closing processesMaintain accurate financial records and documentationAssist with audits and financial reportingEducational RequirementsBachelor/HonorsBachelor’s Degree in Accounting, Finance, or related fieldExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s):Garments,TextileFreshers are also encouraged to apply.Additional Requirements0–2 years of accounting experience (internships welcome!)Strong knowledge of accounting principlesProficiency in Microsoft ExcelHigh attention to detail and strong organizational skillsExcellent communication and teamwork abilitiesJob LocationDhaka (Savar)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371905523/",
    "job_id": "4371905523",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Project Accountant - For Tanvir Constructions Ltd. - Job ID: 1459442",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364539874/",
    "job_id": "4364539874",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Finance & Accounts - For Akashbari Holidays- Job ID: 1459588",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364548447/",
    "job_id": "4364548447",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Finance & Accounts - For Chaity Group - Job ID: 1459542",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372506924/",
    "job_id": "4372506924",
    "source": "linkedin",
    "company_name": "EGUARDIAN",
    "job_title": "Assistant Manager Finance / Executive Finance",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364745252/",
    "job_id": "4364745252",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Financial Analyst- For GCE International Inc - Job ID: 1459896",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371913106/",
    "job_id": "4371913106",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Accountant - For Bangladesh ENT Hospital Ltd. - Job ID: 1458499",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371905470/",
    "job_id": "4371905470",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Accounts And Finance - (For Cheng Yi Garments Industries Ltd) - Job ID - 1459187",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361426756/",
    "job_id": "4361426756",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager / Manager - Credit & Recovery - For Fareast Finance & Investment Limited - Job ID: 1457205",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364556499/",
    "job_id": "4364556499",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Executive- For Clove Chocolate- Job ID: 1459098",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Clove Chocolate is looking for Accounts ExecutiveJob Description / ResponsibilityMaintain daily accounts and financial recordsManage purchase records, vouchers, bills, and invoicesUpdate cash book, bank book, and ledger regularlyPrepare monthly and yearly financial reportsAssist in budget preparation and monitor expensesMaintain inventory and stock-related accountsTrack supplier payments and receivablesSupport in preparing VAT/Tax-related documents as requiredEducational RequirementsMastersSkills Required: Strategic Planning, Project Management, Market Research, Accounting Software, Cost control, Product Costing and budgeting, Artificial Intelligence UsageExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Advertising Agency,Food (Packaged)/Beverage,Agro based firms (incl. Agro Processing/Seed/GM),Healthcare/Lifestyle product,Beauty Parlor/Saloon/Spa,Agro based Startup, Business-to-Business (B2B) Software and Services Startup,Advertising Technology (AdTech) StartupJob LocationDhaka (Mirpur 1)SalaryTk. 18000 - 25000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372341128/",
    "job_id": "4372341128",
    "source": "linkedin",
    "company_name": "AiA Ventures Ltd",
    "job_title": "Executive - Accounts",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company Description AiA Ventures Ltd - Pioneer in self drive car rental service in Bangladesh. Role Description This is a full-time, on-site role for an Executive - Accounts based in Dhaka. The responsibilities include managing daily financial transactions, preparing financial reports, maintaining accurate records, overseeing billing and invoicing, and assisting in preparing budgets. The role also involves ensuring compliance with financial regulations and company policies. Qualifications Proficiency in Accounting, Bookkeeping, and Financial AnalysisExperience with Taxation, Auditing, and Financial ReportingProficiency in Accounting Software and Spreadsheet Applications like ExcelStrong attention to detail and problem-solving skillsAbility to manage time efficiently and meet deadlinesStrong communication and interpersonal skillsExperience or education in Finance, Accounting, or related field; a bachelor's degree is preferredUnderstanding of local financial regulations is a plusSalary Range:BDT 25,000 to 30,000.Special Requirement:Can join with us by 25 February, 2026.Working Days:Saturday to Thursday (On site)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372384533/",
    "job_id": "4372384533",
    "source": "linkedin",
    "company_name": "Enroute International Limited",
    "job_title": "Key Account Executive",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364586886/",
    "job_id": "4364586886",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive / Assistant Manager - Accounts - (For Sajeeb Group) - Job ID - 1459178",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364467105/",
    "job_id": "4364467105",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Key Account Manager (KAM) - For Divergent Technologies Limited - Job ID: 1458723",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364495907/",
    "job_id": "4364495907",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Executive- For B & T Group- Job ID: 1458845",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364725754/",
    "job_id": "4364725754",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive/Sr. Executive Key Account Manager (Property/Vehicle)- For Bikroy.com - Job ID: 1459884",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364457248/",
    "job_id": "4364457248",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Sr. Executive, Accounts- For Nutrition Depot- Job ID: 1458851",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373528644/",
    "job_id": "4373528644",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Account Manager for Daffodil Electric Company Ltd",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Responsibilities:Maintain and oversee day-to-day accounting operations of the companyPrepare and maintain financial statements, reports, and records accuratelyHandle accounts payable & receivable, bank reconciliation, and cash flow managementEnsure proper bookkeeping in accounting software and registersAssist in monthly, quarterly, and annual financial closingMonitor expenses and ensure cost control as per company policyCoordinate with management regarding financial planning and budgetingHandle VAT & Tax related activities including VAT calculation, return submission, tax deduction, and compliance with NBR regulationsPrepare and submit monthly VAT returns, tax returns, and related statutory reports within deadlineEnsure compliance with company policies, accounting standards, and regulatory requirementsSupport audit activities and provide necessary financial documentsJob RequirementsApplicants of any gender are welcome to apply. Preferred degrees are Bachelor’s degree in Accounting, Finance, or a related field, Professional Accounting certification will be an added advantage.Preferred institutions are Not specified.Preferred certifications are Professional accounting certification.Preferred Industry Type are Lift & Escalator Supplier..Experience must be up to 3 years.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364539325/",
    "job_id": "4364539325",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Account Manager - (For Mart Promoters) - Job ID - 1459233",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Mart Promoters is looking for Account ManagerJob Description / ResponsibilityResponsible for all aspects of accounting (accounts payable, accounts receivable, billing, general ledger entries, bank reconciliation, credit card expense report reconciliation, cash applications, collections, and payroll) Responsible for delivering timely and accurate financial processing, month end close, cash management reports, and balance sheet reconciliationResponsible for cash management, including performing international wire transfers, ACH payments, and maintaining lines of creditMaintain professional banking relationshipsProcess new customer credit references and assign credit limits and termsCoordinate and direct the development and preparation of budgets, forecasts, and projectionsDetermine internal audit scope and develop annual plansReview payroll taxes and ensure timely payment of payroll and corporate taxes by payroll servicePrepare State Sales & Use Taxes: quarterly; semi-annually; or annually for CA, CT, FL, GA, & PAMaintain foreign currency exchange tablesPrepare monthly, quarterly, and annual financial statements, bank reports, and various detailed analysis reports, including MISC-1099 for sales agentsMaintain files and comply with record retention requirementsProcess payroll using a payroll serviceHire and terminate employeesUpdate and post company paid holidaysNotify employees when time and attendance records have been satisfied to join the various benefit programs, including health, and Simple IRA programsFile benefit forms with the various agenciesAct as liaison between department managers and staffing agencies when utilizing temporary employeesNegotiate the company’s insurance policies annually or as often as fiscally beneficial (physical damage, liability, worker’s compensation) and oversee the claims submission process to ensure loss control measures are being adhered toMeet with the various agencies, on an annual basis, that maintain the benefit programs and review costs and benefitsEducational RequirementsMaster of Professional Finance (MPF)Experience Requirements5 to 7 year(s)The applicants should have experience in the following business area(s): Group of CompaniesJob LocationChattogram",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2921144077/",
    "job_id": "2921144077",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Philips hiring Account Manager-US & MATC, Bangladesh ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4147776750/",
    "job_id": "4147776750",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Optimizely নিয়োগ",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362115689/",
    "job_id": "4362115689",
    "source": "linkedin",
    "company_name": "Grameen HealthTech Limited",
    "job_title": "Management Accountant",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionGrameen HealthTech Limited, a subsidiary of Grameen Group under Grameen Telecom Trust, is transforming healthcare in Bangladesh through digital, on-demand, end-to-end health services. Rooted in a strong legacy of social responsibility and innovation, the company delivers comprehensive healthcare solutions ranging from preventive to specialized care. By leveraging technology to overcome geographical barriers, it ensures accessible, personalized, and high-quality healthcare, with a strong focus on clinical excellence, customer experience, and long-term community wellbeing.Role ObjectiveAs a Management Accountant at Grameen HealthTech Limited, you will bridge the gap between traditional accounting and strategic decision-making. Beyond day-to-day financial operations, your primary focus will be providing the internal management team with the data, analysis, and insights necessary to drive the company’s growth, optimize costs, and ensure long-term financial sustainability.Department: Finance & AccountsLocation: Head Office, DhakaReports to: Chief Financial Officer (CFO)Key Responsibilities1. Revenue Assurance & Billing OperationsRevenue Integrity: Implement revenue assurance protocols for all products (B2B & B2C) to prevent leakage and ensure 100% billing accuracy.Invoicing & Dispatch: Generate invoices for all services and ensure timely dispatch to clients, partners, and relevant parties.Reconciliation: Reconcile sales data with collections to ensure all rendered services are properly accounted for.2. Strategic Analysis & Business SupportPartner with B2B, B2C, and Operations departments to evaluate business cases and service viability.Conduct feasibility studies and provide financial recommendations (Approve/Reject/Modify) for new projects or service launches.Analyze the company’s cost structures and develop comprehensive cost optimization strategies for the CFO to enhance profitability.3. Budgeting & Financial ControlLead the preparation and coordination of the Annual Budget.Perform variance analysis (Actual vs. Budget) and implement regular controls to ensure departmental spending remains within limits.Monitor Key Performance Indicators (KPIs) to track business health and financial trajectory.4. Reporting & MISPrepare and present Weekly MIS reports for the Management Committee, highlighting trends, revenue performance, and operational hurdles.Generate monthly financial statements, including Income Statements and Balance Sheets, ensuring they reflect the true economic state of the business.5. Operational Excellence & ComplianceOversee day-to-day bookkeeping and ledger maintenance using Tally accounting software.Calculate Tax and VAT obligations, prepare returns, and ensure 100% compliance with tax authority deadlines.Requirements & QualificationsEducation: BBA/MBA in Finance or Accounting. Professional enrollment or part-qualification in CMA, ACCA, or CA is highly preferred.Experience: 5-7 years of experience with a strong analytical background and a proven management accounting mindset.Technical Skills: Advanced proficiency in Tally Prime/ERP. Expertise in MS Excel (financial modeling, data visualization, and complex formulas).Competencies: Strong commercial acumen, ability to challenge the status quo with data-driven insights, and excellent presentation skills.Why Join Grameen HealthTech?This role offers a unique opportunity to move beyond \"record-keeping\" and become a strategic partner in a mission-driven organization. You will have a direct impact on how we scale our health-tech solutions to serve the community while ensuring the financial robustness of our operations.How to ApplyInterested candidates should submit their CV and a cover letter highlighting their experience to hr@ghl.healthcare with the subject: \"Application for Management Accountant – [Your Name]\".",
    "extraction_method": "html-fallback"
  }
]