[
  {
    "url": "https://www.linkedin.com/jobs/view/4374232827/",
    "job_id": "4374232827",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Asst. Manager-Admin (For A Well Reputed Company) - Job ID : 1461315",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Well Reputed Company is looking for Asst. Manager-AdminJob Description / ResponsibilityOversee day-to-day administrative functions including front desk, housekeeping, security, and canteen servicesEnsure compliance with company policies and statutory requirements related to factory administrationMaintain and manage factory documentation, records, and reportsSupervise the maintenance of factory buildings, offices, utilities (power, water), and other infrastructureCoordinate with the technical/maintenance department for facility upkeep and repairsManage inventory and procurement of administrative supplies, stationery, and other non-production materialsOversee the factory transport system (employee buses/vehicles) and parking managementEnsure a safe, clean, and productive work environment for all employeesImplement and monitor security protocols in coordination with security agenciesAssist in organizing employee welfare activities and eventsLiaise with government authorities for licenses, inspections, and renewals related to factory administrationSupport the implementation of safety standards and protocols across the facilityManage documentation for audits and ensure all administrative areas are audit-readyLead, train, and motivate the administrative support staffAssign duties and monitor performance to ensure high standards of serviceEducational RequirementsMaster of Business Administration (MBA)Skills Required: Knit and Woven garment manufacturingExperience Requirements5 to 8 year(s)The applicants should have experience in the following business area(s): GarmentsJob LocationNarayanganj (Araihazar)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374283008/",
    "job_id": "4374283008",
    "source": "linkedin",
    "company_name": "TalentPop App",
    "job_title": "Executive Partner",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Elevate leadership. Drive results. Be the backbone of our success.At TalentPop, we’re changing the game for e-commerce brands by connecting them with world-class talent. As we grow, we’re looking for a pivotal Executive Partner to serve as the strategic right hand for our leaders. This is more than an administrative role—it's a chance to directly impact how our executives and founders operate and scale the business.Your MissionYou’ll be a force multiplier, anticipating needs and managing the flow of information to keep leaders focused on what matters most. Your responsibilities include:Mastering the calendar: Proactively managing complex schedules, meetings, and travel to maximize efficiency.Owning the inbox: Acting as a gatekeeper and first responder to manage communications and prioritize key messages.Driving special projects: Taking charge of projects from start to finish with a proactive, solutions-oriented mindset.Building connections: Serving as a professional, confidential liaison between internal teams and external stakeholders.What We NeedExperience: More than 6 months of experience as an administrative or executive assistant, preferably supporting high-level executives.Communication: A clear, confident, and discreet communication style, both written and verbal.Adaptability: The ability to thrive in a fast-paced, high-pressure, and often ambiguous environment.Tech-Savvy: A natural comfort with technology and a rapid learning curve.Availability: Must be available full-time (40 hrs/week) during U.S. business hours.Remote Work SetupInternet: A stable DSL, cable, or fiber internet connection (at least 25 Mbps download and upload).Hardware: A personal PC or laptop with an i5 processor (or equivalent).Why You’ll Thrive Here100% Remote: Enjoy the freedom to work from anywhere.Career Growth: We invest in your development with opportunities for advancement, learning tools, and regular feedback.Comprehensive Benefits: We offer paid time off, and health and dental insurance (or a stipend).Collaborative Culture: Join a supportive team where your contributions are highly valued and make a real difference.To apply, include the code EA in your submission. We can't wait to see how you'll help us build the future of e-commerce.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374552687/",
    "job_id": "4374552687",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive / Sr. Executive- Finance & Accounts (For Bengal Airlift Ltd.)-Job ID: 1461941",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Bengal Airlift Ltd. is looking for Executive / Sr. Executive- Finance & AccountsJob Description / ResponsibilityFitsAir, Sri Lanka’s first private airline founded in 1997, has been connecting travelers across South Asia and beyond with its hub in Colombo. Today, the airline proudly operates flights to Dhaka, Dubai, Chennai, and Kuala Lumpur, offering seamless connectivity and trusted service. Expanding its wings further, FitsAir launched the Dhaka–Colombo route in April 2024, opening new horizons for Bangladeshi travelers.In Bangladesh, Bengal Airlift Limited serves as the General Sales Agent (GSA), representing FitsAir with passion and professionalism. Together, we carry the inspiring tagline “Friends in the Skies”—a promise of comfort, reliability, and friendship in every journey.This position is responsible for managing the financial affairs of the organization by maintaining accurate records, ensuring compliance with financial regulations. Key duties include bookkeeping, handling accounts payable and receivable, preparing financial reports.Job Responsibilities:KIU Portal ManagementManage passenger agents' accounts by processing top-ups, debit-credit and deductions through the KIU portal as per operational needs.Voucher PreparationPrepare various financial vouchers, including payment, receipt, and journal vouchers, maintaining accuracy and compliance with financial policies.Government Challan PreparationPrepare government challans for passenger (PAX) and cargo services in accordance with regulatory requirements.RTGS, Pay-Order & Cheque PreparationPrepare RTGS, Pay-Order & cheques for various payments and fund transfers.Payment Requisition, Invoice, DN & CN PreparationDraft and process payment requisition, invoice, debit and credit notes accurately.Liaison with Internal Audit, Sales & Reservation TeamMaintain effective communication and coordination with the Internal Audit, Sales & Reservation Department.Bank Reconciliation Statement (Monthly)Detect errors or omissions in cash records and ensure accuracy.Profit & Loss Statement (Assist)Assist in preparing Profit and Loss Statement (P&L).Sales Report Reconciliation & Update to ERPEnsure accurate and timely sales report reconciliation and ERP entry.Refund Final DisbursementEnsure accurate refund disbursement to KIU agents.Cash & Cheque Received and DepositedEnsure proper collection and deposit to bank.Money Receipt Preparation & IssuancePrepare and issue money receipts.Maintain Document FilesEnsure accurate maintenance of all accounts-related files.AIT Certificate PreparationPrepare and provide AIT Certificates to customers.E-mail & Phone CommunicationMaintain effective communication with agents, passengers, vendors and others.Educational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceCA CC PreferableExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): AirlineJob LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374206448/",
    "job_id": "4374206448",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Junior Accounts Officer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company Name: Rangpur Dairy and Food Products LimitedLocation: Dhaka, RangpurJob Type: Full-TimeWorkplace Type: Full-timeJob ID: IJOB202616159Accounting & Bookkeeping: Maintain daily books of accounts, including cash book, bank book, and ledger, ensuring all financial transactions are recorded accurately and timely. Prepare journal entries, vouchers, and supporting documents while maintaining proper documentation and filing of accounts records.Accounts Payable & Receivable: Handle accounts payable and receivable processes, prepare and verify bills, invoices, and payment vouchers. Follow up on outstanding receivables and vendor payments to ensure timely settlements.Bank & Cash Management: Prepare bank reconciliation statements (BRS) and monitor cash and bank balances. Handle cheques, deposits, and bank correspondence efficiently.Supervision (for Senior Accounts Officer): Guide and supervise junior accounts staff, review their work to ensure accuracy, and support training and task allocation.Coordination & Software Use: Coordinate with relevant departments and utilize accounting software to streamline financial processes and reporting.Requirements Experience: 2+ years Education: Skills: back office operations, accounting, accounts reconciliation, accountants, accounting software, accounts payable and receivable, knowledge of accounting software, banking operations, proficiency in accounting software, basic accounting knowledge Last Date of Application: 08 March 2026",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374534968/",
    "job_id": "4374534968",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Jr. Officer (Accounts) (For Matamuhury Infrastructure Development (Pvt.) Ltd.) - Job ID - 1461716",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Matamuhury Infrastructure Development (Pvt.) Ltd. is looking for Jr. Officer (Accounts)Job Description / ResponsibilityVerify invoices, receipts, and financial documents for accuracy.Maintain daily financial operations including accounts payable/receivable, and ledger entries.Process and manage payroll, including ensuring timely payments and deductions.Perform bank reconciliations and manage cash book and bank book entries.Maintain fixed asset registers and monitor inventory movement.Highly performer on Microsoft Office, especially on word & excel and accounting software.Strong attention to detail and accuracy in financial record-keeping.Ability to work under pressure and meet deadlines.Prepare monthly, quarterly, and annual financial reports for management review.Support the audit process by preparing necessary documentation.Educational RequirementsBachelor/HonorsAdditional RequirementsFreshers are encouraged to apply.Job LocationDhaka (Vatara)SalaryTk. 13000 - 15000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377152297/",
    "job_id": "4377152297",
    "source": "linkedin",
    "company_name": "A.P. Moller - Maersk",
    "job_title": "Project Team Assistant",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374576890/",
    "job_id": "4374576890",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Front Desk Executive (Merchandising Department)",
    "location": "Nārāyanganj, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374229831/",
    "job_id": "4374229831",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Officer - For A Very Well Reputed Company - Job ID - 1461301",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374278270/",
    "job_id": "4374278270",
    "source": "linkedin",
    "company_name": "TalentPop App",
    "job_title": "Executive Partner",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374863248/",
    "job_id": "4374863248",
    "source": "linkedin",
    "company_name": "TalentPop App",
    "job_title": "Executive Operations Specialist",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374553154/",
    "job_id": "4374553154",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager/ Sr. Treasury Executive- Bank Reconciliation- For Advanced Chemical Industries PLC (ACI)- Job ID: 1461113",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374542945/",
    "job_id": "4374542945",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Executive / Sr. Executive - For Transco Medical System - Job ID: 1462219",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376042434/",
    "job_id": "4376042434",
    "source": "linkedin",
    "company_name": "Magpie Nest Group",
    "job_title": "Assistant Manager / Manager, Accountancy Service BPO Operation (UK Region)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Assistant Manager / Manager, Accountancy Service BPO Operation (UK Region)Location: Magpie Nest Group HQ (Banashree, Dhaka)Employment Type: Full-Time (On-site)Working Days: Monday to FridayWorking Hours: 11:30 AM - 08:30 PM (Aligned with UK Business Hours)Magpie Nest is seeking a specialised Manager to exclusively oversee the Accountancy Service BPO Operation of our UK-based clients from our Dhaka office. If you have a strong command of UK accounting standards, HMRC regulations, and cloud-based financial software, we want you to lead our cross-border financial reporting.Our Core Values:Strive for excellence and continuous improvement.Grow together with loyalty and a collective mindset.Value honest and direct communication.Key Responsibilities: VAT & Accounts Department Oversight:Oversee and ensure the standardisation and centralisation of accounting processes across all client accounts.Ensure the development and implementation of uniform accounting policies and procedures for efficiency across client accounts.Monitor financial records, transactions, and reconciliations for all client accounts, ensuring accuracy and compliance.Ensure timely and accurate preparation of monthly, quarterly, and annual financial statements for clients.Manage compliance with local tax laws, financial regulations, and audit requirements for all clients.Oversee cash flow, accounts payable/receivable, and budget adherence for client accounts.Supervise cost analysis and reporting to assess expenses and optimize financial performance for clients.Act as the key point of contact between the HQ finance team and client financial teams.Collaborate with internal departments to ensure smooth financial operations for all clients.Ensure continuous improvement in ERP/HRIS financial module implementation and usage across client accounts. Fees & Admin Department Oversight:Oversee the monitoring and management of outstanding client accounts to ensure timely payments.Supervise communication with clients to resolve payment discrepancies and ensure payment collection.Ensure the regular performance of credit checks and risk assessments on clients to minimise financial risk.Oversee the maintenance of accurate client records in the accounting system.Ensure smooth collaboration between internal departments to resolve billing and payment issues for clients.Monitor reports on receivables and overdue accounts, providing insights for management review. Payroll, Company Secretarial & Self-Assessment Department Oversight:Manage the team responsible for processing and managing UK payroll for all client accounts, ensuring compliance with UK payroll regulations.Oversee the maintenance of client employee records, including payroll changes, deductions, bonuses, and benefits.Ensure accurate calculation of tax liabilities, National Insurance contributions, and other statutory deductions.Oversee the preparation and submission of HMRC submissions, including PAYE, NIC, pension contributions, and other related reports.Supervise the handling of monthly and quarterly EPS submissions for SMP/SPP and nil return payroll submissions.Ensure compliance with workplace pension submissions and auto-enrolment requirements.Oversee the management and timely submission of monthly CIS (Construction Industry Scheme) returns for clients.Ensure the accurate and timely preparation of year-end payroll reports, including P60s, P11Ds, and other statutory reports.Stay updated on UK payroll legislation changes and ensure that the team maintains compliance across all clients.Oversee the resolution of employee queries regarding payroll, tax, and deductions.Contribute to the development and improvement of payroll policies and procedures to ensure efficiency. Company Secretarial Oversight:Ensure the proper execution of company secretarial duties for UK clients, including maintaining corporate records and statutory filings.Supervise the filing of necessary documents with Companies House and ensure statutory compliance for clients.Oversee the preparation of board minutes and corporate documentation, ensuring compliance with legal requirements.Manage and ensure compliance with company secretarial regulations for all client companies.Overall Role:The Assistant Manager / Manager, Accountancy Service BPO Operation will oversee the entire accountancy service operations for the UK region. This includes ensuring that each department (VAT & Accounts, Payroll, Company Secretarial & Self-Assessment, and Fees & Admin) is functioning smoothly, meeting client expectations, and adhering to all regulatory requirements. The manager will be responsible for team coordination, process improvements, client satisfaction, and ensuring seamless collaboration across departments.What You Bring:Bachelor's/Master’s degree in Accounting or Finance (ACCA/ACA qualified or part-qualified is highly preferred).3–5 years of mandatory experience specifically managing UK accounts.In-depth knowledge of UK Tax (VAT, Corporation Tax, PAYE)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374563431/",
    "job_id": "4374563431",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Accounts and Finance - For Chemlube Limited - Job ID: 1462200",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374258255/",
    "job_id": "4374258255",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Officer- For Pharmik Group - Job ID: 1461406",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Pharmik Group is looking for Accounts OfficerJob Description / ResponsibilityManaging daily transaction flow.Updating ledger accounts.Preparing financial reports under supervision.Perform daily reconciliation of bank accounts.Maintain general ledger accounts, post journal entries, and assist with month-end/year-end closing.Process vendor invoices, manage employee expense reports, and track accounts receivable.Compile data and assist preparing financial statements.Support senior staff & internal/external audit.Assist in processing, updating, and distributing payroll.Educational RequirementsBachelor of Business Administration (BBA) in AccountingMinimum BBA in Accounting or Finance.Additional RequirementsExperience - Freshers",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374241124/",
    "job_id": "4374241124",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive, Finance & Accounts (For A Listed Reputed Pharmaceuticals Company) - Job ID : 1460741",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Listed Reputed Pharmaceuticals Company is looking for Executive, Finance & AccountsKey PointsWe the reputed company is undergoing major expansion to meet the growing need of domestic as well as export markets. Also is looking for enthusiastic, ambitious and hardworking individuals to fill up the following position in its field operations.Job Description / ResponsibilityMaintain and monitor accounts receivable records and Depot ledgers.Follow up with Depot for collection of outstanding payments.Receive payments through bank (Cheque, BEFTN, RTGS, Cash Deposit) and ensure proper recording.Prepare and verify bank deposit slips and collection documents.Perform daily bank reconciliation with accounts receivable records.Coordinate with banks regarding collection, clearing, and payment confirmation.Prepare aging reports and submit regular collection status reports to management.Resolve billing discrepancies and maintain proper documentation of receipts and adjustments.Educational RequirementsCA (CC)-Certificate LevelExperience Requirements1 to 2 year(s)Additional Requirements1 or 2 years relevant experiences will be preferableJob LocationDhaka (Gulshan)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374250726/",
    "job_id": "4374250726",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Asset & Legal Affairs- For NetCom Learning Global - Job ID: 1461660",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "NetCom Learning Global is looking for Manager - Asset & Legal AffairsJob Description / ResponsibilityRole OverviewWe are seeking a highly sophisticated, reliable, and discreet Property & Estate Manager to oversee a diverse portfolio of real estate assets, legal interests, and personal initiatives. This role requires a unique blend of operational oversight, legal coordination, and long-term project planning. You will act as the primary point of contact for all non-business property matters, ensuring that assets are maintained, staff are productive, and community-focused legacy projects are moved forward.Key Responsibilities1. Land & Property Asset ManagementLegal Oversight: Act as the lead coordinator for all land-related legal cases. Collaborate with legal counsel to monitor filings, attend hearings if necessary, and ensure all documentation is meticulously organized.Conflict Resolution: Implement long-term strategies to resolve property disputes and protect the integrity of the land portfolio.2. Residential & Commercial OversightRussell Sarder Tower: Oversee daily operations, maintenance schedules, and security. Manage on-site staff to ensure the property is functioning at peak efficiency.Dhanmondi Apartment: Complete management of both floors, including maintenance, utility management, and ensuring the premises are guest-ready or occupied according to ownership needs.3. Team Leadership & Personnel ManagementDirectly supervise a team of three full-time support staff.Coordinate daily errands, schedules, and performance reviews.Ensure a high standard of accountability and \"no-fail\" execution for all personal support tasks.4. Community & Legacy ProjectsStrategic Development: Provide administrative and operational support for long-term initiatives in the family’s ancestral village.Project Planning: Assist in the early-stage planning of a community school and other village development projects intended to benefit the local community.5. Executive Personal SupportExecute sensitive, non-business-related requests with total discretion.Manage a wide range of personal logistics, ensuring the Principal’s domestic and personal affairs run seamlessly.Candidate RequirementsCommunication: Fluency in English is mandatory. You must be able to communicate complex legal and operational updates directly to the Principal with clarity.Judgment: Exceptional decision-making skills, especially regarding legal risks and personnel management.Integrity: Proven track record of trustworthiness and handling sensitive information with the utmost confidentiality.Experience: Previous experience in high-end property management, estate management, or legal coordination is highly preferred.Accountability: A \"self-starter\" mindset—the ability to manage the portfolio without constant supervision.Compensation & LogisticsLocation: Based in Dhaka, with occasional travel to property sites or the ancestral village as required.Work Structure: Full-time, with availability for urgent matters outside of standard hours.Educational RequirementsBachelor of Real Estate (BRE)Bachelor of Law (Pass)Bachelor of Science (BSc)Skills Required: Operation & Maintenance, Legal Affairs, Legal Drafting, Conflict management, Land and LegalExperience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s):Law Firm, Real Estate,Real Estate StartupJob LocationDhaka (Dhanmondi, GULSHAN 1)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374556704/",
    "job_id": "4374556704",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Accounts Officer – For Rangpur Dairy and Food Products Limited – Job ID- 1461663",
    "location": "Rangpur Division, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374560453/",
    "job_id": "4374560453",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Relationship Officer- Relationship Manager (Retails Sales- Asset) - For Mutual Trust Bank PLC - Job ID: 1461852",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Mutual Trust Bank PLC is looking for Relationship Officer- Relationship Manager (Retails Sales- Asset)Job Description / ResponsibilityResponsible for new customer acquisition and generate positive sales lead.Ensure delivery of budgeted sales of assets on a monthly, quarterly and yearly basis.Maintain operational accuracy and minimize risk factors of business.Continuously monitoring and enhancing portfolio throw sales of financial product of the bank.Visit to current and prospective client premises and developers regularly to enhance number.Maintain and develops relationships with developers to provide preferred lender services for affordable units and buyers.Submitting daily sales call report to the supervisor.Ensure to deliver consistently high level of customer service and effectively deal with the customer service in order to maintain high degree of customer satisfaction.To ensure the submitted customer application and documentation are complete and error free.Coordinate with various departments within the bank to ensure completion of tasks. Minimize loans discrepancies/errors in loan proposals. Work closely with RFC and different channels.Schedule sales activity.Educational RequirementsCandidate must be from UGC approved university. No 3rd division is allowed.Experience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s):BanksAdditional RequirementsGood communication, interpersonal and organization skills.Effective presentation skills.Excellent negotiation skills.Able to timely manage multiple tasks.Proficiency at both spoken and written English and Bangla.Proficient in Microsoft Office.Strong analytical ability and organizational skillsJob LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374559089/",
    "job_id": "4374559089",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Territory Officer, Yamaha Motorcycle (For ACI Motors Limited)-Job ID: 1462047",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371762375/",
    "job_id": "4371762375",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Research Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374976735/",
    "job_id": "4374976735",
    "source": "linkedin",
    "company_name": "MetLife Bangladesh",
    "job_title": "Bancassurance Sales Support Officer (Contractual)",
    "location": "Bogra District, Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377118652/",
    "job_id": "4377118652",
    "source": "linkedin",
    "company_name": "NTU International A/S",
    "job_title": "Public Finance and Investment Modalities Consultants",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374243610/",
    "job_id": "4374243610",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Technical Quality Controller - For Faisal Spinning Mills Limited - Job ID: 1461211",
    "location": "Habiganj District, Sylhet, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Faisal Spinning Mills Limited is looking for Technical Quality ControllerJob Description / ResponsibilityMonitor and control all quality-related issues as per buyer requirements.Ensure Quality Assurance of products in compliance with customer requirements and international standards.Build and maintain an efficient and competent quality team while ensuring smooth coordination across departments.Lead finished goods inspection and ensure compliance with buyer specifications.Ensure shift-wise finished goods quality and maintain records (shrinkage, GSM, hand feel, etc.) to meet buyer standards.Maintain team discipline and ensure compliance with quality procedures.Implement and monitor quality control systems throughout the production process.Execute and control the quality-related budget as per company plan.Coordinate with Production, Maintenance, and Supply Chain teams to ensure optimum quality and customer satisfaction.Approve quality samples with specific mixing ratios as per customer demand.Handle quality complaints and customer feedback sessions (export-oriented knit and woven fabric manufacturing).Operate fiber and yarn testing machines/equipment efficiently.Provide training to staff and officers.Educational RequirementsDiploma in Engineering in Textile EngineeringExperience RequirementsAt least 10 year(s)The applicants should have experience in the following business area(s):SpinningJob LocationHabiganj (Madhabpur)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374537965/",
    "job_id": "4374537965",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "SEO Expert / Digital Marketer (For Asia Continental Group (BD)-Job ID: 1462234",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364515373/",
    "job_id": "4364515373",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager, Sales Admin & Credit Management- For National Agricare Group- Job ID: 1458595",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "National Agricare Group is looking for Assistant Manager, Sales Admin & Credit ManagementJob Description / ResponsibilitySales, collection, dues and overdue analysis and preparation of reports.Analyzing information in credit control, preparing reports and implementing decisions of the authorities.Analyzing and preparing performance reports of field officers of the sales department.Performing the sales target setting process.Preparing and obtaining approval of letters, office notes of the sales department.Maintaining and managing contracts, approvals and other important documents related to the sales department.Preparing various types of reports for management to make data-based decisions.Coordinate with One ICT for ERP and Apps related work to digitalize/technologically develop the sales department and related activities.Collecting and coordinating Basic Market Information through regional heads.Supervising the activities of executives (Sales Admin).Also, properly perform any duties assigned by the supervisor.Educational RequirementsBachelor of Business Administration (BBA)Master of Business Administration (MBA)Bachelor of Business Administration (BBA) in Accounting/EconomicsMaster of Business Administration (MBA) in Accounting/EconomicsExperience RequirementsAt least 5 year(s)Additional RequirementsBBA/Hon’s (Major in Accounting/Economics) and MBA/Master’s (Major in Accounting/Economics) from any reputed university.Experience in Data science/Data analytics is proffered for this position.At least 5 years experience.Presentable and professional appearance is required.Job LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374547911/",
    "job_id": "4374547911",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Sr. Executive / Asst. Manager (Credit Realization ) - (For Green Land Town Development Ltd.) - Job ID - 1461726",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Green Land Town Development Ltd. is looking for Sr. Executive / Asst. Manager (Credit Realization )Job Description / ResponsibilityGreen Land Town Development Ltd. is one of the most promising and trusted names in the real estate sector of Bangladesh. With a strong commitment to quality, transparency, and customer satisfaction, we are now seeking talented professionals to join our team and uphold our standard of excellence.Job ResponsibilitiesMaintain strong relationships with clients and provide land-related information.Verify, manage and preserve all project land documents (Mutation, Khatian, Porcha).Prepare and organize land files and necessary documentation.Handle customer queries and complaints professionally and provide timely solutions.Assist in client meetings and perform field visits when necessary.Keep proper records of client service requests and update the management regularly.Perform any other responsibilities assigned by the management.Educational RequirementsBachelor of Business Administration (BBA)Bachelor of Commerce (BCom)Skills Required: MS Office, Credit Realization, MS Excel, MS WordExperience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s): Development Agency,Real Estate,DeveloperAdditional RequirementsAbility to work under pressure and maintain professionalismMust be honest & Well ManneredJob LocationDhaka (Mohakhali)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374239679/",
    "job_id": "4374239679",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager/Asst. Manager (Credit Control) - For Next Accessories Ltd. - Job ID :1461135",
    "location": "Rupganj Upazila, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4090940513/",
    "job_id": "4090940513",
    "source": "linkedin",
    "company_name": "Job ID : 1314717",
    "job_title": "Accounts and Admin Officer (For LAMB)",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4069387031/",
    "job_id": "4069387031",
    "source": "linkedin",
    "company_name": "SEED Project",
    "job_title": "Accounts Officer",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4022679292/",
    "job_id": "4022679292",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Junior Officer-Finance (For Rangpur Dairy and Food Products ...",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350616666/",
    "job_id": "4350616666",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Senior Officer/Officer, Finance & Accounts- For Akij Resources- Job ID",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3339408668/",
    "job_id": "3339408668",
    "source": "linkedin",
    "company_name": "Citi নিয়োগ",
    "job_title": "Officer, Treasury Operations",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2220720680/",
    "job_id": "2220720680",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Analyst, Accounting & External Reporting",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4262377077/",
    "job_id": "4262377077",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Analyst, Markets Treasury, HSBC Bangladesh (Assistant Vice ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3970718853/",
    "job_id": "3970718853",
    "source": "linkedin",
    "company_name": "Fund & Treasury Manager",
    "job_title": "SAJIDA Foundation",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3966392376/",
    "job_id": "3966392376",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Investment Analyst Dhaka, Bangladesh LinkedIn",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3975148910/",
    "job_id": "3975148910",
    "source": "linkedin",
    "company_name": "For Maslin Capital Limited (Job ID : 1271420)",
    "job_title": "Investment Analyst",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]