[
  {
    "url": "https://www.linkedin.com/jobs/view/4376977052/",
    "job_id": "4376977052",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Audit Officer, ICCD (Officer to SEO) - For The Premier Bank PLC- Job ID: 1463154",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "The Premier Bank PLC is looking for Audit Officer, ICCD (Officer to SEO)Job Description / ResponsibilityThe Premier Bank PLC., with the network of 136 branches and 67 sub-branches across the country, is on a growth trajectory to expand its network and services nationwide. As part of its commitment to corporate goals, financial inclusion, good governance, and strong internal control & compliance, the Bank is looking for qualified and experienced professionals for Audit & Inspection Unit under Internal Control & Compliance Division.Job Responsibilities:Conduct Risk Based Internal Audits across Branches/Head Office’s Divisions/Departments/Units and Subsidiary of the Bank to assess the adequacy and effectiveness of internal controls and compliance with bank policies and regulatory requirements.Prepare clear, concise, and well-documented audit reports, outlining key findings, root causes, risk implications, and practical, actionable recommendations.Review and evaluate the effectiveness of internal controls across financial reporting, operations, and regulatory compliance.Provide insight to the Head of Audit and concerned Unit Head toward identifying potential audit areas and preparing the annual audit plan and deliver audits in line with the annual plan, ensuring strong risk coverage.Identify weaknesses or control gaps, recommend improvements, and enhance operational efficiency.Assess risk management practices, covering credit, market, liquidity, and operational risks.Support fraud prevention and detection via forensic audits and control mechanisms.Communicate audit outcomes with Senior Management, the Board, and relevant committees.Monitor and follow up on the implementation of audit recommendations.Coordinate with external auditors and regulators, ensuring timely audit support and compliance.Perform any other tasks assigned by the reporting line.Educational RequirementsBachelor/Honors4-years graduation in any discipline from a reputed university with no third class/division or equivalent CGPA in the academic record. Having post-graduation degree will be considered an added advantage.Professional qualifications such as ACCA, CIA, CA (Partly Qualified) will be an added advantage.Experience Requirements3 to 7 year(s)The applicants should have experience in the following business area(s):BanksAdditional RequirementsMinimum 03 to 07 years of experience in internal/external audit, risk management, or compliance activities;Candidates having strong hands-on experience on regulatory requirements such as Risk Based Supervision (RBS), ECL as per IFRS-9, Basel-III, stress testing, GAAP and IIA’s internal Audit framework, data analytics will be given preference;Candidates having strong exposure to Credit and Foreign Trade operations will be given preference.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376234849/",
    "job_id": "4376234849",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive-Financial Audit (Inhouse) - (For A Renowned Company) - Job ID - 1463213",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Renowned Company is looking for Senior Executive-Financial Audit (Inhouse)Job Description / ResponsibilityConduct thorough audits of financial statements, accounting records, and internal controls to assess the accuracy, completeness, and integrity of financial information.Responsible to prepare the policy and procedure. In addition, strictly follow up/monitoring the proper executionEvaluate the effectiveness of internal controls and identify areas for improvement to mitigate risks and enhance operational efficiency.Perform risk assessment analysis to identify potential areas of financial or operational vulnerabilities.Develop audit programs and testing procedures to address identified risks and ensure compliance with relevant regulations and standards.Prepare comprehensive audit reports documenting findings, recommendations, and corrective actions.Communicate audit results and recommendations to the top management in a clear and concise manner.Collaborate with cross-functional teams to implement audit recommendations and monitor remediation efforts.Stay abreast of changes in accounting regulations, auditing standards, and industry best practices to ensure compliance and continuous improvement.Provide guidance and training to staff on internal control procedures, compliance requirements, and audit methodologies.Assist in special projects and initiatives as assigned by top management.Educational RequirementsBachelor of Business Administration (BBA) in AccountingSkills Required: Financial Reporting, MIS Reporting, Presentation and ReportingExperience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s): Manufacturing (FMCG),Audit Firms /Tax ConsultantJob LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378252713/",
    "job_id": "4378252713",
    "source": "linkedin",
    "company_name": "Rahman Knit Garments Ltd.",
    "job_title": "Assistant Manager- Finance & Accounts",
    "location": "Nārāyanganj, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Well Reputed Group of Manufacturing Companies is looking for an Assistant Manager in Finance & Accounts departmentWe are seeking an accomplished and driven candidate to take responsibilities of Accounts and Finance operations and strategies within the organization. This critical leadership role demands expertise in accounting knowledge, financial planning, accounting experience, strategic decision-making & bold leadership to ensure financial stability and propel the company toward its growth objectives.Key ResponsibilitiesAccounting Operations (Priority Focus): 1. Oversee and manage the day-to-day operations of the accounting department, including accounts payable, accounts receivable, payroll, and general ledger. 2. Ensure timely and accurate preparation of financial reports, including monthly, quarterly, and annual statements if required 3. Supervise the reconciliation of accounts and ensure all financial transactions are recorded accurately. 4. Maintain and monitor the chart of accounts and ensure its alignment with business operations. 5. Implement and improve internal controls to safeguard the company’s financial assets and ensure the integrity of financial data. 6. Coordinate and ensure the successful completion of month-end and year-end closings. 7. Manage fixed asset accounting, including tracking and depreciation schedules. 8. Work closely with internal & external auditors to ensure smooth and successful audits and promptly resolve any audit issues. Financial Reporting and Compliance: 1. Prepare and present accurate financial statements in accordance with applicable accounting standards (e.g., IFRS, GAAP). 2. Ensure compliance with all tax laws, including VAT, income tax, and other statutory requirements. 3. Review and file all necessary tax returns and ensure timely payments. 4. Stay updated on changes in accounting regulations and ensure compliance across the department. Budgeting and Financial Analysis: 1. Collaborate with senior management to develop and manage annual budgets and forecasts. 2. Monitor budget utilization and provide variance analysis to ensure alignment with financial goals. 3. Identify areas of cost savings and process improvements in the accounting and finance operations. Team Leadership and Development: 1. Lead, supervise, and mentor a team of accounting professionals to ensure high performance. 2. Assign tasks, set performance objectives, and conduct regular performance reviews. 3. Identify opportunities for development within the department to improve the team’s efficiency and accuracy. Internal Controls and Risk Management: 1. Develop, implement, and monitor internal accounting policies and procedures to minimize errors and fraud. 2. Conduct regular internal reviews of accounting processes and recommend process improvements. 3. Ensure accurate and secure record-keeping of financial data for future reference.RequirementsEducation• Master's degree specializing on Finance/Accounting or a related discipline with a strong academic record.• ACA/CA, FCA/FCMA, CPA/CMA, or similar Professional degree holders will be given preference.Experience• 6-8 year(s) in Accounts/Finance discipline & over 2 year(s) in managerial position• Extensive knowledge & practical working experience in VAT & TAX regulations, laws & submissions• The applicants should have experience in the following business area(s): Garments, Textile, Manufacturing Industry etc.Skills• In-depth knowledge of accounting principles, standards, and practices (e.g., IFRS, GAAP).• Advanced Excel Capabilities & Proficiency in Financial software tools & ERP software• Strong analytical, communication, and leadership skills.• Attention to detail and ability to thrive in a fast-paced environment.Will be Prioritized• Highly motivated & result-oriented with strong work ethics and commitment to excellence.• Passionate about working in a fast-paced and dynamic environment.• Fluent in Speaking & Writing in Bangla & English.• Meticulous attention to detail with excellent organizational skills.Job LocationNarayanganjCompany Websites:https://rkgltd.com/ , https://maksudaspinning.com/ & http://hitech-bd.com/Drop Your CV at-career@rkgltd.com",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376247179/",
    "job_id": "4376247179",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "AGM/ DGM - Finance & Accounts (Banking & Treasury Management) - (For A reputed group of company) - Job ID - 1463087",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A reputed group of company is looking for AGM/ DGM - Finance & Accounts (Banking & Treasury Management)Job Description / ResponsibilityServe as the primary lead for all banking, finance, and treasury management activities.Develop and maintain strong strategic relationships with banks and financial institutions.Optimize the company’s capital structure, borrowing costs, and working capital efficiency.Negotiate banking facilities, credit lines, interest rates, and charges.Oversee daily treasury operations, cash flow planning, and optimal utilization of surplus funds.Prepare short-term and long-term cash flow forecasts.Manage financial and liquidity risks and ensure compliance.Develop and implement process improvements.Educational RequirementsMaster of Business Administration (MBA)Master of Business Studies (MBS)Bachelor of Business Studies (BBS)Bachelor of Business Administration (BBA)Bachelor’s/ Master’s degree in Accounting / Finance with CA CC will be preferred.Experience Requirements12 to 15 year(s)The applicants should have experience in the following business area(s): Manufacturing (FMCG)Additional RequirementsStrong experience in banking, treasury, and financial managementExcellent analytical, negotiation, and risk management skillsStrong communication skillsAbility to coordinate with multiple stakeholdersJob LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375503190/",
    "job_id": "4375503190",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Project Lead, ERP Upgradation & Implementation, Accounts & Finance - For SQ Group - Job ID: 1462477",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "SQ Group is looking for Project Lead, ERP Upgradation & Implementation, Accounts & FinanceJob Description / ResponsibilityLead core ERP upgradation and implementation teams in alignment with organizational growth and diverse operational dynamics.Evaluate existing ERP gaps and define future-state business processes in close collaboration with functional stakeholders.Coordinate with supervisors and governance bodies to ensure approvals, compliance, and progress tracking.Conduct As-Is and To-Be process mapping for finance while working cross-functionally with operations, supply chain, planning, and marketing.Ensure ERP processes follow RMG best practices, eliminate manual workarounds, and promote a single-touch, system-driven operating model.Manage the full ERP project lifecycle using structured methodologies and detailed project Gantt charts.Ensure timely completion of blueprinting, process optimization, and User Acceptance Testing (UAT).Proactively identify project risks and implement effective mitigation plans.Oversee master data governance and ensure accurate data migration for items, styles, buyers, vendors, costing, and general ledger.Facilitate seamless integration between ERP and all internal and external systems.Lead change management initiatives to ensure strong user adoption across head office and factory locations.Design and deliver end-user training on financial operations, SOPs, and user manuals.Act as a change champion to minimize resistance and maintain business continuity.Manage Go-Live readiness, cut-over planning, and post-implementation stabilization.Monitor system performance, resolve post-Go-Live issues, and drive continuous improvement through ERP enhancement roadmaps.Educational RequirementsMaster of Business Administration (MBA) in AccountingMaster of Business Administration (MBA) in FinanceBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceProfessional accounting qualifications such as CA, CPA or equivalent are highly preferred.Strong proficiency in ERP-based accounting systems.Skills Required: ERP Software, Microsoft Office, Microsoft ExcelExperience Requirements6 to 10 year(s)The applicants should have experience in the following business area(s):Garments,TextileAdditional Requirements5+ Years leadership experience in ERP/ SAP Management in RMG.Good knowledge of banking transactions, loan processing, and reconciliation.Strong command of MS Excel and financial documentation.Good knowledge of banking transactions, loan processing, and reconciliation.Strong command of MS Excel and financial documentation.Strong project and stakeholder management expertiseStrong understanding of ERP systems for RMG (e.g., SAP, Oracle, Microsoft Dynamics etc.).Job LocationDhaka (Gulshan)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375295301/",
    "job_id": "4375295301",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager- MIS - (For ShopUp) - Job ID - 1462868",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "ShopUp is looking for Manager- MISJob Description / ResponsibilityThe scope of Manager- MIS role is to ensure accurate, timely and quality Financial and Business Performance Reports for External (Group/Board) and Internal Management, along with consolidated group financials and insightful analyses for Management decision support.Major Responsibilities:Prepare monthly, quarterly and annual Consolidated FinancialsPrepare Management Reports, covering both Financial & Non-Financial dimensions, with critical assessment of numbers/facts & through explanation of underlying performanceAssist line manager with speaker notes for monthly review meeting.Support Investor Relations with necessary financial information & insights to prepare quarterly/annual publication.Serve as the SPOC for ERPRepresent the company during statutory and external audits of the group & its subsidiariesPerform intercompany fund flow reconciliation across all entitiesConduct periodic reconciliation between MIS (Management Information System) and Financial Statements (FS).AOP & budget preparationEducational RequirementsBachelor of Business Administration (BBA)Master of Business Administration (MBA)BBA/MBA in Finance/Accounting from a reputed universityFull/Part qualification in professional educations ie. CA/ ACCA/ CMA will be an added advantage.Additional RequirementsProfessional Experience:Minimum 6-8 years of work experience including 3 years in the relevant field.Job LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376251393/",
    "job_id": "4376251393",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Accounts & Finance - For Bangladesh SEZ Ltd. - Job ID: 1464008",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Bangladesh SEZ Ltd. is looking for Officer - Accounts & FinanceJob Description / ResponsibilityJob Summary:The role is responsible for managing day-to-day accounting operations, including accounts payable and receivable, loan and foreign currency management, tax compliance, inventory control, and financial reporting. The position ensures accurate bookkeeping, regulatory compliance, and proper reconciliation of financial records using ERP systems (preferably Odoo).Key Responsibilities:1. Accounts Payable & Vendor ManagementTrack and monitor vendor invoices to ensure timely processing.Check and post vendor invoices against supporting documents and approvals.Prepare and review Accounts Payable aging reports.Calculate and process TDS and VDS on vendor invoices as per regulations.Reconcile vendor ledger balances periodically.2. Accounts Receivable & Customer ManagementPost customer invoices accurately in the ERP system.Record and monitor customer collections.Prepare and review Accounts Receivable aging reports.Reconcile customer ledger balances regularly.3. Loan & Interest ManagementMaintain loan accounts in both BDT and USD.Calculate and record interest in BDT and USD.Ensure accurate accounting and reconciliation of loan balances.4. Bank & Cash ManagementPerform monthly bank reconciliations and resolve discrepancies.Monitor bank transactions to ensure proper recording in the system5. General Accounting & CompliancePrepare provisional journal entries and subsequent adjustments.Maintain general ledger accounts, including foreign currency (USD) ledgers.Record and adjust foreign exchange (FX) gain/loss as required.Ensure proper accounting treatment of all transactions in the ERP system (Odoo preferred).Face External Audit (Requirements of the Management)6. Inventory & Cost ManagementMaintain inventory control with proper cost allocation.Conduct costing related to leasing land and ensuring accurate allocation.Educational RequirementsBachelor of Commerce (BCom) in AccountingMaster of Commerce (MCom) in AccountingB. Com Hons & master`s in accounting (Preferred Public University)CA CC from a reputed CA Firm Or Part qualify from ICMAB.Experience RequirementsAt least 4 year(s)The applicants should have experience in the following business area(s):Manufacturing (Light Engineering and Heavy Industry)Additional RequirementsAt least 4 Years of working experience in an organization maintaining 100% compliance in accounts maintenance.Required Skills & Competencies:Strong knowledge of accounting principles and financial reporting.Practical experience in Accounts Payable, Accounts Receivable, and General Ledger.Sound understanding of foreign currency accounting and FX adjustments.Experience with ERP systems (Odoo preferred).Good analytical and reconciliation skills.Knowledge of TDS/VDS regulations and compliance.Attention to detail and strong organizational ability.Sound Knowledge on IAS and IFRS.Job LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378602118/",
    "job_id": "4378602118",
    "source": "linkedin",
    "company_name": "ReliefWeb",
    "job_title": "Case Managers (x2)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BangladeshCase Managers (x2)OrganizationMSF - HollandPosted 26 Feb 2026 Closing date 4 Mar 2026Médecins Sans Frontières (MSF) is an international, independent medical humanitarian organization. As a non-profit, self-governed movement of over 63,000 dedicated professionals, we provide life-saving medical assistance to people affected by armed conflict, natural disasters, disease outbreaks, and exclusion from healthcare.Our work is guided by medical ethics and the principles of impartiality, independence, and neutrality. We act based on need, and when we witness injustice, we speak out. Our commitment to professionalism and humanity can mean the difference between life and death.People are our priority. At Médecins Sans Frontières (MSF)/ Artsen zonder Grenzen, we are committed to an inclusive culture that encourages and supports the diverse voices of our employees. We encourage diverse applicants including individuals of all gender identities, ages, sexual orientations, nationalities, ethnic background, religions, beliefs, social and marital status, people with different abilities and all other diversity characteristics and how they intersect.With immediate effect, for our Country Programme in Bangladesh we are looking for:Case Managers (x2)Based in Bangladesh12 monthsObjectives of the positionMédecins Sans Frontières (MSF) OCA is seeking a dedicated and experienced Safeguarding and Code of Conduct (CoC) Case Manager to join our team in Bangladesh. This pivotal position is responsible for actively managing, investigating, and advising on complaints related to CoC violations, including high-risk and complex cases. The successful candidate will play a key role in safeguarding staff, partners, patients, and community members, ensuring a survivor-centred approach and upholding MSF’s commitment to fair process and confidentiality.Main ResponsibilitiesEnsure proper handling of all misconduct complaints, including safe and confidential reception, timely acknowledgment, triage, and immediate reporting of high-risk allegations to the Safeguarding Unit and compliance with Intersectional Platform on Behaviour Standards for Case Management.Provide technical advice and support to all actors involved in case management and ensure risk-mitigation and referral measures for complainants. - respondents and witnesses, including protection, medical, psychosocial and legal referrals when appropriate.Conduct and lead case triage, risk assessments, and investigations, including evidence gathering, interviews, analysis, and recommendations.Manage investigation documentation, including archiving, minute-taking, coordination of meetings/interviews, and preparation of final reports.Build capacity of country programme teams by training and supporting staff involved in complaint handling and misconduct investigations.Propose improvements to protocols and guidelines on case management based on country programme realities.Ensure quality, confidentiality, and data protection in case management processes, including managing complaint databases and reporting statistics.Coordinate internal and external collaboration, maintain communication with the Safeguarding Unit, engage in relevant forums, and coordinate external investigation experts.Candidate ProfileBSc in law, social or organizational sciences, gender, discrimination, whistleblowing, behavioural science, human rightsMinimum 2 years of experience in identifying and addressing safeguarding concerns in a humanitarian setting, preferably a hospital setting with MSF or similar INGOExperience working in high-risk contexts in countries of operation in the humanitarian, health, or development sector is highly desired.Strong analytical and advisory skills, with the ability to handle complex, sensitive, and high-risk cases independently.Excellent verbal communication skills, including the ability to deliver difficult information sensitively and appropriately.Excellent written communication skills, including the ability to draft investigation reports and present cases to senior management succinctly.Demonstrated commitment to confidentiality, survivor-centred practice, and fair process.Fluency in English. Bangla or Rohingya desirable. Other languages are an asset.Ability to develop case strategies, conduct investigative interviews and deliver investigation reports of high quality and within short deadlinesCertification as investigator highly desirable (CHS Tier 3, CFE/ CFF/ CPA/CCEP or equivalent)How to applyApplicationIf you recognise yourself in this profile, we welcome you to apply directly via our website and upload a letter of motivation + Curriculum Vitae (in English) as one combined document.The Closing Date For Applications IsMarch 3rd 2026 at 23:59 CETInformationFor more information about the recruitment procedure, please contact Masha Petrovic (Recruiter) – masa.petrovic@amsterdam.msf.orgNo agencies please***Job detailsCountryBangladeshSourceMSF - HollandTypeJobCareer categoryMonitoring ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374983438/",
    "job_id": "4374983438",
    "source": "linkedin",
    "company_name": "NEXT Ventures",
    "job_title": "Executive – Risk & Operational Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who We AreNEXT Ventures is where ambition takes shape and movement becomes momentum. As a global platform revolutionising access to performance-based capital, we empower the world’s most driven individuals to rise. Through our flagship brand, FundedNext, we empower dreamers to become doers, and potential to turn into performance. With 500+ driven minds across five countries, we power a global rhythm—220,000+ daily users from 170+ nations, each chasing greatness in their own way.Your Role in Our MissionAs an Executive – Risk & Operational Analyst, you will play a critical role in protecting platform integrity, monitoring trading activities, and strengthening operational controls. Your responsibility is to ensure secure, stable, and transparent trading operations by identifying suspicious patterns, mitigating risks, and enhancing monitoring frameworks.You will work closely with Compliance, Trading, and Operations teams to maintain system stability, improve risk visibility, and minimize financial exposure — directly contributing to sustainable and secure business growth.How You’ll Make An ImpactRisk Monitoring & Fraud PreventionAnalyze client trading activities to identify suspicious patterns, toxic flow, and operational risks.Monitor transactions and platform behavior to detect anomalies and potential fraud.Strengthen client profiling and financial security protocols through data-driven insights.Support risk mitigation strategies and enhance internal risk control measures.Platform Oversight & Operational StabilityMonitor trading platform performance to ensure seamless operation and execution stability.Diagnose and resolve platform-related technical issues affecting execution, connectivity, or system functionality.Ensure uninterrupted trading operations through proactive monitoring and rapid issue resolution.Continuously optimize execution flow, automation processes, and operational efficiency.Data Analytics & ReportingUtilize tools such as Power BI, SQL, Python, Excel, and Google Sheets to process, visualize, and analyze risk data.Conduct trend analysis and vulnerability assessments to improve risk strategies.Generate structured reports and insights for cross-functional stakeholders.Contribute to dashboard and analytical tool development for enhanced risk visibility.Compliance & Industry AwarenessStay informed about regulatory requirements, financial security standards, and industry best practices.Ensure platform monitoring processes align with compliance expectations.Support internal documentation and operational governance improvements.What You BringBachelor’s degree in Engineering, Computer Science, Electrical & Electronic Engineering, Mathematics, Statistics, or a related analytical field.Strong analytical and investigative mindset with the ability to interpret complex datasets.Proficiency in data tools such as Power BI, SQL, Python, Excel, and Google Sheets.Familiarity with operational tools such as Notion and ClickUp.Understanding of risk controls, fraud detection principles, and financial security protocols.Strong problem-solving, decision-making, and communication skills.Fluency in English (verbal and written).1–2 years of experience in risk management, fraud monitoring, or market surveillance is preferred but not mandatory.Work StructureThis role operates on a rotational shift basis to support global markets. Shift 1: 2:00 PM – 11:00 PM Shift 2: 11:00 PM – 7:00 AMShift schedules rotate based on business requirements.Your X-FactorThinks proactively and identifies risks before they escalate.Maintains composure and analytical clarity under pressure.Operates independently with accountability and precision.Uses data to drive decisions, not assumptions.Balances operational discipline with continuous improvementYour Pay & PerksMonthly salary range: BDT 35,000 – 55,000.Festival bonus (Eligibility Condition Applies)Start your next chapter with our special honeymoon packageUnwind together at annual company retreatsGet moving with an in-house fitness trainer to keep your mind and body in syncEnjoy comprehensive health insurance — for you, your parents, your spouse, and your childrenBuild long-term security with our Provident Fund contributionNo birthday is complete without a cake and a break; both are on usKick back with game nights and all-access sports zones — billiards, foosball, PlayStation, cricket, football & badmintonOpportunities for relocation to Sri Lanka and Malaysia, subject to business needs, with travel allowancesYour Daily Source of EnergySubsidized lunchUnlimited tea & coffeeVending machine creditsYour Journey after Applying30 minute HR interview with the Talent Acquisition team memberAssessment stage 45 minute Problem Solving Interview (with talent acquisition team & department front line manager)60-minute Bar Raiser Interview (with head of department & talent acquisition lead)Why Join NEXTAt NEXT Ventures, we believe the right talent fuels breakthrough innovation. If you're driven to connect g",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376239808/",
    "job_id": "4376239808",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Accounts, R. P. Shaha University - For Kumudini Welfare Trust of Bengal (BD) Ltd. - Job ID: 1463283",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4257669749/",
    "job_id": "4257669749",
    "source": "linkedin",
    "company_name": "(TAX & VAT)",
    "job_title": "Manager",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4331439095/",
    "job_id": "4331439095",
    "source": "linkedin",
    "company_name": "For Topstar Cargo Systems Limited",
    "job_title": "VAT/TAX Consultant",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4171559668/",
    "job_id": "4171559668",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "ACCA Trainee / Finance Associate (For OTG Bangladesh)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4055764047/",
    "job_id": "4055764047",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ACCA নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4114661481/",
    "job_id": "4114661481",
    "source": "linkedin",
    "company_name": "For OTG Bangladesh (Job ID",
    "job_title": "ACCA Trainee/ Finance Associate",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/599164732/",
    "job_id": "599164732",
    "source": "linkedin",
    "company_name": "Sri Lanka and Bangladesh ...",
    "job_title": "ACCA hiring Transition Support Office",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3202470263/",
    "job_id": "3202470263",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Algorithm Generation hiring Accounts Analyst in Gulshan ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]