[
  {
    "url": "https://www.linkedin.com/jobs/view/4373780675/",
    "job_id": "4373780675",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Sales Admin - (For Bir Group Holdings) - Job ID - 1460473",
    "location": "Tejgaon Thana, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Bir Group Holdings is looking for Assistant Manager - Sales AdminJob Description / ResponsibilityWe are seeking and experience and motivated sales administrator to join our team at Bir Group Holdings – Tools Division. Sales administrator will support sales manager and sales steam to handling sales order, sales data processing, duties including managing schedule documents proposal maintaining customer and dealer, distributor relation records. The ideal candidate to attempt detail oriented and capable managing their workload efficiently.Provides essential, day-to-day administrative support to the sales team.Processing, inputting, and tracking sales orders from initiation to delivery, ensuring accuracy.Updating and maintaining accurate dealer information, contact details, and account history in the Tally software.Preparing, analyzing, and generating weekly or monthly sales reports, performance metrics, and activity tracking.Acting as a point of contact for sales queries via phone or what’s app, email, resolving issues, and providing updatesCreating invoices, processing payments, and managing sales contracts.Assisting the sales team with scheduling, preparing presentations, and coordinating with logistics or finance departments. Educational RequirementsBachelor/HonorsMastersCA (CC) / ACCA (Partly Qualified) will be considered an added advantage.Experience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s):Manufacturing (Light Engineering and Heavy Industry),Group of Companies,Automobile,Sanitary ware,Inventory/Warehouse,Battery, Storage cell,ImporterAdditional RequirementsProven work experience as a Sales Admin or similar role.Previous experience in sales administration, data entry, or Sales order processing in tally software.Proficiency in Tally software (e.g., Salesforce,) and Microsoft Office Suite, specifically Excel for data management.Strong organizational and time-management skills to handle multiple tasks under tight deadlines. Excellent verbal and written communication skills to interact with clients and internal teams. High attention to detail to ensure accuracy in orders, pricing, and dealer/distributor records. Job LocationDhaka (Tejgaon)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373792119/",
    "job_id": "4373792119",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Officer- For Ocean Trade International.- Job ID: 1461011",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Ocean Trade International is looking for Accounts OfficerJob Description / ResponsibilityRecord daily financial transactionsPrepare reports (monthly/yearly)Handle cash, bank, and paymentsMake invoices and check billsMaintain accounts payable & receivablePrepare VAT/Tax documentsKeep financial records organizedSupport audit and management decisionsEducational RequirementsBachelor/HonorsMastersSkills Required: Accounting Software, Microsoft Office, Data Entry, Analytical Skill, CalmExperience RequirementsAt most 3 year(s)The applicants should have experience in the following business area(s):Trading or Export/ImportJob LocationDhaka (Uttara)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376363387/",
    "job_id": "4376363387",
    "source": "linkedin",
    "company_name": "IOM - UN Migration",
    "job_title": "Programme Assistant",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionIntroductionEstablished in 1951, IOM is a Related Organization of the United Nations, and as the leading UN agency in the field of migration, works closely with governmental, intergovernmental and non-governmental partners. IOM is dedicated to promoting humane and orderly migration for the benefit of all. It does so by providing services and advice to governments and migrants.IOM is committed to ensuring a workplace where all employees can thrive professionally, while working towards harnessing the full potential of migration. Read more about IOM's workplace culture at IOM workplace culture | International Organization for MigrationApplications are welcome from internal and external candidates. For all IOM vacancies, applications from qualified and eligible first-tier candidates are considered before those of qualified and eligible second-tier candidates in the selection process. For the purpose of this vacancy, internal and internal-equivalent candidates are considered as first-tier candidates.Organizational Context and ScopeBangladesh country office, established in 1998, has worked closely with government entities at the national and sub-national levels, civil society organizations, local communities, and development partners to respond to evolving development and humanitarian needs. Its work covers migration governance, humanitarian response, climate action, disaster risk reduction and development. IOM prioritizes protection, inclusive service delivery, and resilience-building for displaced populations, including Rohingya refugees. The Mission also provides strategic support to the Government of Bangladesh in strengthening migration governance and strengthening systems, advancing safe and regular migration pathways, and upholding its regional and global migration commitments.The Migration Policy and Sustainable Unit in the CO aims to strengthen migration governance in Bangladesh by promoting safe, regular, orderly, and humane migration while advancing the socio-economic well-being of migrants, their families, and communities. It supports the Government of Bangladesh and key stakeholders through strengthen ing governance including capacity development, ethical recruitment, evidence-based policy development, and direct assistance to migrants and returnees. The programme also advances research, knowledge management, and regional and global policy dialogue to integrate migration into national development priorities with a strong human-rights focus.Under the overall supervision of the Deputy Chief of Mission (Development) and the direct supervision of Head of the Migration Policy and Sustainable Development (MPSD) Unit of IOM Bangladesh, the successful candidate will be responsible for supporting the management and implementation of the different programmes/projects of the unit.Responsibilities Provide general/administrative assistance in the implementation of project activities. Retrieve, compile, summarize, and present information/data on specific project topics. Support the administrative coordination with procurement and finance unit to follow up on payments of vendors, consultants and service providers. Support administrative coordination for project implementation, involving liaison with diverse organizational units or external parties to initiate requests, obtain necessary clearances, process, and follow-up on administrative actions. Draft notes for file, briefing notes for record keeping of various meetings, workshops and related events. Support the organization of meetings, workshops and training sessions. Respond to general information requests and inquiries; set up and maintain files/records. Perform other related duties as assigned. QualificationsRequired Qualifications and ExperienceEducation School diploma with three years of relevant experience; or, Bachelor’s degree in Political or Social Sciences, International Relations, Development Studies, Migration Studies, Human Rights, Law or related fields from an accredited academic institution with one years of relevant professional experience. Accredited Universities are those listed in the UNESCO World Higher Education Database.Experience Experience in liaising with governmental authorities, national/international institutions, United Nations agencies and non-governmental organizations; Experience in working with migrants, refugees, internally displaced persons, victims of trafficking and other vulnerable groups; and, Prior work experience with international humanitarian organizations, non-government or government institutions/organization in a multi-cultural setting is an advantage. Skills Strong administrative support capabilities (filing, document preparation, record maintenance) Ability to process contracts, invoices, consultant/vendor documentation. Experience providing logistical and coordination support for programme activities. Excellent computer literacy including MS Office, especially Excel and basic data systems. Languages",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373774889/",
    "job_id": "4373774889",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "HR Assistant - For Singer Bangladesh Limited - Job ID: 1460693",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Singer Bangladesh Limited is looking for HR AssistantJob Description / ResponsibilityRole PurposeTo ensure smooth HR operations support for the Sales function, including recruitment coordination, payroll & incentive processing, compliance, and employee services during contractual timeline.Key ResponsibilitiesCoordinate third-party recruitment for Sales Promoters and support Sales manpower planning and timely hiring.Manage trainee Branch Manager pool tracking, performance feedback collection, and support confirmation/release decisions with line managers.Liaise with the Training team for performance-based interventions.Ensure accurate and timely salary, commission, and incentive disbursement for Branch Managers in coordination with Payroll and Finance.Coordinate with third-party agencies for Sales Promoter payroll, attendance verification, incentive processing, and discrepancy resolution.Maintain updated HR databases, personnel files, and ensure audit-ready documentation and compliance requirements.Assist in obtaining and renewing trade, labor, and fire licenses, coordinating with relevant authorities and internal stakeholders.Execute HRIS (SAP) processes for Branch Managers, including onboarding, data updates, and system issue coordination with the central HRIS team, along with providing employee services (NOC, payslips, experience letters, etc.)ZEducational RequirementsBachelor of Business Administration (BBA)Skills Required: Communication in English, MS Excel, MS WordExperience RequirementsAt least 1 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Retail Store,Multinational Companies,Electronic Equipment/Home AppliancesAdditional RequirementsExperience working with third-party manpower agencies preferred.Practical knowledge of HRIS/SAP will be an advantage.Strong coordination and follow-up skills.Attention to detail in payroll and documentationJob LocationDhaka (GULSHAN 2)SalaryTk. 35000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373792002/",
    "job_id": "4373792002",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Admin & HR (Garments Factory, Uttara)) (For A Reputed Knit Garments Group of Companies) - Job ID - 1460930",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Reputed Knit Garments Group of Companies is looking for Officer - Admin & HR (Garments Factory, Uttara))Job Description / ResponsibilityFollow-up Attendance, Salary Administration, Leave Management & Compensation Benefit & incentive schemes.Follow-up a sound Performance Management System for all workers, staffs and management personnel in the factory.Follow up employee/labor relation & legal affairs work Preparation / Issue office note, memo, office order & circular in respect of HR issues.Follow-up Appointment processing, Orientation / Induction, exit interview Ensure transfer, increment, promotion, separation, confirmation related work.To develop, upgrade and implement HR policies, guidelines up to a reasonably acceptable standard for establishing smooth HR operation within the company.Follow up Disciplinary action & conduct departmental inquiry & grievance.Follow up expenditures like staff & workers salary & wages, overtime & night allowance, incentives, education allowance, Tiffin bill, Final settlement bill etc.To improve workers and management relationship, communication with workers & staffs, attend participation committee meeting and safeguard the facility against labor unrest and conflict.Ensure security of plant, properties, premises & personnel.Negotiate/resolve daily problems among workers/staffs etc on administrative issues.Maintain rapport with the local bodies, buyer representatives and govt. agencies.Ensure administrative policy & procedure for smooth running in the factory.Update all license, certificates Follow up hygienic issues Ensure administrative related MIS are properly maintain, update Any other activities assigned by the management from time to time.Educational RequirementsBachelor/HonorsMastersSkills Required: Garments IndustryExperience Requirements3 to 5 year(s)The applicants should have experience in the following business area(s): Garments,Textile,Group of CompaniesJob LocationDhaka (Uttara)SalaryTk. 23000 - 25000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373337639/",
    "job_id": "4373337639",
    "source": "linkedin",
    "company_name": "Noor Staffing Group",
    "job_title": "Accounts Receivable Specialist",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373791670/",
    "job_id": "4373791670",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager / Manager- Accounts- For Easy Polymer Industries Ltd.- Job ID: 1460996",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373773846/",
    "job_id": "4373773846",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "HR & Admin Officer - {For YG Sunny Paper Packing (BD) Company Limited} - Job ID - 1460749",
    "location": "Gazipur District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373783645/",
    "job_id": "4373783645",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Receivable Executive - (For GCE International Inc.) - Job ID - 1460203",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "GCE International Inc. is looking for Accounts Receivable ExecutiveJob Description / ResponsibilityResponsibilities include but not limited to: Perform daily and monthly Accounts Receivable (AR) reconciliations between USA based Factoring Bank, ERP (Blue Cherry), and MultiView systems, and assist in resolving discrepancies.Review customer credit coverage with the Factoring Bank and support the credit approval process.Accurately record, apply, and reconcile payments received via checks, ACH, wire transfers, and credit cards.Review, validate, and dispute chargebacks and coordinate the end‑to‑end chargeback resolution process.Monitor USA based customer accounts and support timely collection efforts, including follow‑ups on past‑due invoices via email and phone.Review and dispute ineligible AR balances identified by the Factoring Bank.Maintain up‑to‑date AR aging reports and escalate delinquent accounts when necessary.Collaborate with USA based Sales, Customer Service, and other internal teams to resolve billing or payment issues.Ensure accurate documentation for revenue recognition and payment application in MultiView.Assist with month‑end closing activities, including preparing reports, accruals, and account reconciliations.Provide documentation and support for internal and external audits and compliance requests.Identify and recommend improvements to AR processes, cash flow accuracy, and internal controls.Educational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in AccountingBachelor of Business Administration (BBA)Master of Business Administration (MBA)Experience Requirements2 to 5 year(s)The applicants should have experience in the following business area(s): Manufacturing (FMCG)Additional RequirementsProficiency in MultiView or similar financial systems (e.g., NetSuite) and strong skills in Microsoft Excel and Office.Solid understanding of AR concepts, revenue recognition, and accounting best practices.Strong attention to detail with excellent data accuracy, analytical ability, and problem‑solving skills.Highly organized, able to manage multiple priorities, and comfortable working in a fast‑paced environment.Effective written and verbal communication skills with a professional, customer‑focused mindset.Dependable, results‑driven, patient, and trustworthy with strong interpersonal skills.Job LocationDhaka (Gulshan)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371903203/",
    "job_id": "4371903203",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Executive, Sales & Marketing - AP Pharma (Ayurvedic, Unani)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371762375/",
    "job_id": "4371762375",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Research Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373776672/",
    "job_id": "4373776672",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Chief Accountant & CFO- For ABC Bangladesh- Job ID: 1458909",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361772716/",
    "job_id": "4361772716",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Security In-charge - For Hydroxide Knitwear Limited - Job ID: 1456444",
    "location": "Gazipur District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355716564/",
    "job_id": "4355716564",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Security In-Charge / Supervisor - (For Synergies Sourcing Bangladesh Ltd.) - Job ID - 1453370",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357181883/",
    "job_id": "4357181883",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Security In-Charge. - For Bellisima Apparels Ltd. - Job ID: 1454943",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373775814/",
    "job_id": "4373775814",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Security In-Charge / Supervisor - (For Fair Technology Ltd.) - Job ID - 1460444",
    "location": "Tejgaon Thana, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295255949/",
    "job_id": "4295255949",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Sr. Executive- Payroll (For A Largest Group of Companies)-Job ID",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4117100980/",
    "job_id": "4117100980",
    "source": "linkedin",
    "company_name": "(For Express One)-Job ID",
    "job_title": "Accounts Officer (Payroll & Tally Expert)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353734874/",
    "job_id": "4353734874",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Executive, Finance & Accounts (For Munshi HR Solutions Ltd ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373085265/",
    "job_id": "4373085265",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accountant",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionGoshu Kohsan (Bangladesh) Co., Ltd. specializes in water and wastewater treatment solutions, providing Engineering, Procurement, and Construction (EPC) services and turnkey project implementation. The company delivers comprehensive services including new plant construction, system upgrades, and operational support to ensure sustainable and efficient water management solutions.Job SummaryThe Accounts & Finance Officer is responsible for managing day-to-day financial operations, ensuring compliance with Bangladesh tax and VAT regulations, maintaining accurate financial records, preparing financial statements, and coordinating with auditors, tax authorities, and banks. The role ensures smooth financial reporting and statutory compliance for GKB.Job Location Narayanganj Bangladesh.Key ResponsibilitiesHandle payments and collections (cash and bank transactions).Prepare weekly Petty Cash and Bank Reports.Prepare monthly payment and collection schedules.Prepare cash flow projections and P&L budgets.Reconcile and close accounts monthly.Maintain balance sheet schedules and financial records.Prepare Financial Statements (Balance Sheet, Detailed Balance Sheet, Trial Balance, Profit & Loss Statement, Expense Reports) following company format and Bangladesh standards.Prepare reports for management and statutory authorities as required by Bangladesh law.Prepare and submit all types of tax reports.Prepare and submit monthly VAT returns.Maintain VAT records (purchase register, sales register, tax invoices).Issue tax invoices to customers.Prepare and submit Related Party Declarations.Collect VDS and AIT certificates from clients in a timely manner.Prepare schedules for VAT audits and represent the company before VAT authorities.Verify all vouchers (bank transfers, payment slips, cash receipts, inventory vouchers, etc.).Input accounting data (cash vouchers, bank vouchers, journal vouchers) into the system.Maintain Fixed Asset Register and participate in year-end physical verification.Perform bank reconciliation regularly.Select, set up, and maintain accounting software to ensure smooth financial operations.Coordinate with external auditors during interim and final audits.Liaise with tax officers when required.Coordinate with banks for financial and operational matters.Review inventory reports at month-end.Attend fixed asset and instrument counting at year-end.Perform special assignments as required by management.Qualifications & RequirementsBachelor’s degree in Accounting, Finance, Business Administration, or a related field.Minimum 5 years of experience in a corporate finance or accounting role.Strong accounting and bookkeeping skills, including expertise in maintaining financial records and reconciling accounts.Proficiency in financial reporting and budget preparation.In-depth knowledge of Bangladesh tax regulations, VAT compliance, and statutory reporting requirements.Advanced knowledge of accounting software and financial management tools.Experience in managing timely financial reporting and meeting statutory deadlines.Strong analytical and problem-solving abilities.Excellent communication and organizational skills.High level of attention to detail and accuracy in financial documentation.Ability to work independently and handle multiple priorities efficiently.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374344993/",
    "job_id": "4374344993",
    "source": "linkedin",
    "company_name": "Antal International",
    "job_title": "Payroll Operations Partner (APAC Lead)",
    "location": "Chennai, Tamil Nadu, India",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Payroll Operations Partner (APAC Lead)Global HR & Payroll ServicesWe are seeking an experienced and highly motivated Payroll Operations Partner for the operational oversight, governance, and risk management of outsourced APAC payroll delivery. TMF is the outsourced vendor responsible for accurate and timely processing payroll for 10 jurisdictions across the region. The current APAC countries in our end-to-end model include Singapore, China, Indonesia, India, Australia, South Korea, Japan, Vietnam, Hong Kong, Taiwan and Philippines (current scope is 19 companies, 12 pay cycles per year, circa. 900 headcount). The Payroll Operations Partner will be required to align working hours to APAC business hours to provide real-time oversight of payroll activities. Primary Task & Key Responsibilities:Payroll Operations Ownership (Outsourced Model)Strong understanding of end-to-end payroll delivery cycles across APAC, including inputs, validations, cut-offs, approvals, and post-pay activities Proven experience managing outsourced payroll vendors, including service delivery oversight, issue resolution, and escalation managementDemonstrated experience supporting multi-country / international payroll operations, ideally across complex regulatory environmentsStrong financial and payroll analytical capability, including variance analysis, reconciliations, and interpretation of payroll dataAbility to manage complex, ad-hoc payroll operational scenarios, applying pragmatic judgement and a solution-oriented (“fix-it”) mindset while maintaining appropriate controls and complianceRegional Compliance & Risk OversightStrong working knowledge of APAC statutory requirements, tax, and labour regulations to oversee vendor complianceExperience supporting internal and external payroll audits, including evidence coordination and issue remediationCommunication & Operational LeadershipExcellent written and verbal communication skillsComfortable leading payroll calls, risk reviews, and escalation forums with TMF and internal stakeholdersAbility to operate effectively across multiple countries, cultures, and time zones",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4285830493/",
    "job_id": "4285830493",
    "source": "linkedin",
    "company_name": "Job ID : 1396675",
    "job_title": "Accounts Payable (For Goldsands Group)",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4135299842/",
    "job_id": "4135299842",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Sayam event solution নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357371191/",
    "job_id": "4357371191",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "অপারেশনস অ্যান্ড রিক্রুটিং অফিসার (For A R B Security ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371904278/",
    "job_id": "4371904278",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Officer/Sr. Officer (Local Procurement) (For Abul Khair Group ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340477957/",
    "job_id": "4340477957",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4301861800/",
    "job_id": "4301861800",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346069232/",
    "job_id": "4346069232",
    "source": "linkedin",
    "company_name": "Accounts (For GCE International Inc.)-Job ID: 1442677",
    "job_title": "Executive",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4236634245/",
    "job_id": "4236634245",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340430784/",
    "job_id": "4340430784",
    "source": "linkedin",
    "company_name": "Sreepur Village, Bangladesh",
    "job_title": "Treasurer (Advisor / Trustee)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4068459100/",
    "job_id": "4068459100",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Relationship Manager, Transaction and Treasury Management ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4217028856/",
    "job_id": "4217028856",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "T24 Securities & Treasury Business Consultant",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/1345347258/",
    "job_id": "1345347258",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "HSBC hiring Global Liquidity and Cash Management Sales ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358077872/",
    "job_id": "4358077872",
    "source": "linkedin",
    "company_name": "WeGro Global",
    "job_title": "Financial Planning And Analysis Analyst",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4297225595/",
    "job_id": "4297225595",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "iFarmer hiring Head of Financial Services in Gulshan, Dhaka ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]