[
  {
    "url": "https://www.linkedin.com/jobs/view/4373783716/",
    "job_id": "4373783716",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Document Controller (For National Energy Services Limited) - Job ID: 1460224",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "National Energy Services Limited is looking for Document ControllerJob Description / ResponsibilityNational Energy Services Limited (NESL) is a company incorporated in Bangladesh rendering comprehensive human resource solutions to energy, construction and manufacturing industries of Bangladesh. We recruit across various verticals for multinational corporations as well as leading business houses of the country.NESL now invites applications from competent candidates for the post of Document Controller for Grant Thornton Bangladesh.Grant Thornton Bangladesh, represented by Howladar Yunus & Co. and a member firm of Grant Thornton International Ltd. (GTIL), is looking for aspiring professionals to fill in vacancies in its Assurance Services Department. At Grant Thornton Bangladesh, you will be given the opportunity to grow with us and as a professional in your line of expertise. The aspirant would be trained using the renowned GTIL Assurance methodology using the automated tools/software.Prepare, operate and update document control procedures in line with the Company's document management system.Provide support in the project structuring phase and manage all structuring phase documents.Control all aspects of project documentation on all phases of the project, utilizing various control methods/systems.Ensure all documentation provided is as per Company quality formatting requirements. Formatting may include correcting templates, fonts and style, pagination and numbering and other activities that may be required to achieve a client's documentation requirementsAbility to prioritize, manage well, multitask and troubleshoot.Scan, image, organize & maintain documents adhering to company's document lifecycle procedures.Maintain the integrity of working documents and update documentation when required.Archive inactive records in accordance with records retention scheduleCreate & maintain project files & file systems.Management & organization of all inbound/outbound documentation to/from Client and the Company Departments.Maintain document control log (excel file) for all Facility Engineering OE documentation.Maintain all Operations drawings and documents up to date and keep records of all revisions to drawings and documents in a control log or access file.Prepare transmittal to Client and for all inter-office correspondence.Maintain department files (MOCs, projects, etc.) & establishes file systems on O: drive and e Room, copies reports, CDs, DVDs.Print and dispatch field drawings as requested in a timely manner.Capable of drafting documents in Auto CAD.Inspect work documentation and data capturing on a continuous basis.Educational RequirementsBachelor / Honors in any disciplineSkills Required: AutoCADExperience Requirements3 to 5 year(s)The applicants should have experience in the following business area(s): Multinational CompaniesAdditional RequirementsExperience in Electronic Document Management System (EDMS) preferably Global Documentum System (GDS), FTP clients and Share Point Skilled in Microsoft Excel application will be preferred.Excellent MS Suite software knowledge with familiarity of e-Document management system and Adobe Acrobat.Excellent language skills and strong team playing sprit. Strong interpersonal, communication and customer service skills are essential.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373772762/",
    "job_id": "4373772762",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Chief Business Officer (Lift) - (For Walton Hi-Tech Industries PLC.) - Job ID - 1461035",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Walton Hi-Tech Industries PLC. is looking for Chief Business Officer (Lift)Job Description / ResponsibilityDevelop and implement long-term business strategies aligned with Walton’s vision and market dynamics.Identify and evaluate new business opportunities, partnerships, and product diversification initiatives.Oversee full elevator plant operations to ensure efficiency, quality, and compliance.Enhance production capacity, reduce costs, and improve overall productivity.Drive revenue growth by overseeing B2C and B2B sales, export strategies, and channel expansion.Evaluate ROI for capital expenditures and new investments in production facilities or technology infrastructure.Monitor and optimize supply chain, production, and distribution performance in coordination with operations and implement data-driven decision-making frameworks and key performance indicators (KPIs) to track business progress.Mentor and lead department heads (Sales, Marketing, Production, R&D) under the CBO’s purview and foster a high-performance, collaborative culture.Lead enterprise-wide change initiatives during business process redesign, digital transformation, or restructuring.Collaborate with the CFO to manage budgeting, forecasting, and cost optimization strategies.Monitor and report on financial performance, ROI on strategic initiatives, and operational margins.Collaborate with senior leadership, department heads, and other stakeholders to align business strategies with organizational goals.Promote a culture of innovation, accountability, and inclusivity across teams.Work with HR to attract, develop, and retain top talent, including succession planning for key leadership roles.Educational RequirementsGraduation or Post-Graduation in any discipline.Skills Required: Sales & Marketing, Project Management, Business Development, Team Management and leadership, Analytical SkillExperience RequirementsAt least 12 year(s)The applicants should have experience in the following business area(s): Escalator/Elevator/LiftJob LocationDhaka (Basundhara RA)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374211001/",
    "job_id": "4374211001",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Chief Financial Officer- For Khansons Group- Job ID: 1460807",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Khansons Group is looking for Chief Financial OfficerJob Description / ResponsibilityThis key executive role will oversee all financial operations, ensuring long-term fiscal health and strict regulatory compliance as the company continues its growth across 250+ branches nationwide.The CFO will serve as a strategic partner to the Board of Directors and the CEO, providing high-level financial guidance, managing large-scale operations, and spearheading financial transformation through digital integration.Monitoring day to day Accounts & Finance Department work.Tax related work.Educational RequirementsMaster of Business Administration (MBA) in FinanceA Master’s degree (m.com) in Finance, Accounting, or Business Administration with a consistently strong academic record (no \"third class\" or division). CA(cc) experience 10 yearsCA (inter) experience 5-6 yearsACA experience 2 years aboveSkills Required: Life Insurance CompanyExperience RequirementsAt least 10 year(s)The applicants should have experience in the following business area(s):InsuranceAdditional RequirementsPreference shall be given to candidates having working experience in Insurance Company.Professional Tenure: A minimum of 10 to 12 years of progressive experience in finance and accounting.Leadership Depth: At least 5 years of post-qualification experience in a senior leadership role (CFO or Head of Finance).Industry Expertise: Direct experience in Life Insurance or Banking is essential. Proven expertise in IDRA regulations, BSEC compliance, and Bangladesh tax/VAT laws is required.Citizenship: Must be a Bangladeshi citizen or permanent resident.Integrity: Must have no history of bankruptcy or being a loan defaulter.Clean Record: No convictions for moral turpitude, fraud, money laundering, or corruption. Independence: Must not be an entrepreneur shareholder, director, or chief executive of the same insurer, nor hold a directorship in any other bank or finance company concurrently. Strategic Leadership: Ability to translate financial data into actionable growth strategies for the Board. Compliance Mastery: Deep working knowledge of the Insurance Act, Company Act, and prevailing tax frameworks in Bangladesh.Technical Proficiency: Advanced skills in ERP systems and specialized insurance management software to drive operational efficiency.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373770874/",
    "job_id": "4373770874",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Accounts & Finance- For Manabay Water Park Ltd - Job ID: 1460766",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Manabay Water Park Ltd is looking for Manager - Accounts & FinanceJob Description / ResponsibilityFinancial Accounting & ReportingOversee day-to-day accounting operations including general ledger, accounts payable, accounts receivable, and bank reconciliations.Ensure timely month-end, quarter-end, and year-end closing processes.Prepare accurate and complete financial statements (Balance Sheet, Profit & Loss Account, Cash Flow Statement, and Notes to Accounts).Ensure compliance with applicable accounting standards and regulatory requirements.Coordinate with auditors for statutory audit, internal audit, and tax audit.Review and analyze financial reports to identify discrepancies and recommend corrective actions.VAT Compliance & ReportingEnsure accurate computation of VAT liabilities and input tax credits.Prepare and submit periodic VAT returns within statutory deadlines.Reconcile VAT accounts with books of accounts.Handle VAT assessments, notices, and correspondence with tax authorities.Maintain proper documentation and records for VAT compliance and audits.TDS / Withholding Tax ComplianceEnsure correct deduction of TDS/Withholding Tax as per applicable laws.Prepare and file periodic TDS/Withholding Tax returns accurately and on time.Reconcile TDS ledger balances with returns filed.Issue TDS certificates to vendors and employees as required.Educational RequirementsMaster of Commerce (MCom) in AccountingMaster of Commerce (MCom) in FinanceMaster degree in Accounting, Finance, or related field with CA(CC)/ CMA (600 pass)Experience Requirements5 to 8 year(s)The applicants should have experience in the following business area(s):Textile, Livestock, Amusement ParkAdditional RequirementsStrong hands-on experience in:Preparation and finalization of financial statements.VAT calculation, reconciliation, and return submission.TDS/Withholding Tax deduction and return filing.Experience in handling statutory audits and tax assessments.Proficiency in accounting software and ERP systems.Strong knowledge of tax laws and accounting standards.Excellent analytical, organizational, and leadership skills.Job LocationAnywhere in BangladeshSalaryTk. 50000 - 60000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373773912/",
    "job_id": "4373773912",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager, Tax & VAT and Accounts- For Dev Consultancy Limited- Job ID: 1461016",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Dev Consultancy Limited is looking for Assistant Manager, Tax & VAT and AccountsJob Description / ResponsibilityKey Responsibilities & SkillsTypically, these roles in the Bangladesh market require:Financial Reporting: Preparing monthly/quarterly statements and bank reconciliations.Regulatory Compliance: Managing VAT, Income Tax, online return and Mushak (6.3, 9.1).Audit Support: Coordinating with external and internal auditors.Educational RequirementsMaster of Business Administration (MBA) in AccountingMasters in Accounting/Finance with CA-CC or ICMA -interExperience Requirements2 to 4 year(s)Job LocationDhaka (Paltan)SalaryTk. 25000 - 35000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373781777/",
    "job_id": "4373781777",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Administrative Officer (For Ahsania Mission Cancer & General Hospital)-Job ID: 1459693",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Ahsania Mission Cancer & General Hospital is looking for Administrative OfficerJob Description / ResponsibilityOffice ManagementReport writingHR and administrative workPurchase and procurement knowledgeComputer proficiencyEducational RequirementsMaster of Business Administration (MBA)Skills Required: Office Management, Staff Management, Team Leadership, HR and Administration, Purchase and ProcurementExperience Requirements3 to 5 year(s)The applicants should have experience in the following business area(s):Hospital,Clinic,Healthcare StartupJob LocationDhaka (Mirpur 14)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373774888/",
    "job_id": "4373774888",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant General Manager - Admin & Operations (For Sattar Jute & Fibres Ltd.) - Job ID - 1460515",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Sattar Jute & Fibres Ltd. is looking for Assistant General Manager - Admin & OperationsJob Description / Responsibilityচাকরির বিজ্ঞপ্তি(একটি স্বনামধন্য ব্যবসায়িক প্রতিষ্ঠান – অভিজ্ঞ ও দক্ষ জনবল নিয়োগ দেওয়া হবে)আমাদের প্রতিষ্ঠান সম্প্রসারণের লক্ষ্যে দক্ষ, দায়িত্ববান ও অভিজ্ঞ প্রার্থীদের জন্য নিচের পদের ঘোষণা দেওয়া হলো।যারা নিয়মিত, পেশাদার, প্রতিশ্রুতিবদ্ধ এবং উন্নত কর্মপরিবেশে কাজ করতে আগ্রহী — তারা এখানে আবেদন করতে পারবেন।পদের ভূমিকা: এজিএম হিসেবে আপনি প্রশাসনিক ও অপারেশনাল কার্যক্রমের দৈনন্দিন বাস্তব নিয়ন্ত্রণ, টিম সাপোর্ট, রিপোর্টিং এবং কার্যপ্রণালী উন্নয়ন করবেন।অফিস প্রশাসন ও প্রাত্যহিক কার্যক্রম নিরীক্ষণকর্মী ব্যবস্থাপনা, রুটিন প্রস্তুতি ও টাস্ক কন্ট্রোলঅপারেশনাল ডকুমেন্টস, লজিস্টিক সাপোর্ট ও রিপোর্টের দায়িত্বঅন্যান্য ডিপার্টমেন্টের সাথে সমন্বয়ের কাজযোগ্যতা ও অভিজ্ঞতাপ্রতিষ্ঠিত কোম্পানিতে এজিএম/অ্যাডমিন/অপারেশনস কাজে বাস্তব অভিজ্ঞতাপ্রতিষ্টিত কোন কোন কোম্পানিতে এজিএম হিসেবে কাজ করার বাস্তব অভিজ্ঞতা সম্পন্নঅফিস অর্গানাইজেশন, সিস্টেমস এবং স্টাফ ম্যানেজমেন্টে দক্ষকো-অর্ডিনেশন ও কমিউনিকেশন স্কিল থাকতে হবেJob LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373786611/",
    "job_id": "4373786611",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive / Senior Executive - Audit - (For Hajee Automobiles) - Job ID - 1460713",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376363564/",
    "job_id": "4376363564",
    "source": "linkedin",
    "company_name": "Vacancies at IOM Indonesia",
    "job_title": "Programme Assistant",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Identification 19240 Posting Date 02/22/2026, 04:05 AM Apply Before 02/28/2026, 05:55 PM Contract Type Fixed-term (1 year with possibility of extension) Initial Contract Duration One Year Fixed Term Org Type Country Office Vacancy Type Vacancy Notice Recruiting Type General Service Grade G-4 Is this S/VN based in an L3 office or in support to an L3 emergency response? No Job Identification 19240 Posting Date 02/22/2026, 04:05 AM Apply Before 02/28/2026, 05:55 PM Locations Dhaka, BD Contract Type Fixed-term (1 year with possibility of extension) Initial Contract Duration One Year Fixed Term Org Type Country Office Vacancy Type Vacancy Notice Recruiting Type General Service Grade G-4 Is this S/VN based in an L3 office or in support to an L3 emergency response? No IntroductionEstablished in 1951, IOM is a Related Organization of the United Nations, and as the leading UN agency in the field of migration, works closely with governmental, intergovernmental and non-governmental partners. IOM is dedicated to promoting humane and orderly migration for the benefit of all. It does so by providing services and advice to governments and migrants.IOM is committed to ensuring a workplace where all employees can thrive professionally, while working towards harnessing the full potential of migration. Read more about IOM's workplace culture at IOM workplace culture | International Organization for MigrationApplications are welcome from internal and external candidates. For all IOM vacancies, applications from qualified and eligible first-tier candidates are considered before those of qualified and eligible second-tier candidates in the selection process. For the purpose of this vacancy, internal and internal-equivalent candidates are considered as first-tier candidates.Organizational Context and ScopeBangladesh country office, established in 1998, has worked closely with government entities at the national and sub-national levels, civil society organizations, local communities, and development partners to respond to evolving development and humanitarian needs. Its work covers migration governance, humanitarian response, climate action, disaster risk reduction, and development. IOM prioritizes protection, inclusive service delivery, and resilience-building for displaced populations, including Rohingya refugees. The Mission also provides strategic support to the Government of Bangladesh in strengthening migration governance and strengthening systems, advancing safe and regular migration pathways and upholding regional and global migration commitments.The Migration Policy and Sustainable Unit in the CO aims to strengthen migration governance in Bangladesh by promoting safe, regular, orderly, and humane migration while advancing the socio-economic well-being of migrants, their families, and communities. It supports the Government of Bangladesh and key stakeholders through strengthening governance including capacity development, ethical recruitment, evidence-based policy development, and direct assistance to migrants and returnees. The programme also advances research, knowledge management, and regional and global policy dialogue to integrate migration into national development priorities with a strong human-rights focus.Under the overall supervision of the Deputy Chief of Mission and the direct supervision of Head of the Migration Policy and Sustainable Development (MPSD) Unit of IOM Bangladesh, the successful candidate will be responsible for supporting the management and implementation of the different programmes/projects of the unit.Assist in the implementation and monitoring of project activities. Retrieve, compile, summarize, and present information/data on specific project topics.Support administrative coordination of project implementation, involving liaison with diverse organizational units and external parties to initiate requests, obtain necessary clearances, process and follow-up on administrative actions, etc.Draft status reports, identifying shortfalls in delivery and bringing them to the attention of the supervisor. Draft correspondence, reports, briefing notes, graphics, statistical tables, presentations and other forms of documentation. Organize meetings, workshops and training sessions. Respond to general information requests and inquiries; set up and maintain files/records.Perform other related duties as assigned.Required Qualifications And ExperienceEducationSchool diploma with four years of relevant experience; or,Bachelor’s degree in Political or Social Sciences, International Relations, Development Studies, Migration Studies, Human Rights, Law or related fields from an accredited academic institution with two years of relevant professional experience.Accredited Universities are those listed in the UNESCO World Higher Education Database.ExperienceExperience in liaising with governmental authorities, national/international institutions, United Nations agencies and non-governmental organizations;Experience",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373772807/",
    "job_id": "4373772807",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Reservation Officer - Ticket & Visa - (For Zatayat Tours and Travels) - Job ID - 1460992",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374993045/",
    "job_id": "4374993045",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Sr. Branch Manager",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376522387/",
    "job_id": "4376522387",
    "source": "linkedin",
    "company_name": "Unilever",
    "job_title": "Manager - Financial Planning & Analysis",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373777816/",
    "job_id": "4373777816",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accountant (For Zahid Steel Ltd.)-Job ID: 1460352",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373787669/",
    "job_id": "4373787669",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Secretary to Deputy Managing Director (Greenland Group) - For Greenland Group. - Job ID: 1460061",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Greenland Group. is looking for Secretary to Deputy Managing Director (Greenland Group)Job Description / ResponsibilityPosition SummaryWe are seeking a competent, highly organized, and detail-oriented Secretary to Deputy Managing Director to provide high-level administrative, compliance, and corporate governance support. The incumbent will assist in ensuring statutory compliance, maintaining corporate records, and coordinating board and regulatory matters.Key ResponsibilitiesEnsure compliance with all applicable corporate laws and regulatory requirementsPrepare and maintain statutory registers, records, and filingsOrganize Board Meetings, Committee Meetings, and Annual General Meetings (AGM)Prepare meeting agendas, minutes, and resolutionsLiaise with regulatory authorities and external stakeholdersAdvise management on corporate governance and regulatory mattersMonitor changes in legislation and regulatory environmentMaintain company documentation and ensure timely reportingProvide confidential administrative support to the Deputy Managing DirectorEducational RequirementsSkills Required: MS Office, Corporate Affairs, Corporate Communication, Bangla and English typing Skills, Deadline DrivenExperience Requirements2 to 3 year(s)The applicants should have experience in the following business area(s): Training Institutes, Real Estate, Group of CompaniesAdditional RequirementsBachelor’s or Master’s degree in Law, Business Administration, Accounting, or related fieldProfessional certification (ICSB / ICSA or equivalent) preferredMinimum 2-3 years of relevant experienceStrong knowledge of corporate law and regulatory complianceExcellent communication and organizational skillsHigh level of integrity and confidentialityMust have excellent typing skills in English and BanglaProficiency in Microsoft Office applications, especially ExcelJob LocationDhaka (GULSHAN 1)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373798095/",
    "job_id": "4373798095",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Admin Officer- For HTI Surgical - Job ID: 1460990",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373773829/",
    "job_id": "4373773829",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Officer-Finance and Logistic - For Mukti Cox's Bazar - Job ID: 1460480",
    "location": "Cox’s Bazar, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373793246/",
    "job_id": "4373793246",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "এক্সিকিউটিভ (For Ambala Commerce)-Job ID: 1461057",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373784963/",
    "job_id": "4373784963",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Manager/First Assistant Vice President - Project Structured & Sustainability Finance - For LankaBangla Finance PLC. - Job ID: 1461047",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373788934/",
    "job_id": "4373788934",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager - Procurement & Finance (For VX Services Limited)-Job ID: 1460869",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4073712607/",
    "job_id": "4073712607",
    "source": "linkedin",
    "company_name": "For US-Bangla Airlines (OTAs)",
    "job_title": "Chief Financial Officer (CFO)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373799196/",
    "job_id": "4373799196",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Executive / Executive - Internal Audit (TBG) - (For Bashundhara Group)-Job ID: 1462010",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360989174/",
    "job_id": "4360989174",
    "source": "linkedin",
    "company_name": "Startup Bangladesh Limited",
    "job_title": "Chief Investment Officer",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321359678/",
    "job_id": "4321359678",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Chief Financial Officer (Alliance Finance PLC based in Bangladesh)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370074478/",
    "job_id": "4370074478",
    "source": "linkedin",
    "company_name": "Oriental Group BD",
    "job_title": "Chief Financial Officer",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionOriental Group commenced operations in 1982 in the Real Estate business under the entrepreneurial guidance of its Founder Late Mr. Amjad Ali Khan. Now led by his three heirs, the group has multiple privately-owned companies and maintains a substantial turnover. Oriental Group has become a leading industrial conglomerate in Bangladesh, with operations in diverse business sectors including infrastructure, real estate, and more. The group has a track record of over 30 years of sustained growth, supported by a team of skilled professionals and workers.Role OverviewWe are seeking an experienced and strategic Chief Financial Officer (CFO) to lead financial strategy, capital structuring, banking relationships, and financial operations across a diversified group operating in manufacturing, real estate development, and capital-intensive sectors.The CFO will play a critical leadership role in driving growth, optimizing capital allocation, strengthening governance, and ensuring financial sustainability while supporting expansion initiatives and complex financing transactions.Key Responsibilities1. Strategic Financial LeadershipDevelop and execute group-level financial strategy aligned with long-term growth objectives.Advise the Board and executive leadership on investment decisions, capital deployment, and risk exposure.Lead financial planning for expansion projects, acquisitions, and new ventures.Oversee corporate structuring, SPVs, joint ventures, and partnerships.2. Banking, Capital Raising & TreasuryManage relationships with local and international banks, DFIs, and financial institutions.Structure and negotiate project finance, syndicated loans, working capital facilities, and trade finance.Lead debt restructuring, refinancing, and capital optimization initiatives.Oversee treasury operations, cash flow management, and currency risk mitigation.3. Manufacturing Finance OversightImplement cost accounting and production-based financial analytics.Monitor plant-level performance, unit economics, and operational efficiency.Oversee budgeting and financial control for machinery procurement and plant expansion.Manage inventory financing and working capital cycles.4. Real Estate Development FinanceEvaluate project feasibility, investment returns, and financial modeling (IRR, NPV, sensitivity analysis).Structure development financing and monitor construction budgets.Manage land acquisition funding and project cash flow planning.Support pricing, sales strategy, and exit planning for development projects.5. Financial Operations & GovernanceOversee accounting, audit, taxation, treasury, and regulatory compliance across the group.Ensure timely preparation of consolidated financial statements.Implement robust internal controls, risk management frameworks, and governance policies.Lead financial system implementation and ERP integration where necessary.6. Reporting & Performance ManagementDevelop financial dashboards and performance monitoring tools.Lead annual budgeting, forecasting, and strategic planning cycles.Present financial performance and strategic insights to the Board and investors.7. Leadership & Team DevelopmentBuild and lead a high-performing finance team across divisions.Mentor finance managers and establish strong reporting structures.Represent the company in investor meetings, financial negotiations, and strategic partnerships.Qualifications & ExperienceMinimum 12–15+ years of senior finance experience with leadership responsibility.Strong exposure to banking relationships, project finance, or structured finance.Demonstrated experience in manufacturing finance and real estate development projects.Proven track record in raising capital and managing large-scale investments.Professional certification preferred (CA, ACCA, CPA, CFA, or equivalent).Strong understanding of IFRS/IAS or international accounting standards.Experience working with multi-entity groups or conglomerates is highly desirable.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371790713/",
    "job_id": "4371790713",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Ericsson নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353801907/",
    "job_id": "4353801907",
    "source": "linkedin",
    "company_name": "For A Group Of Company",
    "job_title": "Chief Finance Officer (CFO)",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4229568446/",
    "job_id": "4229568446",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Quantum Education Group নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4184799853/",
    "job_id": "4184799853",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Director, Finance & Accounts Division (For Dhaka Ahsania Mission ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4200346564/",
    "job_id": "4200346564",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Manager (For DHANMONDI GENERAL AND KIDNEY ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320593586/",
    "job_id": "4320593586",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Solve.Care US hiring Financial Director in United States",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318428944/",
    "job_id": "4318428944",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4206780107/",
    "job_id": "4206780107",
    "source": "linkedin",
    "company_name": "For Digi Solution- Job ID : 1355284",
    "job_title": "Accounts & Stock In-charge",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343578615/",
    "job_id": "4343578615",
    "source": "linkedin",
    "company_name": "AD Solutions",
    "job_title": "Accounting Administrative Assistant",
    "location": "Orlando, FL",
    "employment_type": "",
    "date_posted": "",
    "job_description": "AD Solutions is a Business Solutions Equipment and Service Provider with headquarters in Orlando, Florida. We are seeking a detail-oriented and organized Accountant Administrative Assistant to join our team. The ideal candidate will have a strong understanding of accounting principles and practices, excellent numerical skills, and the ability to work independently and as part of a team.Responsibilities:Reconcile bank statements and credit card transactions monthlyAssist with monthly analysis, reconciliations, and resolutions for GL accountsReconcile discrepancies by collecting and analyzing account informationPrepares Journal Entries and make necessary correctionsProvide support for formal month-end and year-end close processesAssist in maintaining chart of accounts and keeping books up to date and secureCollaborate with other team members to complete duties as neededMaintain Accounts Receivable ledgerMaintain and Reconcile A/R aging report on weekly basisReconcile purchase orders and AP Aging ReportOther duties as assignedPreferred Qualifications:Minimum of 1-3 years' experience in bookkeeping/accountingFirm understanding of basic accounting principles and basic accounting tasksBasic Excel skills are a plusExperience in Quickbooks, Sage or NetSuite is requiredA high school diploma is requiredAn associate's degree is a plusPre-employment drug testing is required for this positionPowered by JazzHRmkZpheZupc",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363930040/",
    "job_id": "4363930040",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "FAO hiring Data Enumerators in Dhaka, Dhaka, Bangladesh ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]