[
  {
    "url": "https://www.linkedin.com/jobs/view/4374886822/",
    "job_id": "4374886822",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "GRN & Accounts Executive - For BioMed Pharmacy / BioMed Online Pharmacy - Job ID: 1463187",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BioMed Pharmacy / BioMed Online Pharmacy is looking for GRN & Accounts ExecutiveJob Description / ResponsibilityEmployment Type: Full-time (Roster Duty)Job Location: Biomed Pharmacy, 152/2-H, Eastern Dolon, Bir Uttam Kazi Nuruzzaman Road, West Panthapath, Dhaka 1215Job Responsibilities:Prepare and manage GRN (Goods Received Note) accuratelyPrepare purchase invoices, delivery challans & Purchase order.Maintain stock entry and supplier ledgerAssist in daily accounts entries (cash, bank, expenses)Reconcile supplier statements and pending billsMaintain proper documentation and filing systemAssist shop and Pharmacy section in accounts management.Educational RequirementsBachelor of Commerce (BCom)Experience Requirements2 to 3 year(s)Additional Requirements2–3 years’ experience in pharmacy / retail / hospital / healthcare accounts preferredKnowledge of accounting software & MS ExcelStrong understanding of GRN processBasic accounting knowledgeJob LocationAnywhere in BangladeshSalaryTk. 22000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375506177/",
    "job_id": "4375506177",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Finance (Garments) (For A Leading Garments Industry) - Job ID - 1463447",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Leading Garments Industry is looking for Assistant Manager - Finance (Garments)Job Description / ResponsibilityBank & NBFI credit facility yearly renewal activities.Proposal for a new Bank/NBFI loan facility as per management requirements.Prepare & coordinate all relevant documents-for new loan, loan renewal & departmental requirement.Monitor the market conditions of borrowing and lending interest/profit rate.Responding to the post disbursement quires & requirements of Bank/NBFI.Visit & correspond to various Bank and Non-Banking Financial Institution.Responding to the post disbursement quires, requirements of the Bank & Financial Institution.Update Monthly Group Liabilities and MIS.Responding to the queries & requirements of the credit rating agency. Assist Head of Department to prepare feasibility of a new project.Liaise with banks and financial institutions for cost effective working capital management and worthful capital investment.Monitor cost of fund rate for effective fund management.Visit factory and with both local & foreign investors.Open A/C with various Bank.Any other task assigned by higher management.Educational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in AccountingCA (CC) will be given preference.Experience Requirements4 to 8 year(s)The applicants should have experience in the following business area(s): GarmentsJob LocationDhaka (GULSHAN 1)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375292639/",
    "job_id": "4375292639",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager / Deputy Manager (Finance & Accounts) (For A WELL RENOWNED, REPUTED COMPANY) - Job ID - 1463424",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A WELL RENOWNED, REPUTED COMPANY is looking for Assistant Manager / Deputy Manager (Finance & Accounts)Job Description / ResponsibilityCandidates who stay at Chattogram will get priority.Maintaining credit and debit vouchers, cash books & ledger of accounts etc.Have to check supporting papers/documents of day- to-day expenditures.Prepare monthly bank & customer reconciliation statement.Check all kinds of financial transaction activities.Update daily collection register.Assist credit collection process.Monitoring of daily/Weekly/Monthly Financial reports.Maintain accounts receivable & payable accountsPosting of all kinds of accounting adjustmentMonitoring the Debtors, Stocks and Asset position of the Company;Keeping records of transaction and preparation of all kinds of vouchers in software processes on a regular basis.Ensure transactions are properly recorded in a timely manner.Monthly accounts preparation.Credit counting system follow up.Educational RequirementsMaster of Business Administration (MBA)Master of Commerce (MCom)MBA/M. Com in Accounting and CA Course completed from any reputed Firm.Experience Requirements6 to 7 year(s)Experience RequirementsApplicants previously having 6-7 years working experience in the relevant field.Additional Job RequirementsShould be energetic, proactive, dynamic and hard working.Should have sound knowledge in computer & software.High level interpersonal skills and integrity;Ability to work in a team environment.Ability to communicate effectively with all levels of people.Job LocationChattogram",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378093586/",
    "job_id": "4378093586",
    "source": "linkedin",
    "company_name": "Munshi HR Solutions Limited",
    "job_title": "Executive Accountant",
    "location": "Tejgaon Industrial Area Thana, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job SummaryThe Accounts Executive will be responsible for accurate accounting data entry, preparing bills/invoices, and ensuring the timely collection of receivables. The role requires close coordination with internal departments and customers to ensure proper billing, payment follow-up, and maintenance of accounting records.Key Responsibilities1. Data Entry & Record KeepingEnter accounting transactions accurately in the accounting software/ERP.Update customer ledgers regularly.Ensure proper filing of invoices, vouchers, and supporting documents.2. Billing & InvoicingAssist in preparing sales invoices as per approved terms and rates.Assist in preparing and issuing money receipts.3. Collection & Receivables ManagementFollow up with customers for outstanding payments.Maintain ageing analysis of accounts receivable.Record collections and reconcile with bank and cash receipts.Required Qualifications & SkillsBachelor’s degree in Accounting, Finance, or Commerce.1 year of relevant experience in accounts, billing, or collections.Basic knowledge of accounting principles.Proficiency in MS Excel and accounting software.Good communication and follow-up skills.Attention to detail and ability to meet deadlines.Others Required :Only male candidates are encouraged to apply for the Data Entry, Billing, and Collection position along with other related processes. Must be willing to relocate for work. Candidates should be smart, hardworking, and knowledgeable in Excel and other MS Office applications.Intersted candidate can apply: career@munshicorp.com",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375292496/",
    "job_id": "4375292496",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Head of Finance and Accounts (GM/DGM/Finance Controller) - (For Nasir Syntax Group)-Job ID: 1462963",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Nasir Syntax Group is looking for Head of Finance and Accounts (GM/DGM/Finance Controller)Job Description / ResponsibilityResponsible for the day-to-day \"execution\" of accounting across the corporate office and factory units.Direction and coordination of company accounting system, financial planning, and budget management functions.Measuring the financial and operating performance of manufacturing units, divisions, and departments.Identify and implement cost-saving initiatives to reduce the Cost of Goods Sold (COGS) of manufacturing units.Manage company cash flow and liquidity effectively.Manage the preparation of the official annual report of actual revenues, transfers, and expenses.Manage the preparation of financial outlooks and financial forecasts.Prepare financial analysis for contract negotiations and product investment decisionsEstablish and implement short- and long-range departmental goals, objectives, policies, and operating procedures.Direct financial audits and provide recommendations for procedural improvements.Other duties as assigned.Educational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in Cost & Management AccountingCost and Management Accountant (CMA) / Chartered Accountant (CA) preferredSkills Required: Accounting Software, Accounts and Finance, Cost management AccountingExperience Requirements15 to 20 year(s)The applicants should have experience in the following business area(s):Manufacturing (Light Engineering and Heavy Industry),Group of CompaniesAdditional RequirementsExcellent knowledge of corporate financial law, cost accounting, inventory management, tax, and VAT compliance in Bangladesh.Candidate should have a solid understanding of large manufacturing industry’s accounting, financial reporting and costing following BAS/BFRS/BCAS.Candidate will be responsible for managing the overall Finance, Accounts and Manufacturing Cost related activities.Sound knowledge & expertise on Finance, Accounts, Costing, Inventory, Banking and Commercial related activities.Effective relationship and liaison with banking and financial institutions for fund management and trade finance related activities.Sound knowledge ERP systems operations.Job LocationDhaka (GULSHAN 2)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378336248/",
    "job_id": "4378336248",
    "source": "linkedin",
    "company_name": "Accelleron",
    "job_title": "Country Finance Manager - Bangladesh",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Accelleron is accelerating sustainability in the marine and energy industries as a global technology leader in turbocharging, fuel injection, and digital solutions for heavy-duty applications. Building on a heritage of over 100 years as a trusted industry partner, the company serves customers in more than 100 locations in over 50 countries. Accelleron’s 3,000 employees are continuously innovating to deliver best-in-class products, services, and solutions that are mission-critical for the energy transition. You will join a team of experts in an exciting international environment, committed to excellence and innovation. Together, we support our customers in driving the transition toward sustainable industries with cutting-edge technology, deep expertise, and smart solutions. At Accelleron, we foster diversity and inclusion, welcoming and celebrating individual differences as a source of strength.Job DescriptionAs the key financial leader for Bangladesh, you will act as copilot of the Country Managing Director (CMD) and be responsible for all local finance and commercial management matters. Partnering closely with the CMD, you will play a critical role in steering the direction and success of the organization by providing timely and accurate financial insights and demonstrating strong business acumen. You will lead and oversee all aspects of controlling, accounting, reporting, internal control, commercial management, fiduciary responsibilities, treasury, and tax matters to sustainably optimize business performance and financial position. Representing the company externally, you will ensure full compliance with all legal requirements and internal policies. The Country Finance Manager (CFM) reports to the Area Finance Manager and the Country Managing Director Bangladesh.Your ResponsibilitiesStrategic Leadership: Contribute to the local implementation of the Accelleron business strategy, providing strategic financial leadership and direction.Business Planning: Develop and translate strategy into comprehensive business plans (budget/forecast), set measurable targets, and coordinate/oversee the corresponding processes. Assess financial implications of strategic decisions, create, and evaluate business scenarios, and initiate corrective actions when necessary.Performance Management and decision support: Monitor financial performance across multiple dimensions, delivering insights to support both operational and strategic decision-making. Drive cost structure optimization, productivity improvements, and capital efficiency to maximize value creation.Commercial and Risk Management: Identify and communicate commercial and financial risks and opportunities arising from business propositions, such as contracts. Conduct risk and contract reviews in line with global policies and standards to minimize risks and exposure. Monitor overdue accounts to mitigate default risk and safeguard company assets.Financial Reporting: Establish and oversee processes and tools to ensure transparent and reliable financial data, reported in compliance with Group standards (US-GAAP) and financial closing schedules.Accounting and Statutory Reporting: Ensure accurate financial bookkeeping (via our external Accounting Service Provider) in accordance with local accounting principles. Ensure timely preparation of accurate statutory financial statements.Tax Compliance: Responsible for the preparation and filing of accurate tax returns (including timely payment) for corporate income taxes, transfer pricing and indirect taxes, in collaboration with your tax service provider. Ensure adherence to Accelleron tax policies as well as local and international tax regulations to ensure full tax compliance. Monitor changes in local tax legislation and assess their impact with local and global experts.Governance, Compliance, and Audits: Establish and maintain local governance in line with corporate standards, regulations, policies, and legal requirements. Ensure effective execution of internal controls for financial and specified non-financial operations. Coordinate external audits and support internal audits, acting as a liaison with the global legal and integrity function. Act as Secretary to the Board of Directors. Ensure regulatory filings, reporting, and other general affairs tasks.Treasury Management: Secure, plan and manage the company’s liquidity, including investment and debt management. Responsible for the local bank relationships, including the management of bank accounts, bank guarantees and other local banking services. Identify and manage foreign exchange risks, implementing hedging strategies in accordance with Group policies. Oversee the company's local insurance policies and credit risk management in alignment with Group guidelines.Your BackgroundUniversity degree in Finance/Controlling or Chartered Financial Accountant (e.g., ACCA, ACA, ICAEW, ICAS, CPA, CIMA) or extensive practical work experience with demonstrated achievements.Up-to-date know",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375508315/",
    "job_id": "4375508315",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Finance - For Justice And Care - Job ID: 1463383",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Justice And Care is looking for Assistant Manager - FinanceJob Description / ResponsibilityFinancial Oversight & ManagementMonitor all financial activities of the IACHT project to ensure compliance, accuracy, and timely execution.Maintain complete and accurate books of accounts following organizational and donor standards.Ensure all accounting activities comply with IFRSs, IASs, and national laws and regulations.Budgeting, Forecasting & ReportingAssist in financial forecasting, annual budget preparation, and overall financial planning.Support the preparation of monthly, quarterly, and annual financial reports.Provide cost–benefit analysis to support funding decisions.Strategic Financial SupportProvide strategic recommendations for the Finance Manager and senior management for improved financial performance.Conduct financial analysis for project planning, review, and decision-making.Contribute to maintaining the financial health and long-term sustainability of the project.Audit Coordination & Compliance MonitoringAssist in preparing schedules and documents for external and internal audits.Respond to auditor queries and support implementation of audit recommendations.Ensure all statutory compliance related to financial operations (tax, VAT, regulatory filings).Financial Analysis & SupportConduct variance analysis, expenditure tracking, and provide insights for decision-making.Support program and management teams with financial data, costing, and budget revisions.Contribute to financial capacity-building sessions for program and support staff.Educational RequirementsMastersMaster’s degree in accounting, Finance, Business Administration, or a related field from a reputed university.Professional certification is preferred.Skills Required: Accounts and Finance, VAT and Tax, Donor Compliance, Fund Management, Reporting and DocumentationExperience Requirements4 to 8 year(s)The applicants should have experience in the following business area(s):NGO,Development AgencyAdditional RequirementsProven experience managing donor-funded projects (e.g., USAID, FCDO, Freedom Fund, or similar).The applicants should have experience in the following business area: INGO, NGO.Strong understanding of IFRS, NGOAB regulations, and Bangladesh labor and tax laws.Proficiency in MS Excel, QuickBooks, or ERP-based accounting systems.Excellent communication skills in English and Bangla.Proactive and self-motivated.Sensitivity for the safety and well-being of beneficiaries and team members, committed to actively preventing any form of harm, abuse, neglect, harassment, or exploitation, including sexual exploitation and abuse (SEA).Maintain awareness and concern for Justice and Care’s safeguarding values, contributing to a safe and respectful environment for all.Commitment to Justice and Care’s mission, vision, and principles.Job LocationDhakaSalaryTk. 60000 - 70000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377226939/",
    "job_id": "4377226939",
    "source": "linkedin",
    "company_name": "EGUARDIAN",
    "job_title": "Assistant Manager Finance / Executive Finance",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375287461/",
    "job_id": "4375287461",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Finance & Accounting (For Apex Data Management & IT Ltd) - Job ID : 1463628",
    "location": "Banani, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375503294/",
    "job_id": "4375503294",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager- Treasury, Accounts & Finance (Garments) (For A Leading Garments Industry) - Job ID - 1463423",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376049878/",
    "job_id": "4376049878",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Senior Relationship Manager, SME Banking",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Summary To position the branch as an effective retail sales and service outlet by providing superior client service for increasing the client base and achieving the branch asset & liability targets for Premium Clients segment. Assist the BM/ BOSM to ensure that all the Group & Local Regulatory guidelines are adhered to during branch operations.ResponsibilitiesFinancial/Sales: To achieve set targets in terms of building assets and liabilities set forth in Job Objective. To manage the assigned Priority portfolio through relationship management. To increase the client base of the branch. To capitalize on cross-sell opportunities. To communicate with clients and potential clients for sales opportunities. To help and organize sales promotions (Campaigns, presentations, seminars, exhibitions, etc.) in co- ordination with the Branch & other sales channels. To ensure cost minimization/ control environment.Service Quality To provide high quality service to Priority Clients. To achieve set targets in terms of service standards for client transactions. To show a significant development of service quality levels across the Branch as measured NPS. To log Client complaints into CEMS and keep track for their solutions.Operations Own and drive Customer Due Diligence, Reputation Risk, Anti-Money Laundering, Sanction and FATCA initiatives. Establish Risk Recognition and Compliance Culture in the branch. Ensure Control Environment is robust enough to receive Satisfactory Audit Ratings. Ensure proper documentation for Retail Banking products for all clients and keep the error rate within acceptable level. Ensure proper documentation for Dormant/ Unclaimed Account Regularization. Provide service/ answer enquiries to the clients over the counter and over telephone. Initiate the increasing, decreasing, rescheduling and renewal of Over Draft limit. Act as Client Service Executive/BOSM as and when required based on Approved DOA. Conduct Need Based Conversations and create sales opportunities. Act as a custodian of Prime keys as and when required in the branch.Operational Risk/ Administration Assist the BM for the branch security management and coordinate with Property as and when required. Assist the BM to ensure that branches maintain all the records that are auditable for good audit rating. Assist BM to ensure that proper signage is in appropriate place. Assist BM to ensure the awareness of business continuity plan among the departments.People Have open channels of communications and maintain high levels of motivation.Help create an environment where the branch staff can operate as a team demonstrating the Values of the BankRegulatory & Business Conduct Display exemplary conduct and live by the Group’s Values and Code of Conduct. Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct. Lead to achieve the outcomes set out in the Bank’s Conduct Principles Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key Stakeholders Head – Client Relationships Product Heads and Segment Heads Support Unit Departments Other BMs, RMs & BOSMs Account Services Loan Operations Assurance Manager Compliance, Legal and FCC Credit Securities Bonds Dept. Client Experience Existing and Prospective ClientsQualifications Minimum Bachelor’s degree. Minimum 5 years of experience.Role Specific Technical Competencies Ms OfficeAbout Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 170 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents and we can't wait to see the talents you can bring us.Our purpose, to drive commerce and prosperity through our unique diversity, together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion.Together WeDo the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we doNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so wellAre better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long termWhat We OfferIn line with our Fair Pay Charter, we offer a competitive salary and benefits to support your mental, physical",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375295736/",
    "job_id": "4375295736",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Audit Executive- For New Nasir and brothers- Job ID: 1463481",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375284692/",
    "job_id": "4375284692",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Costing - Executive (For Friendship)-Job ID: 1462511",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371762375/",
    "job_id": "4371762375",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Research Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375290891/",
    "job_id": "4375290891",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts - VAT And Tax - For VIYELLATEX group - Job ID: 1463566",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "VIYELLATEX group is looking for Executive - Accounts - VAT And TaxJob Description / ResponsibilityPrepare and submit VAT returns as per VAT & SD Act 2012 guidelines.Ensure proper deduction and deposit of TDS & VDS within due dates.Maintain tax and VAT registers, challans, and documentation.Reconcile VAT & tax accounts with the general ledger regularly.Assist in preparing annual income tax returns and corporate tax assessments.Coordinate with tax consultants, auditors, and regulatory authorities.Handle tax audit and VAT audit requirements.Monitor changes in tax and VAT laws and ensure compliance.Prepare reports related to tax, VAT, and statutory payments for management.Support internal and external audits with required documents.Educational RequirementsBachelor of Business Administration (BBA) in Accounting[University of Dhaka, Jahangirnagar University, North South University, East West University, Jagannath University ]students will get preferenceSkills Required: Tax (VAT/ Customs Duty/ Income Tax), Accounting, Accounts and Finance, VAT and Tax, Taxation, Tax Return Submission, Income Tax, Bank ReconciliationExperience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):Garments,Textile,Group of CompaniesAdditional RequirementsMinimum 3 years of practical experience in Tax & VAT in a reputed organization.Experience in manufacturing or corporate industry will be preferred.Strong knowledge of Income Tax Ordinance and VAT & SD Act.Job LocationDhaka, Gazipur",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378309869/",
    "job_id": "4378309869",
    "source": "linkedin",
    "company_name": "A.P. Moller - Maersk",
    "job_title": "Sales Account Manager, Retail & Lifestyle",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374571524/",
    "job_id": "4374571524",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts - For Economic Consortium Ltd. - Job ID: 1462140",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375289380/",
    "job_id": "4375289380",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive/Senior Executive, Accounts- For Confidence Infrastructure PLC - Job ID: 1463017",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Confidence Infrastructure PLC is looking for Executive/Senior Executive, AccountsJob Description / ResponsibilityRecord and process payment vouchersProcess vendor paymentsEnsure proper recording of VAT and tax transactionsMaintain documentation, recording, and follow-upPrepare and process online challans/paymentsManage voucher filing and documentationPerform data entry through integrated software and manual posting (where required)Process admin and other expense approvals and paymentsAdjust advances and settlementsConduct bank, vendor, purchase, and stock reconciliationsExperience Requirements2 to 3 year(s)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373790641/",
    "job_id": "4373790641",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts and VAT - (For Salahuddin Associates SA) - Job ID - 1460875",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374887322/",
    "job_id": "4374887322",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive/Asst. Manager - Accounts - For Nitol-Niloy Group - Job ID: 1461855",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3364420947/",
    "job_id": "3364420947",
    "source": "linkedin",
    "company_name": "CSM Bangladesh Ltd.",
    "job_title": "Sr. Accounting Officer",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339782041/",
    "job_id": "4339782041",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4214555135/",
    "job_id": "4214555135",
    "source": "linkedin",
    "company_name": "Sabrina-Dream Properties Ltd.",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4253120721/",
    "job_id": "4253120721",
    "source": "linkedin",
    "company_name": "Wärtsilä নিয়োগ",
    "job_title": "Senior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4257952660/",
    "job_id": "4257952660",
    "source": "linkedin",
    "company_name": "Crown Trading Corporation নিয়োগ",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355805937/",
    "job_id": "4355805937",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Junior Accounts Officer (Canteen) (For Pro-Active Medical College ...",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293155730/",
    "job_id": "4293155730",
    "source": "linkedin",
    "company_name": "(For A Renowned MNC)",
    "job_title": "Executive-Accounts & Finance",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3945385287/",
    "job_id": "3945385287",
    "source": "linkedin",
    "company_name": "(For OMC Footwear Ltd)",
    "job_title": "Finance & Accounts",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4290365486/",
    "job_id": "4290365486",
    "source": "linkedin",
    "company_name": "For Muktar Hossain ...",
    "job_title": "Accounting & Taxation Contractor (Remote)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]