[
  {
    "url": "https://www.linkedin.com/jobs/view/4369332159/",
    "job_id": "4369332159",
    "source": "linkedin",
    "company_name": "GAC Group",
    "job_title": "Accountant",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366110209/",
    "job_id": "4366110209",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.The company is founder-led, profitable, and growing.The role of an Accountant at Canonical:If you are passionate about the technology industry and want to work for a company that aligns with your interests, we might be the place for you! Canonical, and our world class Ubuntu product, attracts some of the leading talent from around the world. Come and work with exceptional people and advance your career in Finance!Our Finance team is growing and it's a really exciting time to join the team. We are looking for bright, motivated people who have a passion for making a difference. You will be seeking an opportunity to drive process improvements and change, input your ideas and truly contribute to a highly productive team.We are looking for an exceptional Accountant with IFRS experience to help us ready the business for public market scrutiny through our planned IPO. The right candidate will have domain expertise and a passion for IFRS.Location: This role may be office based in London, or Remote in EMEA Time Zones.What your day will look likeAssist in the month end reporting process to deliver timely and accurate informationHave full responsibility for a part of the ledger processes relevant to your strengthsAssist with the year end audit process and statutory reportingSupport the finance team's wider plans to prepare for an IPOImprove the efficiency of financial processes and procedures and monitor complianceShare knowledge between team members to ensure cover is available when neededActively develop your own skills to ensure current knowledge of applicable standards and regulationsEstablish strong relationships with key colleagues outside the wider finance teamWhat we are looking for in youExceptional academic track record and subsequent career performanceBachelor's degree in Accounting or equivalentQualified accountant (ACCA, ACA, ACMA, CPA, etc.)Experience at a large public accounting firm, or public multinational corporate accounting department preferredNetSuite or similar enterprise grade systems experienceWillingness to travel up to four times per yearWhat we offer colleaguesWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.Distributed work environment with twice-yearly team sprints in personPersonal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveTeam Member Assistance Program & Wellness PlatformOpportunity to travel to new locations to meet colleaguesPriority Pass and travel upgrades for long-haul company eventsAbout CanonicalCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.Canonical is an equal opportunity employerWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367345409/",
    "job_id": "4367345409",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "Tax & Legal Services - International Tax/ M&A - Manager (Qatar)",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365792292/",
    "job_id": "4365792292",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Muscat, Masqaţ, Oman",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321409536/",
    "job_id": "4321409536",
    "source": "linkedin",
    "company_name": "Metro Pacific Water Solutions, Inc.",
    "job_title": "Accountant",
    "location": "Mandaluyong, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4023943908/",
    "job_id": "4023943908",
    "source": "linkedin",
    "company_name": "Savico",
    "job_title": "General Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321524065/",
    "job_id": "4321524065",
    "source": "linkedin",
    "company_name": "San Miguel Integrated Logistics Services, Inc.",
    "job_title": "Cost Accountant",
    "location": "Pasig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366820423/",
    "job_id": "4366820423",
    "source": "linkedin",
    "company_name": "Gallery de Neyuh",
    "job_title": "KẾ TOÁN NỘI BỘ (INTERNAL ACCOUNTANT)",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321389142/",
    "job_id": "4321389142",
    "source": "linkedin",
    "company_name": "Hangcha Forklift",
    "job_title": "Accountant",
    "location": "Biên Hòa, Dong Nai, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361563871/",
    "job_id": "4361563871",
    "source": "linkedin",
    "company_name": "Metergy Solutions",
    "job_title": "Finance & Operations Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368649203/",
    "job_id": "4368649203",
    "source": "linkedin",
    "company_name": "Abou Ghaly Motors",
    "job_title": "Senior SAP SD Consultant",
    "location": "Qesm El Obour, Al Qalyubiyah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321434642/",
    "job_id": "4321434642",
    "source": "linkedin",
    "company_name": "Omoda & Jaecoo Philippines",
    "job_title": "Chief Accountant",
    "location": "Taguig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366112964/",
    "job_id": "4366112964",
    "source": "linkedin",
    "company_name": "Primary Health Care Corporation",
    "job_title": "Subject Matter Expert - Billing & Insurance (CIS)",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355846979/",
    "job_id": "4355846979",
    "source": "linkedin",
    "company_name": "NCC Group Philippines",
    "job_title": "Credit Controller",
    "location": "Taguig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355685875/",
    "job_id": "4355685875",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - HR, Admin And Compliance (For Win Champion BD Ltd.) - Job ID : 1453110",
    "location": "Dinajpur, Rangpur Division, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321514411/",
    "job_id": "4321514411",
    "source": "linkedin",
    "company_name": "Northern Trust",
    "job_title": "Consultant, Compliance",
    "location": "Taguig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About Northern TrustNorthern Trust, a Fortune 500 company, is a globally recognized, award-winning financial institution that has been in continuous operation since 1889.Northern Trust is proud to provide innovative financial services and guidance to the world’s most successful individuals, families, and institutions by remaining true to our enduring principles of service, expertise, and integrity. With more than 130 years of financial experience and over 22,000 partners, we serve the world’s most sophisticated clients using leading technology and exceptional service.Major Duties:Global Compliance Ireland Team InfrastructureMaintain the register of team documentation (e.g. team procedures, compliance manual, policies) and ensure they are reviewed/approved in line with regulatory/corporate governance requirements.Oversee internal (e.g. Boards, Committees) and external (e.g. CBI, client due diligence) compliance reporting completed by the team.Lead the completion and approval of the team’s Business Continuity Plan (BCP) and liaise with Business Continuity/Disaster Recover colleagues.Coordinate the preparation of regulatory filings (e.g. Lobbying Return) for approval by the Head of Compliance.Group Compliance CoordinationMaintain the Service Descriptions for support provided by Group Compliance to the Irish entities (e.g. regulatory change).Perform monthly oversight of Key Performance Indicators, escalate matters to relevant stakeholders and manage the annual review of theses Service Descriptions.Oversee the annual Compliance Training Programme for the Irish entities.Compliance MonitoringUndertake assigned compliance monitoring in line with the annual Ireland Compliance Programs.Monitor and assess the adequacy and effectiveness of the measures, controls and procedures put in place by business units to address NT’s compliance with its regulatory obligations.Document timely, accurate, concise and high-quality conclusions.OtherParticipates in developing Compliance programs and acts as a contact point within the company for Compliance inquiries from partners.Participates in establishing written guidance on the appropriate implementation of Compliance programs and laws, regulations, rules and standards, through policies and procedures and other documents, such as Compliance manuals, internal codes of conduct and practice guidelines.Operates independently; has in-depth knowledge of Compliance risk avoidance.Knowledge:Knowledge of risk management and the Company's strategic goals.Knowledge of compliance frameworks, applicable laws and regulations, acquired through formal education and work experience, is required.Analytical and communication skills are necessary to consult with and communicate information to partners/clients; to analyze and summarize information; and to apply laws and regulations to the Company's business.Experience:5-7 or more years' experience, preferably in Compliance or risk management; or equivalent related experience.Working With UsAs a Northern Trust partner, greater achievements await. You will be part of a flexible and collaborative work culture in an organization where financial strength and stability is an asset that emboldens us to explore new ideas.Movement within the organization is encouraged, senior leaders are accessible, and you can take pride in working for a company committed to assisting the communities we serve! Join a workplace with a greater purpose.We’d love to learn more about how your interests and experience could be a fit with one of the world’s most admired and sustainable companies! Build your career with us and apply today. #MadeForGreaterReasonable accommodationNorthern Trust is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation for any part of the employment process, please email our HR Service Center at MyHRHelp@ntrs.com.We hope you’re excited about the role and the opportunity to work with us. We value an inclusive workplace and understand flexibility means different things to different people.Apply today and talk to us about your flexible working requirements and together we can achieve greater.About Our Manila OfficeThe Northern Trust Manila office celebrated a decade of excellence in 2024. Through agility, resiliency, innovation, and excellence, they have evolved into a dynamic hub with diverse capabilities and a thriving workforce of over 1,200 — driving meaningful impact and sustainable growth. Learn more. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355783537/",
    "job_id": "4355783537",
    "source": "linkedin",
    "company_name": "Emirates",
    "job_title": "Manager Treasury - Financing",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365835196/",
    "job_id": "4365835196",
    "source": "linkedin",
    "company_name": "OMNIYAT",
    "job_title": "Senior Accountant - Finance Reporting",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360580901/",
    "job_id": "4360580901",
    "source": "linkedin",
    "company_name": "TLS LOGISTICS",
    "job_title": "Budget and Financial Reporting",
    "location": "Tuzla, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321315180/",
    "job_id": "4321315180",
    "source": "linkedin",
    "company_name": "MAA GROUP BERHAD",
    "job_title": "MANAGER/SENIOR MANAGER - COMPLIANCE & AUDIT",
    "location": "WP. Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "POSITION SUMMARYSupervise, monitor and evaluate the outsource engagement of internal audit function for the group. The incumbent also ensures Group-wide implementation of the Enterprise Risk Management (ERM) framework. Supervise the day-to-day operations of MAA Credit Berhad and MAAX Factor Sdn Bhd to ensure compliances towards the regulations and guidelines issued by the authorities and the companies. Report to Audit & Governance Committee on quarterly basis for compliance reporting.ESSENTIAL FUNCTIONS Internal AuditTo be the point of liaison for the external service provider and to oversee, review and comment on the work performed by them.To participate and provide inputs on exit meetings with process owners to examine highlighted issues and remedial actions.To institute follow-up action to ensure the complete implementation of agreed measures/ policies/ processes meant to address shortcomings identified in audit exercises.Undertake the ad-hoc internal audit / investigations as and when required by the Audit Committee.Risk ManagementTo be the point of liaison for the external service provider and to oversee, review and comment on the work performed by them with regards to risk review.Provide guidance to the risk management units in the Group’s subsidiaries with the assistance of the outsource service provider with regard to their respective work scopes and execution of responsibilities with a view to strengthening their role in the overall governance framework.Loan ManagerTo undertake loan processing which includes liaising with the relevant solicitors, valuers, borrowers, guarantors, and other stakeholders related to the loan.To conduct loan assessment via RAMCI and propose to management on borrowers’ eligibility.To prepare Board papers for Board’s approval.To prepare Letter of Offer, Loan Agreement and ensure perfection of document before disbursement.To oversee the day to day operation of Microfinancing.To undertake loan approval and verification for Microfinancing.To provide loan report to Group Finance and any other report as requested.Manages between 1-3 staff performing loan processing.Head of Operation and Compliance for MAAX Factor Sdn BhdTo undertake the verification and approval (within certain limit) of factoring cases.To ensure documentation is in order before disbursement done (except for waived cases as approved by management).To discuss with management on recourse action to be taken on defaulters.Manages between 1-3 staff performing the admin and operation division.Collaborates with teams from other division i.e., Sales & Marketing, Business Development and Risk & Credit Analyst on factoring facilities to share knowledge and problem solving.Compliance Officer for MAA Credit Berhad and MAAX Factor Sdn BhdTo ensure compliance with the Anti-Money Laundering/ Counter Financing of Terrorism Act, Personal Data Protection Act, Money Lenders Act and relevant guidelines issued by authorities.To ensure effective implementation of appropriate policies and procedures, including Customer Due Diligence (“CDD”), record-keeping, on-going due diligence, suspicious transaction report and combating of terrorism.To ensure regular assessment of the AML/CFT mechanism such that it is effective and sufficient to address any change in ML/TF trends.To ensure security and confidentiality of communication from the respective employees.To ensure all employees are aware of the reporting institution’s AML/CFT measures, including policies, control mechanism and reporting channels.To establish and maintain relevant internal criteria (red flags) to enable identification and detection of suspicious transactions.To ensure appropriate evaluation of internally generated suspicious transactions reports before reporting to the Financial Intelligence and Enforcement Department, Bank Negara Malaysia.To ensure proper identification of risks associated with new products or services or risks arising from the operational changes, including the introduction of new technology and processes; andTo ensure compliance with any other obligations that are imposed by the authorities.CustodianTo ensure safe keeping of original document, agreements, legal papers, titles, charge, and shares certificates as forwarded by respective companies within MAA Group and its subsidiaries.To liaise with key holder and combination number holder on the operation of the safe.To appoint new key holder and combination number holder upon their resignation and propose to management for approval.OthersTo review findings / reports from subsidiaries before they are tabled at the Audit Committee and Risk Management Committee meetings.Prepare the Statement on Risk Management and Internal Control (SORMIC), Audit Committee Report and Corporate Governance Statement for the Annual Report. Prepare the Corporate Governance Report for submission to Bursa Malaysia.Keep abreast with developments in the internal audit and risk management fields with a view to incorporating the sa",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368546829/",
    "job_id": "4368546829",
    "source": "linkedin",
    "company_name": "Morgan Philips Group",
    "job_title": "Manager, Group Compliance and Audit - MY874879",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366106271/",
    "job_id": "4366106271",
    "source": "linkedin",
    "company_name": "Alignerr",
    "job_title": "Governance, Risk & Compliance (GRC) Analyst",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365813600/",
    "job_id": "4365813600",
    "source": "linkedin",
    "company_name": "Techcombank (TCB)",
    "job_title": "Expert, Technology and Digital Risk Management",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "A. JOB PURPOSE1. Develop and maintain technology risk management framework, policies, procedures, guidelinesDevelop principles and methodologies for technology risk management, establishing technology risk limit, key risk indicators... according to international practices, legal regulations, and internal governance requirementsStandardize risk management activities including identifying, assessing, responding and monitoring technology and information security risks following industry best practice and international standards (NIST, ISO, COBIT ...)Develop technology & information security threat/ vulnerability/ scenario/ control catalogsConsult relevant units to develop BCP/DRP in bankwide level.2. Develop technology risk management capabilities and improve bankwide technology & information security risk awareness and cultureB. KEY ACCOUNTABILITIES1. Establish and maintain the technology risk management frameworkProvide subject matter advices and develop technology risk management framework, methodologies, regulations, policies, standards, procedures, guidelines.Enhance risk taxonomies, governance policies and operating models collaborating with ORM based on investigation findings to enhance robustness of existing risk mechanismEstablish and allocate technology risk limits, key risk indicators (KORI) according to international practices, legal regulations, and internal governance requirements2. Assess technology risks, consult to develop mitigation solutions and monitorReview and approve technology risks in technology platforms, technology and business processes under the authority as prescribedConsult to develop solutions and methods to effectively mitigate and manage technology risk based on technology risk management framework, ensuring comprehensive risk management implementationTechnical control assurance based on internal policies, government law and regulations, international security standardsIndependent investigate cybersecurity/ technology risk events or digital platform risks; analyzing root causes, proposing solutions/actions to mitigate and manage risks3. Develop technology risk management capabilities, improve bankwide technology risk awareness and cultureResearch on emering technologies appying in banking operations to provide subject matter advices in managing emerging risksBuild & implement technology risk management capabilities (i.e. competencies standard, training, upskilling, coaching and communication) to enhance bank’s capability in managing technology risks in bankwide levelSupport other units to conduct training and communication to improve bank-wide technology risks awareness and cultureC. REQUIREMENTSExperienceAt least 8 years of relevant work experience in IT field, including at least 3 years of IT risk management (1st or 2nd line of defence) experienceHave experience in developing IT risk governance & management framework, risk management policies, procedures and guidelines.Have experience in IT infrastructure operation/ IT Architecture/ Cybersecurity operation/ DevSecOps/ Cloud ComputingHave experience in IT Audit, IT compliance & assuranceHave experience in developing IT risk management capabilities to enhance bank’s capability in managing technology risks ExpertiseExtensive knowlegde IT & cybersecurity risk management framework (COBIT, ITIL, ISO, NIST ...), internal information security laws & regulations (Circular 09/2020-NHNN, Circular 50/2024-NHNN, Cybersecurity Law, Personal Data Protection Law ...), and international information security standards (SWIFT CSP, PCI DSS, CIS ...)Deep knowledge in at least 1 of the following areas: IT infrastructure operation/ IT Architecture/ Cybersecurity operation/ DevSecOps/ Cloud computingGood knowledge of emerging technologies such as GenAI, Blockchain, Quantium technology, etc.QualificationsHaving a university degree or higher on Information Technology, Information System, Computer Science, Electronics & Telecommunications, Information Security or equivalent...English: TOEIC 500 or equivalentProfessional certifications in IT Risk, IT Security: CISA/CISSP/CRISC/CISM/COBIT/ITIL ... Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355702590/",
    "job_id": "4355702590",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Customer Support (Internet) - (For Bengal Broadband Limited) - Job ID - 1453171",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321534499/",
    "job_id": "4321534499",
    "source": "linkedin",
    "company_name": "Valiram",
    "job_title": "Business Analyst (FP&A)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367824094/",
    "job_id": "4367824094",
    "source": "linkedin",
    "company_name": "GemCommerce",
    "job_title": "Product Executive (Business Analyst Based)",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355703133/",
    "job_id": "4355703133",
    "source": "linkedin",
    "company_name": "Şanstech",
    "job_title": "Business Analyst",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Şanstech is a growing technology company with young and dynamic talent. We create an environment and offer growing opportunities for young talent to develop their skills while experimenting with agile solutions. Technological innovation is the key to our success. To achieve this goal, we need exceptionally talented, intelligent, and driven people. We are seeking a Business Analyst. If you'd like to help us achieve this success, here's your chance to make history. We're looking for a dynamic, organized, and entrepreneurial team to join our Product and Customer Management team. Job Description Perform process analysis and technical analysis of projects, including task creation and process management.Receive requests from business units and execute solution implementation processes.Ensure coordination and effective communication with different team units.Manage work plans and documentation, and track work, testing processes, and defects.Work within Project Management principles during solution implementation. Qualifications Bachelor's Degree in Computer Engineering preferred.Ideally 4+ years of experience as a Technical Business Analyst/Business Analyst in software development.Participate in the analysis, design, and implementation processes of software projects.Experience and knowledge of middleware, application, and web service technologies such as SOAP/REST Web Services, XML, JSON, WSDL, Kafka and Redis.Proficiency in Jira, Confluence, Java, .Net, and SQL.Proficiency in Activity Diagrams, Sequence Diagrams, Use Case Diagrams, and State Diagrams.Excellent teamwork and collaboration skills.Strong written and verbal communication skills and good interpersonal skills.Analytical thinking and Problem-solving skillsThe ability to anticipate and effectively solve complex problems; build consensus and harmony, act with urgency, achieve results, and take informed risksStrong planning, organization, documentation, and coordination skillsThe ability to adapt to flexible working hoursProficiency in EnglishPreferably knowledge of iGamingFor male candidates, completion of military service Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354117893/",
    "job_id": "4354117893",
    "source": "linkedin",
    "company_name": "Sama X",
    "job_title": "Sales and Billing Operations Manager",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job ProfileThe Sales and Billing Operations Manager is responsible for optimizing and supporting the end-to-end sales process for satellite connectivity plans and services. This role ensures operational excellence, accurate forecasting, pricing governance, CRM integrity, billing operations and smooth cross-functional coordination across sales, finance, technical, and operations teams to achieve Sama X‘s revenue, margin, and growth.Key ResponsibilitiesSales Process Optimization• Design and improve sales processes, workflows, and tools.• Ensure consistent sales methodology and documentation standards.• Optimize lead management, qualification, and funnel stages.2. Sales Planning and Forecasting• Support the CCO in developing sales plans and accurate revenue forecasts.• Consolidate sales performance data by country, segment, and product• Track pipeline health, cycle times, conversions and churn.• Deliver regular sales reports, KPIs and dashboards for Leadership review.3. Reporting and Analytics • Monitor KPIs: sales pipeline health, conversion ratios, average sales cycle, churn, and utilization rates.• Generate monthly management reports summarizing key insights, opportunities, and risks.• Track data-pools consumption/utilization and margin performance per region or partner and coordinate with Sales.• Analyze performance of products and services.4. Pricing Governance & Commercial Support• Support pricing, margin validation, and offer structuring.• Maintain pricing catalogs and discount frameworks.• Review proposals for compliance and profitability.• Manage commercial approval workflows.5. Sales Enablement• Develop sales templates, playbooks, and product guides.• Lead onboarding programs for new sales hires.6. CRM Management & Data Quality• Monitor CRM configuration and reporting.• Ensure accurate and complete customers and pipeline data.• Train and enforce CRM usage across sales teams• Relay to and coordinate with CTO required CRM updates, features and fixes7. Deal & Contract Operations• Support proposals, RFP submissions, and documentation.• Ensure proper contract handover to delivery, NOC, and billing teams.• Track renewals and contract term compliance.8. Billing Operations• Oversee end-to-end billing for Starlink services (hardware, subscriptions, data plans, add-ons, services,..).• Ensure accurate invoicing aligned with pricing models, customers contracts and SLAs.• Manage recurring monthly billing, prorations, upgrades, suspensions, and terminations.• Validate billing against activated terminals and service start dates.• Ensure billing complies with approved bids, prices and discount levels.• Monitor gross margins per customer, deal, and service type.• Coordinate with Finance for accurate billing, invoicing, revenue recognition and collection.9. Cross-Functional Coordination• Act as liaison between Sales, Product, Engineering, Legal, Finance, and Operations.• Ensure alignment on product launches and provisioning processes.• Track delivery SLAs and escalate issues.Candidate Requirements Bachelor’s degree in Business, Engineering, Telecom, or related field.15+ years of experience in sales operations in satellite, telecom, ISP, or technology sectors.Understanding of LEO satellite services, terminals, and bandwidth models.Strong CRM knowledge (Salesforce, HubSpot, Zoho, Dynamics).Excellent analytical, reporting, and financial modeling skills.Experience in pricing governance and commercial processes.MBA is a plusKey CompetenciesHighly structured and process-oriented.Strong analytical and problem-solving skills.Excellent communication and stakeholder management.Ability to thrive in fast-paced, multi-country environments.Strong ownership and attention to detailProficient in English with excellent written and verbal communications skills Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355823056/",
    "job_id": "4355823056",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer-Admin & HR (Ashulia & Gazipur Zone) - For A reputed knit garment manufacturing & exporting Company. - Job ID : 1453142",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "A reputed knit garment manufacturing & exporting Company. is looking for Officer-Admin & HR (Ashulia & Gazipur Zone)Job Description / ResponsibilityFollow-up Attendance, Salary Administration, Leave Management & Compensation Benefit & incentive schemes.Follow-up a sound Performance Management System for all workers, staffs and management personnel in the factory.Follow up employee/labor relation & legal affairs work Preparation / Issue office note, memo, office order & circular in respect of HR issues.Follow-up Appointment processing, Orientation / Induction, exit interview.Ensure transfer, increment, promotion, separation, confirmation related work.To develop, upgrade and implement HR policies, guidelines up to a reasonably acceptable standard for establishing smooth HR operation within the company.Follow up Disciplinary action & conduct departmental inquiry & grievance.Follow up expenditures like staff & workers salary & wages, overtime & night allowance, incentives, education allowance, Tiffing bill, Final settlement bill etc.To improve workers and management relationship, communication with workers & staffs, attend participation committee meeting and safeguard the facility against labor unrest and conflict.Ensure security of plant, properties, premises & personnel.Negotiate/resolve daily problems among workers/staffs etc on administrative issues.Maintain rapport with the local bodies, buyer representatives and govt. agencies.Ensure administrative policy & procedure for smooth running in the factory.Update all license, certificates & follow up hygienic issues.Ensure administrative related MIS are properly maintain & update.Any other activities assigned by the management from time to time.Educational RequirementsBachelor of Business Administration (BBA) in Human Resource ManagementExperience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):Garments,Textile,Group of CompaniesJob LocationGazipur, Dhaka (Ashulia) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355716453/",
    "job_id": "4355716453",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive Tally Officer (For Karmo Group)-Job ID: 1453964",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357099225/",
    "job_id": "4357099225",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Accounts Officer (For iFarmer Limited)-Job ID: 1455277",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284483506/",
    "job_id": "4284483506",
    "source": "linkedin",
    "company_name": "Supertech Innovation Labs",
    "job_title": "AR/IoT Development Specialist",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367256090/",
    "job_id": "4367256090",
    "source": "linkedin",
    "company_name": "Intervest Software Technologies (Private) Limited",
    "job_title": "Customer Success Operations Manager (New Business)",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355922864/",
    "job_id": "4355922864",
    "source": "linkedin",
    "company_name": "Michael Page",
    "job_title": "Head of Controlling and R2R",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "For our international client, we are hiring a Head of Controlling (DACH) to join a newly built Global Business Services hub in Warsaw. This is a senior, hands-on leadership role combining end-to-end ownership of Swiss entity controlling (close, compliance and governance) with continuous process improvement and team build-out. Client DetailsOur client is a fast-growing, global organisation with a strong focus on innovation, quality and accountability. They are scaling their international finance footprint and investing in modern systems, robust governance and high-performing teams. The role is based in Warsaw in a hybrid model (3 days/week in the office, 2 days remote).Description Lead Swiss controlling / R2R operations for multiple legal entities, ensuring accurate and timely month-end, quarter-end and year-end close.Ensure compliance with applicable reporting frameworks (e.g., US GAAP, Swiss statutory requirements, and relevant Swiss accounting standards).Own statutory reporting, regulatory submissions and audit coordination with external auditors and local advisors.Partner with Technical Accounting on complex accounting topics (e.g., collaboration arrangements, Gross-to-Net, contract reviews) to ensure appropriate accounting treatment.Oversee accounting and governance for a Swiss principal / hub model, including intercompany flows, transfer pricing entries, and profit/cost allocation mechanics across Europe.Coordinate with Tax and external consultants on transfer pricing compliance, intercompany agreements and Swiss-specific regulatory expectations.Maintain strong internal controls and financial risk management; perform balance sheet reviews and analytical controls (e.g., flux/variance analysis).Execute and evidence assigned SOX controls in partnership with Internal Controls, ensuring audit readiness and consistent control design.Act as the key interface between Swiss controlling and Group Consolidation during close cycles, supporting reconciliations and reporting deliverables.Drive standardisation and continuous improvement across processes, controls and documentation, reducing manual work and improving quality.Support system enhancement initiatives and tool rollouts (e.g., BlackLine), ERP/process upgrades, and automation/reporting improvements.Partner cross-functionally with FP&A, Tax, Treasury, Legal, HR and commercial finance leaders to align on data, reporting, and business requirements.Contribute to finance strategy discussions by providing insights, recommendations and practical execution plans in a scaling environment.Build, lead and develop the Swiss controlling team; hire initial roles and set expectations, ways of working, and performance culture. Profile Bachelor's degree in Accounting, Finance, Business or similar.8+ years of progressive accounting/controlling experience in a multinational environment.Proven track record leading finance operations across multiple European entities; exposure to a Swiss principal / hub structure is strongly preferred.Strong knowledge of US GAAP and European statutory reporting; solid understanding of Swiss statutory context is an advantage.Very good command of transfer pricing mechanics, intercompany accounting, and cross-border financial operations.Experience managing statutory audits, external advisors and compliance deliverables end-to-end.Demonstrated internal controls mindset (incl. SOX exposure preferred), balance sheet ownership and analytical controls/variance reviews.Hands-on systems capability: SAP S/4HANA essential; BlackLine experience strongly preferred; strong Excel skills; familiarity with Power BI and finance tools (e.g., Ariba, Concur, Workday) is a plus.Strong leadership skills with experience managing and motivating teams in a hybrid model.Able to thrive in a changing, sometimes non-structured environment; pragmatic, proactive and solutions-oriented.Excellent stakeholder management and communication skills in English; additional European languages are a plus.Project / change management exposure is an advantage (process improvement, system implementations, automation). Job Offer Private medical care including dentalLife insuranceAnnual bonusCar allowanceBenefits platformEmployee Stock Purchase Plan Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284078719/",
    "job_id": "4284078719",
    "source": "linkedin",
    "company_name": "Master Works",
    "job_title": "WebMethods Developer",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284028833/",
    "job_id": "4284028833",
    "source": "linkedin",
    "company_name": "Master Works",
    "job_title": "GCP Infra Cloud Support Engineer",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367815234/",
    "job_id": "4367815234",
    "source": "linkedin",
    "company_name": "Qiddiya | القدية",
    "job_title": "Senior Manager - Finance Technology - Horizon & Ramp up (CORS300)",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369350543/",
    "job_id": "4369350543",
    "source": "linkedin",
    "company_name": "PT Armindo Intercorp (VIP Furniture)",
    "job_title": "Accounting Manager",
    "location": "Tangerang, Banten, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365793273/",
    "job_id": "4365793273",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366107126/",
    "job_id": "4366107126",
    "source": "linkedin",
    "company_name": "Red Dot Payment",
    "job_title": "Senior Accountant (based in Jakarta)",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358350281/",
    "job_id": "4358350281",
    "source": "linkedin",
    "company_name": "K&H Csoport",
    "job_title": "nagyvállalati kapcsolattartó asszisztens",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366123189/",
    "job_id": "4366123189",
    "source": "linkedin",
    "company_name": "FCC Environment CEE",
    "job_title": "TERMELÉSI ADMINISZTRÁCIÓS MUNKATÁRS",
    "location": "Gyál, Pest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355806725/",
    "job_id": "4355806725",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Head of Sales & Marketing (Trade & Corporate Sales) - For B&T CABLES LTD. - Job ID - 1453720",
    "location": "Banani, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346389827/",
    "job_id": "4346389827",
    "source": "linkedin",
    "company_name": "Indodana",
    "job_title": "Risk & AML Specialist",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365791327/",
    "job_id": "4365791327",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Bucharest, Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358046054/",
    "job_id": "4358046054",
    "source": "linkedin",
    "company_name": "Auberge Saint-Antoine",
    "job_title": "Technicien(ne) comptable – Comptes recevables, audits et paie",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368739733/",
    "job_id": "4368739733",
    "source": "linkedin",
    "company_name": "MUFG Investor Services",
    "job_title": "Senior Associate, Fund Accounting - Private Debt",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361848041/",
    "job_id": "4361848041",
    "source": "linkedin",
    "company_name": "Farmasi",
    "job_title": "Kıdemli Bordro ve Özlük İşleri Uzmanı",
    "location": "Çekmeköy, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321483784/",
    "job_id": "4321483784",
    "source": "linkedin",
    "company_name": "Yapı Kredi",
    "job_title": "Ticari Portföy Yöneticisi",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366101249/",
    "job_id": "4366101249",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318934544/",
    "job_id": "4318934544",
    "source": "linkedin",
    "company_name": "Johnson Controls",
    "job_title": "Business Unit Finance Partner",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370984183/",
    "job_id": "4370984183",
    "source": "linkedin",
    "company_name": "UNICEF",
    "job_title": "Batch Recruitment (2 Positions): Education Officer, (NO-2), Temporary Appointment (364 days), Chittagong #134679 and Barisal #134521, Bangladesh (Open to Bangladeshi Nationals only)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367652914/",
    "job_id": "4367652914",
    "source": "linkedin",
    "company_name": "Ronald McDonald House Toronto",
    "job_title": "Director of Finance",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356637289/",
    "job_id": "4356637289",
    "source": "linkedin",
    "company_name": "Goway Travel",
    "job_title": "Deputy Chief Financial Officer",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355940212/",
    "job_id": "4355940212",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Intern - Human Resources - For Apex Data Management & IT Ltd - Job ID: 1453988",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Apex Data Management & IT Ltd is looking for Intern - Human ResourcesKey PointsEvening Shift: 1 PM to 10 PMWork Days: Sunday- ThursdayWeekend: 2 Days (Friday-Saturday)Job Location: Dhaka (Banani)Work Schedule: 5 days a week, Sunday to ThursdayJob Description / ResponsibilityJob Overview:Apex DMIT Limited is seeking an HR Intern who is enthusiastic about people-focused work and eager to develop a strong career in Human Resources within a high-performing, multinational environment. The selected candidate will support core HR operations, including recruitment, onboarding, HRIS updates, employee engagement, and documentation. As the role involves frequent interaction with employees, applicants must possess strong communication skills, professionalism, and a proactive learning mindset.Key Responsibilities:Assist in sourcing, screening, and shortlisting candidates.Coordinate interview scheduling and maintain candidate databases.Communicate application updates and support background checks.Help with onboarding tasks and updating employee information in HR systems.Post and update job ads across platforms.Respond to basic employee queries on HR policies and leave.Support HR in organizing events, engagement activities, and career programs.Educational RequirementsBachelor of Business Administration (BBA) in Human Resource ManagementSkills Required: Organizational Skills, Energetic and self-motivated, Google Suite, Leadership and Good Communication skill., Problem solving and analytical skill, Good Ms office and Emailing skill, Google workspaceAdditional RequirementsCandidates must have completed all academic courses except the internship.Internship Duration: 6 months Job LocationDhaka (Banani)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365813205/",
    "job_id": "4365813205",
    "source": "linkedin",
    "company_name": "Betty",
    "job_title": "Head of Finance",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Betty is an innovative entertainment company pioneering at the intersection of real money online casino and casual mobile gaming.As our group continues to grow, we’re excited to launch a new venture — Betty UK. To support this expansion, we’re looking for an experienced Head of Finance to establish and lead the financial strategy, operations, and governance of this newly built company.Key Responsibilities:Establish and manage all financial operations, including accounting, budgeting, forecasting from scratch.Develop financial models and forecasts to support business planning and strategic decision-making.Support the management team in evaluating new investments, partnerships, and business opportunities.Set up and manage accounting systems and reporting structures suitable for a growing organization.Prepare monthly, quarterly, and annual financial statements, management reports, and performance analyses.Manage relationships with banks, auditors, vendors, and other financial partners.Identify and implement process improvements and automation to streamline financial operations.Recruit, train, and lead a small finance team as the company grows.Qualifications & Requirements:Bachelor’s degree in Finance, Accounting, or Economics; a Master’s degree or professional qualification (ACCA, CFA,CIMA) is an asset.Minimum 5 years of experience in finance or accounting, ideally with exposure to startup or fast-growth business environments.Ability to work independently and adapt to changing priorities in a dynamic environment.Strong organizational ability and proactive mindset.Experience setting up and managing financial systems and controls from scratch.Excellent analytical, problem-solving, and communication skills.Strong knowledge of financial reporting and planning.What we offer:Competitive salaryPremium Health insuranceCareer and skills development opportunitiesFun and collaborative team environmentNew modern office space",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320864794/",
    "job_id": "4320864794",
    "source": "linkedin",
    "company_name": "WebPros",
    "job_title": "Staff Accountant",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About WebProsWebPros is committed to empowering businesses worldwide through cutting-edge solutions in web hosting, billing automation, infrastructure, server management, and online marketing. Since our founding in 2017, we’ve rapidly grown into a global leader, expanding our robust portfolio to include industry-defining brands such as cPanel & WHM, Plesk, WHMCS, SolusVM, NIXStats, XOVI, SocialBee, and Sitejet. Today, we power 85 million+ websites across 900,000+ servers worldwide, backed by a 600+ strong team of dedicated professionals spanning multiple continents.Your RoleHi, I’m Agniia, a Financial Director at WebPros and your future manager. I lead a global team of accountants who specialize in international financial accounting and are well versed in both global issues and local legislation. Currently, we’re hiring an Accountant as we’re launching a new Accounting Hub in Bulgaria and growing our team with ambitious professionals ready to help us scale. This position involves accounting and tax support, timely payroll calculations and reporting. You will be involved in managing settlements with counterparties and interacting with banks.ResponsibilitiesBookkeepingProcessing sales invoices and payments receivedProcessing purchase invoices and paymentsProcessing expense reportsProcessing business trip orders and expensesMonthly expenses accrualsBank / Stripe / PayPalWork with online banks and international payment systems (Stripe and PayPal) to process paymentsPerforming month-end bank reconciliationsCash flow planningAP & POInvoicingPayingManaging Accounts Payable and Payment OrdersPayrollPayroll calculation and reconciliation, including insurance, tax calculation and withholding, and employee benefitsFixed Assets & InventoriesHandling fixed assets recognition, depreciation, and write-offBusiness CorrespondenceConducting business correspondence with colleagues from related departments of the companyCommunicating with vendors, banks, tax offices, and other counterpartiesExcel Proficiency - IntermediateConfident use of complex functions and formulas, including creating nested functionsWorking with data arraysUsing advanced analysis toolsAutomation through entry-level macros, understanding of data security principles, and document collaborationRequirementsHigher education in a relevant field, at least a bachelor's degree.At least 3 years of relevant experience in similar functions.Strong knowledge of local GAAP and IFRS.Strong knowledge of accounting principles and IFRS, as well as a full range of financial workflow.Confident use of financial tools, software, etc.Familiarity with judicial practice in the relevant field.Languages: English (upper-intermediate/fluent)Accounting experience with international companies, knowledge in matters related to international transactions, complex tax structures in interaction with several legal entities of the Group will be considered as advantageCompensation & BenefitsWe believe benefits go beyond just perks. At WebPros, we invest in your growth, flexibility, and well-being, so you can do your best work and build a meaningful career. While we strive to provide equal global benefits for all team members, some may vary by location, and we’ll clarify the details with you during the interview process.Learning Support: Udemy subscription & peer learning.Public Transport Ticket: transport card compensation.Gym reimbursement: up to 500 BGN per year.Paid Time Off: 20 days of annual leave.Team Culture: Regular team and on-site company events.Our CultureWebPros is built on diversity, not just in principle but by design. We’ve grown through acquiring industry-leading brands, bringing together teams from 42+ nationalities, 20+ countries, and 10+ brands. Instead of enforcing a one-size-fits-all culture, we embrace unique perspectives, different working styles, and localized expertise to drive global innovation.We are a fully remote, async-friendly company where transparency, open communication, and collaborative problem-solving define how we work. Whether you thrive in the fast pace of a startup or the stability of an established product, WebPros offers a dynamic, evolving career journey that you can shape based on your strengths.We are committed to fostering an inclusive, equitable workplace where every team member feels valued, heard, and supported because our diversity is our strength.Your Hiring ExperienceHi, I am Zornitsa, your Talent Partner at WebPros and I will guide you through the interview process, ensuring a clear, transparent, and meaningful experience.Interview ProcessScreening Interview (30 min): A conversation with Zornitsa to get to know each other, and introduce you to WebPros, our culture, and your potential team. We’ll discuss your motivation, career aspirations, and how your experience aligns with the role while giving you as much insight as possible into what to expect.Hiring Manager Interview (60 min): A discussion with Agniia to evaluate skills and experience, ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366480370/",
    "job_id": "4366480370",
    "source": "linkedin",
    "company_name": "NielsenIQ",
    "job_title": "Data Acquisition Back-Office Specialist",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionThe Data Acquisition Back-Office Specialist will be part of the core operations team responsible for delivering high-quality, standardized back-office services to multiple Western European markets. This role will execute day-to-day activities in accordance with established processes, service level agreements, and corporate standards, ensuring accuracy, timeliness, and efficiency in all tasks.Working in close coordination with the Western Europe Regional Back Office Leader, other Data Acquisition back office team members, and Data Acquisition delivery leaders in the countries, Data Acquisition CoE and Transformation teams, the Hub Executive will play a key role in maintaining smooth service delivery, identifying improvement opportunities, and ensuring a positive customer/stakeholder/vendor experience across supported countries.Key ResponsibilitiesExecute back-office processes and transactions according to Standard Operating Procedures (SOPs) and defined timelinesDeliver high-quality, accurate, and timely outputs to internal stakeholders in supported marketsAdhere to agreed Service Level Agreements (SLAs) and Key Performance Indicators (KPIs)Flag any deviations, inefficiencies, or recurring issues to the Hub Manager for resolution and improvementAct as a day-to-day operational contact for Data Acquisition teams, vendors, commercial and operational teams in local markets, responding to queries and providing updates on requestsCollaborate with colleagues across different functions and countries to ensure smooth end-to-end process completionEnsure compliance with relevant legal, financial, and data protection regulations for each supported countryParticipate in process improvement initiatives, contributing ideas to increase efficiency and qualitySupport testing and rollout of new tools, systems, and workflows as part of Data Acquisition back office enhancementsRequirementsBachelor’s degree or relevant vocational qualification (business administration, operations, finance, or related fields preferred)Experience in back-office, shared services, or administrative operations (multi-country experience is a plus)Experience working in a multicultural, cross-border environmentGood working knowledge of MS OfficeStrong attention to detail and commitment to accuracyGood organisational skills with the ability to prioritise and manage multiple tasksEffective communication skills in English (additional European languages are a strong advantage)Ability to work collaboratively in a team-oriented environmentProactive mindset with willingness to learn and adapt to changing requirementsWe offer:Food vouchers of 120 BGN monthlyAdditional Medical Insurance, incl Prophylactics, Outpatient care, Inpatient care, еxpenses for medications and medical productsLife InsuranceA Hybrid model of working: 3 days of the week you work from home (home office), 2 days from the officeAdditional paid leave of 3 days in case of no overdue leave days from previous yearFree access to LinkedIn Learning platformIn addition:Working in an international organization, once you become a specialist in your field, you can count on numerous programs offering development or relocation to other departments or countries. Your development is important to us!Stable employment in a dynamic and international environment with an established position on the marketThe opportunity to gain a valuable experience and knowledge of FMCG on the country and international levelFriendly working environmentAdditional InformationOur BenefitsFlexible working environmentVolunteer time offLinkedIn LearningEmployee-Assistance-Program (EAP)NIQ may utilize artificial intelligence (AI) tools at various stages of the recruitment process, including résumé screening, candidate assessments, interview scheduling, job matching, communication support, and certain administrative tasks that help streamline workflows. These tools are intended to improve efficiency and support fair and consistent evaluation based on job-related criteria. All use of AI is governed by NIQ’s principles of fairness, transparency, human oversight, and inclusion. Final hiring decisions are made exclusively by humans. NIQ regularly reviews its AI tools to help mitigate bias and ensure compliance with applicable laws and regulations. If you have questions, require accommodations, or wish to request human review were permitted by law, please contact your local HR representative. For more information, please visit NIQ’s AI Safety Policies and Guiding Principles: https://www.nielseniq.com/global/en/ai-safety-policies. About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355915513/",
    "job_id": "4355915513",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Business Analyst - QA (For Pridesys IT Limited) - Job ID : 1453808",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Pridesys IT Limited is looking for Business Analyst - QAJob Description / ResponsibilityQuality Assurance & Product ValidationConduct end-to-end product testing from a business perspective, ensuring features meet functional, logical, and user expectations.Identify, document, and report bugs or inconsistencies using issue-tracking tools such as Jira, Trello, Asana, or similar platforms.Evaluate product modules related to accounting, finance, HR, and other business functions to ensure accuracy and compliance with standard business practices.Validate “must-have” vs. “nice-to-have” features for B2B software based on market standards and user needs.Perform usability assessments to ensure smooth user experience and operational efficiency.Business Analysis & Requirement ManagementPrepare feature checklists, requirement summaries, and acceptance criteria aligned with product goals and user expectations.Maintain requirement traceability throughout development and testing cycles to ensure accurate implementation.Review product requirements, suggest improvements, and support refinement of user stories and specifications.Collaborate with cross-functional teams—including product, development, and design—to align product behavior with business rules.Client Interaction & UAT SupportParticipate in client meetings, demonstrations, and requirement-gathering sessions to understand business workflows.Assist in conducting User Acceptance Testing (UAT), consolidating client feedback, and ensuring timely resolution of issues.Support internal teams with documentation, clarification, and follow-up on product-related concerns.Process & DocumentationPrepare structured test documents, including checklists, acceptance criteria, test summaries, and workflow notes.Ensure clear communication of test outcomes and business-impact insights to relevant teams.Contribute to continuous process improvement by identifying gaps in workflow or system logic.Technology & Domain CompetenceWork confidently with modern, automation-enabled software platforms and B2B SaaS environments.Understand how enterprise users interact with accounting, finance, HR, and business management tools.Assist in shaping the product roadmap through domain knowledge and structured analysis.Educational RequirementsBachelor of Business Administration (BBA)Skills Required: Business/ Product Development, Business Analysis, Quality Assurance, Software Testing, Reporting and Documentation, ERP Systems, SaaSExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): Software Company,IT Enabled Service,Business-to-Business (B2B) Software and Services StartupAdditional RequirementsProfessional experience in B2B SaaS environments, particularly in QA, business analysis, or product development roles.Strong understanding of business workflows, especially accounting cycles, HR operations, procurement, and financial processes.Proficiency in issue-tracking and project management tools (example: Jira)Strong analytical and documentation skillsExcellent communication skills and the ability to work cross-functionally.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364556499/",
    "job_id": "4364556499",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Executive- For Clove Chocolate- Job ID: 1459098",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Clove Chocolate is looking for Accounts ExecutiveJob Description / ResponsibilityMaintain daily accounts and financial recordsManage purchase records, vouchers, bills, and invoicesUpdate cash book, bank book, and ledger regularlyPrepare monthly and yearly financial reportsAssist in budget preparation and monitor expensesMaintain inventory and stock-related accountsTrack supplier payments and receivablesSupport in preparing VAT/Tax-related documents as requiredEducational RequirementsMastersSkills Required: Strategic Planning, Project Management, Market Research, Accounting Software, Cost control, Product Costing and budgeting, Artificial Intelligence UsageExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Advertising Agency,Food (Packaged)/Beverage,Agro based firms (incl. Agro Processing/Seed/GM),Healthcare/Lifestyle product,Beauty Parlor/Saloon/Spa,Agro based Startup, Business-to-Business (B2B) Software and Services Startup,Advertising Technology (AdTech) StartupJob LocationDhaka (Mirpur 1)SalaryTk. 18000 - 25000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4263535725/",
    "job_id": "4263535725",
    "source": "linkedin",
    "company_name": "Minds United",
    "job_title": "IT COMPLIANCE & RISK",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Full TimeJob Purpose The IT Compliance & Risk Lead is responsible for the assessment of technology\\ vendor risks and control effectiveness across .....Job Purpose The IT Compliance & Risk Lead is responsible for the assessment of technology\\ vendor risks and control effectiveness across the IT disciplines. The IT Risk lead will identify, classify, and document control issues in banks environment by documenting assessment results, recommending corrective action, tracking remediation, evaluating policy and control standard exceptions, and regularly report to IT management.Key Accountabilities Supports the establishment of the IT risk management process and integration and maturing of the process across the IT disciplines and practices. Supports development of the technology risk framework, policies, standards, and risk taxonomy. Supports the implementation and adherence to the risk framework, in collaboration and conjunction with business-aligned risk partners. Evaluates and identify technology risk related to divisions and the enterprise, including emerging trends that may impact risk profile. Supports the self and control risk assessment (RCSA) for IT and engage with the IT stakeholders to define the controls in place, residual risk and treatment plans. Maintains a consolidated list of the technology risk at the enterprise level and ensure a continuous monitoring on the risks and corresponding mitigations plans. Implements risk assessments across the enterprise and build an overall profile of the technology risk. Provides credible challenge based on risk assessment results and ensure risk is being mitigated. Collaborates with division risk officers and subject matter experts to ensure policies and standards are practical, effective and efficientQualifications Bachelor’s/master’s degree in computer science or related field.Professional Certifications COBIT, ITIL, CRISC, ISACAExperience 6 – 8 YearsSkills Minimum 3-5 years of experience in IT risk and compliance role. Solid understanding of IT governance, information security policies, standards and industry best practices. Experience in technology and operational risks frameworks. Practical experience in scoping, conducting risk assessment, and documenting results. Detail oriented and able to meet tight deadlines. Excellent documentation skills and ability to communicate effectively across functional areas.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370732341/",
    "job_id": "4370732341",
    "source": "linkedin",
    "company_name": "Insight Global",
    "job_title": "Accountant - Senior & Intermediate Tax Specialist",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Insight Global is looking for an Accountant - (Tax Specialist)Looking for 2 roles.Accountant - Senior (Tax Specialist)Accountant - Senior (Senior Tax Specialist / Manager)The Tax Specialist will be responsible for the effective and timely completion and filing of all requisite tax returns for complex Estate and Trust accounts. The Tax Specialist fulfills a variety of income tax compliance, planning and administrative functions.Reporting to the Director, Tax Services, the Manager tax trust services will be responsible for managing new and junior staff, training sessions, prepare complex tax returns and oversee/review tax returns. Ensure effective and timely completion for complex Estate and Trust accounts and fulfills a variety of income tax compliance, planning and administrative functions.How You’ll Succeed· Client engagement Understanding the business structure and associated risks. Gather relevant information for complex tax return preparation.· Compliance identification, assign and review in timely manner Performs calculations, completes required schedules, and organizes the information for complex returns without additional oversight. Review client accounts to ensure compliance obligations filed on time, ensuring credit optimization and all reporting obligations are met.· Relationship building- Liaise with Tax team, CIBC Trust staff, outside tax professionals, and clients to ensure that: income tax filing requirements for more complex returns are met on a timely basis; taxation issues are explained and resolved; and tax strategies are implemented effectively.· Subject Matter Expertise- Technical expertise in estate and trust taxation. Accurately reviews, personal, Estate and trust income tax returns and schedules. Identify post-mortem and other tax planning opportunities. Act as a technical tax resource to the Executive Trust Associate Team and tax team personnel. Review assessment notices and prepares adjustment, objection notices and Clearance Certificate requests for filing. Corresponds with the CRA to ensure any requests for information are provided. Review complex tax returns such as GRE’s and terminal T1 returns, rights or things.· Leadership capabilities- Participate in Special Projects as assigned. Ability to manage and train junior staff. Ability to take ownership of assigned projects with limited supervision.Who You Are· You put our clients first. You engage with purpose to find the right solutions. You go the extra mile because it's the right thing to do. Well-developed communication skills sufficient to interact effectively with clients, professionals, and small groups. Ability to co-ordinate multiple activities simultaneously with time management components and influence the delivery of responses from various parties.· You’re goal oriented. You are motivated by accomplishing your goals and delivering your best to make a difference. You have the ability to co-ordinate multiple activities simultaneously with time management components and influence the delivery of responses from various parties.· You give meaning to data. You enjoy investigating complex problems and making sense of information. You communicate detailed information in a meaningful way.· You can demonstrate experience in helping managing workloads, taking full ownership, working independently, prepare and review tax returns T1, T1 terminal (final), T3 trusts and estate returns. Assistance with outsourcing tax returns/ identify tax planning opportunities. Familiarity with graduated rate estates including their benefits and exceptional writing skills sufficient to prepare various communications containing detailed descriptions, explanations, and specialized Estates & Trusts terminology. It’s an asset if you have strong tax research and computer skills and ability to work paperless and Tax prep software.· You’re a certified professional. CPA/CA You have current accreditation and good standing in STEP, CSI or Taxation Courses.· You have a degree/diploma in ­­­­­­­­­­­­­­­­­­Accounting.· Values matter to you. You bring your real self to work, and you live our values - trust, teamwork, and accountability.Must Have Requirement:- 3-5+ years of experience in an Accounting or tax related role.- Familiar with graduated rate estates- Post-secondary degree in accounting or equivalent- Experience with preparation of T1- Experience with preparation of T1 terminal (final)- Experience with preparation of T3 trusts and estate returns- Tax prep software experience- Ability to conduct research and technical expertise-Leadership skills and strong decision-making,Nice to Have:- CPA preferred or working towards",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367499744/",
    "job_id": "4367499744",
    "source": "linkedin",
    "company_name": "Aplin",
    "job_title": "Senior Analyst, Commodity Tax",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Our client, a leading Canadian financial services organization backed by a well-established national enterprise, is seeking a Senior Analyst, Commodity Tax to join their growing finance team.This role supports a highly regulated banking environment and offers exposure to complex indirect tax matters within a financial institution setting. The successful candidate will play a key role in ensuring compliance, advising internal stakeholders, and supporting ongoing process and system enhancements.Benefits & Perks$80-90k3 days in office per week (Downtown Toronto)CPA support and professional development opportunitiesCollaborative, close-knit team environmentStrong commitment to diversity, equity, inclusion, and accessibilityResponsibilitiesPrepare monthly, quarterly, and annual GST/HST/QST returns for a financial institution classified as a Selected Listed Financial Institution (SLFI) and related entitiesPrepare, review, and reconcile quarterly commodity tax journal entriesAct as a subject matter expert on indirect/commodity tax matters, providing ongoing advisory support to internal business units, including review of vendor contractsCompile information from multiple financial systems and business units to support filings, audits, and inquiries from tax authorities and external auditorsDevelop, enhance, and maintain commodity tax accounting procedures, internal controls, and standard operating proceduresMonitor changes in commodity tax legislation and interpretations, assess impact, and communicate implications to stakeholdersSupport ad hoc initiatives and cross-functional projects as requiredQualificationsPost-secondary education in Accounting or a related fieldMinimum 3 years of indirect/commodity tax experience, ideally within:Banking or financial servicesInsurance, pensions, or financial institutionsBig 4 or large professional services firms with financial services exposureStrong understanding of how commodity tax rules differ for financial institutions versus non-financial organizationsExperience preparing GST/HST/QST returns in a complex, regulated environmentSolid knowledge of accounting principles as they relate to indirect taxExperience working with large financial systems (e.g., SAP)Advanced Excel skillsStrong communication skills with the ability to explain tax matters to non-tax stakeholdersCPA designation is an assetAt Aplin — together with our brands CompuStaff and Impact Recruitment — we connect great people with great organizations across North America. We believe diverse teams build stronger companies, and we welcome applicants from all backgrounds, experiences, and perspectives. We use AI tools to assist in a fair and efficient matching process, helping our recruiters connect the right people with the right opportunities. To be considered, applicants must be legally entitled to work in Canada, including holding any required permits. Our recruitment services are always free for job seekers.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363440809/",
    "job_id": "4363440809",
    "source": "linkedin",
    "company_name": "MNP",
    "job_title": "Senior Accountant, International Corporate Tax",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Make an impact with our International Corporate Tax team as a Senior Accountant. This diverse team of professionals delivers customized tax strategies within a complex and dynamic regulatory framework. As a trusted advisor, you’ll develop innovative strategies that enable clients to streamline processes, maximize efficiencies and minimize global tax liability while meeting their international reporting requirements.MNP is proudly Canadian. Providing business strategies and solutions, we are a leading national accounting, tax and business advisory firm in Canada. Entrepreneurial to our core, our talented team members transcend obstacles into opportunities and are successfully transforming mid-market business practices.ResponsibilitiesConduct international corporate tax engagements involving advice on tax planning opportunities, worldwide tax minimization strategies, and compliance issues for Canadian entities carrying on business in foreign countriesDeliver industry and technical expertise relating to complex offshore tax and assurance issues through client interactions, reports, technical work, management presentations and high quality deliverables Assist organizations in determining the most effective corporate structure from a tax perspective in different countries; as well as assisting clients in choosing effective methods of capitalization and financing Assist in performing due diligence or modeling with respect to potential acquisitions by Canadian entities of international subsidiaries, partnerships or business operationsResearch client issues that arise from compliance or planning work such as the effects of various tax treaty provisions on the taxpayer (capital gains, dividends, business profits, etc.)Think strategically about client needs by understanding their business, key risks and identifying ways to maximize client relationships and deliver added valueCollaborate with client engagement team prior to commencement of client work to discuss roles and responsibilities, risk areas, materiality and deadlinesLead engagement teams, developing effective relationships with clients while coaching and mentoring junior team membersContribute to the development of new ideas and approaches to improve work processes Participate in business development initiatives and identify new business opportunities Maintain flexibility to travel, as necessary Skills And ExperienceBachelor’s degree in commerce or business administration (accounting or finance major is preferred)Completion of, or working towards, a CPA designation; completion of the CFE examination and working towards relevant practical experience requirements will also be considered2 to 4 years of relevant public accounting or tax experience Experience working within U.S. or international personal, partnership, trust and corporate tax within public practice is considered an assetExperience working with accounting and tax software MyRewards@MNP With a focus on high-potential earnings, MNP is proud to offer customized rewards that support our unique culture and a balanced lifestyle to thrive at work and outside of the office. You will be rewarded with generous base pay, vacation time, 4 paid personal days, a group pension plan with 4% matching, voluntary savings products, bonus programs, flexible benefits, mental health resources, exclusive access to perks and discounts, professional development assistance, MNP University, a flexible ‘Dress For Your Day’ environment, firm sponsored social events and more!The annual salary range for this position is: $65000 - $95000Diversity@MNPWe embrace diversity as a core value and celebrate our differences. We believe each team member contributes unique gifts and amplifying their potential makes our business stronger. We encourage people with disabilities to apply!Future/Current Opportunity: Current",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374733325/",
    "job_id": "4374733325",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Financial Analyst",
    "location": "Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Desired Education: University educationLanguage Skills: EnglishFinancial Analyst will work with a team of financial and operational professionals in the maintenance of existing policies and procedures as well as the deployment of the teams’ resources to address a diverse range of issues and opportunities as they arise. The role is manufacturing finances focused.What Will Be Your ResponsibilitiesFP&A: Critical finance responsibility is understanding the relationship between the P&L and balance sheet. This role will assist in providing material support by identifying financial trends, spotting data inaccuracies, and driving process alignment where possible.Headcount - alignment of HC, cost centers, location, entity financially while also maintaining a linkage to HR’s Success Factors which ensure accurate costing Planning Sessions –provide critical support to Controllers and Finance Consolidations Manager.Month-End Close – Support the team in expediting the close process through job margin analysis, profit center accounting maintenance, account reconciliations, settlements, and other ancillary support required to meet the business targets.Manufacturing Cost Support: This role will support the weekly controllership call. Including tracking metrics on forecasting accuracy, Capitalized Variance support, Fixed Overhead Support, and populating common financial KPI’s.Daily: Cost creation for new materials (not deadline-sensitive)Weekly: Controllers Meeting, Capitalized Variance and Capitalized Fixed Overhead Forecasting, Settlement processing for SAP locations in scope, KPI reporting: Revenue, COGS, Expenses, Hours, OT, Productivity, Efficiency, Spend Analysis, PPV investigationMonthly: WD1 review of Billing Analysis (Revenue and Cost Support), GRNI support, Account ReconciliationsQuarterly: Capitalized Variance and Capitalized Fixed Overhead Calculation, E&O CalculationControllership: Creating well-determined sustainable processes which have detailed standard operating procedures. Additionally, supporting the Finance Director with ad-hoc analysis and support as required inclusive of providing backup support, as needed, for other Financial AnalystsWhat Is Important For UsExperience in accounting and reporting in a global manufacturing or in a manufacturing environment.Bachelor’s degree (or international equivalent) in Accounting, Finance, BusinessProficient in Microsoft Office applicationsExperience in SAP, HFM and Essbase systems preferable (Hyperion experience beneficial)Advanced level of EnglishWhat We OfferMotivating salary and annual bonusesEquity grant (company shares)Meal vouchersFlexipass vouchers 700 CZK or Multisport Card for free5 weeks of holiday, sick days, volunteering dayCelebrate your birthday (day off)Flexible working hoursUp to 50% of Home OfficeContribution to language/professional courses 6000 CZKContribution to pension and life insuranceMobile service employee programPleasant and modern working environment close to the city centerRefreshments at the workplace for freeEmployee assistance programLinkedIn Learning free accessFor further information, and to apply, please visit our website via the “Apply” button below.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373403291/",
    "job_id": "4373403291",
    "source": "linkedin",
    "company_name": "Square Food & Beverage Ltd.",
    "job_title": "Jr. Officer - Accounts & Finance - Job ID : 1459746",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368749534/",
    "job_id": "4368749534",
    "source": "linkedin",
    "company_name": "Turner & Townsend",
    "job_title": "Senior Asset Data Manager",
    "location": "Greater Dublin",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Turner & Townsend is a global professional services company with over 22,000 people in more than 60 countries.​Working with our clients across real estate, infrastructure, energy and natural resources, we transform together delivering outcomes that improve people’s lives. Working in partnership makes it possible to deliver the world’s most impactful projects and programmes as we turn challenge into opportunity and complexity into success.​Our capabilities include programme, project, cost, asset and commercial management, controls and performance, procurement and supply chain, net zero and digital solutions.​We are majority-owned by CBRE Group, Inc., the world’s largest commercial real estate services and investment firm, with our partners holding a significant minority interest. Turner & Townsend and CBRE work together to provide clients with the premier programme, project and cost management offering in markets around the world.​Please visit our website: www.turnerandtownsend.comJob DescriptionThe Data & Asset Management Specialist will be working in the Geospatial and Asset Information team to support core information systems, including the Project CDE, GIS, project information systems, and asset management systems. Reporting to the Geospatial and Asset Lead, the role holder will oversee the capture, production, management, and dissemination of geospatial, project and asset data, ensuring it meets Client's standards.The role holder will be the key contact for Client's asset information standards, production methods, and procedures for asset related data.The Data & Asset Management Specialist is responsible for supporting the delivery teams to meet Client’s requirements for geospatial, project and asset data and provide assurance that all delivery teams geospatial and asset data meets the required level of information need and acceptance criteria. Responsibilities:Collaborate with the digital function in establishing an asset data management approach that relies on the adoption and implementation of UniClass. Ensure best use of existing digital solutions that are in use across client. Drive research and recommend key technologies required to successfully implement projects approach to asset management. Collaborate with key stakeholders on the project that are tasked with the construction and installation of Client's assets and those tasked with the operation and maintenance of those assets. Drive the accuracy, consistency, and integrity of asset data, implementing quality control measures and best practices. Perform additional tasks, activities or other duties as may be required or assigned as part of the role. Qualifications >7 years’ experience in asset data production and management with specific experience carrying out the production and management of structured data relating to physical and functional characteristics of project assets across the project lifecycle in a high value metro rail projects of similar size and complexity. Experience working in a highly collaborative environment, feeling comfortable to engage with staff at all levels across the business as well as key project stakeholders, internal and external. Strong experience of developing structured data of rail projects or infrastructure projects of a similar scale / complexity. Experience dealing with a range of stakeholders at all levels across the organisation influencing the improvement of processes and providing guidance to support project delivery and reporting. Tangible experience of driving best practice in technical activities, processes, policies and standards. Experience with cloud-based systems and platforms (e.g. Azure, AWS or GCP)Proven track record in data governance, data quality and regulatory complianceFamiliarity with industry frameworks (e.g. DAMA-DMBOK)Asset management experience in applying the principles in relation to ISO 50001 and BIM standards (ISO19650). SkillsHands-on understanding of the production and management of Asset data. Hands-on understanding of the design and delivery requirements of complex projects in the architectural, engineering and construction sectors. Knowledge of quality management and process improvement practices and systems is desirable, preferably within the construction sector. Ability to effectively engage with and manage relationships with various stakeholders, including customers, regulatory bodies, and internal teams. Excellent verbal and written communication skills to facilitate clear and consistent dialogue between all parties involved. Skilled in identifying, assessing, and mitigating project-related risks. Strong collaboration skills to work effectively with multidisciplinary teams and ensure cohesive project delivery. Ability to identify issues and develop effective solutions. Flexibility to adapt to changing project requirements and environments. Strong interpersonal skills with the ability to influence and relate to both technical and non-technical individuals and groups. Str",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358473206/",
    "job_id": "4358473206",
    "source": "linkedin",
    "company_name": "ACE Money Transfer",
    "job_title": "Chief Operating Officer – PCF 42",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Description – Chief Operating Officer (COO)About ACE Money TransferACE Money Transfer is a UK-based multinational fintech company. We provide secure and innovative online remittance services to customers in 28 countries across the UK, Europe, Canada, and Australia, enabling cross-border money transfers to over 100 countries worldwide.Position SummaryWe are seeking a dynamic, results-driven, and experienced Chief Operating Officer (COO) to join our executive leadership team. The COO will play a critical role in driving operational excellence, process optimization, and product development across the organization. This position requires a strategic leader with deep expertise in fintech operations, scalable processes, and end-to-end product lifecycle management.The ideal candidate will bring strong leadership capabilities, a data-driven mindset, and a proven track record of delivering operational efficiency and successful fintech products in a fast-paced environment.Key ResponsibilitiesOperational Excellence & Process ImprovementLead continuous improvement initiatives to enhance operational efficiency, service quality, and customer satisfactionDesign, implement, and standardize operational processes and best practices to improve scalability and reduce costsDefine, track, and optimize Key Performance Indicators (KPIs) to measure operational effectivenessIdentify process gaps, bottlenecks, and inefficiencies, and work cross-functionally to resolve themFoster a culture of continuous improvement, innovation, and operational discipline across the organizationProduct Development & DeliveryOversee the complete product development lifecycle, from ideation and design to launch and post-launch optimizationPartner closely with Product Management, Engineering, Compliance, and Technology teams to ensure timely, high-quality product releasesDrive the development of new fintech products, platforms, and features aligned with business strategy and customer needsEnsure all products meet high standards of quality, security, regulatory compliance, and user experienceMonitor market trends, competitive landscape, and customer feedback to guide product innovation and enhancementsLeadership & Strategic CollaborationCollaborate with the CEO and executive leadership team to define and execute the company’s operational and product visionTranslate strategic objectives into actionable operational and product roadmapsBuild, mentor, and lead high-performing teams across operations and product developmentEstablish clear roles, responsibilities, and performance expectations to drive accountabilityPromote a collaborative, inclusive, and high-performance culture that encourages innovation and ownershipRequirements & QualificationsBachelor’s degree in Business Administration, Engineering, Finance, or a related field; MBA or advanced degree preferredMinimum 10 years of leadership experience in operations and product development within the fintech or financial services industrySix Sigma Black Belt certification preferredDemonstrated success in driving large-scale process improvements and delivering complex product initiativesStrong understanding of fintech products, digital payments, financial technologies, and regulatory environmentsExcellent leadership, communication, and stakeholder management skillsStrategic thinker with strong analytical, problem-solving, and decision-making abilitiesAbility to thrive in a fast-paced, high-growth, and dynamic environmentACE Money Transfer Profile: https://acemoneytransfer.com/company-profilePowered by JazzHRSCxCT7athu",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356510833/",
    "job_id": "4356510833",
    "source": "linkedin",
    "company_name": "Broster Buchanan",
    "job_title": "Financial Controller",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Financial Controller - Site BasedCounty Dublin€ Excellent plus Bonus and BenefitsThe recruiting client is an independently run and profitable design, service and installation business west of Dublin owned by a leading international Group.The organisation adheres to high quality corporate governance and associated financial controls.Based at site, the role is responsible for the local Finance and Accounting functions covering month and year end reporting, tax, VAT and all statutory reporting and compliance.Beyond incorporating the obvious financial requirements, the successful candidate will be involved in the wider business and will have the opportunity to contribute more broadly.The position provides a very good platform for personal and career development in a supportive Group environment, working alongside high calibre colleagues.At a detailed level, responsibilities will includeFinancial reporting to relevant Group deadlines.Provision of financial support and guidance to local management and sales teams thereby enhancing financial performance.Leading budgeting and forecasting.Contribution to the development of accounting systems via ERP roll out.Local taxation issues/returns.Acting as a primary POC for external and internal audit.Cash management including cash flow forecasting.Management and development of a small finance team.Oversight of local HR issues and policies with corporate support/guidance.Potential candidates should be qualified accountants with a sound working knowledge of local accounting standards and strong communication skills enabling the successful candidate to play a key role in the local management team.Attitude and commitment to excellence will be seen as more important than any exposure to the specific sector, as it is assumed that candidates will have the intellect to bring value and enhance the operation over time.Basic salary will be very competitive plus bonus and benefits including a Group pension plan PRSA scheme and 21 days annual leave plus stats.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375877746/",
    "job_id": "4375877746",
    "source": "linkedin",
    "company_name": "Everison International Group Inc.",
    "job_title": "Accountant/Office Administrator",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionEverison International Group Inc. was founded overseas in 2001. In 2005, we expanded our operations to North America, with our Toronto office acting as the central hub overseeing global operations. Through the years, Everison International Group Inc. has grown from dealing mostly in recycled metal and steel pipes to dealing with many different types of commodities from all over the world.Role DescriptionThe Accountant/Office Administrator is responsible for assisting the Accounting Department with account reconciliations, updating various ledgers, preparing financial reports, ensuring transactions are supported with adequate documentation, ensuring financial statements are accurate on an ongoing basis among other accounting duties as assigned. The Accounting Administrator will also be responsible for assisting in general administrative duties as assigned. These duties can include acting as the designated client contact and follow-up with clients and maintain ongoing communications with clients among other administrative duties as assigned.Main ResponsibilitiesComplete account reconciliations on various general ledger and sub-ledger accounts.Collaborate with other departments to streamline processes and improve efficiency.Receive, review, and verify invoices and expense reports for accuracy, proper coding, and authorization.Produce intercompany billing for delivery services.Prepare and process weekly payment runsReconcile vendor statements and resolve discrepancies promptly.Ensure all transactions are supported by adequate supporting documentation, in accordance with official policy and properly approved.Ensure transactions are reflected in a proper accounting period.Assist with year-end and month-end processes.Assist in preparing financial reports, budgets, and forecasts.Qualifications and Education RequirementsDegree in Accounting, Finance, or a related fieldProficiency with Microsoft Excel, Google Workspace, and general IT troubleshooting.Excellent organizational and communication skills.Excellent organizational skills with the ability to manage multiple tasks effectively.CPA or Working Towards designation.What We OfferModern Workplace: Enjoy our newly renovated, open-concept office with an upbeat vibe. On-site parking and a business casual dress code mean a comfortable, hassle-free workday.Supportive Culture: Work alongside friendly colleagues in a fun, team-oriented atmosphere. Open communication and collaboration are the norm – we’re all about helping each other succeed!Career Growth: We love promoting from within. You’ll have access to professional development resources and fast-track promotion opportunities, helping you grow your career right here at Everison.Benefits & Perks: We provide 100% company-paid extended health, dental, vision, and life insurance coverage for you and your family. In addition, we offer a wide range of benefits designed to enhance your overall well-being and improve your daily quality of life. We believe that taking care of our team means supporting you both at work and at home.Stability: This is a permanent, full-time position (37.5 hours per week, Monday–Friday) offering solid job security and work-life balance.Job Types: Full-time, PermanentWork Location: In personCompensation: $46,551.00 -60,243.00 the range takes into account several factors and qualifications that are considered in making compensation decisions including experience, education, training, licenses, certifications, and other business and organizational requirements.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373773829/",
    "job_id": "4373773829",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Officer-Finance and Logistic - For Mukti Cox's Bazar - Job ID: 1460480",
    "location": "Cox’s Bazar, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4240867448/",
    "job_id": "4240867448",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "Accounts & Finance (For Bangladesh SEZ Ltd.)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4046505558/",
    "job_id": "4046505558",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Institute of Business Administration, University of Dhaka নিয়োগ ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376818430/",
    "job_id": "4376818430",
    "source": "linkedin",
    "company_name": "BeachHead",
    "job_title": "BA/BSA (Platform Modernization)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Are you ready to lead transformative banking projects? Apply Now!Working with one of our top financial clients, this role calls for a BA/BSA (Platform Modernization). The successful candidate will bring extensive experience in business analysis within the banking sector, particularly in modernization and digitization initiatives, to support our client's ongoing technology transformation.Pay rate range (CAD): $68.84/hr – $82.60/hrResponsibilitiesCollaborate with stakeholders to gather, analyze, and document comprehensive business requirements.Translate business needs into detailed user stories, functional specifications, and process maps.Liaise with development teams to communicate requirements clearly and facilitate understanding of technical considerations.Actively participate in Agile ceremonies to ensure an agile mindset is embedded throughout project phases.Lead business process reengineering efforts to optimize workflows and support modernization goals.Provide insights and recommendations on digitization strategies and system upgrades.Bridge communication between business units and technical teams, ensuring alignment and clarity.Desired Skill-Set7-8 years of experience as a Business Analyst, preferably within the banking industry.Strong familiarity with Agile methodologies and active participation in Agile ceremonies.Understanding of technology stacks, with the ability to communicate effectively with developers without coding experience.Expertise in developing business process flows and converting functional knowledge into technical requirements.Proven experience in creating and refining user stories aligned with project deliverables.Excellent stakeholder engagement and communication skills.Nice to HavePrior experience in industries such as Insurance or Telecom.Hands-on involvement in modernization, digitization, and large-scale business transformation projects.Strong soft skills with the ability to articulate UI functions and end-to-end process flows.Demonstrated ability to explain the \"why\" behind project tasks, providing strategic insights rather than just execution.BeachHead is an equal opportunity agency and employer. We advocate for our candidates and welcome applicants regardless of race, color, religion, national origin, sex, age, or physical or mental disability. BeachHead or our clients may use technology-enabled tools, including automation and artificial intelligence (AI), to support parts of the recruitment process such as resume screening, application management, and candidate matching. These tools assist our recruiters and our clients, and do not replace human decision-making. This job posting represents a current or anticipated vacancy. The position may be filled at any time, and the posting may be removed without notice once the role has been filled.Privacy Policy",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375786624/",
    "job_id": "4375786624",
    "source": "linkedin",
    "company_name": "Dexian",
    "job_title": "Business Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Title: Business AnalystJob location: Toronto, ONContract duration: 12 monthsKey ResponsibilitiesBusiness Systems Analysis is a professional field that generally requires formal education or relevant experience. It demands a strong understanding of requirements management, business-related systems, operational processes, related technology, industry knowledge, enterprise technology delivery practices and standards, and project management. A thorough understanding of the businesses supported and enterprise methodologies is essential.As a Senior Business Systems Analyst, you will be responsible for:Requirements Elicitation and Management: Collaborate with pod members/business stakeholders to plan, elicit, analyze, document, communicate and lead the delivery of detailed functional and non-functional requirements in alignment with Delivery Execution Framework (DEF) and CLIENTS Behavior Driven Design (BDD) Standards. Create and maintain detailed documentation including business requirements, process flows, use cases, user stories, and technical specifications. Ensure documentation remains current and accessible for reference and auditing purposes. Lead brainstorming and user story refinement sessions to ensure requirements are clearly understood by all stakeholders and meet the expected business needs/desired outcomes.Business Process Analysis: Conduct comprehensive analysis of current capabilities, business processes and workflows (AS-IS), understand high level business requirements, identify areas for improvement, and recommend system enhancements (TO-BE) that align with best practices and business goals. May provide support with Business operational/process related analysis.Solution Design: Translate business requirements into system specifications, and collaborating with technology partners to build and test the proposed solutions while ensuring traceability to business requirements throughout. Ensure that proposed solutions are scalable, sustainable, and integrate seamlessly with enterprise architecture.Testing and Deployment Support: Support testing efforts to ensure scenarios and results align to requirements and assist in implementation activities to achieve business outcomes.Stakeholder Communication: Act as the main liaison between business leadership and technical teams, offering expertise in business-technology matters and addressing system-related issues that pertain to business requirements and technical solutions. Liaise with third-party vendors and consultants as needed, ensuring their deliverables align with CLIENTS standards and business needs.Continuous Improvement: Continuously enhance knowledge/expertise in own area and keep current with leading-edge technology trends/developments and develop expertise in CLIENTS services, applications, infrastructure, analytical tools and techniques that can contribute to effective solution development/delivery. Continuously enhance knowledge of business domains and their products/services.MUST-HAVE Hard Skills:1.) 8+ years of experience in business analysis, systems analysis, or related roles in a corporate environment2.) Strong knowledge and experiences in SAFe Agile methodology along with policies, procedures and practices, competitors, and market trends3.) Proficiency in using analytical software tools, MS Office, process modeling, data analysis methods and reporting techniques, and Atlassian (Confluence and Jira)4.) Demonstrated understanding of software development lifecycle (SDLC), business systems integration, and process automation tools SOFT SKILLS:1.) Strong communication skills (written and verbal)2.) Attention to detail, highly organized 3.) Strong critical thinking, problem-solving, and quantitative analysis abilities4.) Strong collaboration and relationship-building abilities5.) Flexibility to adjust to changing business priorities and emerging technologies NICE-TO-HAVE1.) Experience with SQL, data analytics, and business intelligence platforms is a strong asset2.) CBAP, PMP, Six Sigma certification3.) Banking or financial institution",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366801830/",
    "job_id": "4366801830",
    "source": "linkedin",
    "company_name": "Futures First",
    "job_title": "Market Analyst",
    "location": "Kolkata, West Bengal, India",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Position SummaryFutures First offers a unique opportunity in India to work in the world’s most stimulating, liquid, and well-developed derivatives markets. This is an exciting challenge and an excellent opportunity for bright, analytical, highly motivated graduates to join a vibrant business and participate directly in today’s dynamic world markets.At Futures First we are committed to provide our employees with the best in technology, training, and continuing education which includes training on financial markets and products, risk management, soft skills development and one-on-one mentoring to develop the requisite psychological and endurance skills.Job ProfileThe job involves dealing in the most exotic financial derivatives & futures markets and would be trained to acquire the strong understanding of market structure for various Asset classes. It would require Identification, Research and Development of new strategies and ideas. It would involve analyzing and assimilation of market news/information/data to determine market sentiments, using technical and fundamental analysis in making decisions.RequirementsEducation QualificationsStrong Academics, Degree Educated or Equivalent.Preferable educational streams: Commerce, Finance, Economics, Mathematics, Statistics and Engineering.Work ExperienceUp to 1 year relevant experienceGood understanding and experience in futures markets and proven track record is essential.Skill SetNumerate, great at mathQuick thinker, especially under high pressureCompetitiveSharp, with deep intelligenceHardworkingPassionate and driven to succeedPerform even better under pressure, and retain capacity for dispassionate learning in real-timeDemonstrated strength of character: integrity, initiative, judgment, commitment, emotional stability, persistence, resilience.ImportantTHIS RECRUITMENT DRIVE IS ONLY FOR CANDIDATES WHO HAVE PASSED OUT IN 2025 OR BEFORE.CANDIDATES WHO HAVE TAKEN OUR RECRUITMENT PROCESS WITHIN THE LAST 1 YEARJoining - March 2026",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4336849900/",
    "job_id": "4336849900",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Consultant-TTC- Sirion - Hyderabad/Bengaluru/Gurugram/Pune/Chennai/Mumbai/Kolkata",
    "location": "Kolkata, West Bengal, India",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4086079260/",
    "job_id": "4086079260",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "Accounts and Finance Officer (For Shataphool Bangladesh)",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3997702108/",
    "job_id": "3997702108",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Manager-Finance & Accounts (For Gana Unnayan Kendra (GUK ...",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4252451918/",
    "job_id": "4252451918",
    "source": "linkedin",
    "company_name": "For Home Mega Design & Development Limited",
    "job_title": "Accountant",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4161605647/",
    "job_id": "4161605647",
    "source": "linkedin",
    "company_name": "For Nabil Group- Job ID : 1341290",
    "job_title": "AGM (Accounts)",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4090940513/",
    "job_id": "4090940513",
    "source": "linkedin",
    "company_name": "Job ID : 1314717",
    "job_title": "Accounts and Admin Officer (For LAMB)",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4069387031/",
    "job_id": "4069387031",
    "source": "linkedin",
    "company_name": "SEED Project",
    "job_title": "Accounts Officer",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2220720680/",
    "job_id": "2220720680",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Analyst, Accounting & External Reporting",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3970718853/",
    "job_id": "3970718853",
    "source": "linkedin",
    "company_name": "Fund & Treasury Manager",
    "job_title": "SAJIDA Foundation",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3966392376/",
    "job_id": "3966392376",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Investment Analyst Dhaka, Bangladesh LinkedIn",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3975148910/",
    "job_id": "3975148910",
    "source": "linkedin",
    "company_name": "For Maslin Capital Limited (Job ID : 1271420)",
    "job_title": "Investment Analyst",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366156225/",
    "job_id": "4366156225",
    "source": "linkedin",
    "company_name": "New York University Abu Dhabi",
    "job_title": "Senior Manager, Operations & Finance - Office of Executive Education",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355736398/",
    "job_id": "4355736398",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Executive - Order processing - (For Bir Group Holdings) - Job ID - 1453524",
    "location": "Tejgaon Thana, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365903914/",
    "job_id": "4365903914",
    "source": "linkedin",
    "company_name": "Vietcap Securities (VCI)",
    "job_title": "Research Analyst - Consumer Sector",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365802952/",
    "job_id": "4365802952",
    "source": "linkedin",
    "company_name": "RSM Vietnam",
    "job_title": "Tax Consultant/Assistant - Transfer Pricing Services",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322250742/",
    "job_id": "4322250742",
    "source": "linkedin",
    "company_name": "QIAGEN",
    "job_title": "Accountant, Accounts Payable",
    "location": "Manila, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366429470/",
    "job_id": "4366429470",
    "source": "linkedin",
    "company_name": "LARION",
    "job_title": "QA Lead/QA Manager",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359834285/",
    "job_id": "4359834285",
    "source": "linkedin",
    "company_name": "Team Finans",
    "job_title": "Katılım Finans Uyum Yöneticisi / Müdürü / Görevlisi",
    "location": "Istanbul, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329593057/",
    "job_id": "4329593057",
    "source": "linkedin",
    "company_name": "NTT DATA Payment Services",
    "job_title": "Finance Manager",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job ResponsibilitiesLead the Finance Team to deliver accurate, timely, and reliable financial reports, analyses, and insights that support informed decision-making by management.Ensure adherence to accounting standards, company policies, and statutory requirements.Oversee year-end statutory audits, internal audits, and the timely submission of financial statements in accordance with regulatory and Board requirements.Manage tax planning, compliance, and reporting to ensure adherence to tax laws and regulations.Provide timely, data-driven insights and recommendations to support management in enhancing organisational performance, financial sustainability, and resource allocation.Proactively identify and mitigate financial risks to safeguard company assets.Monitor ongoing compliance with evolving accounting and regulatory requirements.Lead, mentor, and develop the Finance teams to foster professionalism, capability, and accountability, ensuring effective succession planning and business continuity.Support internal stakeholders by providing guidance on accounting and tax-related matters, ensuring alignment with current regulations and company policies.Drive continuous improvement initiatives and lead implementation of new technologies or systems.Collaborate on budgeting, forecasting, and financial planning activities.Manage and review business agreements from a financial compliance and risk perspective.Attend to any ad-hoc tasks or assist in any other reports requested by the immediate superior from time to time.Job RequirementsExperience: Minimum of eight (8) years of accounting or finance experience with at least five (5) years of working experience in relevant position.Knowledge: Strong understanding with MFRS / IFRS and statutory financial statements requirements.Technical Skills: Proficient in Microsoft Office applications and Oracle.Analytical Skills: Strong analytical and problem-solving skills.Work Ethic: Self-driven and independent with a strong sense of commitment, able to deliver under tight deadlines.Attitude: Possesses a positive working attitude, is independent and is a strong team player.Communication Skills: Strong communication and interpersonal skills.Language Proficiency: Proficient in English, Bahasa Malaysia and Mandarin.Availability: Able to start work within a short period.Education RequirementsCandidate must possess at least a Degree in Accounting, Finance and international qualified accountant with professional certificate such as MIA, ACCA, CPA and etc.Pay range and compensation package: Salary and compensation details will be discussed during the interview process.Equal Opportunity Statement: NTT Data Payment Services is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355746719/",
    "job_id": "4355746719",
    "source": "linkedin",
    "company_name": "Fuzul Holding",
    "job_title": "Yatırım ve Proje Değerlendirme Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Fuzul Holding olarak; farklı sektörlerdeki yatırım ve proje fırsatlarını analiz edecek, finansal ve sektörel değerlendirmelerle karar alma süreçlerimize katkı sağlayacak Yatırım ve Proje Değerlendirme Uzmanı arıyoruz.Genel NiteliklerÜniversitelerin İktisat, İşletme, Finans, Endüstri Mühendisliği, Matematik, İstatistik veya ilgili bölümlerinden mezun,Tercihen proje değerlendirme, yatırım analizi, finansal analiz alanlarında en az 8 yıl deneyimli,Güçlü finansal analiz ve modelleme bilgisine sahip,NPV, IRR, geri ödeme süresi, nakit akışı, senaryo ve duyarlılık analizleri konularında deneyimli,Excel başta olmak üzere finansal analiz ve raporlama araçlarını etkin kullanabilen,Analitik düşünme ve problem çözme yeteneği güçlü,Raporlama, sunum ve iletişim becerileri gelişmiş,Farklı sektörleri hızlı öğrenebilen ve analiz edebilen,Takım çalışmasına yatkın, planlı ve sonuç odaklı.Görev Tanımı;Proje ve yatırımlara ilişkin nakit akışı (cash flow) analizlerini hazırlamak ve yorumlamak,Projelerin finansal fizibilite çalışmalarını yapmak; kârlılık ve geri dönüş analizlerini gerçekleştirmek,NPV, IRR, geri ödeme süresi gibi finansal göstergeleri kullanarak proje değerlendirmeleri yapmak,Farklı varsayımlara dayalı senaryo ve duyarlılık analizleri ile proje risklerini analiz etmek,Farklı sektörlere yönelik sektörel analizler, pazar araştırmaları ve benchmarking çalışmaları gerçekleştirmek,Projelerin finansal, operasyonel ve sektörel risklerini belirlemek ve risk azaltıcı öneriler geliştirmek,Proje değerlendirme sonuçlarını raporlar ve sunumlar haline getirerek ilgili paydaşlara ve üst yönetime sunmak,Finans, yatırım, strateji ve ilgili iş birimleri ile koordineli çalışmak,Mevcut ve potansiyel projelerin performansını izlemek, sapmaları analiz etmek ve iyileştirme önerileri geliştirmek. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355677572/",
    "job_id": "4355677572",
    "source": "linkedin",
    "company_name": "Türkiye Finans",
    "job_title": "Financial Crime Compliance Vice President",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Who are we?Türkiye Finans is one of Turkey's strongest participation banks, operating with a 67% stake in SNB, one of the largest capitalized banks in the Middle East region.At Türkiye Finans, we focus on people and prioritize digitalization, continuously improving our service approach with our technological infrastructure. We continue on our path with an innovative approach, recognizing the value of producing and succeeding together, and growing continuously based on shared values. As we grow together, our goal is to introduce participation banking to all individuals and companies in Turkey through sustainable and profitable growth.We know the value of achieving and producing together in Turkiye Finans family and we are constantly moving, based on common values.Are you ready to take the position of Financial Crime Compliance Vice President?Required Qualifications:• Bachelor’s degree in Finance, Economics, Law, Business Administration or a related field• Minimum 8+ years of experience in financial crime Compliance and AML/CTF, within banking or financial institutions• Strong knowledge of local and international financial crime regulations, including AML, CTF, FATCA and CRS• Demonstrated leadership, decision-making, and stakeholder management skills• Excellent analytical, communication and reporting abilities• ACAMS is a plus• Fluency in English is requiredJob Description:The Financial Crime Compliance Vice President is responsible for overseeing the Bank’s financial crime compliance framework, including Anti-Money Laundering (AML), Counter-Terrorist Financing (CTF), KYC, risk management, and regulatory reporting obligations. The role ensures full compliance with local and international regulations.Financial Crime Monitoring & Regulatory Reporting• Oversee customer and transaction monitoring activities, including analysis, investigation, and escalation of suspicious activities• Manage Suspicious Transaction Reporting (STR) processes and ensure timely and accurate reporting to regulatory authorities (e.g. MASAK)• Coordinate regulatory reporting obligations including FATCA, CRS, SPK notifications, and other statutory filings• Manage asset freezing and sanctions-related regulatory decisions and follow-up actions• Monitor emerging financial crime typologies, regulatory trends, and enforcement actions, and ensure their integration into control frameworks.KYC, Customer Acceptance & Risk Management• Define and maintain customer acceptance standards• Establish customer segmentation and differentiated KYC/CDD/EDD requirements based on risk profiles• Ensure ongoing customer due diligence and periodic review processes are effectively implemented• Manage and coordinate account exit and relationship termination processes arising from financial crime or compliance risks.Policy, Governance & Compliance Framework• Develop, maintain, and update the Bank’s Financial Crime Compliance Program, including policies, procedures, and internal controls• Monitor regulatory developments and international best practices, ensuring timely implementation within the Bank• Ensure AML/CTF risk assessments for products, services, and delivery channels• Provide compliance input and risk opinions for new and existing products and services• Lead internal governance processes related to financial crime compliance, including management and board-level reporting.Training, Systems & Continuous Improvement• Design, update, and deliver standard and specialized financial crime compliance training programs• Oversee enhancements to monitoring systems, screening tools, and other compliance-related technologies• Drive continuous improvement initiatives to strengthen the effectiveness and efficiency of financial crime controls. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4334511050/",
    "job_id": "4334511050",
    "source": "linkedin",
    "company_name": "Maa Althahab",
    "job_title": "Operations &amp; Projects Officer ( Turkey)",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job PurposeThe Operations & Projects Officer is responsible for supporting management in coordinating and following up on projects and operational tasks in Turkey. The position also involves assisting with research and development activities, supporting the Turkey office operations, and communicating.Key ResponsibilitiesFollow up on all projects and assignments given by management in Turkey. Coordinate with relevant departments (HR, Sales, Purchasing, Logistics, etc.) to ensure projects are executed on time. Assist in conducting research related to market trends, new opportunities, or process improvements.Support development initiatives and pilot projects as directed by management. Help collect and organise information to support decision-making and project planning. Coordinate and communicate with official entities (such as government offices, chambers, or legal authorities) as required by management. Prepare and submit documentation or correspondence in line with official requirements. Follow up on company registrations, permits, or formal communications related to the Turkey office or other branches. Support HR in following up on recruitment, onboarding, and employee records.Assist in purchasing processes and supplier follow-ups. Support daily administrative tasks, filing, and data organization. Prepare internal reports, summaries, and meeting notes for management. QualificationsBachelor’s degree in Business Administration, Management, or a related field. 0-2 years of experience in operations, project coordination, or administrative work. Strong communication and coordination skills. Good research and reporting ability. Proficiency in Microsoft Office (Word, Excel, PowerPoint). Fluency in English. Ability to manage multiple tasks and meet deadlines. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329321152/",
    "job_id": "4329321152",
    "source": "linkedin",
    "company_name": "The Coca-Cola Company",
    "job_title": "Accounts Payable Accountant (1-Year Contract)",
    "location": "Tuas, West Region, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Based in Tuas, Singapore (2-way transportation provided at 13 selected MRT locations across Singapore)Duration: 12-months contract (Open to renewal)Please note that due to Singapore statutory regulations, we will be prioritizing applicants who have a current right to work in Singapore, and do not require Coca-Cola's sponsorship of a visa.Company Benefits:37.5 hour work week$499 annual vouchers to buy Coca Cola products18 days annual leaveMedical coverage + Dental + Optical BenefitsMedical & Dental coverage for self AND dependents5 days work weekPacific Refreshments Pte Ltd (Coca-Cola Singapore) is a strategic concentrate manufacturing plant in Asia. We are an export facility, specializing in the manufacturing of concentrates and beverage bases, with a complex portfolio, supporting the ASEAN, South Pacific and Southwest Asia business units. We are on a journey of growth - having completed the construction and expansion of our site towards doubling our manufacturing capacity in recent years. We have also embarked on our digital transformation journey, striving to be the Lighthouse for the Consumer Products Supply (CPS) plants in Asia and to be a leader in digital transformation.We champion a safety-first culture, dedicated to protecting our employees' well-being and fostering a secure workplace that values each individual.Pacific Refreshments Pte Ltd is a winner of the ‘2020 HR Asia Best Companies to Work For’ Award.Position OverviewThe services required to be performed in this role include: receiving, scanning, and submission of invoices received on site to the invoice posting team as part of Accounts Payable Operations; GST verification for processed invoices to ensure accurate GST recognition and tax compliance of invoices up to GST filing activities; Site Finance support in balance sheet and SOX narratives, audit support, withholding tax, bank reconciliation for direct debit, urgent payment requests, Non-Purchase Order invoice request processing, audit support, and Vendor Master Data-related activities. Ad-hoc services are expected related to CPS Finance, Accounts Payable, and P2P.Key Roles & Responsibilities:Accounts Payable Support (40%)· Receive, scan, and submit invoices for processing (by a separate team)· Coordinate with associates to resolve the blocked account payable documents and invoices in exception status· Resolve vendor queries with site end users and accounts payable team· Support site finance for internal and external audit requirements pertaining to AP· Support AP Monthly Reporting team to follow through on GRIR account maintenance and resolution with CPS Buyers/PlannersGST Reconciliation and Filing for Indirect Tax Team (10%)· Support Indirect Tax team in GST reporting and verification for Invoice Posting accuracy· Reconcile the GST differences between SAP and filing via reviewing the process and communicating with associates/vendor/AP teamsSite Support in handling Non PO invoices/Vendor Master Data/PO/GR (30%)· Facilitate between CPS Finance and local associates and advise the resolution of issues· Guide local associates, vendors, and finance team on the right channels and requirements for Vendor Master Data· Submit requests for vendor master data creation and updates through Ariba SLP· Submit Non-PO invoices (including Freight and Logistics) and Urgent Payment Request for CPS FinanceCPS Finance Support (20%)· Support and provide balance Sheet narratives, update SOX Narratives· Preparation and submission of local surveys, monthly and year end accruals, prepayment amortization posting, withholding tax· Ad hoc CPS Finance requests and reportsWhat you need to be successful• 2-3 years of accounts payable/accounting or related experience• Fluent in English (verbal and writing)• Strong problem solving, decision making, and analytical thinking skills• Good communication skills• Strong SAP and Excel skills• Knowledge of accounting and internal controls Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4262104155/",
    "job_id": "4262104155",
    "source": "linkedin",
    "company_name": "emagine",
    "job_title": "Senior IT Analyst – Financial & Data Intelligence (Quantex)",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355702526/",
    "job_id": "4355702526",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Admin & Accounts Officer - (For Melody Housing Agency) - Job ID - 1453265",
    "location": "Banani, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Melody Housing Agency is looking for Admin & Accounts OfficerKey PointsFull-time Admin & Accounts Officer position in a reputed real estate companyResponsibility for accounts records, cash/bank transactions, and reportingRequires 2+ years accounts experienceBangla (Bijoy) & English typing skills mandatoryJob Description / ResponsibilityManaging overall office administration and ensuring smooth daily operations.Maintaining proper books of accounts, vouchers, bills, invoices, and supporting documents.Handling cash, bank deposits, withdrawals, and cheque-related activities.Managing petty cash and preparing regular petty cash statements.Preparing daily, weekly, and monthly financial and administrative reports.Assisting management in budget preparation and expense control.Maintaining attendance records, leave registers, and basic HR documentation.Coordinating with vendors, suppliers, and service providers for office requirements.Maintaining office files, registers, contracts, and confidential documents.Following up on utility bills, office rent, and other recurring expenses.Assisting in payroll preparation and salary disbursement support.Supporting audit activities by preparing required documents and statements.Ensuring compliance with company policies and internal control procedures.Coordinating with banks, auditors, and external stakeholders when required.Providing administrative and accounts-related support to management as assigned.Educational RequirementsBachelor of Business Administration (BBA)Bachelor’s degree in Accounting, Finance, Business Administration, or a related discipline.Skills Required: Finance & Bank Operation, Accounting Data Entry, Technical Skills, Taxation, CRM Software, Microsoft Excel, Excellent communication and presentation skills, Typing Skill - Bengali and EnglishExperience Requirements2 to 4 year(s)The applicants should have experience in the following business area(s): Real EstateAdditional RequirementsMinimum 2 years of practical experience in Accounts and Administration.Excellent typing skills in both Bangla (Bijoy) and English are mandatory.Advanced proficiency in MS Excel (reports, formulas, data analysis).Good working knowledge of MS Word and office documentation.Sound understanding of modern technology, office software, and digital tools.Strong communication, organizational, and interpersonal skills.Ability to work under pressure and meet deadlines with professionalism.Honest, responsible, and eager to learn with a positive attitude.Job LocationDhaka (Banani) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324913059/",
    "job_id": "4324913059",
    "source": "linkedin",
    "company_name": "Charterhouse Partnership | Asia",
    "job_title": "Senior Director, Head of AML Operations",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Seeking a seasoned Senior Executive, to head the Anti Money Laundering (AML) Operation establishment, within retail banking, responsible to lead Line 1 Anti Money Laundering (AML) operation functions, driving operational excellence and proactive risk management across the retail banking continuum, playing a strategic pivotal role in the organization's AML Uplift initiatives.ResponsibilitiesStrategic ManagementLead the design and execution of AML controls across Group Retail, including frontline, product, digital, operations, and support units.Drive the strategic prioritization of initiatives required for AML Operational controls in alignment with MAS directives and internal governance structures.Maintain oversight and accountability over offshored AML activities and teams.Spearhead the AML Enterprise-Wide Risk Assessment (EWRA) and AML Control Self-Assessment (CSA) programs.Partner Line 1.5 and Line 2 to ensure that emerging trends and threat as observed are feedback as well as cascaded to Line 1 control functions.Quality Execution Partner with Line 1.5 Advisory and Assurance team to ensure cohesive implementation of controls.Oversee end to end AML Operational processes such as data and record retrieval, effective assignment of alerts and triggers. post-STR validations, onboarding reviews (OGR, ODD), and appeals processes.Ability to direct large teams on the ground, including teams which may not report directly to himself/herself to ensure quality execution.Ability to identify operational gaps and proactively design effective controls to mitigate operational risks.Data AnalyticsDevelop and monitor AML risk metrics and dashboards.Leverage data analytics to achieve operational excellence and effective monitoring of end to end risk signals.Governance & Stakeholder EngagementManage audit and compliance reviews, ensuring timely remediation of gaps.Elevate AML competencies through training, communications, and quality assurance.Senior LeadershipSpearhead a team of AML Operation Managers, ensuring continuous upskilling and performance management.Foster a culture of accountability, integrity, and innovation in AML operations.QualificationsMinimum 20 years of experience in banking, with deep expertise in managing large scale operations. Experience in AML/CFT operations will be preferred.Proven leadership in managing cross-functional teams and complex regulatory environments.Strong stakeholder management and communication skills.Experience in data analytics and risk metrics development is highly desirable.Experience in leading transformational initiatives to uplift efficiency and effectiveness.If you hold experience in managing Anti Money Laundering (AML) operations, within group retail banking, do reach me at LeonardT@charterhouse.com.sg for a discussion.EA License no: 16S8066 | Reg no.: R1657935Only successful candidates will be notified. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361784450/",
    "job_id": "4361784450",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Verification & Recovery Officer- For Advanced Chemical Industries PLC (ACI)- Job ID: 1457488",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Advanced Chemical Industries PLC (ACI) is looking for Verification & Recovery OfficerJob Description / ResponsibilityComprehensive visit to prospective customer to identify customer`s credit worthiness and probable credit risk.Work closely with the Core Credit, Legal and Sales Team to identify root causes of credit delinquency, operational weaknesses and recommend changes to improve the quality of the portfolio.Coordinate efforts to collect credits with sales, core credit, and legal departments.Undertake regular and frequent calls, site visits, and follow-ups with the default customers to implement remedial strategies and action plans for credit recovery.Involve local influential or Law Enforcement Agencies to recover money from the problematic customers.Maintain electronic records and hard copies of all payment plans, amounts paid, and communications.Initiate repossession and other legal proceedings if credit collection plans fail.Work in accordance with key performance indicatorsEducational RequirementsBachelor/HonorsSkills Required: Credit Recovery, Debt recovery, Due CollectionExperience RequirementsAt least 3 year(s)The applicants should have experience in the following area(s):Credit Recovery ManagementThe applicants should have experience in the following business area(s):Manufacturing (FMCG),Pharmaceutical/Medicine Companies, Agro based firms (incl. Agro Processing/Seed/GM),AutomobileAdditional RequirementsAt least 3 years of experience in relevant position in a reputed organization.Retired Army/Navy/Police Officials will be preferred.Very good communication skill (both written and spoken) in English.Good knowledge in MS Office (Word, Excel, PowerPoint).Job LocationAnywhere in Bangladesh Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366105202/",
    "job_id": "4366105202",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.The company is founder-led, profitable, and growing.The role of an Accountant at Canonical:If you are passionate about the technology industry and want to work for a company that aligns with your interests, we might be the place for you! Canonical, and our world class Ubuntu product, attracts some of the leading talent from around the world. Come and work with exceptional people and advance your career in Finance!Our Finance team is growing and it's a really exciting time to join the team. We are looking for bright, motivated people who have a passion for making a difference. You will be seeking an opportunity to drive process improvements and change, input your ideas and truly contribute to a highly productive team.We are looking for an exceptional Accountant with IFRS experience to help us ready the business for public market scrutiny through our planned IPO. The right candidate will have domain expertise and a passion for IFRS.Location: This role may be office based in London, or Remote in EMEA Time Zones.What your day will look likeAssist in the month end reporting process to deliver timely and accurate informationHave full responsibility for a part of the ledger processes relevant to your strengthsAssist with the year end audit process and statutory reportingSupport the finance team's wider plans to prepare for an IPOImprove the efficiency of financial processes and procedures and monitor complianceShare knowledge between team members to ensure cover is available when neededActively develop your own skills to ensure current knowledge of applicable standards and regulationsEstablish strong relationships with key colleagues outside the wider finance teamWhat we are looking for in youExceptional academic track record and subsequent career performanceBachelor's degree in Accounting or equivalentQualified accountant (ACCA, ACA, ACMA, CPA, etc.)Experience at a large public accounting firm, or public multinational corporate accounting department preferredNetSuite or similar enterprise grade systems experienceWillingness to travel up to four times per yearWhat we offer colleaguesWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.Distributed work environment with twice-yearly team sprints in personPersonal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveTeam Member Assistance Program & Wellness PlatformOpportunity to travel to new locations to meet colleaguesPriority Pass and travel upgrades for long-haul company eventsAbout CanonicalCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.Canonical is an equal opportunity employerWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337487982/",
    "job_id": "4337487982",
    "source": "linkedin",
    "company_name": "Moneris",
    "job_title": "Internal Audit Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321473524/",
    "job_id": "4321473524",
    "source": "linkedin",
    "company_name": "Yapı Kredi",
    "job_title": "Kurumsal Bankacılık Portföy Yöneticisi",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369318169/",
    "job_id": "4369318169",
    "source": "linkedin",
    "company_name": "Sokha Real Estate",
    "job_title": "Accounting Manager",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357479393/",
    "job_id": "4357479393",
    "source": "linkedin",
    "company_name": "cander",
    "job_title": "Treasury Domain Expert",
    "location": "Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372003370/",
    "job_id": "4372003370",
    "source": "linkedin",
    "company_name": "3 Step Recruitment Inc.",
    "job_title": "Controller",
    "location": "Vaughan, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Location: Vaughan, ON - On-siteJob Type: Full-time, PermanentSalary: $100,000-$120,000 per yearJob SummaryA leading building materials distribution company is seeking an experienced Controller to lead financial operations, reporting, and controls. This role plays a key part in driving financial accuracy, insight, and operational efficiency across the business and is well suited to candidates with hands-on experience in inventory-driven distribution environments, customer rebates, logistics, and ERP systems.Primary AccountabilitiesMaintain complete ownership of the trial balance, ensuring precision, reconciliation and integrity across all accountsProvide leadership and daily guidance to the Finance DepartmentEnsure all accounting transactions are accurately recorded in a timely manner, adhering to GAAP standardsPrepare month-end journal entries and accrualsExecute month-end accounting tasks, including balance sheet reconciliations. Support year-end closing activitiesReconcile intercompany accountsReview the daily cash positionOversight of payables department including payroll processingAssist in analyzing and evaluating operating expensesAct as a back-up for accounting staff as neededResolve complex accounting issues using generally accepted accounting principlesDemonstrate proficiency with accounting software and systemsConsistently meets deadlinesInterpret and analyze large volumes of financial dataEffectively manage multiple priorities and tasksPerform other duties as required by the businessRequirementsMinimum Bachelor's degree in accounting, finance or related field requiredPublic Accounting experience preferredHolds a CPA designation5+ years of experience in financial accounting in the distribution industryExcellent working knowledge of Microsoft Office products (Word, Excel, PowerPoint)Excellent analytical, reasoning, and problem-solving skillsExperience with Dynamic 365 Business Central is considered an assetStrong business acumen with the desire to see beyond the numberExcellent communication skills and comfortable interacting with all levels of managementAbility to work independently and in a fast-paced team environmentSalary & Pay TransparencyThe salary range provided reflects the expected compensation for this role and is intended as a guide. Final compensation will be determined based on experience, qualifications, and job-related factors. Where applicable, the range includes base salary and any non-discretionary commissions or incentive pay.Disclosure:This posting represents an active and genuine vacancy with one of 3 Step Recruitment’s clients and is not for speculative or pipeline recruitment.3 Step Recruitment and/or our Clients may, from time to time, use AI-assisted tools to support the screening and evaluation of applications; however, these tools are not intended to replace human judgment or decision-making in the hiring process.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371367492/",
    "job_id": "4371367492",
    "source": "linkedin",
    "company_name": "IFG - International Financial Group",
    "job_title": "Controller",
    "location": "Scarborough, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355766874/",
    "job_id": "4355766874",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Front Desk Executive - For RTF GROUP - Job ID: 1453630",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "RTF GROUP is looking for Front Desk ExecutiveJob Description / ResponsibilityGuest ManagementGreet and welcome guests, clients, and visitors with a positive, friendly, and professional attitude.Manage the visitor log, issue temporary passes, and notify company personnel of guest arrival promptly.Communication & CorrespondenceAnswer, screen, and forward incoming phone calls in a professional manner.Receive, sort, and distribute daily mail, deliveries, and courier packages.Manage and respond to general inquiries via email and phone.Office Operations & AdministrationMaintain a tidy, presentable, and functional reception area.Manage the scheduling and booking of conference rooms and meeting spaces.Assist with various administrative tasks, such as filing, photocopying, and data entry.Maintain office supplies inventory by checking stock and placing orders.Coordinate with facility management to ensure office equipment (e.g., printers, coffee machines) is well-maintained and functioning.Support & Coordination:Provide ad-hoc support for internal teams, including preparation for meetings and eventsNo one should apply if they are not interestedEducational RequirementsBachelor/HonorsBachelor/HonorsSkills Required: Good comunication skillExperience Requirements1 to 3 year(s)The applicants should have experience in the following business area(s): Travel Agent,Travel StartupFreshers are also encouraged to apply.Job LocationDhaka, Dhaka (Basundhara RA)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321317906/",
    "job_id": "4321317906",
    "source": "linkedin",
    "company_name": "Cornmarket Group Financial Services Ltd.",
    "job_title": "Administrator",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who We Are?At Cornmarket,we look after the financial wellbeing of public servants and their families. We’ve been focused on public sector employees for over 50 years, learning how to bring our clients the best financial services – from car, home, health and life insurance, to income protection, retirement planning and beyond.Role PurposeWe are seeking a proactive and motivated Office Administrator to join our team. The ideal candidate will be highly organized, adaptable, and eager to learn new skills. You will play a key role in supporting daily operations and assisting colleagues across a very busy team environment. This role requires someone who can work independently with confidence, while also thriving as part of a collaborative team.This position is a 6-month fixed-term contract.Accountabilities of the RoleOpening and organising incoming and outgoing post.Printing and issuing clients renewal packs and certificates of insurance.Managing team mailboxes and coordinate with team members.Scanning documents and saving to client records.Assisting the team with collecting information from clients.Assisting in the general overall administration activities of the business.Skills & Knowledge RequiredStrong organizational and time-management skills with attention to detail.Ability to work on own initiative and manage tasks independently.A collaborative team player with excellent communication skills.Positive attitude and willingness to learn new skills and take on challenges.Proficient in Microsoft Office (Word, Excel, Outlook, PowerPoint) or similar tools.Problem-solving mindset and adaptability in a fast-paced environment.Knowledge of risk control & regulatory environmentCommercial awarenessWhat We Can Offer You?Significant investments in professional developmentAnnual leave that increases based on service, plus two additional company daysFlexi leave (option to take additional annual leave)Life leaveAttractive pension contribution ratesHealth insurance or wellness subsidyWorking abroad policyFully paid family leave types (maternity/paternity/surrogacy)Performance based bonus or commissionIncome protectionLife coverDiscounts on financial productsExcellent health & wellbeing programmeWellness WednesdaysEqual Opportunities & Data Privacy NoticeCornmarket is committed to building an inclusive workplace environment. We’re proud to be an equal opportunity employer, striving to create a welcoming environment. All qualified applicants will be considered for employment without regard to age, disability, ethnic background, family status, gender identify or expression, marital status, membership of the Traveller Community, national origin, race, religion, sexual orientation.We are also committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact our Talent Acquisition Team.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374793367/",
    "job_id": "4374793367",
    "source": "linkedin",
    "company_name": "Darwin Hawkins",
    "job_title": "Accounts Payable Manager",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371450864/",
    "job_id": "4371450864",
    "source": "linkedin",
    "company_name": "PE Global",
    "job_title": "Financial Controller",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "💥PE Global are recruiting a Financial Control Accountant for a national agency located in Dublin city. This is a permanent role with a hybrid option.💥✔ Are you a FULLY qualified Accountant with 3+ years PQE?✔ Extensive financial control experience?✔ Detailed knowledge of FRS 102 / IFRS?Get in touch with me today to find out more about this exciting role and send an up-to-date CV to howie.leahy@peglobal.net#Accounting #Finance #DublinJobshttps://www.peglobal.net/job/accountant/",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366004928/",
    "job_id": "4366004928",
    "source": "linkedin",
    "company_name": "MUFG Investor Services",
    "job_title": "Senior Associate, Fund Accounting - Private Debt / Private Equity",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "MUFG Investor Services is a trusted partner to many of the world’s largest public and private funds, providing asset servicing and operational solutions built for alternatives. With over $1 trillion in client assets under administration, we offer fund administration, banking, payments, fund financing, foreign exchange overlay, corporate and regulatory services, custody, business consulting, and more. Operating from 17 locations worldwide, we help clients mitigate risk, enhance efficiency, and navigate the operational complexities of today’s investment management landscape. As a division of Mitsubishi UFJ Financial Group (MUFG), one of the world’s largest financial institutions with approximately $3 trillion in assets, we combine deep expertise with the strength and stability of a leading financial institution. To learn more, visit us at www.mufg-investorservices.com.Job DescriptionThe Senior Associate will support the day-to-day administration and financial reporting service requirements for our Private Equity and Private Debt clients. The role will include the below key tasks.You Will: Review financial data received from Private Equity / Private Debt clients and load to our internal accounting systems. Assist with setting up, preparing and reviewing consolidations through the investment structure using various consolidation rules. Process payment of fund expenses in applicable banking system. Book journal entries related to cash payments and accruals. Prepare third party reconciliations of investments and cash. Prepare capital call and distribution calculations and notices. Prepare fee schedules including calculation of management fees and carried interest, ensuring all calculations observe applicable fund documents. Prepare investor allocations for each NAV cycle ensuring capital transactions are booked correctly and P&L is allocated correctly. Prepare NAV packages and other ad hoc deliverables as defined in the service level agreements. Collaborate with client, banks, auditors and other third parties to ensure smooth delivery to clients and completion of deliverables. This is a new positionPay range: 72,000 - 105,600 CADQualificationsSome experience working in the fund administration industry or auditPrivate Equity or Private Debt experience is preferred but not essentialUnderstanding of securities such as equities, bonds, forwards, futures, options. Degree in economics, accounting or professional qualification as ACA, ACCA CFAExperience working with Investran is value added but not essentialAdditional InformationWhat’s in it for you to join MUFG Investor Services? Take a look at our careers site and you’ll find everything you’d expect from a career with the fastest-growing business at one of the world’s largest financial groups. Now take another look. Because it’s how we defy expectations that really defines us. You’ll feel that difference in all kinds of ways. Our vibrant CULTURE. Connected team. Love of innovation, laser client focus, and next-level LEARNING & DEVELOPMENT. Oh, and we really walk the talk when it comes to HYBRID WORKING. So, why settle for the ordinary? Apply now for a Brilliantly Different career.At MUFG Investor Services, we use Artificial Intelligence (AI) tools to help identify skills and experience that align with role requirements. All AI recommendations are reviewed by our recruitment team before any decisions are made.MUFG is an equal opportunity employer.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4163888028/",
    "job_id": "4163888028",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Assistant Manager – Finance and Commercial",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4022679292/",
    "job_id": "4022679292",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Junior Officer-Finance (For Rangpur Dairy and Food Products ...",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350616666/",
    "job_id": "4350616666",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Senior Officer/Officer, Finance & Accounts- For Akij Resources- Job ID",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4262377077/",
    "job_id": "4262377077",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Analyst, Markets Treasury, HSBC Bangladesh (Assistant Vice ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]