[
  {
    "url": "https://www.linkedin.com/jobs/view/4364509927/",
    "job_id": "4364509927",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Officer (Cash) - (For Pro-Active Medical College & Hospital Ltd.(Narayanganj)) - Job ID - 1459548",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Pro-Active Medical College & Hospital Ltd.(Narayanganj) is looking for Junior Officer (Cash)Educational RequirementsBachelor/Honorsস্নাতক/স্নাতকোত্তর অথবা সমমানের ডিগ্রী সম্পন্নকারী। হাসপাতাল ফার্মেসি বিভাগের সংশ্লিষ্ট পদে ১ বছরের অভিজ্ঞতা থাকা বাঞ্চনীয়।Experience RequirementsAt least 1 year(s)The applicants should have experience in the following business area(s):Hospital,Physiotherapy center,Diagnostic Centre,Clinic,ChamberJob LocationNarayanganj",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356494293/",
    "job_id": "4356494293",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer, VAT- For Vitalac Dairy & Food Industries Ltd- Job ID: 1454732",
    "location": "Narsingdi District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Vitalac Dairy & Food Industries Ltd is looking for Officer, VATJob Description / ResponsibilityPrepare and submit monthly VAT returns (Mushak-9.1) within the due date for distributors.Maintain all relevant VAT registers and documentation, including Mushak forms, challans, and purchase & sales registers using NBR-enlisted software.Ensure proper deduction and deposit of VAT at source (VDS) and reconcile input-output VAT.Ensure VAT compliance in every transaction and provide necessary support during VAT audits.Provide VAT-related analysis, reports, and summaries to the section in-chargeCommunicate and liaise with VAT authorities regarding various VAT-related issues and requirements.Updates on Regulations: Stay updated with the latest amendments, SROS, and circulars issued by the NBR to ensure legal complianceEducational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in AccountingExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Food (Packaged)/Beverage,Food (Packaged),Dairy",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354222986/",
    "job_id": "4354222986",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Accounting Officer (For Best tech engineering) - Job ID - 1452445",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Best tech engineering is looking for Senior Accounting OfficerWorkplaceWork at officeEducational RequirementsBachelor of Commerce (BCom)Master of Commerce (MCom)বি.কম/এম.কম পাস।Experience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s): Garments,Group of CompaniesAdditional Requirementsসুয়েটার ফ্যাক্টরী / গার্মেন্টস এ কমপক্ষে ৫ বৎসরের হিসাব বিভাগে কাজের বাস্তব অভিজ্ঞতা ওএকক ভাবে হিসাব বিভাগ পরিচালনায় দায়িত্ব ও দক্ষতা থাকিতে হইবে।কর্মস্থল গাজীপুর।Job LocationGazipur",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367039498/",
    "job_id": "4367039498",
    "source": "linkedin",
    "company_name": "Grant Thornton Bahrain",
    "job_title": "Manager Finance (Senior Consultant)",
    "location": "Seef, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Position: Manager Finance (Senior Consultant) Grant Thornton Abdulaal Bahrain is currently seeking qualified and motivated Manager Finance (Senior Consultant) to join one of our highly reputable clients in the market. This role will be hired on a short term contract, with the possibility of extension based on client requirements.Job Description:The ideal candidate will hold a professional accounting qualification (ACCA/CA) and possess a minimum of 8 years of hands-on experience in accounting, financial reporting, and compliance. This role requires a strong understanding of IFRS, the ability to manage deadlines, and a detail-oriented approach to both routine and ad hoc financial tasks.Key Responsibilities:Oversee and support day to day accounting operations, including accruals, ERP journal entries, reconciliations and consolidation adjustment entriesManage month end and year-end closing processes, ensuring accuracy and timelinessHandle various reporting tasks, including management reports, variance analysis, and regulatory submissionsRespond to ad hoc financial requests and assist in special projects as requiredEnsure compliance with relevant accounting standards, policies, and controlsPrepare and review financial statements for holding Companies in compliance with IFRS and internal accounting policiesCollaborate with internal and external stakeholders including auditors, tax consultants, and business unitsQualifications:Qualified ACCA or CA (or equivalent recognized accounting qualification)Minimum of 6 years of relevant experience in accounting or finance rolesStrong working knowledge of International Financial Reporting Standards (IFRS)Excellent attention to detail and commitment to accuracy and data integrityAbility to work independently with minimal supervisionStrong time management skills with the ability to meet tight deadlinesProficient in Excel and accounting systems (e.g., ERP, Oracle is a plus)Role will be hired on a short term contract, with the possibility of extension based on client requirement. Job is open only for candidates currently based in Bahrain.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369478568/",
    "job_id": "4369478568",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Assistant Finance Manager",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job SummaryAbout the job Assistant Finance ManagerThe Assistant Finance Manager will support the Finance Manager in overseeing the banks financial operations, ensuring accuracy, compliance, and efficiency across accounting, reporting, taxation, and banking-related activities. The role requires strong hands-on experience in VAT filing, monthly financial reporting, vendor payment management, MIS reporting, and active involvement in core banking system implementation and enhancement initiative.Key ResponsibilitiesFinancial Accounting & Reporting Assist in the preparation and review of monthly, quarterly, and annual financial statements in accordance with applicable accounting standards. Ensure timely month-end and year-end closing, including accruals, provisions, and reconciliations. Monitor general ledger activities and ensure accuracy of accounting records. Support internal and external audits by preparing schedules, explanations, and documentation.VAT & Tax Compliance Prepare, review, and submit VAT returns accurately and on time in compliance with local tax regulations. Maintain VAT records, reconciliations, and supporting documentation. Coordinate with tax consultants and authorities on VAT-related matters, assessments, and audits. Assist with other statutory tax filings and regulatory compliance as required.Vendor Payments & Accounts Payable Oversee and manage the vendor payment cycle, ensuring timely and accurate payments. Review supplier invoices for accuracy, approvals, and compliance with contractual terms.Maintain vendors master data and resolve discrepancies or disputes with suppliers. Monitor aging reports and manage cash flow related to payables.MIS & Management Reporting Prepare and analyze MIS reports for management, including profitability, cost analysis, budget vs. actuals, and variance analysis. Develop dashboards and periodic financial summaries to support strategic decision-making. Ensure accuracy, consistency, and timeliness of management reports.Budgeting & Forecasting Assist in the preparation of annual budgets and financial forecasts. Track budget performance and highlight deviations with actionable insights. Support cost control initiatives and financial planning activities.Core Banking System Implementation & Support Actively participate in the implementation, enhancement, and optimization of the core banking system. Coordinate with IT, vendors, and internal stakeholders during system rollout and upgrades. Assist in mapping financial processes, testing system functionalities, and validating financial data. Ensure seamless integration between the core banking system and accounting/reporting modules. Provide post-implementation support, troubleshooting, and documentation.Controls & Process Improvement Ensure adherence to internal financial controls, policies, and procedures. Identify process gaps and recommend improvements to enhance efficiency and compliance. Support automation and digital transformation initiatives within the finance function.EDUCATION AND CERTIFICATIONSBachelor's degree in Accounting, Finance, or a related field.RequirementsMinimum of 5 years' experience in trade finance operations within a banking environment.Strong knowledge of bookkeeping principles, general ledger functions, and financial reporting.Strong knowledge with IFRS16Familiarity with local tax regulations (NBR), payment processing standards, and internal controlsFamiliarity with Central Bank of Bahrain guidelinesFor further information, and to apply, please visit our website via the “Apply” button below.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364703574/",
    "job_id": "4364703574",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Officer, Cash (For Divine Mercy Hospital Ltd.)-Job ID: 1459152",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Divine Mercy Hospital Ltd. is looking for Assistant Officer, CashJob Description / ResponsibilityReceive and process payments from patients for hospital services, medicines, and other fees.Issue receipts/Invoice and maintain accurate financial records.Handle cash transactions responsibly and reconcile the cash drawer at the end of each shift.Prepare daily and periodic cash reports for the finance/accounting department.Respond to patient billing inquiries courteously and professionally.Ensure compliance with hospital policies on cash handling, security, and confidentiality.Coordinate with finance, pharmacy, and other hospital departments to ensure smooth financial operations.Educational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s): HospitalAdditional RequirementsBasic accounting and cash handling knowledge preferred.Proficiency in using computer, hospital management software and POS systems.Strong numerical and data entry skills.Honest, reliable, and trustworthy.Good communication and interpersonal skills.Prior experience in hospital, clinic, or diagnostic Centre is highly preferred.Job LocationGazipur (Kaliganj)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367780254/",
    "job_id": "4367780254",
    "source": "linkedin",
    "company_name": "Grant Thornton Bahrain",
    "job_title": "Assistant Finance Manager (Contract Role)",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job SummaryThe Assistant Finance Manager will support the Finance Manager in overseeing the banks financial operations, ensuring accuracy, compliance, and efficiency across accounting, reporting, taxation, and banking-related activities. The role requires strong hands-on experience in VAT filing, monthly financial reporting, vendor payment management, MIS reporting, and active involvement in core banking system implementation and enhancement initiative.Key ResponsibilitiesFinancial Accounting & Reporting Assist in the preparation and review of monthly, quarterly, and annual financial statements in accordance with applicable accounting standards. Ensure timely month-end and year-end closing, including accruals, provisions, and reconciliations. Monitor general ledger activities and ensure accuracy of accounting records. Support internal and external audits by preparing schedules, explanations, and documentation.VAT & Tax Compliance Prepare, review, and submit VAT returns accurately and on time in compliance with local tax regulations. Maintain VAT records, reconciliations, and supporting documentation. Coordinate with tax consultants and authorities on VAT-related matters, assessments, and audits. Assist with other statutory tax filings and regulatory compliance as required.Vendor Payments & Accounts Payable Oversee and manage the vendor payment cycle, ensuring timely and accurate payments. Review supplier invoices for accuracy, approvals, and compliance with contractual terms.Maintain vendors master data and resolve discrepancies or disputes with suppliers. Monitor aging reports and manage cash flow related to payables.MIS & Management Reporting Prepare and analyze MIS reports for management, including profitability, cost analysis, budget vs. actuals, and variance analysis. Develop dashboards and periodic financial summaries to support strategic decision-making. Ensure accuracy, consistency, and timeliness of management reports.Budgeting & Forecasting Assist in the preparation of annual budgets and financial forecasts. Track budget performance and highlight deviations with actionable insights. Support cost control initiatives and financial planning activities.Core Banking System Implementation & Support Actively participate in the implementation, enhancement, and optimization of the core banking system. Coordinate with IT, vendors, and internal stakeholders during system rollout and upgrades. Assist in mapping financial processes, testing system functionalities, and validating financial data. Ensure seamless integration between the core banking system and accounting/reporting modules. Provide post-implementation support, troubleshooting, and documentation.Controls & Process Improvement Ensure adherence to internal financial controls, policies, and procedures. Identify process gaps and recommend improvements to enhance efficiency and compliance. Support automation and digital transformation initiatives within the finance function.EDUCATION AND CERTIFICATIONSBachelor's degree in Accounting, Finance, or a related field.RequirementsMinimum of 5 years' experience in trade finance operations within a banking environment.Strong knowledge of bookkeeping principles, general ledger functions, and financial reporting.Strong knowledge with IFRS16Familiarity with local tax regulations (NBR), payment processing standards, and internal controlsFamiliarity with Central Bank of Bahrain guidelinesFamiliarity with TCS core system is an advantage",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373850608/",
    "job_id": "4373850608",
    "source": "linkedin",
    "company_name": "HSBC",
    "job_title": "Officer, Special Project, International Wealth & Premier Banking (Contractual for 6 Months)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role Purpose This role will support HSBC’s International Wealth & Premier Banking (IWPB) transition activities. The incumbent will manage customer complaint handling, contact centre operational services, and execute wind down related residual works to ensure compliance, customer satisfaction, and smooth operational closure.This job will support the wind-down project team to help customers exiting the bank ensuring highest standard, and temporary in nature expected to be completed in next 6 months.Principal Accountabilities Receive, log, and resolve customer complaints in line with HSBC’s global standards and Bangladesh Bank regulatory requirements. Liaise with relevant departments to ensure timely resolution and fair customer outcomes. Provide outstanding customer service on account closure, loan transfer, govt. Bond transfer, other closure related services to the exiting IWPB customers. Prepare documentation and reporting for management review and audit readiness. Monitor call handling, escalation processes, and customer communication standards. Execute administrative and operational tasks related to the wind down of IWPB services. Maintain accurate records and ensure smooth transition of residual activities. Experience, Skills And Qualifications Bachelor’s degree from a public/private university. Sound knowledge of basic banking services, local regulations. Attention to detail and ability to maintain accurate documentation. Collaborative approach with cross functional teams. Adaptability to temporary project-based assignments.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365799260/",
    "job_id": "4365799260",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.The company is founder-led, profitable, and growing.The role of an Accountant at Canonical:If you are passionate about the technology industry and want to work for a company that aligns with your interests, we might be the place for you! Canonical, and our world class Ubuntu product, attracts some of the leading talent from around the world. Come and work with exceptional people and advance your career in Finance!Our Finance team is growing and it's a really exciting time to join the team. We are looking for bright, motivated people who have a passion for making a difference. You will be seeking an opportunity to drive process improvements and change, input your ideas and truly contribute to a highly productive team.We are looking for an exceptional Accountant with IFRS experience to help us ready the business for public market scrutiny through our planned IPO. The right candidate will have domain expertise and a passion for IFRS.Location: This role may be office based in London, or Remote in EMEA Time Zones.What your day will look likeAssist in the month end reporting process to deliver timely and accurate informationHave full responsibility for a part of the ledger processes relevant to your strengthsAssist with the year end audit process and statutory reportingSupport the finance team's wider plans to prepare for an IPOImprove the efficiency of financial processes and procedures and monitor complianceShare knowledge between team members to ensure cover is available when neededActively develop your own skills to ensure current knowledge of applicable standards and regulationsEstablish strong relationships with key colleagues outside the wider finance teamWhat we are looking for in youExceptional academic track record and subsequent career performanceBachelor's degree in Accounting or equivalentQualified accountant (ACCA, ACA, ACMA, CPA, etc.)Experience at a large public accounting firm, or public multinational corporate accounting department preferredNetSuite or similar enterprise grade systems experienceWillingness to travel up to four times per yearWhat we offer colleaguesWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.Distributed work environment with twice-yearly team sprints in personPersonal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveTeam Member Assistance Program & Wellness PlatformOpportunity to travel to new locations to meet colleaguesPriority Pass and travel upgrades for long-haul company eventsAbout CanonicalCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.Canonical is an equal opportunity employerWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368656279/",
    "job_id": "4368656279",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Manager Finance (Senior Consultant)",
    "location": "Seef, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About The Job Manager Finance (Senior Consultant)Position: Manager Finance (Senior Consultant)Grant Thornton Abdulaal Bahrain is currently seeking qualified and motivated Manager Finance (Senior Consultant) to join one of our highly reputable clients in the market. This role will be hired on a short term contract, with the possibility of extension based on client requirements.Job DescriptionThe ideal candidate will hold a professional accounting qualification (ACCA/CA) and possess a minimum of 8 years of hands-on experience in accounting, financial reporting, and compliance. This role requires a strong understanding of IFRS, the ability to manage deadlines, and a detail-oriented approach to both routine and ad hoc financial tasks.Key ResponsibilitiesOversee and support day to day accounting operations, including accruals, ERP journal entries, reconciliations and consolidation adjustment entriesManage month end and year-end closing processes, ensuring accuracy and timelinessHandle various reporting tasks, including management reports, variance analysis, and regulatory submissionsRespond to ad hoc financial requests and assist in special projects as requiredEnsure compliance with relevant accounting standards, policies, and controlsPrepare and review financial statements for holding Companies in compliance with IFRS and internal accounting policiesCollaborate with internal and external stakeholders including auditors, tax consultants, and business unitsQualificationsQualified ACCA or CA (or equivalent recognized accounting qualification)Minimum of 6 years of relevant experience in accounting or finance rolesStrong working knowledge of International Financial Reporting Standards (IFRS)Excellent attention to detail and commitment to accuracy and data integrityAbility to work independently with minimal supervisionStrong time management skills with the ability to meet tight deadlinesProficient in Excel and accounting systems (e.g., ERP, Oracle is a plus)Role will be hired on a short-term contract, with the possibility of extension based on client requirement.Job is open only for candidates currently based in Bahrain.For further information, and to apply, please visit our website via the “Apply” button below.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364124950/",
    "job_id": "4364124950",
    "source": "linkedin",
    "company_name": "Calo Inc.",
    "job_title": "Senior Revenue Accountant",
    "location": "Seef, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About Calo (more Here)Calo is an app providing personalized meal plans for busy people through nutritional algorithms, built with love by chefs, nutritionists, and software engineers.Launched in Bahrain in 2019, we have since expanded to 7 countries, delivered millions of meals to our customers, and are now expanding our mission of making healthy easy to retail and other verticals.We're on a noble mission to make healthy easy. We think this is one of the most important problems to tackle in our world today. We have global ambitions - no small thinking here.Why This Role MattersWe are looking for an experienced Senior Revenue Accountant to support the group reporting function at Calo. Will be responsible for overseeing the revenue accounting of the group and ensuring accuracy and integrity of transactions.What You’ll DoRecord and reconcile revenue transactions on day to day basis in compliance with accounting standards and implementing the necessary accounting policies and procedures Prepare and reconcile monthly revenue reports and account balances Maintain accurate and up-to-date accounts receivable records in accordance with accounting standardsMonitor and reconcile discrepancies between payment gateway accounts and delivery aggregator statements Assist with month-end closing activities related to accounts receivables and revenue recognitionLiaison with payment gateways, delivery aggregators, external regulators etcFollow up on outstanding receivables from B2B departmentManage, mentor, and develop the revenue accounting team, ensuring high performance, professional growth, and effective collaboration with other departments.Identify opportunities to improve revenue accounting processes and systems, assisting in the implementation of best practices.What We’re Looking ForBachelor’s degree in accounting and finance, or equivalent5+ years of accounting experienceExperience with revenue booking and the month-end/year-end closing processWorking knowledge of IFRS and GAAP specifically with IFRS 15Strong communication skills, both written and verbalStrong organizational and stress management skillsProficiency in Microsoft Office, particularly with ExcelAbility to work with little to no supervisionAccuracy & attention to detailThe Hiring JourneyScreening1st Technical Interview2nd Technical InterviewCulture Fit InterviewReady to Join?If this role excites you, and you see yourself matching at least 85% of the criteria above, what are you waiting for? Yalla, let’s gooo! 🚀",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368122083/",
    "job_id": "4368122083",
    "source": "linkedin",
    "company_name": "Napco National",
    "job_title": "ACCOUNTANT",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionShort DescriptionDescriptionPreparing : Tally Invoice vs. Loading Manifest vs. Sales Order Tally Selling Price on Sales Orders vs. Price List or Costing Sheet Follow up , Record Bank Collection & Follow up Export Collections Prepare Export L/C documents Reconcile Customer Accounts & Maintain Customer Aging Report Tally Receivable Aging vs. Trial Balance & take corrective action for variances Prepare Debit / Credit Notes to Customers Follow up missing Official Receipt Numbers Create New Customer Account on ERP Generate Monthly Customer Statement of Account and distributed to Sales Dept Generate Quarterly Customer Balance Confirmation and distributed to Sales Dept Follow up Customer Balance Confirmation and their statistics by Salesman Control Official Receipt Book Tally Supplier Invoice vs. Packing slip vs. Purchase Order Record RM invoices & SP invoices Maintain suppliers Payment schedule & Follow up with bank for Foreign Suppliers Reconcile Supplier accounts & Tally Payable Aging vs. Trial Balance. Identifying variance and take corrective actions. Preparing SWIFT transfers & Bank’s correspondence Open New Supplier Account on ERP.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368205429/",
    "job_id": "4368205429",
    "source": "linkedin",
    "company_name": "Bank ABC",
    "job_title": "Compliance Oversight Testing Officer",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360835645/",
    "job_id": "4360835645",
    "source": "linkedin",
    "company_name": "Burjline Builders",
    "job_title": "Accountant Intern",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362790210/",
    "job_id": "4362790210",
    "source": "linkedin",
    "company_name": "Hire Fellows",
    "job_title": "Senior Accountant",
    "location": "Al-Hidd, Muharraq Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We are looking for a Cost Accountant to join a company in the F&B Space. As a vital member of the organization, you will be responsible for analyzing costs, implementing cost-saving measures, and maximizing profitability while maintaining the highest standards of quality. If you have a keen eye for detail, a strong background in cost control within the F&B sector, and specific experience in Bahrain's F&B landscape, we want to hear from you!Main Responsibilities:Preparing company MIS reports and annual audit Analyze food and beverage costs to identify areas for improvementDevelop and implement cost-saving strategies without compromising qualityMonitor inventory levels and ensure accurate stock managementCollaborate with purchasing and culinary team to optimize procurement processesConduct regular audits to ensure compliance with established proceduresPrepare reports and presentations on cost analysis and budget performanceStay updated on industry trends and best practices in F&B cost controlRequirementsExperience in forecasting and cost controlling for F&B industryKnowledge of Microsoft Dynamics Navision will be preferredBachelor's degree in Finance, Accounting, or related fieldStrong analytical skills with attention to detailExcellent communication and interpersonal abilitiesProficiency in MS Office, particularly ExcelAbility to work well under pressure and meet tight deadlines",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369250289/",
    "job_id": "4369250289",
    "source": "linkedin",
    "company_name": "Jobs via eFinancialCareers",
    "job_title": "Compliance Oversight Testing Officer - Arab Banking Corporation",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363229587/",
    "job_id": "4363229587",
    "source": "linkedin",
    "company_name": "Downtown Rotana",
    "job_title": "Accounts Supervisor - Payable",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360522420/",
    "job_id": "4360522420",
    "source": "linkedin",
    "company_name": "Liva Insurance UAE",
    "job_title": "Accountant",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361755572/",
    "job_id": "4361755572",
    "source": "linkedin",
    "company_name": "Gulf Downstream Association (GDA)",
    "job_title": "Accountant",
    "location": "Awali, Southern Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372341124/",
    "job_id": "4372341124",
    "source": "linkedin",
    "company_name": "Burjline Builders",
    "job_title": "Senior Accountant",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368101867/",
    "job_id": "4368101867",
    "source": "linkedin",
    "company_name": "Hire Fellows",
    "job_title": "Chief Accountant",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We are seeking an experienced and detail-oriented Chief Accountant to lead the accounting function for a company in the F&B/Retail space. This role is responsible for overseeing financial operations, ensuring accurate reporting, maintaining strong internal controls, and supporting business growth through sound financial management. The ideal candidate brings deep accounting expertise, hands-on leadership, and a strong understanding of retail and F&B operations.Main Responsibilities:⁠Oversee all accounting activities for the Retail and F&B division, including general ledger, accounts payable/receivable, inventory accounting, and fixed assetsPrepare and review monthly, quarterly, and annual financial statements in accordance with applicable accounting standardsEnsure timely and accurate month-end and year-end closing processesManage budgeting, forecasting, and variance analysis; provide actionable financial insights to managementMonitor cash flow, cost controls, margins, and profitability across outlets and retail operationsEnsure compliance with tax regulations, statutory filings, and external audit requirementsEstablish and maintain effective internal controls, policies, and accounting proceduresSupervise, mentor, and develop the accounting teamCollaborate closely with operations, procurement, and management to support strategic and operational decisionsSupport system improvements and ERP/accounting software enhancementsRequirements⁠⁠Experience in forecasting and cost controlling for F&B industryBachelor's degree in Accounting, Finance, or a related field (CPA, ACCA, CMA, or equivalent certification preferred)⁠Minimum 7-10 years of accounting experience, with at least 3-5 years in a senior or managerial roleProven experience in Retail and/or Food & Beverage accounting, including inventory and cost of sales management⁠Strong knowledge of accounting standards, tax regulations, and financial reporting⁠Advanced proficiency in accounting software and MS Excel; ERP system experience is a plus⁠Excellent leadership, organizational, and analytical skills⁠High attention to detail with the ability to meet tight deadlines⁠Strong communication skills and the ability to work cross-functionally",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364119922/",
    "job_id": "4364119922",
    "source": "linkedin",
    "company_name": "Burjline Builders",
    "job_title": "Assistant Manager (Finance)",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Key Responsibilities:Prepare accurate and timely financial statements and regulatory reporting in accordance with applicable accounting standards including consolidation.Lead strict month-end and year-end closing processes for all divisions, ensuring adherence to deadlines and completeness of financial records.Prepare and analyse MIS reports for management, providing meaningful insights on financial performance across divisions.Analyse financial data to verify accuracy, identify discrepancies, and ensure compliance with relevant laws, regulations, and internal policies.Coordinate and deal with external auditors and tax authorities across the region, ensuring timely completion of audits and regulatory requirements.Develop comprehensive budgets and financial plans based on detailed analysis of historical data and market trends.Perform monthly account reconciliations to maintain accurate reporting and ensure proper ledger maintenance.Provide financial analysis and forecasting to support strategic decision-making and business planning.Education and Experience:Bachelor’s degree in accounting, Finance, or a related field (CPA, ACCA, CA or equivalent certification). Minimum of 8 years of progressive accounting experience, with at least 2 years in a similar role and positionDemonstrated experience in accounting, financial reporting, and compliance within a corporate environment.Strong knowledge of accounting principles, IFRS/GAAP, financial reporting, and regulatory requirements.Proficiency in accounting software and ERP systems (such as SAP, Oracle, or QuickBooks).Proficiency in accounting software and ERP systems (e.g., SAP, Oracle, QuickBooks). Advanced Excel skills and familiarity with data analysis tools. Excellent analytical, organizational, and problem-solving skills. Strong communication and interpersonal abilities. High level of integrity and attention to detail.Preferred SkillsExperience in the financial services sector. Familiarity with international accounting standards and multi-currency environments. Experience in multi-entity or multinational group accounting environments. Knowledge intercompany eliminations and consolidation adjustments. Ability to work under pressure and meet tight deadlines.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369484375/",
    "job_id": "4369484375",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Senior Accountant",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionAbout the job Senior AccountantPerform daily accounting entries in Odoo ERPHandle 150–200 accounting transactions per monthManage Accounts Payable including invoice processing and payment arrangementsManage Accounts Receivable, tenant follow-ups, and aging reportsPerform bank and cash reconciliations on a monthly basisPrepare monthly financial closing and ensure accuracy of recordsPrepare and submit a monthly financial reports to the MD, including:Executive SummaryProfit & LossCash flow summaryAccounts receivable agingAccounts payable summaryCoordinate directly with external auditors and support annual auditPrepare audit schedules and respond to auditor queriesSupport VAT filings and statutory complianceMaintain accounting records for two SPVs, with limited annual transactions (5–10 per year)Coordinate with facility management and leasing teams for rent reconciliation and financial accuracyQualifications & Skills RequiredBachelors degree in Accounting, Finance, or equivalentProfessional certifications (CA, ACCA, CPA, CMA) are an advantageStrong hands-on accounting skillsExperience using ERP systems (Odoo or similar)Solid knowledge of AP, AR, GL, and reconciliationsAudit preparation and auditor coordination experienceAbility to work independently without close supervisionStrong follow-up and organizational skillsClear reporting and communication skillsComfortable working directly with company owners / senior managementExperience in real estate, or asset-based businesses is highly preferredUnderstanding of service charges and tenant accounting is a plusFor further information, and to apply, please visit our website via the “Apply” button below.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361626416/",
    "job_id": "4361626416",
    "source": "linkedin",
    "company_name": "Qureos",
    "job_title": "Senior Accountant - Braxtone Group",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Key ResponsibilitiesPrepare accurate and timely financial statements and regulatory reporting documents in accordance with applicable standards. Manage month-end and year-end closing processes to ensure completeness and accuracy of financial records.Analyze financial data to verify accuracy, identify discrepancies, and ensure compliance with relevant laws and regulations. Collaborate with external auditors to ensure timely and proper adherence to all regulatory requirements. Develop comprehensive budgets and financial plans based on thorough analysis of financial data and market trends. Perform monthly account reconciliations to maintain accurate reporting and ensure proper ledger maintenance. Provide financial analysis and forecasting to support strategic decision-making and business planning.Implement and maintain robust financial controls, policies, and procedures to safeguard assets and ensure operational efficiency. Assist in audit preparations and coordinate internal audit activities to ensure readiness and compliance. Supervise and delegate financial tasks to the accounting team, ensuring quality and timeliness of deliverables.Education And ExperienceBachelor’s degree in Accounting, Finance, or a related field (CPA or equivalent certification preferred). Minimum of 5 years of progressive accounting experience, with at least 2 years in a senior or supervisory role. Strong knowledge of accounting principles, financial reporting, and regulatory compliance. Proficiency in accounting software and ERP systems (e.g., SAP, Oracle, QuickBooks). Advanced Excel skills and familiarity with data analysis tools. Excellent analytical, organizational, and problem-solving skills. Strong communication and interpersonal abilities. High level of integrity and attention to detail.Preferred SkillsExperience in the financial services sector. Familiarity with international accounting standards and multi-currency environments. Experience in multi-entity or multinational group accounting environments. Knowledge intercompany eliminations and consolidation adjustments. Ability to work under pressure and meet tight deadlines.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362420750/",
    "job_id": "4362420750",
    "source": "linkedin",
    "company_name": "Qureos",
    "job_title": "Assistant Manager (Finance) - Braxtone Group",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Key ResponsibilitiesPrepare accurate and timely financial statements and regulatory reporting in accordance with applicable accounting standards including consolidation.Lead strict month-end and year-end closing processes for all divisions, ensuring adherence to deadlines and completeness of financial records.Prepare and analyse MIS reports for management, providing meaningful insights on financial performance across divisions.Analyse financial data to verify accuracy, identify discrepancies, and ensure compliance with relevant laws, regulations, and internal policies.Coordinate and deal with external auditors and tax authorities across the region, ensuring timely completion of audits and regulatory requirements.Develop comprehensive budgets and financial plans based on detailed analysis of historical data and market trends.Perform monthly account reconciliations to maintain accurate reporting and ensure proper ledger maintenance.Provide financial analysis and forecasting to support strategic decision-making and business planning.Education And ExperienceBachelor’s degree in accounting, Finance, or a related field (CPA, ACCA, CA or equivalent certification). Minimum of 8 years of progressive accounting experience, with at least 2 years in a similar role and positionDemonstrated experience in accounting, financial reporting, and compliance within a corporate environment.Strong knowledge of accounting principles, IFRS/GAAP, financial reporting, and regulatory requirements.Proficiency in accounting software and ERP systems (such as SAP, Oracle, or QuickBooks).Proficiency in accounting software and ERP systems (e.g., SAP, Oracle, QuickBooks). Advanced Excel skills and familiarity with data analysis tools. Excellent analytical, organizational, and problem-solving skills. Strong communication and interpersonal abilities. High level of integrity and attention to detail.Preferred SkillsExperience in the financial services sector. Familiarity with international accounting standards and multi-currency environments. Experience in multi-entity or multinational group accounting environments. Knowledge intercompany eliminations and consolidation adjustments. Ability to work under pressure and meet tight deadlines.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368355628/",
    "job_id": "4368355628",
    "source": "linkedin",
    "company_name": "Jobs via eFinancialCareers",
    "job_title": "IFRS9 & ECL Reporting Officer - Arab Banking Corporation",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Bank ABC seeks to recruit an IFRS9 & ECL Reporting Officer in the Group Risk Management Department based in our Head Office, in Bahrain.The primary responsibility of this role involves running the Moodys IFRS9 RCO on several environments / contexts for different units/subsidiaries as applicableRegularly maintaining, updating, and monitoring the Expected Credit Loss (ECL) framework, including the calculation rules and engines in line with internal policies and regulatory requirements.The role requires a sound understanding of SQL and related database technologies and a high-level familiarity with statistical tools such as SA. A strong knowledge of IFRS9 guidelines, Basel guidelines, and credit risk management tools is essential Responsibilities of the role: Reporting to the Head of IFRS9 & ECL Reporting, the job holder will be responsible for: Generation of IFRS9 ECL provision results on a quarterly basis through the Moodys RCO for both Group and Unit levels using different environments/contexts. Engaging with all ABC Subsidiaries and Business Units to collect necessary data and ensure that the data provided is accurate by performing periodic checks Generating analytical reports related to ECL from Strategic System Define and validate the integration of the RCO with other risk management systems Preparing and maintaining all internal standards, policies and rules on IFRS9. Active engagement, awareness and monitoring of any proposed or announced policy changes together with preparation for the impact of such changes Providing support for other critical strategic risk management initiatives which include Risk MI Dashboard, Stress Testing, ICAAP, portfolio reporting etc Maintaining and monitor ECL strategic system configuration for any required changes. Engage and perform any necessary UAT for changes in the RCO and assist with efforts to automate the ECL computation where applicable Reporting P&L Charge to GCC which includes reconciliation between Group Finance & Group Risk. Not limited to reconciliation of Stage 3 accounts with Group RLU Areas Of Knowledge, Qualification And Experience 2-5 years' experience in a similar function with a large regional or global financial institution A graduate degree with Banking & Finance Background High level of data handling skills. Strong knowledge of IFRS9 regulations Good knowledge of Credit Risk measurement techniques such as risk ratings. Strong, hands-on proficiency in SQL and related database technologies ( i.e. SAS, R & Python) beyond basic or high-level understanding. Ability to learn and update skills on the job. Expert-level Excel skills, including data cleaning, advanced functions (e.g., VLOOKUP/XLOOKUP, INDEX-MATCH), and large-dataset management. Good organizational skills",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372317328/",
    "job_id": "4372317328",
    "source": "linkedin",
    "company_name": "BRAC",
    "job_title": "Manager, Grants, Humanitarian Crisis Management Programme (HCMP)",
    "location": "Cox’s Bazar, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BRAC is an international development organisation founded in Bangladesh that partners with over 100 million people living with inequality and poverty globally to create sustainable opportunities to realise potential. Working at BRAC is not like any other job. It is a platform where you can bring about real change for people who need it the most. We are not just dreaming of a better world; we are building it. Join us to find the way.Purpose:The purpose of this role is to effectively design and implement a comprehensive monitoring and evaluation system to track the progress and effectiveness of the overall grants efforts.Job Description/Responsibilities:Plan, produce and review cost proposals for the assigned project.Design and implement a comprehensive monitoring and evaluation system to track actual against projected expenditure of funds received.Ensure the collection of data that measures progress and tracks the effectiveness of the approved budgets in implementing projects.Conduct assessment and provide feedback on progress toward program targets and benchmarks. Ensure donor compliance especially European Union (EU) funded project. Ensure quality control, rigorous monitoring, and evaluation.Support to the programme team program team with budget revisions and realignment.Produce budget vs actual expenditure (BvA) report, analyze spending trends, and provide updates to the programme team. Represent BRAC at donor and other stakeholder meetings for funding opportunities.Facilitate budgeting and reporting for NOGAB in coordination with different sectors.Coordinate with respective sectors to determine funding needs.Ensure timely submission of proposals and reports to donor agencies.Safety and Safeguarding:Ensure the safety of Programme Participants, people who come into contact with the organisation, and team members from harm, abuse, neglect, harassment, and exploitation, including sexual exploitation and abuse (SEA), to achieve the programme's goals of safeguarding implementation. Act as a critical source of support, guidance, and expertise on safeguarding to establish a safe working environment.Practice, promote and endorse the issues of safeguarding policy among team members and ensure the implementation of safeguarding standards in every course of action.Follow the safeguarding reporting procedure in case any reportable incident occurs and encourage others to do so.Educational Requirements:MBA/ Master’s degree in finance/ accounting from any reputed university. Experience Requirement:Minimum 5 years’ experience in the relevant field in donor-funded programmes in which at least 2 years’ experience in the grants and financial management, preferably in EU-funded projects for at least one year. Additional Requirements:The candidate should have two years of experience as a Grants Manager/Finance Manager and hands-on experience in NGOAB budgeting and reportingStrong understanding of BRAC’s values and mission, development sector, global development scenario to identify funding trends, financial and grants management, donor agenciesFamiliarity with financial planning, budget preparation, expenditure tracking, donor compliance, and cost control mechanismsStrong communication, report writing, and interpersonal skills for effective coordination with teams and stakeholdersAbility to operate in a complex organization, across functions and work on own initiative and collaboratively as part of diverse teamsCommitment to BRAC’s values, safeguarding, accountability, and gender-transformative programmingSalary: Negotiable.Other Benefits: Festival Allowance, Health & Life Insurance, Paternity/ Maternity leave and others as per organisation policy.Job Location: Cox’s BazarLast Apply Date: 20 February 2026Other Way to Apply: You may apply through bdjobs.com or send your updated CV to resume.hcmp@brac.net mentioning the name of the position “Manager, Grants, HCMP” in the subject line. This position is open for Bangladeshi nationals only.BRAC believes that everyone we work with including our staff, programme participants, partners, and the communities have the right to be protected from all forms of harm, abuse, neglect, harassment, and exploitation including sexual exploitation and abuse (SEA). We uphold human dignity and inclusion for all, regardless of race, religion, gender, disability, ethnic origin, or socio-economic condition. As an equal-opportunity employer, we actively encourage applications from gender-diverse individuals and people with disabilities.Selected candidates will have to go through a rigorous reference and background checking process which may include police verification.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368112259/",
    "job_id": "4368112259",
    "source": "linkedin",
    "company_name": "Napco National",
    "job_title": "GENERAL ACCOUNTANT",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Description Control and maintain the integrity of the general accounts in compliance with the FCA and standard accounting practices. Check the activities of the Cashier when needed for checks and balances. Check the treasury activities including accounting for money transfers, bank charges and remittances to the Company, running accounts payable/payroll checks, responsibility for bank deposits, coordinating and arranging, processing and coordinating all wire transfers, telex payments; ensure integrity of these activities before submitting to Chief General Accountant. Compute and submit to Chief General Accountant the required data related to own scope in order to include in the annual budget. Monitor the implementation of tax regulations and procedures imposed by the government throughout departments of the whole company, and keep abreast of new decrees associated with tax declarations and computation. Conduct audit to ensure that internal control procedures are well implemented recommend and follow up on corrective measures Filter payments and validate their accuracy in order to periodically fill the required tax & VAT forms as imposed by the tax authorities. Relay to Accounting Manager for approval. Develop and update statutory and fiscal reports for the usage of government’s tax controller and for the monthly sales report. Perform monthly banks and affiliates reconciliations and adjust irregularities Maintain a monthly trial balance audit file to confirm all balance are accurate Ensure proper filing and follow up on all subsidy applications and refunds",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371900645/",
    "job_id": "4371900645",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Operations Manager (For Dynamic Solution Innovators Limited)-Job ID: 1459325",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Dynamic Solution Innovators Limited is looking for Operations ManagerJob Description / ResponsibilityDescriptionDynamic Solution Innovators (DSi) is a software company providing software development services since 2001 to clients across Bangladesh and various international markets. With a team of 270+ professionals, we have delivered impactful solutions in the education, finance, logistics, and government sectors.We are seeking a results-driven and detail-oriented Operations Manager to oversee and optimize our day-to-day operational functions at DSi. This key management position will be responsible for ensuring operational efficiency, implementing process improvements, and supporting the execution of our business strategy.ResponsibilitiesManage daily operations across various departments, ensuring smooth workflow, adherence to compliance, quality standards and timely delivery of products/servicesAnalyze internal operations to identify, develop and implement solutions to streamline operations, and introduce best practices that enhance productivity and reduce costsLeading and supervising operation team, you will foster a collaborative and productive work environment. This involves scheduling, training team members, conducting performance evaluations, and ensuring team adherence to company policies and procedures.Oversee the allocation and utilization of resources including materials, equipment, and personnel to ensure optimal efficiencyMonitor performance with tracking software and take corrective measures when necessary, and prepare detailed updates and forecastsBuild and maintain trusting relationships with key customers, clients, partners, and stakeholdersPrepare different types of operational and management reportsEducational RequirementsMinimum 12+ years of experience in operations management or a similar role, preferably in Software IndustryExperience RequirementsAt least 12 year(s)The applicants should have experience in the following business area(s):Software Company,IT Enabled ServiceAdditional RequirementsProven track record of managing operational processes and leading teamsStrong understanding of operational workflows, supply chain basics, and performance metricsExcellent problem-solving and decision-making abilitiesStrong leadership, communication, and interpersonal skillsStrong people development skillsExperience in solution-based or innovation-driven organizationsDemonstrated experience with budget management and cost controlKnowledge of ERP systems and automation toolsFamiliarity with quality management systems and compliance standardsStrong organizational and time management skillsAnalytical mindset with attention to detailAbility to work under pressure and manage multiple prioritiesProactive and solution-oriented approachJob LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371503534/",
    "job_id": "4371503534",
    "source": "linkedin",
    "company_name": "Fives",
    "job_title": "Junior Accountant (Local Hiring)",
    "location": "Askar, Southern Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371933144/",
    "job_id": "4371933144",
    "source": "linkedin",
    "company_name": "EY-Parthenon",
    "job_title": "Valuations & Business Modeling Manager/ Senior Manager (Oil & Gas) - EY Parthenon - Manama",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368687563/",
    "job_id": "4368687563",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "Tax & Legal Services - Corporate Tax - Manager (Bahrain)",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368813241/",
    "job_id": "4368813241",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "Tax & Legal Services - Corporate Tax - Manager (Bahrain)",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373535669/",
    "job_id": "4373535669",
    "source": "linkedin",
    "company_name": "Faith Overseas Ltd",
    "job_title": "Trainee Officer – International Application & Enrollment",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "ResponsibilitiesPrepare a missing documents list upon receiving student documents and share it with the Managing Director and respective CounsellorsVerify that all submitted documents comply with Faith’s established rules and required formatsCarefully review all documents prior to visa submissionCheck and respond to students’ emails when requiredWrite and prepare Statements of Purpose (SOPs) for admission and visa interviewsMaintain and update document checklists for different countries’ Embassies and VFSPrepare and monitor the final document list to be submitted for visa applications, identifying complete and missing itemsHandle and monitor university application portals and visa portalsManage clients across different visa categoriesComplete, submit, and track visa and immigration application formsApply for visas and immigration processes, including payment of visa feesAssist with various official and administrative tasks as assigned by the Managing DirectorFollow instructions and guidance provided by senior officersPrepare and submit Daily, Weekly, Monthly, and Yearly operational reportsSupport the senior management team with management reports and special projects as neededEnsure all legal and regulatory documents are properly filed and maintain compliance with applicable laws and regulationsSalary Range: 10k-15kJob Location: House-14, Road-09, Sector-04, Uttara, Dhaka, Bangladesh-1230Working Hours:* 10:00 AM – 7:00 PM* Winter Schedule: 10:00 AM – 6:30 PM",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371906424/",
    "job_id": "4371906424",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Executive- For Dreamco Express- Job ID: 1459449",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Dreamco Express is looking for Junior ExecutiveJob Description / ResponsibilityOffice adminDocumentation supportHandling calls, emails and client coordinationEducational RequirementsBachelor of Business Administration (BBA)Skills Required: Communication, Microsoft Office, Fluent in English SpeakingSalaryTk. 15000 - 20000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371908130/",
    "job_id": "4371908130",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Data Entry & Operation Executive- For Hawker Limited- Job ID: 1459518",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Hawker Limited is looking for Data Entry & Operation ExecutiveJob Description / ResponsibilityData entry in Web based software and Media Monitoring Portal.Have to operate in Adobe Photoshop, Illustrator, MS Word, and Excel programs.Any other task assigns by the management.Should be dedicated to daily task completion.Keep close coordination with co-workers and update information.Educational RequirementsBachelor/HonorsSkills Required: Internet browsing & online work ability.Experience Requirements1 to 3 year(s)Additional RequirementsThe Candidate must be a non-smokerWillingness to work long hours even on any national holidays.Skill in Internet Browsing and email correspondence.Good typing speed in both Bangla & English.Job LocationDhaka (Mohakhali)SalaryTk. 10000 - 20000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3940267093/",
    "job_id": "3940267093",
    "source": "linkedin",
    "company_name": "Spa Staff.com",
    "job_title": "Full Time Spa Manager for a Health Club in Bahrain .",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372340060/",
    "job_id": "4372340060",
    "source": "linkedin",
    "company_name": "Ray Advertising",
    "job_title": "Virtual Assistant – Remote",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company OverviewRay Advertising is a U.S.-based company with global operations, specializing in performance marketing, health insurance, and e-commerce. Our business ecosystem is designed to help leading U.S. companies scale efficiently while delivering high-quality solutions to American consumers.We are focused on building a trusted and recognized brand in the U.S. market while creating meaningful job opportunities in Bangladesh. By empowering local talent and fostering professional growth, we aim to contribute to long-term economic development through sustainable, performance-driven operations.Ray Advertising is headquartered in Redding, California, USA, and operates with distributed teams supporting U.S.-based business functions.Position SummaryWe are seeking a detail-oriented, tech-savvy Virtual Assistant to support our management team in daily operations. This role is ideal for a highly organized, proactive professional who thrives in a fast-paced, remote work environment.You will manage schedules, coordinate communications, conduct research, and streamline workflows to ensure smooth operations. This role plays a critical part in enabling senior leaders to focus on high-impact decisions while maintaining efficient daily operations and strategic execution.Primary focus: executive support, research assistance, and task coordination.Other responsibilities are supportive in nature, not ownership roles.Key Responsibilities – Virtual AssistantResearch & Market IntelligenceConduct in-depth research on platforms, competitors, advertisers, and industry trendsAnalyze market developments and prepare concise insights and reports for managementIdentify potential business opportunities, partnerships, and growth areasExecutive SupportAssist senior management with daily operational and administrative tasks, including scheduling meetings, supporting email campaigns, and coordinating internal communicationsPrepare reports, summaries, and presentations based on research and dataHandle ad-hoc research and administrative requests to save executive timeData Management & ReportingMaintain, update, and organize data in spreadsheets, CRMs, and project management tools (Monday.com, HubSpot, ClickUp, Trello, etc.)Track and summarize key performance metrics for internal teams and campaignsPrepare accurate dashboards, reports, and summaries for management reviewSocial Media & Content SupportAssist in managing social media accounts by scheduling posts, monitoring performance, and supporting campaignsCreate and edit AI-assisted content drafts (blog snippets, captions, summaries) under management guidanceSupport email marketing and outreach initiatives to potential clients or partnersWorkflow & Task CoordinationSupport Project Managers by coordinating tasks and workflows with internal teamsMonitor task progress, deadlines, and deliverables to maintain operational consistencyAssist in cross-team communication to reduce bottlenecks and improve productivityEvent & Vendor ResearchResearch industry events, expos, conferences, and job fairs; provide recommendationsIdentify and evaluate vendors or service providers; maintain organized recordsTrack competitor activities and campaigns for benchmarking and strategic planningCompliance & DocumentationAssist with company paperwork, proposals, contracts, and filing while ensuring accuracyVerify partner and vendor compliance with company and client requirementsMaintain confidentiality and adhere to data security and company guidelinesOrganize and maintain structured digital documentation and filesProfessional CommunicationManage daily communications, including emails, follow-ups, internal messages, and client interactionsEnsure timely responses and maintain a high standard of professionalismSupport management in outreach efforts, email campaigns, and response trackingRequired QualificationsProven experience as an Executive Assistant, Virtual Assistant, or similar administrative/research roleStrong research and analytical skills with the ability to synthesize information clearlyComfort working with spreadsheets, CRMs, and project management tools (e.g., HubSpot, Monday.com, ClickUp, Trello)Excellent written and verbal English communication skills with strong attention to detailAbility to manage multiple priorities in a fast-paced environmentStrong organizational and documentation management skillsHigh professionalism and discretion when handling confidential informationTech-savvy; comfortable with Google Workspace, Calendly, Google Meet, and productivity toolsPreferred Qualifications (Good to Have)Experience creating or editing AI-assisted contentPrevious experience supporting senior executives in a remote environmentFamiliarity with social media scheduling, email marketing, or basic performance trackingKnowledge of compliance, vendor management, or contract handlingUnderstanding of market research and competitor analysisExposure to outreach, lead generation, or basic CRM workflowsSkills & Competen",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371904313/",
    "job_id": "4371904313",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive, Sales Admin - For Esquire Group - Job ID : 1459296",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Esquire Group is looking for Executive, Sales AdminJob Description / Responsibility Handle day-to-day sales administration activities, including order processing, coordination, and documentation.Maintain accurate sales records, customer databases, and documentation.Coordinate with sales executives, accounts, and logistics teams.Prepare and generate MIS reports from ERP software as required by management.Prepare daily, weekly, and monthly sales reports as per requirement.Handle field force sales team, customer inquiries and provide basic product information.Support sales promotions and marketing activities.Assist in forecasting and tracking sales performance.Ensure accuracy, timeliness, and proper filing of all sales-related documents and reports.Educational RequirementsBachelor of Business Administration (BBA)Master of Business Management (MBM)Experience Requirements1 to 3 year(s)The applicants should have experience in the following business area(s): Garments,Electronic Equipment/Home Appliances,Group of Companies,Plastic/ Polymer Industry,Garments Accessories,Paint,Shop/ShowroomAdditional RequirementsPrevious experience in sales administration or office administration (preferred).Good communication skills (written and verbal).Proficiency in MS Word, Excel, and email communication.Strong organisational and time-management skills.Ability to work under pressure and meet deadlines.Attention to detail and accuracy.Job LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371905273/",
    "job_id": "4371905273",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Front Desk Executive - For Chuti Cox's Bazar Limited - Job ID : 1458688",
    "location": "Banani, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Chuti Cox's Bazar Limited is looking for Front Desk ExecutiveJob Description / ResponsibilityGreet and receive guests, clients, and visitors in a professional manner.Manage incoming phone calls, emails, and inquiries; direct them to appropriate departments.Maintain visitor records and ensure smooth front-desk operations.Schedule appointments, meetings, and conference room bookings.Schedule and coordinate meetings, prepare meeting agendas, and circulate schedules to concerned parties.Take accurate meeting minutes and share them promptly with relevant stakeholders.Handle incoming and outgoing mail, courier, and documents efficiently.Assist in administrative tasks such as maintaining files, data entry, and preparing reports.Ensure the reception area is clean, organized, and presentable at all times.Support HR/Admin team in day-to-day office coordination when required.Educational RequirementsBachelor/HonorsBachelor/HonorsSkills Required: Organized and Disciplined, Work Under PressureExperience RequirementsAt most 2 year(s)The applicants should have experience in the following business area(s): HotelFreshers are also encouraged to apply.Job LocationDhaka (Banani)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373287713/",
    "job_id": "4373287713",
    "source": "linkedin",
    "company_name": "Braxtone Group",
    "job_title": "Senior Underwriter/ Data Analyst ( Bahrain Based)",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "The Senior Underwriter/data analyst plays a crucial role in supporting overall performance, efficiency, analyzing data results, evaluate and underwrite insurance risks in accordance with company policies and profitability targets while leveraging data analytics to monitor portfolio performance, detect trends, and support strategic decision-making.This position bridges technical underwriting with data-driven insight, ensuring sound risk selection, loss ratio improvement, and operational efficiency.Duties And ResponsibilitiesA. Underwriting & Risk EvaluationAssess and underwrite individual and fleet policies in line with Braxtone and insurer guidelines.Analyze policy applications, vehicle data, and client profiles to determine appropriate pricing and coverage terms.Ensure underwriting decisions maintain compliance with company risk appetite and reinsurance requirements.Review loss experience, claims frequency, and trends to adjust underwriting criteria or premiums.Collaborate with brokers and insurance partners to clarify underwriting conditions or exclusions.Recommend risk mitigation actions and re-underwriting for loss-making portfolios.B. Data Analysis & ReportingCollect, clean, and analyze data from claims, underwriting, and operations systems.Identify patterns affecting loss ratio, frequency of service, and claim cost by segment or partner.Develop dashboards and reports showing key performance indicators (KPI), including:Loss ratio by product and insurerAverage cost per service or claimPolicy utilization ratesPortfolio growth by partnerSupport management in quarterly portfolio reviews and pricing model adjustments.Monitor Minimum Deposit (M&D) commitments and insurer performance against service volume targets.C. Process OptimizationRecommend automation and workflow improvements for underwriting and data tracking.Work with IT to improve data integration between CRM, claims, and finance systems.Establish quality checks for data accuracy and consistency across departments.D. Compliance & GovernanceEnsure adherence to underwriting authorities, company policies, and local regulatory standards.Maintain confidentiality of partner and client data.Prepare audit-ready documentation for internal and external reviews.Key Performance Indicators (KPIs)Portfolio Loss Ratio maintained below agreed benchmark.Accuracy of underwriting decisions (error rate Timely delivery of monthly underwriting and performance reports.Reduction in data discrepancies and reporting delays.Improvement in underwriting profitability through data insights.Educational, Skills, And ExperienceBachelor’s degree, in Actuarial studies, Business Administration, Statistics.5–8 years’ experience in underwriting (motor or general lines) with strong analytical exposure.Experience in insurance data analysis, pricing, or business intelligence.Excellent knowledge of insurance principles, risk assessment, and policy structures.Technical SkillsAdvanced Excel, Power BI, or Tableau for data visualization.Strong command of SQL or similar tools for data extraction (preferred).Familiarity with CRM and insurance management systems.Excellent reporting, presentation, and documentation skills.Personal Competencies Analytical thinker with high attention to detail.Strong communication and negotiation skills.Ability to balance commercial awareness with risk control.Organized, proactive, and capable of working under pressure.Collaborative and able to work cross-functionally with Operations, Finance, and IT.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371438599/",
    "job_id": "4371438599",
    "source": "linkedin",
    "company_name": "Nextcare",
    "job_title": "Senior Fraud Analyst",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Key Responsibilities/What You DoRepresent the Global Claims Risk Unit as a Fraud Management Subject Matter Expert(SME) for cross functional activities, Client Updates, New Business Solutions and AuditingAnalyze claims data to identify unusual patterns and potential fraud indicators.Support the Fraud Analysts throughout the Fraud Process (Identification, Investigation, Corrective Actions)Conduct thorough investigations into suspicious claims, including interviewing claimants and gathering relevant documentation.Utilize advanced analytics and fraud detection tools to enhance fraud detection capabilities.Perform detailed data analysis to uncover trends and anomalies indicative of fraudulent activities.Prepare comprehensive reports on findings, including actionable recommendations.Participate in cross-functional teams to develop and implement fraud prevention strategies.Ensure all fraud detection and investigation activities comply with internal policies, external regulations, and industry standards.Maintain accurate and detailed records of investigations and outcomes.Prepare and present fraud reports to senior management and stakeholders.Identify opportunities to enhance fraud detection and prevention processes.Stay current with industry trends, emerging threats, and new technologies in fraud prevention.Provide training and guidance to junior fraud analysts and other staff on fraud detection techniques and best practices.Mentor team members, fostering a culture of vigilance and proactive fraud prevention.Take part in other projects when required, review documentation and contribute where applicable, research information relating to your area and provide feedback.Other Ad hoc duties as requiredAI READINESS Work effectively in an environment shaped by artificial intelligence (AI), machine learning, data analytics and cloud-based tools, using insights responsibly with our standards of data governance, security and ethical useKey Requirements/What You BringBachelor’s degree in any Medical field, Finance, Business Administration, Insurance, or a related field preferred.At least 5 years’ experience in analysing and assessing medical claims of high values and complexitiesWith proven track record in Fraud mitigationStrong ability to communicate effectively with various audiences and all levels of the organisationProficiency in MS Office (in particular in Excel, Power BI, PowerPoint)Excellent level of written and verbal English is essential.High level of solution orientation & decision makingHave obtained or be working towards 1 or more of the following:Fraud (eg ACFEMedical QualificationData AnalyticsInternational Medical CodingLegally permitted to work in the country of operations.Hybrid working option available as per business requirements.How we hire Allianz Partners does not accept unsolicited CV’s or approaches from agencies. We only work with partners on our approved supplier list, under contract. Any unsolicited submission will not be considered.Key Benefits/What We OfferAllianz Partners is a world leader in B2B2C insurance and assistance, offering global solutions that span international health and life, travel insurance, automotive and assistance. Customer driven, our innovative experts are redefining insurance services by delivering future-ready, high-tech high-touch products and solutions that go beyond traditional insurance.Our products are embedded seamlessly into our partners’ businesses or sold directly to customers and are available through four commercial brands: Allianz Assistance, Allianz Automotive, Allianz Travel and Allianz Care. Present in 75 countries, our 21,100 employees speak 70 languages, handle over 71 million cases each year, and are motivated to go the extra mile to offer peace of mind to our customers around the world.We at Allianz believe in a strong inclusive culture that encourages people to speak their minds, get involved and question the status quo. We are proud to be an equal opportunity employer and encourage you to bring your whole self to work, no matter where you are from, what you look like, who you love, or what you believe in.We therefore welcome applications regardless of race, ethnicity or cultural background, age, gender, nationality, religion, social class, disability, sexual orientation, or any other characteristics protected under applicable local laws and regulations.At Allianz Partners, AI is revolutionizing customer service and claims management through innovative solutions. These AI-driven tools enhance productivity by streamlining complex claims processes, reducing administrative burdens, and accelerating resolution times. Our AI-powered technology has made claims processing faster, offering quicker resolutions. All while ensuring human oversight for claims to maintain service integrity. By embracing AI and Emerging Technologies, Allianz Partners continues to lead the industry, meeting ever-changing customer needs with innovative solutions. Our commitment to Ethi",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364236575/",
    "job_id": "4364236575",
    "source": "linkedin",
    "company_name": "Dicetek LLC",
    "job_title": "Business Analyst (SME) - Corporate Internet Banking",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionWe are seeking a highly skilled Business Analyst with a robust background in Corporate Internet Banking, coupled with hands-on experience in Group Transaction Banking, Trade Products, and Supply Chain Finance Products. The ideal candidate will have a profound understanding of Middle East banking practices and regulations, contributing to the enhancement and optimization of our corporate banking solutions.Responsibilities Conduct thorough analysis of corporate internet banking systems, focusing on Group Transaction Banking, Trade Products, and Supply Chain Finance Products. Collaborate with stakeholders to gather and document business requirements, ensuring alignment with Middle East banking standards and regulations. Leverage expertise in Middle East banking practices to provide valuable insights into industry trends and recommend innovative solutions in transaction banking and trade finance. Work closely with product teams to translate business requirements into functional specifications, ensuring seamless implementation of enhancements across various banking products. Conduct impact assessments and risk analysis, guiding decision-making processes related to corporate internet banking initiatives and associated financial products. Act as a liaison between business stakeholders, testing and technical teams, fostering effective communication and understanding of project goals across diverse banking products. Participate in testing and quality assurance processes to validate the functionality and performance of corporate internet banking systems and associated financial products. Provide training and support to end-users for successful adoption of new features in transaction banking, trade products, and supply chain finance.Qualifications Proven experience as a Business Analyst with a focus on Corporate Internet Banking, Group Transaction Banking, Trade Products, and Supply Chain Finance Products. In-depth knowledge of Middle East banking practices, regulations, and market trends across various financial products. Strong analytical skills with the ability to translate business needs into technical requirements for diverse banking products. Excellent communication and interpersonal skills to facilitate collaboration between business and technical teams. Familiarity with project management methodologies and tools. Ability to manage multiple priorities and thrive in a fast-paced, dynamic environment.Education And Experience Bachelor’s degree in business, Finance, or a related field. Minimum of 6 years of experience as a Business Analyst in Corporate Internet Banking, with specific exposure to Group Transaction Banking, Trade Products, and Supply Chain Finance. Previous experience working with Middle East banks is essential.If you are a strategic thinker with a comprehensive understanding of corporate internet banking and expertise in Group Transaction Banking, Trade Products, and Supply Chain Finance, we invite you to apply and contribute to the advancement of our innovative solutions in the banking sector.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4336000868/",
    "job_id": "4336000868",
    "source": "linkedin",
    "company_name": "American University of Bahrain (AUBH)",
    "job_title": "Executive Assistant to the President",
    "location": "Riffa, Southern Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "The Executive Assistant will provide executive level administrative support to the President's office anticipating and executing upon those needs. The role will require coordination among management team members and within the organization on behalf of the executive team to align current activities with priorities. S/he will obtain and transmit information to executive team from within the organization to assist in furthering priorities, as well as filter communications of executive team and prioritize communications for executive review.RequirementsDuties and ResponsibilitiesLiaison between leadership, executives, faculty, administrators, and staff with external entitiesBe the point of contact for various inquiries and resolving issues on behalf of the President. Manage incoming calls, correspondence, and emailsManage and maintain complex calendars, schedule, and arrange all associated details for meetings and eventsMake decisions based on working knowledge of the responsibilities and priorities of the PresidentCoordinate travel arrangements, develop various itineraries and process expense reimbursements and payments. Prepare and distribute various materials, compose correspondence for signature, proof correspondence and other material and maintain filling system. Oversee administrative support staff to ensure the efficient operation of the Presidents' officeWork flexible hours as per the requirements of the Presidents' officePerform other duties as reasonably required by management. Qualifications Bachelor's degree in a relevant field is required Graduate degree in a related field is desirable Professional certification in a related field is desirableExperience Required Minimum of five years of experience in a similar role or comparable experience in industry Experience in supporting senior level executives Experience in project coordination and executionSkills And Competencies RequiredStrong communication and relationship building skills with peers, leadership, and external constituents, including the business communityAbility to work independently and responsibly while managing numerous projects simultaneouslyExceptional attention to detail with the ability to handle sensitive, confidential, and challenging situations with tact and diplomacyExcellent Arabic and English skills",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368109337/",
    "job_id": "4368109337",
    "source": "linkedin",
    "company_name": "Napco National",
    "job_title": "GENERAL ACCOUNTING SENIOR ANALYST",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionBusiness Acumen Ability to use own understanding of NFP business environment and objectives with the ability to interpret and apply internal policies and procedures Advanced Communication Ability to communicate and deliver information in a business context both verbally and in writing in a clear, concise, and comprehensive manner Advanced Data Analysis & Reporting Ability to monitor, collect and interpret a range of raw data from various sources, evaluate/analyze results and create reports to assist decision-making process in various aspects of work at NFP Advanced Language Knowledge of, and the ability to use National and Foreign languages both spoken and written Advanced Planning & Organizing Ability to organize and plan work/project activities to efficiently accomplish tasks and meet short & long term objectives Advanced Technological Ability Ability to understand and effectively use standard equipment and office automation systems and software Knowledge in related accounting software and ERP Advanced Problem Solving Gathers and analyzes data and effectively respond to new, complex or problematic situations; creates solutions that drive value for NFP and its customers, incorporating innovative approaches where relevant Advanced.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354262664/",
    "job_id": "4354262664",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Travel Operations Specialist",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.The company is founder-led, profitable, and growing.We are hiring Travel Operations Specialists to join our Business Services team, ensuring smooth travel for colleagues and guests from countries all around the world to our company meetings and industry events. Our team set travel policy, support travel decisions, respond to travel emergencies and are responsible for supplier relationships.We look for positive team players who are self-driven and results oriented, with excellent attention to detail. The best candidates show that they are forward planners, reliable and determined, and keen to assume responsibility for projects, processes and policy. We are a unique global business, so we are not looking for candidates with extensive experience so much as excellent organisers and communicators who are keen to develop skills and strive for continuous improvement.Location: Worldwide - home based, except in locations where we have an office, such as London, Taipei and Beijing.ResponsibilitiesEngage with colleagues to address travel queries and issuesWork with the wider business services team on company and industry event plansHold travel vendors accountable for providing excellent serviceCheck invoices to ensure accurate charges and timely payments, credits and refunds for travelMonitor trends, spend, emissions and compliance with company policyTrack unused tickets, credits and airline points usageWhat we are looking forExcellent academic results at school and universityA degree in a business or technical subjectExcellent communication skillsResponsible and accountableSelf-awareness and thoughtfulnessAbility to travel up to four times a year for company events of up to two weeks durationAbility to learn new technology and software quicklyWhat we offer youWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.Distributed work environment with twice-yearly team sprints in personPersonal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveEmployee Assistance ProgrammeOpportunity to travel to new locations to meet colleaguesPriority Pass, and travel upgrades for long haul company eventsAbout CanonicalCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.Canonical is an equal opportunity employerWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341339590/",
    "job_id": "4341339590",
    "source": "linkedin",
    "company_name": "Amana Healthcare",
    "job_title": "Senior Clinical Application Analyst",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "OverviewM42 delivers comprehensive healthcare services across the full continuum of care; from primary care to advanced specialty treatments. Leveraging cutting-edge health technologies and precision medicine, we ensure the highest standards of effectiveness, efficiency, and patient-centered outcomes. With a global presence spanning more than 480 facilities in 27 countries and a dedicated workforce of over 20,000 professionals, M42 is uniquely positioned to redefine the future of healthcare on a global scale.Amana Healthcare is a leading long-term care and rehabilitation provider in the Middle East and GCC, and the region’s pioneer in post-acute care services. It offers comprehensive long-term care, post-acute rehabilitation, transitional care, and home healthcare. As part of the M42 network, Amana is dedicated to delivering high-quality, patient-centered care tailored to the needs of individuals requiring complex or extended recovery support.The Clinical Analyst acts as a vital bridge between clinical and business operations at Amana Healthcare, ensuring that Hospital Information Systems such as Oracle Cerner and Fusion operate seamlessly to support workflows, enhance patient safety, and drive business growth. This role focuses on innovative system implementation, configuration, and testing, while maintaining data integrity and fostering continuous improvement. It also involves providing ongoing staff training and collaborating closely with clinical and IT teams to optimize Cerner electronic health record applications so they meet organizational needs and elevate patient care delivery.ResponsibilitiesConfigure and implement Cerner EHR applications tailored to clinical workflows; build, test, and deploy modules (CPOE, PharmNet, Supply Chain, Registration & Scheduling) and enhancements.Conduct system testing and validation to ensure accuracy and performance.Provide advanced end-user support; analyze and resolve complex system issues promptly.Maintain system documentation and update configuration records.Collaborate with healthcare providers and IT teams to optimize functionality and identify workflow improvements.Support Cerner-related projects and upgrades as a technical resource.Develop and deliver training sessions for clinical staff.Create user guides and support materials for Cerner applications.QualificationsBachelor’s degree in Healthcare, Information Technology, or related field; Cerner certification preferred.Proven experience with Cerner Millennium (PowerChart, PharmNet, Supply Chain) or other Cerner EHR systems; strong analytical, problem-solving, and communication skills.Expertise in Cerner Millennium EHR configuration and support, including build and configuration for CPOE, PharmNet, Supply Chain, Registration & Scheduling; knowledge of solution integration and clinical workflow optimization.Understanding of BMDI and Radiology (optional); proficiency in data integrity and system troubleshooting.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323394684/",
    "job_id": "4323394684",
    "source": "linkedin",
    "company_name": "Bapco Energies",
    "job_title": "Secretary To Board Secretary",
    "location": "Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionJob Purpose: Provide high-level administrative and organizational support to the Board Secretariat Division, ensuring smooth execution of board secretarial functions. The role involves assisting with preparation and coordination of Board and Committee meetings, maintaining accurate records, supporting compliance with governance standards, and leveraging technology tools (e.g., Diligent board management system) to enhance efficiency. Discretion, attention to detail, and confidentiality are essential.Key ResponsibilitiesManage and organize the Group Board Calendar and schedule all Board and Committee meetings. Coordinate agendas, meeting notifications, and distribution of materials. Handle logistical arrangements, venue booking, and travel for Board members. Ensure timely preparation and circulation of documentation for meetings.Maintain accurate records of Board and Committee meetings and decisions.Assist in developing and maintaining annual Board calendars and work plans. Manage remuneration and fee payments for Board members. Provide administrative support to independent and executive directors. Support induction programs for new Board members and organize training sessions. Arrange educational training sessions for Board and Committee members. Assist in organizing annual evaluations of the Board and its Committees.Qualifications & ExperienceDiploma or Bachelor’s degree in Business Administration or related field.15+ years of administrative or secretarial experience, preferably in corporate/legal settings.Familiarity with corporate governance principles and board secretarial functions.Strong organizational and time management skills.Excellent communication and interpersonal skills.Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).Ability to handle confidential information with discretion.Proactive and detail-oriented with a strong sense of responsibilityAbout UsBapco Energies operates a portfolio spanning the entire energy value chain in the Kingdom of Bahrain. The portfolio includes wholly-owned subsidiaries and specialized operating companies. Together, these companies drive Bapco Energies' mission to power the next generation.About The TeamThe integrated Company leading the energy transition in the Kingdom of Bahrain, powering the next generation.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371830408/",
    "job_id": "4371830408",
    "source": "linkedin",
    "company_name": "American University of Bahrain (AUBH)",
    "job_title": "Academic Administrative Assistant",
    "location": "Riffa, Southern Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345445948/",
    "job_id": "4345445948",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Senior Communications Manager - Analyst Relations",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Be the voice of CanonicalWe're on the lookout for an energetic and creative Senior Communications Manager with experience in analyst relations (AR) to join our communications team. The ideal person for this role will drive communications strategy through the analyst relations channel in order to increase Canonical's visibility among industry influencers and shape market perception.Canonical serves a diverse customer base, ranging from end users to startups, large enterprises and governments. Our portfolio is broad in scope and in reach. The ideal candidate is passionate about technology, curious about shaping the evolving AR field, and relishes the challenge of communicating a diverse product range based around trusted open source.The AR field is becoming increasingly data-driven. Market research is also changing as a discipline thanks to AI models. As the voice of Canonical towards analysts and industry influencers, you will define and implement a strategy for data-driven engagement across portfolio areas, building on key narratives, developing new ones, and establishing relationships to advance our position across markets.This role will involve close partnership with the Product Management function within the company, as well as the Alliances, Sales and Marketing teams, to communicate key product news and announcements and manage perception of Canonical and its range of products among analysts. You will have the opportunity to shape the AR field in the company and help our organization stay ahead of the curve using technologies like AI to conduct market research and assess market perception, delivering insights to the business.This is a senior position and sits in the communications team reporting to the Director of Communications.Location: This role will be based remotely in the EMEA region.What your day will look likePrepare and execute analyst-focused communications plans for product announcements, new partnerships and other initiatives in line with our go-to-market strategyProactively look for ways to use new technologies like AI to analyze market trends and assess analyst perception and sentiment of Canonical and its products Understand GenAI platforms developed by analyst firms and ensure they contain the right information about Canonical's portfolioCraft and deliver compelling narratives about Canonical and its products in line with our company visionManage analyst relationships directly, coordinating touchpoints throughout the year both through online briefings and industry eventsMeasure the impact of the AR program, reporting regularly on progress to leadership, implementing the necessary tooling to improve collaboration and managing spendProactively position the company in key analyst reports to drive recommendations and strengthen the company's brandSupport the Director of Communications on Corporate Communications initiativesWhat we are looking for in youExtensive experience in market research, AR or communicationsExperience managing technology communications (agency or in-house) or AR programsA track record of delivering innovative and successful communications campaigns in the technology space, and enhancing company positioning through AR programsExperience of cloud/SaaS/open source technology an advantageAn analytical eye and a good sense for the type of content that resonates best with analysts and other industry influencersExceptional interpersonal skills and aptitude for forging trusting relationships across diverse, cross-functional teamsExcellent verbal and written communication skillsProven ability to prioritize and differentiate what matters from the noise, meeting deadlines without sacrificing qualityAffinity for planning is a must, experience with project management tools like Jira is an advantageBackground in product management or product marketing is a plus but not requiredWillingness to travel up to 4 times a year for internal eventsWhat we offer youYour base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, please ask your Talent Partner.🏠Fully remote working environment - we've been working remotely since 2004!📚Personal learning and development budget of 2,000USD per annum💰Annual compensation review🏆Recognition rewards🏝 Annual holiday leave👶Parental Leave🧑‍💼Employee Assistance Programme🧳Opportunity to travel to new locations to meet colleagues at 'sprints'✈️Priority Pass for travel and travel upgrades for long hau",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364567962/",
    "job_id": "4364567962",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "SENIOR EXECUTIVE- FINANCE - For Trimco (Bangladesh) Co Ltd - Job ID: 1459590",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Trimco (Bangladesh) Co Ltd is looking for SENIOR EXECUTIVE - FINANCEJob Description / ResponsibilityCash & Bank Management:Prepare and arrange cash and bank payments to suppliers.Ensure timely collection of AIT certificates from the bank after monthly processing.Accounting & Bookkeeping:Record daily bank receipt vouchers accurately.Make journal entries in the SEGE 300 system & Microsoft Dynamics AX 12.Verify supplier bills and invoices for correctness and compliance.Financial Reporting:Prepare various financial reports as advised by senior management.Reconcile intercompany balances with General Ledger (GL).Tax & Statutory Compliance:Calculate VDS (Value Deduction at Source) and TDS (Tax Deduction at Source) from supplier bills.Support statutory and internal audits by providing schedules, explanations, and required documentation.General Support:Assist senior finance executives with ad hoc financial analysis, reporting, and other tasks as needed.Educational RequirementsSkills Required: Accounting Software, Microsoft ExcelExperience Requirements4 to 5 year(s)The applicants should have experience in the following business area(s): Garments, Packaging Industry, Garments AccessoriesAdditional RequirementsStrong knowledge of accounting principles, bank transactions, and statutory compliance.Attention to detail and ability to meet deadlines.Job LocationDhakaSalaryTk. 30000 - 35000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356111328/",
    "job_id": "4356111328",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant General Manager - For Industrial Equip Sol Ltd. - Job ID: 1454054",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Industrial Equip Sol Ltd. is looking for Assistant General ManagerJob Description / ResponsibilityAssistant General Manager (Sales & Marketing) for a cleaning machine distributor company drives overall growth by setting sales strategies, managing teams, identifying new markets (industrial, commercial), overseeing product launches, controlling budgets, and ensuring customer satisfaction, bridging high-level operations with direct revenue generation for the specialized cleaning sector. Role Summary:This leadership role is responsible for achieving aggressive revenue targets, expanding market share in industrial, commercial, and specialized cleaning sectors, and spearheading strategic growth for our innovative cleaning machine product portfolio, ensuring alignment with overall company vision and operational excellence.Responsibilities:Sales & Strategy:Develop and implement comprehensive sales and marketing strategies to meet and exceed sales targets for cleaning equipment and solutions.Identify, target, and secure new business opportunities, key account, and strategic partnerships (e.g., Facility management, healthcare, industrial clients).Analyze market trends, competitor activities, and customer needs to inform product development and sales approaches.Oversee the entire sales pipeline, from lead generation to contract negotiation and closing dealsMarketing & Brand:Lead the creation and execution of integrated marketing campaigns (digital, trade shows, content) to build brand awareness and generate qualified leads.Drive product category strategy, including new product introductions (NPIs) and lifecycle management for cleaning machines and related consumables.Manage budgets for sales & marketing activities, ensuring optimal ROI.Leadership & Operations:Build, mentor, and motivate high-performing sales and marketing teams, setting clear KPIs and providing regular feedback.Collaborate cross-functionally with Operations, Product Development, and Finance to ensure seamless execution and profitability.Oversee operational aspects related to sales delivery, including demonstrations, training, and after-sales support, ensuring service level agreements (SLAs) are met.Report on key performance indicators (KPIs),sales forecasts, and market insights to executive leadership.Educational RequirementsBachelor of Business Administration (BBA) in MarketingBachelor’s degree in Business or Marketing is required; an MBA is strongly preferred for 2026 leadership roles.Experience Requirements10 to 15 year(s)The applicants should have experience in the following business area(s): Indenting FirmAdditional RequirementsProven track record in B2B sales leadership, preferably in capital equipment, industrial, or cleaning technology sectors.Typically, 10-15 years of experience in sales and marketing, with at least 5 years in a senior leadership position within industrial machinery or service-oriented sectors.Strong understanding of modern cleaning technologies, hygiene standards, and market dynamics.Exceptional communication, negotiation, and presentation skills.Strategic thinker with strong analytical and financial acumen.Experience managing budgets and P&L for sales/marketing functions.Job LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363289352/",
    "job_id": "4363289352",
    "source": "linkedin",
    "company_name": "Calo Inc.",
    "job_title": "Finance Business Partner",
    "location": "Seef, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About Calo (more Here)Calo is an app providing personalized meal plans for busy people through nutritional algorithms, built with love by chefs, nutritionists, and software engineers.Launched in Bahrain in 2019, we have since expanded to 7 countries, delivered millions of meals to our customers, and are now expanding our mission of making healthy easy to retail and other verticals.We're on a noble mission to make healthy easy. We think this is one of the most important problems to tackle in our world today. We have global ambitions - no small thinking here.Why This Role MattersWe are looking for a Finance Business Partner to provide accurate and data-based information on the company’s financial and non-financial performance. You will research and analyze financial information to help Calo make well-informed decisions, write reports and monitor financial movements.What You’ll DoConduct in-depth analysis of business performance, including revenue streams, cost structures, and market trends to support strategic initiatives.Perform business analysis to deliver actionable insights that assist the team in achieving the company's goals and vision.Collaborate closely with product, operations, and marketing teams to evaluate new initiatives, assess their financial impact, and provide recommendations.Collaborate with various departments to evaluate business opportunities, assess financial implications, and develop strategic initiatives.Identify opportunities to streamline financial processes and enhance reporting accuracy, efficiency, and effectiveness.Analyze industry trends and competitor performance to inform strategic planning and identify growth opportunities.Develop and present comprehensive financial reports to senior leadership, highlighting key metrics, financial results, variance vs. budget reporting and actionable insights.Monitor budget adherence, identify opportunities for financial performance improvement across the organization and areas for cost optimization.Spearhead the annual and quarterly budgeting and forecasting processes.Develop financial models that help with decision-making, support planning, and analysis.Perform financial forecasting, reporting, and operational metrics tracking.Increase productivity by developing automated reporting/forecasting tools.Maintain a strong financial analysis foundation by creating forecasts and models.Support in ad-hoc financial and non-financial reporting & analysis.What We’re Looking ForBachelor's degree in Finance, Accounting, or related field; CFA or CMA a plus.3-5 years of business finance or other relevant experience, financial planning & analysis, management accounting, or other related fields.Strong working knowledge of Excel/Google Sheets and financial modeling.Excellent analytical, decision-making, and problem-solving skillsAttention to accuracy and detail required.High proficiency in financial modeling techniques.Excellent communication and presentation skills; be comfortable interacting with executive-level management and shareholders.The Hiring JourneyScreening1st Technical Interview2nd Technical InterviewCulture Fit InterviewOffer stageReady to Join?If this role excites you, and you see yourself matching at least 85% of the criteria above, what are you waiting for? Yalla, let’s gooo! 🚀",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4144377940/",
    "job_id": "4144377940",
    "source": "linkedin",
    "company_name": "ila Bank",
    "job_title": "Fresh Graduate Opportunities",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Are you a fresh graduate looking to start your career in Banking? ila Bank is the right place for you.We are constantly looking to recruit young talent in various roles throughout the year and we have dedicated a slot on our careers page for candidates like you!If you are interested in joining the leading mobile-only, digital bank, please apply here and we will be in touch when an opportunity arises.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368171400/",
    "job_id": "4368171400",
    "source": "linkedin",
    "company_name": "Zain Bahrain",
    "job_title": "ZAIN2138 - Deputy MLRO",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About The RoleThis role will be part of Zain Bahrain's Subsidiary Fintech Company - \"Bede\"Bede, the fintech arm of Zain Bahrain, is a dynamic startup revolutionizing personal finance through Bahrain’s first Shariah-compliant Islamic financing app. Licensed and regulated by the Central Bank of Bahrain, Bede is committed to creating an inclusive platform that offers practical solutions tailored to real customer needs.With a focus on customer centricity, strategic partnerships, and digital innovation, Bede aims to guide individuals toward growth and success by leveling the playing field for all.The DMLRO (Deputy Money Laundering Reporting Officer) acts as an alternate in the MLRO’s absence, subject to CBB requirements, and is responsible for assisting in overseeing the implementation and management of the organization’s anti-money laundering (AML) program. The DMLRO develops and implements AML policies and procedures, monitors transactions for suspicious activity, provides training to staff, conducts internal audits, and maintains relationships with law enforcement agencies and regulatory bodies.What We Need From You Act as the designated alternate to the MLRO during absence or unavailability. Support the MLRO in suspicious transaction analysis and escalation. Ensure continuity of AML/CTF oversight at all times. Assist in preparation and submission of Suspicious Transaction Reports (STRs) to the Financial Intelligence Directorate (FID), where delegated. Ensure compliance with AML regulations and industry best practices. Minimize the risk of money laundering and terrorist financing within the organization. Provide support to other departments in their efforts to integrate AML controls into their processes. Develop and implement AML policies and procedures. Oversee the organization's AML risk assessment process and update it regularly. Clarify name screening alerts and conduct transaction for suspicious activity and escalate any potential money laundering cases to the relevant authorities. Assist the MLRO in reviewing and preparing STRs/SARs for submission to the Bahrain Financial Intelligence Directorate (FID). Maintain confidentiality and independence in all STR-related matters. Support regulatory examinations, inspections, and information requests from the CBB and other competent authorities. Support the MLRO in designing and delivering mandatory AML/CTF training programs, including onboarding and annual refresher training. Track completion and effectiveness of training in line with CBB expectations. Conduct internal audits to ensure compliance with AML regulations. Keep abreast of changes in AML laws and regulations and update the organization's policies and procedures accordingly. Build and maintain relationships with law enforcement agencies and regulatory bodies. Collaborate with other departments to integrate AML controls into their processes. Support AML aspects of Shariah audits and reviews, where required. Perform other required tasks as per department needs.Qualification and ExperienceMinimum 3–5 years of relevant AML/CTF experience within a regulated financial institution, fintech, or Islamic financial services firm. With demonstrated familiarity with CBB regulations, including the Financial Crime (FC) Module.Bachelors degree in law, business, or a relevant field. AML certifications (CAMS, ICA, or equivalent) is required.Minimum 3+ years of relevant AML/CTF experience within a regulated financial institution, fintech, or Islamic financial services firm. With demonstrated familiarity with CBB regulations, including the Financial Crime (FC) Module.Skills and Knowledge Staying up to date with all CBB laws, rules & regulations Understanding of issues and risks associated with financial services and ability to define mitigation plan Self-starter with the ability to define clear objectives relating to compliance and regulatory challenges Ability to resolve interpersonal conflict and miscommunications Excellent written and verbal communication skills with ability to simplify complex issues and influence their audience Excellent analytical abilities with good business judgmentEqual Employment Opportunity StatementWe are an equal opportunity employer and welcome applications from individuals of all backgrounds, including persons with disabilities and those who may require reasonable accommodations to perform their duties. We are committed to maintaining an inclusive workplace and to ensuring that all employees are supported to succeed.About Application ProcessIf you meet the criteria and you are enthusiastic about the role, we would welcome your application. To complete the application you would need the following document(s):Resume/CVPassport-size photographHighest Education Qualification",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368163182/",
    "job_id": "4368163182",
    "source": "linkedin",
    "company_name": "Jobs via eFinancialCareers",
    "job_title": "Fresh Graduate Opportunities - Arab Banking Corporation",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Are you a fresh graduate looking to start your career in Banking? Bank ABC is the right place for you.We are constantly looking to recruit young talent in various roles throughout the year and we have dedicated a slot on our careers page for candidates like you!If you are interested in joining, please apply here and we will be in touch when an opportunity arises.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365791099/",
    "job_id": "4365791099",
    "source": "linkedin",
    "company_name": "Zain Bahrain",
    "job_title": "ZAIN2137 - Merchant & Corporate Engagement Officer",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About The RoleThis role will be part of Zain Bahrain's Subsidiary Fintech Company - \"Bede\"Bede, the fintech arm of Zain Bahrain, is a dynamic startup revolutionizing personal finance through Bahrain’s first Shariah-compliant Islamic financing app. Licensed and regulated by the Central Bank of Bahrain, Bede is committed to creating an inclusive platform that offers practical solutions tailored to real customer needs.With a focus on customer centricity, strategic partnerships, and digital innovation, Bede aims to guide individuals toward growth and success by leveling the playing field for all.This position contributes to the growth of Bede’s merchant‑led micro‑financing model through the onboarding, activation, and ongoing management of merchants and service providers across assigned sectors. The role focuses on enabling customers to finance purchases through Bede by paying merchants and service providers directly, positioning Bede as a preferred payment and financing option at the point of sale. Performance in this role will be measured by the sales results and financing volumes driven through merchant channels.In addition, the role will collaborate closely with the Marketing & Communications (MARCOM) team to design and execute targeted marketing, advertising, and social media initiatives that support merchant acquisition and financing uptake. Also, leading and managing roadshows and on-site engagements with medium and large employers to promote Bede’s financing solutions directly to employees, generating financing opportunities through both merchant-based and direct micro-financing products.What We Need From YouMerchant & Service Provider Acquisition Identify, approach, and onboard merchants and service providers across assigned and new verticals, including educational, medical, retail entities, furniture, and other approved sectors.Ensure merchants and service providers are fully enrolled, contractually compliant, and activated on the Bede platform.Strengthen Bede’s presence as a preferred point-of-sale financing and payment option for merchants and service providers.Expand merchant coverage to ensure a diverse and competitive offering within each vertical. Vertical Growth & Management Support the development and expansion of new financing verticals in line with Bede’s strategic roadmap.Ensure each vertical contains a sufficient number and variety of active merchants and service providers. Marketing & Campaign Collaboration Work closely with the MARCOM team to design and execute merchant-focused marketing initiatives.Support the development of advertising, social media, and sponsored campaigns aimed at driving financing adoption through merchants and service providers.Coordinate merchant participation in promotions, offers, and awareness campaigns to maximize financing uptake. Employer Roadshows & Corporate EngagementPlan, organize, and execute roadshows and on‑site visits to SME employers. Promote Bede’s micro-financing and merchant-based financing solutions directly to employees.Coordinate with employers and internal teams to maximize employee engagement and financing conversions during roadshows. Stakeholder Relationship Management Maintain strong working relationships with merchants, service providers, employers, and internal stakeholders.Act as the primary point of contact for merchant-related growth initiatives. Address merchant inquiries, resolve issues, and ensure a positive partner experience.Compliance & Governance Support Ensure all merchant and employer engagements comply with Bede’s policies, procedures, and regulatory requirements.Support documentation, record-keeping, and reporting requirements related to merchant onboarding and financing activities.Perform any other related tasks as required.Qualification and ExperienceBachelor’s degree or diploma in Business Administration, Marketing, Finance or a related field.Relevant professional certifications in sales, marketing, or financial services are an advantage but not mandatory.1-3 years of hands-on experience in business development, sales, merchant acquisition, partnerships, or field sales.Skills and KnowledgeStrong sales, negotiation, presentation and relationship management skills.Good analytical skills to monitor merchant performance and financing activity.Strong planning and organizational skills, with the ability to manage multiple merchants and engagements simultaneously.Equal Employment Opportunity StatementWe are an equal opportunity employer and welcome applications from individuals of all backgrounds, including persons with disabilities and those who may require reasonable accommodations to perform their duties. We are committed to maintaining an inclusive workplace and to ensuring that all employees are supported to succeed.About Application ProcessIf you meet the criteria and you are enthusiastic about the role, we would welcome your application. To complete the application you would need the following document(s):Resume/CVPassp",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322691063/",
    "job_id": "4322691063",
    "source": "linkedin",
    "company_name": "Binance",
    "job_title": "Operations Specialist (BPay)",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Binance is a leading global blockchain ecosystem behind the world’s largest cryptocurrency exchange by trading volume and registered users. We are trusted by 300+ million people in 100+ countries for our industry-leading security, user fund transparency, trading engine speed, deep liquidity, and an unmatched portfolio of digital-asset products. Binance offerings range from trading and finance to education, research, payments, institutional services, Web3 features, and more. We leverage the power of digital assets and blockchain to build an inclusive financial ecosystem to advance the freedom of money and improve financial access for people around the world.What is BPay? BPay is a fiat money wallet built to support Binance's cryptocurrency business. BPay is designed as a fiat wallet to allow customers to hold and store their own funds. This would enable customers to open a wallet for purchasing cryptocurrencies on the Binance platform through verified, matching named accounts.ResponsibilitiesBusiness Process Management: Work with process owners to develop Standard Operating Procedures (SOP), adhering to the standard / framework agreed within the operating office and operational risk team.Evaluate existing business processes and outline business process improvement/optimisation opportunities.Monitor and perform ongoing analysis on business processes related to productivity, quality and costs. Present process performance tracking reports and integrate feedback.Project Management: Identify delivery gaps, recommend process opportunities and drive internal projects to optimise delivery outcomes.Coordinate business process improvement strategies with internal stakeholders.Oversee all aspects related to the implementation stages of business process improvement initiatives.Collaborate both internal and external teams to achieve operation scaling up.Manage communication with 3rd party partners (solve customer issues, follow up on delays and pending items).Play a key role between BPay departments and outsourced departments (Customer Service, KYC/KYB central teams, etc.).Requirements1-3 years and above experience with a Bachelor's degree in a business-oriented field, or equivalent practical experience.Preferable with internal or external consulting background.Hands-on experience of operational or business process management work experience, preferably in a financial services organisation.Strong coordination skills and strategic mindset for internal cross team collaboration.Proven experience in stakeholder management.Ability to identify and solve complex problems.Why Binance Shape the future with the world’s leading blockchain ecosystem Collaborate with world-class talent in a user-centric global organization with a flat structure Tackle unique, fast-paced projects with autonomy in an innovative environment Thrive in a results-driven workplace with opportunities for career growth and continuous learning Competitive salary and company benefits Work-from-home arrangement (the arrangement may vary depending on the work nature of the business team)Binance is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success.By submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice .We may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364576171/",
    "job_id": "4364576171",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Executive - Internal Audit",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company Name: AKIJ Bashir GroupLocation: DhakaJob Type: Full-TimeWorkplace Type: Full-timeJob ID: IJOB202614354Conduct Comprehensive Audits: Perform detailed process, functional, and compliance audits across Strategic Business Units (SBUs) to evaluate the effectiveness of internal controls and operational efficiency.Review Financial Transactions: Conduct pre- and post-audit reviews of payments, party bills, internal bills, vouchers, and expense claims to ensure accuracy, policy compliance, and detect errors or potential fraud.Market Visits and Verifications: Carry out market visits and physical verifications to confirm compliance with AkijBashir Group policies and procedures.Vendor and Market Analysis: Review vendor quotations and market rates to ensure fairness, transparency, and cost-effectiveness in procurement processes.Identify and Address Gaps: Identify process gaps, control weaknesses, and non-compliance issues, and recommend practical corrective and preventive actions.Prepare Audit Reports: Prepare structured internal audit reports highlighting observations, risks, root causes, and actionable recommendations.Follow-up and Coordination: Follow up on audit observations and coordinate with concerned departments to ensure timely implementation and closure of audit issues.Maintain Professional Ethics: Maintain confidentiality, objectivity, and professional ethics while performing all audit activities.Requirements Experience: 2-5 years Education: bachelor of business administration in accounting Skills: internal audit, it audit, audits, internal auditing, it auditing, quality audits, internal audits, audit procedures, auditing Last Date of Application: 24 February 2026",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357479393/",
    "job_id": "4357479393",
    "source": "linkedin",
    "company_name": "cander",
    "job_title": "Treasury Domain Expert",
    "location": "Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365275127/",
    "job_id": "4365275127",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Senior | Internal Audit | Bahrain",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About Deloitte: When you work for us, you commit to a career at one of the largest and most prestigious professional services firms in the world. We have received numerous awards over the last few years, including Best Employer in the Middle East, and Best Consulting Firm, and the Middle East Training & Development Excellence Award.Our PurposeDeloitte makes an impact that matters. Every day we challenge ourselves to do what matters most—for clients, for our people, and for society. We serve clients distinctively, bringing innovative insights, solving complex challenges and unlocking sustainable growth. We inspire our talented professionals to deliver outstanding value to clients, providing an exceptional career experience and an inclusive and collaborative culture. We contribute to society, building confidence and trust in the markets, upholding the integrity of organizations and supporting our communities.Our shared values guide the way we behave to make a positive, enduring impact:Lead the wayServe with integrityTake care of each otherFoster inclusionCollaborate for measurable impactKey ResponsibilitiesSupport the planning and execution of risk-based internal audits across business functions, service lines, and legal entities within DME.Perform audit fieldwork and identify control gaps, root causes, and improvement opportunities, and develop practical and value-adding recommendations.Conduct special reviews / investigations / ad hoc assignments requested by leadership.Prepare and maintain high-quality working papers in line with IIA standards, Deloitte methodology and documentation requirements.Assist in developing audit deliverables including: Audit programs / test plans Risk & Control Matrices (RACMs) Observation memos and audit reports Follow up tracker and reportsParticipate in audit closing meetings with stakeholders and support management action plan follow-up and tracking.Assist in supporting governance and compliance-related activities as required, including policies, procedures, and process documentation across DME.Prepare weekly status report and monthly status report for leadership including NSE. Coordinate with other specialised teams involved in the fieldwork (i.e IT and Cyber security). Leadership CapabilitiesBuilds own understanding of our purpose and values; explores opportunities for impact.Demonstrates strong commitment to personal learning and development; acts as a brand ambassador to help attract top talent.Understands expectations and demonstrates personal accountability for keeping performance on track.Actively focuses on developing effective communication and relationship-building skills.Understands how their daily work contributes to the priorities of the team and the business.Qualifications And SkillsMinimum 5 years of experience.A Bachelor’s degree in accounting, finance, business, or a related field is essential.Holding, or working towards, a professional qualification such as CIA, CISA, ACCA, CPA, or equivalent is an advantage.Strong understanding of Internal Audit principles and methodology, including risk-based auditing concept aligned with IIA standards/ IPPF.Good knowledge of internal controls including controls design and operating effectiveness. Understanding of risk assessment, audit planning, scoping, sampling approach.Internal Audit report writing skills and understanding of rating methodology. Good written and verbal communication skills in English is mandatory.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369634218/",
    "job_id": "4369634218",
    "source": "linkedin",
    "company_name": "Alzayani Investments",
    "job_title": "Assistant IT Auditor",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job OverviewWe are currently seeking a meticulous and proactive Assistant IT Auditor to join our professional team in Manama, Bahrain. This is a full-time position, ideal for an individual looking to develop their career in IT audit within a forward-thinking and expanding company. The successful candidate will play a key role in supporting the IT audit function, helping to assess and enhance the effectiveness of our risk management, control, and governance processes across our diverse technological landscape.ResponsibilitiesReports to an assigned immediate superior and ultimately to the Group Internal Audit Manager (GIAM).Uphold the Company’s Code of Ethics and the Institute of Internal Auditor’s Code of Ethics specifically the principles of Integrity, Objectivity, Confidentiality and Competency.Conduct IT audit engagements following the internal audit department’s policies and procedures e.g., engagement planning, fieldwork, reporting and follow-up.Participates in the opening and closing meetings with engagement clients.Assists in the conduct of assurance engagements where the work of IT specialist is required.Assists in the conduct of consulting engagements e.g., investigations, performance improvement studies, due diligence, etc., where the work of IT specialist is required.Review IT purchases such as but not limited to: Laptops and desktop computers, Mobile phones, Internet connectivity, Annual Maintenance Services related to IT assets, etc.Do other tasks related to the functions of internal audit department, assigned by the GIAM.QualificationsA bachelor's degree in Information Technology, Computer Science, Business Information Systems, or a related field.Previous experience in an IT audit, internal audit, or IT risk management role is highly advantageous.Familiarity with IT general controls and application control concepts.Strong analytical, problem-solving, and critical-thinking skills.Excellent written and verbal communication skills with a high degree of attention to detail.The ability to work collaboratively as part of a team as well as independently.A desire to pursue or progress with professional certifications (e.g., CISA, CISM) is desirable.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355204000/",
    "job_id": "4355204000",
    "source": "linkedin",
    "company_name": "Qureos",
    "job_title": "Assistant IT Auditor - Alzayani Investments",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job OverviewWe are currently seeking a meticulous and proactive Assistant IT Auditor to join our professional team in Manama, Bahrain. This is a full-time position, ideal for an individual looking to develop their career in IT audit within a forward-thinking and expanding company. The successful candidate will play a key role in supporting the IT audit function, helping to assess and enhance the effectiveness of our risk management, control, and governance processes across our diverse technological landscape.ResponsibilitiesReports to an assigned immediate superior and ultimately to the Group Internal Audit Manager (GIAM).Uphold the Company’s Code of Ethics and the Institute of Internal Auditor’s Code of Ethics specifically the principles of Integrity, Objectivity, Confidentiality and Competency.Conduct IT audit engagements following the internal audit department’s policies and procedures e.g., engagement planning, fieldwork, reporting and follow-up.Participates in the opening and closing meetings with engagement clients.Assists in the conduct of assurance engagements where the work of IT specialist is required.Assists in the conduct of consulting engagements e.g., investigations, performance improvement studies, due diligence, etc., where the work of IT specialist is required.Review IT purchases such as but not limited to: Laptops and desktop computers, Mobile phones, Internet connectivity, Annual Maintenance Services related to IT assets, etc.Do other tasks related to the functions of internal audit department, assigned by the GIAM.QualificationsA bachelor's degree in Information Technology, Computer Science, Business Information Systems, or a related field.Previous experience in an IT audit, internal audit, or IT risk management role is highly advantageous.Familiarity with IT general controls and application control concepts.Strong analytical, problem-solving, and critical-thinking skills.Excellent written and verbal communication skills with a high degree of attention to detail.The ability to work collaboratively as part of a team as well as independently.A desire to pursue or progress with professional certifications (e.g., CISA, CISM) is desirable.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373596203/",
    "job_id": "4373596203",
    "source": "linkedin",
    "company_name": "Four Seasons Hotels and Resorts",
    "job_title": "Assistant Director of Finance",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About Four SeasonsFour Seasons is powered by our people. We are a collective of individuals who crave to become better, to push ourselves to new heights and to treat each other as we wish to be treated in return. Our team members around the world create amazing experiences for our guests, residents, and partners through a commitment to luxury with genuine heart. We know that the best way to enable our people to deliver these exceptional guest experiences is through a world-class employee experience and company culture.At Four Seasons, we believe in recognizing a familiar face, welcoming a new one and treating everyone we meet the way we would want to be treated ourselves. Whether you work with us, stay with us, live with us or discover with us, we believe our purpose is to create impressions that will stay with you for a lifetime. It comes from our belief that life is richer when we truly connect to the people and the world around us.About the location:On an exclusive island in the heart of the Kingdom’s capital, Four Seasons Hotel Bahrain Bay, with its unique architecture, has become an iconic landmark that soars as a destination in its own right, combining the best of a beach holiday and an urban getaway.About The RoleThe Assistant Director of Finance supports the Director of Finance in managing the hotel’s daily financial operations, ensuring accurate reporting, strong internal controls, and compliance with policies. The role oversees accounting functions, assists with budgeting and forecasting, and partners with departments to improve financial performance and cost efficiency.Duties & ResponsibilitiesThoroughly understand and possess a working knowledge of the Accounting & Finance ManualExcellent understanding of Month-End Process including, but not limited to, preparation of financial statements, accruals and journal entries, maintain reconciliations for all balance sheet accounts in established corporate formats and in accordance with generally accepted accounting principals.Great attention to detail along with a continuous innovation of daily working of the Finance team under the direction of the Director of Finance.Coordinate, observe and prepare all operating equipment and supply inventories in accordance with corporate policies and as directed by the Director of Finance.Prepare Daily Cash Position report and maintain the highest level of investment of excess funds in accordance with corporate guidelines as prescribed in the Accounting & Finance Manual.Assist the Director of Finance in preparation of all budgets and forecasts.Ensure the outstanding liability for all revenue/profit related fees (i.e. Management Fees, Incentive Fees, Marketing Fees, Advertising Fees, Royalty Fees) is accurate and complies with the respective Management Agreement(s).Ensure electronic payments have the signatory of a member of Group B on each individual page and the initials of a member of Group A and both members of Group A and B sign the Batch Total of the payment run.Ensure strict access controls over unused cheques to prevent improper or unauthorized use of the documents and ensure there is segregation of duties in place to safeguard the writing and voiding of negotiable bank cheques.Ensure accurate exchange rates in Financial Reporting are applied to the local currency (where applicable) and valued in the currency stipulated in the Management Agreement.Ensure post-departure credit card credit allowances are performed only by accounting and all such allowances are reviewed and signed per the SR-5 by Director of Finance or Assistant Director of Finance and all “Unmatched Credits” reports provided by credit card processing company are reviewed/scrutinized by DOF monthly and retained by the Director of Finance.Approve all journal entries with supporting documentation (as appropriate) and ensure all non-standard, non-recurring entries are countersigned by Director of Finance.Ensure the system is set up to prevent month end closing without all journal entries being posted, updated or otherwise entered into the General Ledger.Ensure that monthly reconciliations for all balance sheet accounts are prepared and all bank reconciliations are countersigned by Director of Finance on a monthly and on a quarterly basis; Director of Finance approves all reconciliations paying special attention to reconciling items.Coordinate and facilitate external and internal audits.As required, have a working knowledge of residential (or other entity) accounting procedures and how it affects the hotel’s financials.Continuously strive for improvement of processes and efficiency.Monitor and control expenses of the hotel paying special attention to the daily reporting done by the auditor of the hotel and addressing issues that not only have material effect, but also effect the guest experience.Ensure that House Funds and Floats Counts are up to date and limit any kind of exposure that would affect the profitability.Assist the Director of Finance i",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366924190/",
    "job_id": "4366924190",
    "source": "linkedin",
    "company_name": "Yokogawa",
    "job_title": "Senior Group Audit Specialist",
    "location": "Muharraq, Muharraq Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364518998/",
    "job_id": "4364518998",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Executive- Market Audit and Business Intelligence (MABI)",
    "location": "Chattogram, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company Name: Akij Venture Ltd.Location: Barishal, Bogura, Cumilla, Mymensingh, Rangpur, Sylhet, Chattogram (Chakbazar Chittagong)Job Type: Full-TimeWorkplace Type: Full-timeJob ID: IJOB202614207Responsibilities:Conduct comprehensive visits to retail outlets to gather detailed information on AFBL and competitor products, ensuring a thorough understanding of market dynamics.Collect and analyze data on competitor activities to identify market trends and competitive strategies.Engage with retailers to gather insights on service quality perceptions across various beverage companies, facilitating improvements in service delivery.Key Duties:Visit distribution points to observe and evaluate adherence to Standard Operating Procedures (SOPs), ensuring operational excellence.Collaborate with field forces to assess their activities, identifying strengths and areas for improvement to enhance overall performance.Evaluate the effectiveness and response to various trade, retail, and consumer program implementations, providing actionable insights for strategic adjustments.Conduct retail outlet visits to collect data on cooler and product aging, ensuring optimal product freshness and quality.Identify and report on fake sales activities, maintaining the integrity of sales data.Gather and analyze wholesale dumping information to prevent market saturation and maintain healthy inventory levels.Prepare detailed reports on market observations, providing management with critical insights for decision-making.Conduct field force promotional assessment activities to evaluate the impact and effectiveness of promotional strategies.Prepare various trade program bills, including Slab, Memo Scratch Card, and Display, for claim adjustment, ensuring financial accuracy and accountability.Requirements Experience: 1-2 years Education: Skills: retail industry knowledge, beverage industry knowledge, retailoperations, market research & analysis, retail buying, market audit, advertising research, retail marketing, trade marketing, advertising sales Last Date of Application: 24 February 2026",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367110498/",
    "job_id": "4367110498",
    "source": "linkedin",
    "company_name": "KPMG Bahrain",
    "job_title": "Assistant Audit Manager",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who are we?KPMG in Bahrain employs over 350 professionals and partners. We provide our clients with a suite of locally supported Audit, Tax, and Advisory services. We recruit the best and brightest from around the world and currently have a workforce representing over 20 countries across our teams. We also pride ourselves on our capabilities to attract, nurture, and empower talent from our communities locally.A career in Audit at KPMG will give you insights into the inner workings of companies and a broad business perspective that can open countless opportunities for professional and personal growth. Our Audit process does more than assess financial information. It’s designed to focus on the key areas of risk so that our clients can focus on managing their core business. KPMG combines a multi-disciplinary approach with deep, practical industry knowledge to help clients meet challenges and respond to business opportunities.We do what matters!The IndividualGraduate degree in Accounting or related fieldFully qualified in any of the following international professional qualifications – CA, ACCA, ACA, CPA, CMA, CIAKnowledge of IFRSAt least 5 years in public auditing and accounting, of which at least 3 years must be post-qualifying experience, preferably with a Big 4 Audit firmExperience working with banking clients with a good understanding of IFRS 9 requirements and regulatory requirements such as Basel rules (required)Extensive knowledge of best practice reporting and International Financial Reporting StandardsSome experience outside the normal audit field, such as agreed-upon, accounting support, and other transaction support engagementsStarting to actively develop an understanding of a range of financial and other areas (other than attestation and accounting advisory) to be able to assist clients on due diligence and other transaction support engagements. If this point is not available, then there should be available proof of being trained thereonWhy joining KPMG is beneficial for you:It is more than a career opportunity! It is a chance to join a high-performing team that delivers a broad range of solutions to clients across different industries.We’re fully committed to developing a lifelong learning culture.We recognize potential, nurture talent, and reward high performance.We offer tax-free income.If this is your first international assignment, no need to worry! We will support you with the transition and relocation to make sure that it is as smooth and hassle-free as possible, through the following:Immigration and Visa supportHotel AccommodationCash AdvancesAnnual TicketsRelocation Allowance",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355846619/",
    "job_id": "4355846619",
    "source": "linkedin",
    "company_name": "Downtown Rotana",
    "job_title": "Income Auditor",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionWe are currently seeking for passionate and dynamic Finance professionals who pride themselves on their ability to deliver extraordinary levels of customer service and provide creative solutions to our guests.As an Income Auditor you are responsible to review and verify all financial reports in order to ensure a proper authorization in compliance with the applicable policies and procedures, whereby your role will include key responsibilities such as- Review and verify Night Auditors logbook, daily revenue report and daily Food & Beverage report with supporting vouchers and trial balance Distribute daily reports after obtaining Director of Finance / Financial Controller’s approval Review rage variance report in order to ensure the correct rate is applied Review the city ledger and credit card transfers of the day and pass the same to the Accounts Receivable Audit the daily cash summary and update General Cashier’s report Review overages and shortages of Cashiers and take appropriate action and review Front Office foreign exchange rates as and when required Conduct float counting of all house fund holders on a weekly basis and prepare a monthly float count summarySkillsEducation, Qualifications & ExperiencesYou should have a degree in hotel management or accounting and at least one year previous experiences within a hotel environment. Excellent verbal and written English communication skills and computer literacy is a must, while knowledge of Opera, Micros, FBM and SUN System an asset.Knowledge & CompetenciesThe ideal candidate will be an analytical, pragmatic thinker with a high level of integrity and professionalism. You are result oriented, able to adjust priorities and manage time wisely in a fast-paced environment and maintain a fair, consistent set of standards. You are proactive and flexible, while possessing following additional competencies-Understanding Hotel OperationsTeamworkPlanning for BusinessSupervising PeopleUnderstanding DifferencesSupervising OperationsEffective CommunicationAdaptabilityCustomer FocusDriving for Results",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363886583/",
    "job_id": "4363886583",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Auditor - Audit & Assurance Team",
    "location": "Seef, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About The Job Auditor - Audit & Assurance TeamJob Title: Auditor - Audit & AssuranceGrant Thornton Abdulaal is seeking a highly motivated and experienced Audit Senior to join our dynamic team. As a Audit Senior, you will play a key role in leading and managing the audit process for a variety of clients across different industries.Key ResponsibilitiesLead and manage audit engagements, including planning, execution, and completionDevelop and maintain strong relationships with clients, providing excellent customer service and addressing any concerns or issuesReview and analyze financial statements and audit reports for accuracy and completenessIdentify and communicate any potential risks or issues to the audit team and clientsTrain and mentor junior staff, providing guidance and support to help them develop their skills and knowledgeStay up-to-date with industry trends and changes in accounting and auditing standardsParticipate in business development activities, including networking and proposal writingAssist with other ad-hoc projects and tasks as assigned by senior management.QualificationsBachelor's degree in Accounting, Finance, or a related fieldExperience within financial services and insurance companies will be an added advantageMinimum of 1 to 2 years of experience in audit & assurance, preferably in a reputed public accounting firmCA or ACCA qualification will be an added advantageStrong knowledge of IFRS and GAAPExcellent communication and interpersonal skillsAbility to work well in a team and manage multiple engagements simultaneouslyStrong analytical and problem-solving skillsProficient in Microsoft Office and accounting software.For further information, and to apply, please visit our website via the “Apply” button below.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355061235/",
    "job_id": "4355061235",
    "source": "linkedin",
    "company_name": "QIMA",
    "job_title": "CSCA Ethical Auditor (Part-time)",
    "location": "Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionAt QIMA, we are on a mission to offer our clients smart solutions to make products you can trust.Operating in over 100 countries, we serve the consumer products, food, and life sciences industries and help more than 30,000 brands, retailers, manufacturers, and growers achieve quality excellence.We combine on-the-ground expertise with digital solutions that bring accuracy, transparency and intelligence for quality and compliance data.What sets us apart is our unique culture. Our 5,000 Qimers live and make decisions every day by our QIMA Values. With client passion, integrity, and a commitment to making things simple, we disrupted the Testing, Inspection, and Certification industry. Are you ready to hop on this exciting ride with us and help us achieve our mission?Job Description Audit the manufacturing sites of our clients’ suppliers, sometimes without warning. Your areas of attention will include labor rights, health and safety, environmental security, and others, according to the applicable international standard or the client’s in-house procedure Be alert to any violations, staying vigilant when dealing with factory management, and recording all your findings in detailed reports, to be delivered to the client Approach Your Job With Utmost Integrity, As Your Conduct During An Audit Can Have Lasting Consequences For The Supplier, Factory Staff, And Our Clients We May Also Request You To Provide your expertise in client meetings, to create custom quality control requirements Contribute your ideas for improving the quality of our Operations projectQualifications A higher education degree in Engineering, Law, Economics, Social Sciences or a related major APSCA registered at CSCA level Work experience in 3rd party auditing Experience in Environmental Audit SMETA/BSCI/SA8000/WRAP or mixed audits done in recent 12 months Have good command of English (spoken and written) Availability for travel",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340333928/",
    "job_id": "4340333928",
    "source": "linkedin",
    "company_name": "KPMG Bahrain",
    "job_title": "Senior Executive- Audit",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who are we?KPMG in Bahrain employs over 350 professionals and partners. We provide our clients with a suite of locally supported Audit, Tax, and Advisory services. We recruit the best and brightest from around the world and currently have a workforce that represents over 20 countries working across our teams. We also pride ourselves on our ability to attract, nurture, and empower talent from our communities locally.A career in Audit at KPMG will give you insights into the inner workings of companies and a broad business perspective that can open countless opportunities for professional and personal growth. Our Audit process does more than assess financial information. It’s designed to focus on the key areas of risk so that our clients can focus on managing their core business. KPMG combines a multi-disciplinary approach with deep, practical industry knowledge to help clients meet challenges and respond to business opportunities.We do what matters!Primary Job Responsibilities/AccountabilitiesAbility to obtain and present appropriate audit evidence, address the relevant audit objectives, play the in-charge role on the audit engagementsDraw initial conclusions on client queries, being alert to both commercial concerns and technical accuracy and referring upwards if necessaryPerform fieldwork on assigned clients, assisting with the setting of budgets and pricing, scheduling audits, selecting staff and assigning workloads, developing the audit strategy, within the KPMG Audit Methodology, and using technology toolsIdentify issues for reporting in the management letter, and other communications with management, and drafts the final documents for review by manager and partnerBudget time allocation to assignments and explain variances from budget and collects cash on timeLead and manage the audit team in the field on assignmentsSupply or attend briefings which are clearly understood on all assignmentsEnsure completion of audits/projects within agreed timescales and budgets.What we look for:To qualify for the role, you must haveGraduate degree in Accounting or related fieldAn international professional qualification – CA/ ACCA/ ACA/ CPAKnowledge of IFRSAt least 1-3 years in public auditing and accounting, preferably with a Big 4 Audit firm;Knowledge of best practice reporting and International Financial Reporting Standards;Some experience outside the normal audit field, such as agreed-upon, accounting support and other transaction support engagements",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372809267/",
    "job_id": "4372809267",
    "source": "linkedin",
    "company_name": "Grant Thornton Bahrain",
    "job_title": "Audit, Risk and Compliance Manager",
    "location": "Seef, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Location: BahrainEmployment Type: Full-TimeIndustry: Retail, Logistics etcJOB DESCRIPTION:Financial Compliance: Establish and maintain a comprehensive framework for financial compliance, encompassing regulatory adherence, risk mitigation, and preserving the organization's financial integrity. Monitor performance and financial compliance against SOPs and financial KPIs. Review financial records and reports to detect any irregularities, weaknesses, or issues needing further investigation, including KYCs and CDD for customers and suppliers. Review and ensure compliance with government regulations regarding financial activities such as taxation, securities trading, banking, and insurance. Review and ensure compliance with the administration requirements across operations (e.g., Insurance Coverage). Review and report the monthly compliance Dashboard for the results of ICQs, the status of the Compliance Assignment, and any other issues to the CEO and Head of Financial Controlling.Regulatory Compliance: Oversee the implementation of the compliance framework as approved by the ARC and Board. Lead the preparation of the annual compliance audit plan with the CEO and secure approvals from the ARC. Ensure the performance of semi-annual self-assessment reviews of regulations by the divisions and the implementation of the annual compliance audit. Review instances of non-compliance and ensure follow-up actions are performed. Report the regulatory compliance dashboard to the CEO on a timely basis. Review the results of compliance audits and report to the CEO and ARC.Group/Operational Compliance: Lead the actions in conducting thorough investigations of reported compliance violations or concerns. Ensure prompt resolution, implement corrective actions, and guide to prevent future non-compliance. Analyse material variance to detect causes and implement corrective actions with regular reports to the CEO. Conduct investigations and analysis when required to review transactions and documentation to ensure compliance, including fraud investigations and reporting findings. Monitor company assets to ensure they are protected from loss due to theft or mismanagement.Internal Audit: Lead and prepare the internal audit plan annually with KPMG and the Division Heads to obtain confirmation and approvals. Ensure timely and accurate responses to audit findings and identified non-conformities, implement necessary corrective actions, and follow up on recommendations with the Divisions. Liaise with internal and external auditors to facilitate and support audits, follow up on findings, prepare pre-audits, collate and organize the documents, and determine each party's access. Responsible for executing the internal audit program for the company in close coordination with the Line Manager by identifying risk factors and recommending appropriate solutions.Risk Management: Ensure that the Groups Risk framework and design align with organizational standards to eliminate potential threats. Review and advise on continual improvements and support management of the risk management framework and tools. Report the current risk and compliance performance status to business functions, highlighting areas of concern and potential threats, and implementing robust and effective compliance controls to mitigate risks. Review and assess the businesss future ventures to identify possible compliance risks and develop necessary mitigation plans. Advise the Risk Management Committee on any novelties and expected changes in the Business Risk Profile. Review the audit approach, scope, and risk profile with the internal auditors. QUALIFICATIONS: At least a bachelors degree in Accounting, Finance, or a related compliance field. Professional Qualifications in accounting, such as CA/CPA/CIMA/ACCA/CIA. Professional certification in Compliance, ICA from the International Compliance Association. Certificate of Risk and Compliance Management Professional (CRCMP) or equivalent certification will be preferred.EXPERIENCE, TRAINING, AND SKILLS:Minimum of 5 years post-qualification work experience in managing an accounting/finance function of a medium or large-sized service organization.PC proficient in MS Office and related internal systems. Written and spoken skills in English and Arabic. Knowledge of applicable local laws. Knowledge of finance, accounting, budgeting, forecasting, and financial standards, including Generally Accepted Accounting Principles (GAAP) and International Financial Reporting Standards (IFRS).",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372368026/",
    "job_id": "4372368026",
    "source": "linkedin",
    "company_name": "NEXT Ventures",
    "job_title": "Senior Executive – Human Resource Business Partner (HRBP)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who We AreNEXT Ventures is where ambition takes shape and momentum becomes movement. As a global platform revolutionising access to performance-based capital, we empower the world’s most driven individuals to rise. Through our flagship brand, FundedNext, we empower dreamers to become doers, and potential to turn into performance. With 500+ driven minds across five countries, we power a global rhythm—220,000+ daily users from 170+ nations, each chasing greatness in their own way.Your Role in Our MissionAs a Senior Executive – HR Business Partner (HRBP), you will serve as the key link between business units and the core People & Culture team. From workforce planning to onboarding, from employee relations to training needs analysis, this role requires someone who thrives in cross-functional collaboration, understands the nuances of departmental dynamics, and ensures that the HR lens is present in every people decision. You will play a critical role in building a culture of communication, accountability, and performance within your assigned departments.How You’ll Make An ImpactStakeholder Partnership & Workforce PlanningCollaborate with department leaders to drive manpower planning and headcount forecasting.Facilitate discussions around team structures, succession planning, and internal mobility.Liaise between departments and Talent Acquisition to validate role requirements and priorities.Talent Acquisition & Compensation SupportParticipate in interviews and candidate evaluation alongside hiring managers.Coordinate creation and alignment of JDs, scorecards, and competency frameworks.Align hiring decisions with approved salary ranges and negotiate offers in collaboration with TA.Departmental Onboarding & Culture EnablementLead department-specific onboarding programs to complement organizational onboarding.Implement and oversee buddy systems, ensuring new joiners have smooth transitions.Support integration and celebration touchpoints (e.g. returns from leave, team milestones).Employee Lifecycle & Documentation OversightMaintain up-to-date records for departmental employees and flag data/documentation gaps.Ensure all HR documentation (e.g. letters, requisitions, updates) are processed correctly.Lead departmental exit interviews and share actionable insights with relevant teams.Issue Resolution, Surveys & ENPS Follow-upProactively address people issues within departments, including team dynamics and conflicts.Collaborate on internal surveys and ENPS analysis; lead follow-up sessions with managers.Coordinate action planning in response to audit findings or negative feedback trends.Training & Development LiaisonConduct departmental Training Needs Analysis (TNA) based on manager input and observations.Share TNA insights with the L&D team and track training delivery and participation.Monitor post-training feedback and departmental impact of development initiatives.HR Operations CollaborationPartner with the People Operations team to ensure policy awareness, attendance monitoring, and SOP alignment.Flag potential compliance issues and collaborate on policy reinforcement campaigns.Provide ad-hoc support for HR operations escalations and system improvement feedback.What You Bring3–5 years of progressive experience in HR, ideally in a business partnering or generalist role.Demonstrated experience managing department-level stakeholders and driving alignment.Sound understanding of HR processes including onboarding, exits, recruitment, and policy compliance.Strong collaboration, communication, and data interpretation skills.Exposure to HRMS/HRIS systems and Google Workspace tools.Experience in recruitment processes (sourcing, interviewing, selection) preferred.Your X-FactorTrusted advisor who can balance business urgency with people needs.Culturally tuned-in, able to detect unspoken dynamics within teams.Thinks one step ahead, always anticipating gaps before they turn into risks.Your Pay & PerksMonthly salary range: BDT 40,000 – BDT 65,000.Bi-annual salary review (Eligibility Condition Applies).Festival bonus (Eligibility Condition Applies).Celebrate birthday leave and great team events.Start your next chapter with our special honeymoon package.Unwind together at annual company retreats.Kick back with game nights and all-access sports zones – billiards, foosball, PlayStation, cricket, football & badminton.Get moving with an in-house fitness trainer to keep your mind and body in sync.Opportunities for relocation to Sri Lanka and Malaysia, subject to business needs, with travel allowances.Your Daily Source of EnergySubsidized lunchUnlimited tea & coffeeVending machine creditsYour Journey After Applying30-minute Get-To-Know-You Session (with TA Lead)48-hour deadline take-home assessment60-minute Final Interview Session (with Department Head and HR Leadership)Why Join NEXTAt NEXT Ventures, we believe the right talent fuels breakthrough innovation. If you’re driven to elevate people, performance, and purpose at scale—we’d love to ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371149181/",
    "job_id": "4371149181",
    "source": "linkedin",
    "company_name": "RCSI Medical University of Bahrain",
    "job_title": "HR Operations & Compliance Coordinator",
    "location": "Muharraq, Muharraq Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role Objective:The HR Operations & Compliance Coordinator is responsible for the coordinated delivery of high-quality HR operational and administrative services across the employee lifecycle at RCSI Bahrain.The role ensures accurate contractual administration, employee records management, HR systems maintenance, payroll coordination, and compliance with Bahraini labour law and regulatory requirements. The postholder acts as the primary operational liaison with external government and regulatory bodies, ensuring that all employee documentation, registrations, and reporting obligations are completed accurately and on time.A core focus of the role is to maintain strong operational control and compliance while supporting continuous improvement of HR processes through effective use of HR systems, digital tools, and standardised workflows. The role provides a responsive, confidential, and service-focused HR operation that enables the wider HR team to focus on strategic, advisory, and development activities.Key Responsibilities HR Operations & Employee Lifecycle: Coordinate HR operational activities across the employee lifecycle, including onboarding, probation tracking, contract renewals, amendments, and off-boarding. Prepare, issue, and maintain employment contracts, variations, and formal HR correspondence in line with RCSI Bahrain policies and Bahraini labour law. Maintain accurate, up-to-date employee records, ensuring data integrity, confidentiality, and audit readiness at all times. Act as the first point of contact for routine HR operations queries from staff, providing clear and consistent guidance on HR processes, documentation, and systems. Escalate non-standard, sensitive, or complex issues to the HR Manager as appropriate. HR Systems & Data Management: Act as an operational subject matter resource for the HR Information System (Zoho People), including: Employee data maintenance and validation Standard reporting and data extracts User support and issue resolution Process documentation and guidance Support continuous improvement of HR processes through automation, workflow enhancements, and improved use of HR systems. Government & Regulatory Compliance: Coordinate all HR-related requirements with external authorities, including: LMRA: work permits, visas, renewals, cancellations, and compliance reporting SIO: employee registration, updates, contributions, and leaver processing Tamkeen: employee registrations, programme submissions, claims, and compliance tracking Quadrabay: system updates, reporting, and coordination as required Higher Education Council (HEC): staff registration, approvals, renewals, and ongoing compliance Coordinate eVisa, immigration, and labour-related processes in line with current regulations. Monitor changes in Bahraini employment legislation and regulatory requirements and flag potential impacts to the HR Manager. Payroll & Benefits Coordination: Coordinate monthly payroll inputs and submissions to the payroll provider, ensuring accuracy of employee data, allowances, deductions, and statutory requirements. Support benefits administration and respond to employee queries related to payroll processes and statutory benefits. Liaise with Finance and payroll providers to resolve payroll-related issues promptly. Certificates & External Authentication: Coordinate authentication and verification of academic and professional certificates for new and existing employees as required by regulators and external bodies. Maintain accurate records of authenticated documents and compliance status. Administrative & Operational Support: Raise purchase requisitions and purchase orders for HR-related services and supplies as required. Support induction and exit processes, contributing to a positive employee experience. Maintain HR filing systems (electronic and physical) in line with data protection and record-retention requirements. Support internal HR projects, audits, reporting, and team initiatives as required. Ensure compliance with RCSI and RCSI Bahrain policies, procedures, and values at all times. Undertake training and professional development as required and perform other duties appropriate to the role. RequirementsKey Requirements & Competencies Essential Fluency in English and Arabic (written and spoken). Proven experience in HR administration or HR operations, preferably within Bahrain. Strong working knowledge of Bahraini HR regulatory systems, including LMRA, SIO, Tamkeen. Excellent organisational skills with a high level of attention to detail and accuracy. Ability to manage multiple priorities and meet deadlines in a fast-paced environment. Strong interpersonal and customer service skills with a professional and confidential approach. Proficiency in Microsoft Office and HR systems (experience with HRIS is an advantage). Desirable Experience working in higher education or a regulated environment. Familiarity with payroll coordination and statutory reporting. A qualification in HR, Busin",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364703536/",
    "job_id": "4364703536",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - HR, Admin & Compliance (For Pretty Group) - Job ID : 1459188",
    "location": "Rupganj Upazila, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Pretty Group is looking for Manager - HR, Admin & ComplianceJob Description / ResponsibilityWe are looking for a dynamic and experienced Manager in the field of HR, Admin & Compliance to look after a 100% Export Oriented Knit Garments Factroy.Job Location will be Rupganj, Narayanganj.Demonstrate an inspiring level of leadership and team playing capability to plan, organize, monitor, and lead teams of HR, Admin, and Compliance department of the factory.Formulate development strategies in terms of HR, Admin, and Compliance.Working with the senior management of the company in connection with the company’s strategy formulation.Ensure that all the existing policies, SOPs, standing orders, etc., are implemented in the factory.Responsible for compliance issues (internal & external), which will include, but not be limited to, different buying brands’ requirements as well as the legal issues, both local and international (i.e., ILO, EU, etc.).Maintain liaison with different associated bodies (Government, Semi-Government, autonomous, etc.) as part of your administrative responsibilities.Responsible for managing aspects of industrial relations and conflict management in accordance with the laws of the country.Maintain rapport with local or international buying partners’ (brands) representatives, especially related to compliance.Forecasting and preparing the annual budget in line with the requirements of HR, Admin, and Compliance Department.Ensure inter-departmental cooperation in favor of your teams as well as others.Required to report all the updates and follow-ups to the top management at a regular interval.Might be given any other assignments, other than specified here, at the discretion of top management.Educational RequirementsBachelor/HonorsSkills Required: Administration, Compliance, HR OperationExperience RequirementsAt least 10 year(s)The applicants should have experience in the following business area(s):Garments,Textile,Group of CompaniesAdditional RequirementsCommunication skills in both English and Bengali in verbal and written.Ability to work independently and as part of a team.Be able to cope with pressure, flexible, and adaptable.Highly self-motivated, self-directed, and proactive.Well conversant with IT equipment.Job LocationNarayanganj (Rupganj)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355260046/",
    "job_id": "4355260046",
    "source": "linkedin",
    "company_name": "Chalhoub Group",
    "job_title": "Store Supervisor - Penhaligon's",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372378787/",
    "job_id": "4372378787",
    "source": "linkedin",
    "company_name": "Next Sourcing Limited",
    "job_title": "Administrator Executive",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Title: Administrator ExecutiveJob Location: Uttara, Dhaka, Bangladesh Report to: Head of HRJob Description: End to End management of 45,000+ sq. ft. corporate office facilities, 4 company apartments, and Central Store operations.Oversee housekeeping, preventive maintenance of AC, Air purifier, renovations, and workspace optimization to ensure operational excellence.Drive cost-effective procurement and inventory control of office supplies, equipment, and amenities.Ensure workplace security, visitor management, CCTV monitoring, fire safety, and full compliance with Health & Safety standards.Manage fleet operations including maintenance, insurance, regulatory renewals, and transport coordination.Lead and develop a large operational team including Transport Officer, 45+ drivers, and 15+ support staff.Deliver high service standards, administrative excellence, and seamless logistical support across the organization.Essential Skills & Requirements:Bachelor’s Degree in Management or Diploma in Mechanical/Electrical Engineering.More than 5 years hands-on experience in Housekeeping Management, AC Maintenance, Inventory & Store Management, Repair & Renovation, Safety & Security, and Courier Operations.Strong understanding of facilities operations and preventive maintenance systems.Excellent interpersonal and communication skills.Strong problem-solving ability with a proactive and supportive mind-set.Ability to work effectively in a fast-paced, matrix, and multicultural environment.Fluency in English and the local language If you are interested, kindly share you CV to careers@bd.nextsourcing.com",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364763576/",
    "job_id": "4364763576",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "IELTS Admission & Compliance Officer - (For Scholars Zone) - Job ID - 1459647",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Scholars Zone is looking for IELTS Admission & Compliance OfficerJob Description / ResponsibilityCall and counsel prospective students for IELTS online and offline courses.Provide detailed information about course structure, schedules, and benefits.Convince and guide students to complete their admissions and submit necessary files.Maintain accurate records of student inquiries, enrollments, and compliance documentation.Ensure all IELTS-related compliance requirements and procedures are properly followed.Coordinate with the academic and operations team for smooth class management.Follow up with potential students to maximize enrollment conversions.Prepare daily/weekly reports on calls, follow-ups, and admissions.Educational RequirementsBachelor/HonorsIELTS TeachingSkills Required: Administration, Compliance, IELTS, File management, Reporting and Documentation, Student Admission, sales calling, Knowledge of Admissions Process, admission consultancyExperience Requirements1 to 5 year(s)The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service,Immigration/Visa Processing,Educational Technology (Edtech) StartupAdditional RequirementsStrong communication and persuasion skills in both English and Bangla.Previous experience in counseling, admissions, or education consultancy will be an advantage.Basic knowledge of IELTS and study abroad process will be preferred.Proficiency in MS Office/Google Workspace for record-keeping and reporting.Positive attitude, ability to work under pressure, and target-oriented mindset.Job LocationDhaka (Dhanmondi)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364499923/",
    "job_id": "4364499923",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "HR & Compliance Manager (For Wendler Interlining Bangladesh Limited) - Job ID : 1459091",
    "location": "Trishal Upazila, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371914062/",
    "job_id": "4371914062",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Asst. Manager / Manager-Compliance - For ACS Textiles (Bangladesh) Ltd.- Job ID: 1459496",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371901784/",
    "job_id": "4371901784",
    "source": "linkedin",
    "company_name": "Oxfam",
    "job_title": "Senior Programme Officer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Oxfam is a global movement of people working together to end the injustice of poverty.Do you have experience in managing full project cycles, including planning, budgeting, implementation, and reporting, while ensuring donor compliance and quality delivery?Do you have experience in coordinating with partners, consultants, and internal teams, and supporting program implementation in humanitarian or development contexts?Do you have experience in promoting safe programming, community participation, and applying feminist principles in program design and implementation?If the answer is yes, then we would like to hear from you.The RoleOxfam in Bangladesh is looking for a Senior Programme Officer (SPO) to manage assigned projects within the Project Management Unit (PMU), ensuring effective project delivery, compliance, and financial oversight.The SPO will oversee project planning, budgeting, implementation, monitoring, and reporting; coordinate with partners, consultants, and internal teams; and support safe, inclusive programming approaches. The role contributes to strengthening project management systems, monitoring performance, promoting accountability, and applying feminist principles in decision-making.Key Focus Areas IncludeLeading the full project cycle: planning, budget management, activity implementation, monitoring, and reporting.Maintaining project documentation and online portals (OPAL, CRIMSON) and keeping stakeholders informed.Ensuring financial oversight and risk management, including donor compliance.Supporting MEAL processes to capture project outcomes and lessons learned.Coordinating with partners, consultants, and internal units to ensure smooth implementation.Promoting accountability, community participation, and safe programming approaches.Line managing 2–3 staff members, providing mentorship, performance management, and demonstrating feminist leadership practices.What We Are Looking ForWe’re looking for a candidate who cares about Oxfam's mission to end poverty and is personally aligned to our feminist principles and values of empowerment, accountability and inclusion in all you do.An Ideal Candidate For The Role Will Also Be/haveA postgraduate degree in Disaster Management, Social Science, or a relevant field.At least 5 years of project cycle management experience, including planning, budgeting, implementation, and reporting.Solid understanding of Disaster Risk Reduction, Anticipatory Action, Disaster Resilience, Resilience WASH, and Emergency Response.Experience in locally led project implementation and, ideally, multi-country projects.Strong knowledge of humanitarian principles, community development, and participatory approaches.Experience in Cash Transfer Programming (CTP) and Electronic Cash Transfers.Ability and willingness to work in field environments.Strong analytical, interpersonal, and communication skills, with professional proficiency in English.Commitment to gender equity, safe programming, and marginalized communities.[Only Bangladeshi Nationals are eligible to apply]We OfferWe offer a competitive salary and a range of additional benefits to staff including flexible working options, a gratuity pension scheme, annual leave, additional leave allowances, company sick pay, life assurance and a range of other benefits.From the day you join Oxfam we invite you to stretch and learn in your role. Our wide range of Learning & Development opportunities includes in-house courses, e-learning modules, on-the job learning opportunities, coaching and mentoring, and much more.You can read more about all Oxfam has to offer here.How To ApplyAs part of your online application, please upload your up to date CV and Cover Letter explaining your suitability against the essential criteria in the job profile.Our values and commitment to safeguardingOxfam is committed to preventing any type of unwanted behaviour at work including sexual harassment, exploitation and abuse, lack of integrity and financial misconduct; and committed to promoting the welfare of children, young people, adults and beneficiaries with whom Oxfam GB engages. Oxfam expects all staff and volunteers to share this commitment through our code of conduct. We place a high priority on ensuring that only those who share and demonstrate our values are recruited to work for us. The post holder will undertake the appropriate level of training and is responsible for ensuring that they understand and work within the safeguarding policies of the organisation.All offers of employment will be subject to satisfactory references and appropriate screening checks, which can include criminal records and terrorism finance checks. Oxfam GB also participates in the Inter Agency Misconduct Disclosure Scheme. In line with this Scheme, we will request information from job applicants’ previous employers about any findings of sexual exploitation, sexual abuse and/or sexual harassment during employment, or incidents under investigation when the applicant left",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369491054/",
    "job_id": "4369491054",
    "source": "linkedin",
    "company_name": "Hilton",
    "job_title": "Front Desk Agent",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358871271/",
    "job_id": "4358871271",
    "source": "linkedin",
    "company_name": "Pay10 Bahrain",
    "job_title": "Legal Counsel",
    "location": "Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role overviewWe are seeking a dynamic and hands-on Legal Counsel to handle the Company’s legal requirements in Bahrain and collaborate with the legal team across other companies within the group. This is a stand-alone role, however, will be part of a larger legal team spread across 13 jurisdictions and growing. The Legal Counsel will need to have hands on experience in financial regulations, commercial contracting, digital payments, and cross-border legal frameworks. The role reports to the Group’s Chief Legal Officer and to the CEO of Pay10 Bahrain. Key Responsibilities:1. Corporate Advisory:Provide legal support on to the Company regarding its corporate requirements relating to its operations.Main corporate records of the Company and keep them to up to date. Managing corporate service providers 2. Regulatory & Compliance OversightMaintain the licensing records up to date and liaise with the relevant teams on updating the relevant license. Collaborate with compliance and risk management teams to strengthen governance and internal controls of the Company in Bahrain.3. Contracts & Commercial LawDraft, negotiate, and review high-value contracts, including client agreements, technology licensing, partnerships, and vendor arrangements.Ensure contracts are commercially sound, legally enforceable, and aligned with Bahrain regulations and business risk appetite.4. Corporate Governance & TransactionsSupport the Chief Legal Officer in maintaining the Company’s corporate governance framework including drafting board resolutions, minutes of meetings, shareholder meetings, and corporate secretarial functions.5. Litigation & Risk ManagementManage disputes, litigation, regulatory investigations, and coordinate with external counsel as necessary under the guidance of the Chief Legal Officer.Establish and deliver internal training programs to promote legal awareness and reduce operational risks.Required Qualifications & Experience:Minimum 5 years of legal experience in fintech, banking, payments, technology, e-commenrce, or tech-adjacent sectors. GCC experience is a must. Licensed to practice law in a common law jurisdiction (UK, US, or equivalent).Demonstrated knowledge of regulatory environments for financial services, e-money, and payment solutions in the Bahrain.Team player with excellent stakeholder engagement, commercial negotiation, and organizational skills.Business-oriented mindset with the ability to balance a diverse task list. Arabic language skills are not essential but preferred.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357714437/",
    "job_id": "4357714437",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Product Registration Officer",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "The Product Registration and Compliance Officer is responsible for supporting product registration, regulatory submissions, and ongoing compliance activities to ensure that company products meet all applicable regulatory, legal, and quality requirements in assigned markets. The role involves coordination with internal teams, regulatory authorities, and external partners to maintain timely and accurate product approvals and compliance documentation.Key ResponsibilitiesPrepare, submit, and track product registration and renewal applications with relevant regulatory authoritiesMaintain product registration databases and ensure records are accurate and up to dateCoordinate with internal departments (Regulatory, Quality, Supply Chain, Marketing) to gather required documentationEnsure products comply with local and international regulatory requirements, standards, and guidelinesMonitor changes in regulatory requirements and support implementation of necessary updatesAssist with labeling, artwork, and documentation compliance reviewsSupport audits, inspections, and regulatory inquiries as requiredTrack submission timelines and follow up with authorities to ensure timely approvalsMaintain organized regulatory files and compliance documentationQualifications & RequirementsBachelor’s degree in Pharmacy, Life Sciences, Regulatory Affairs, or a related field1–2 years of experience in product registration, regulatory affairs, or compliance (entry-level candidates may be considered with basic knowledge in the field)Basic knowledge of regulatory requirements and product registration processes.Strong organizational and documentation skillsAttention to detail and ability to manage multiple tasks simultaneouslyGood communication and coordination skillsProficiency in MS Office applications",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369626140/",
    "job_id": "4369626140",
    "source": "linkedin",
    "company_name": "Nextcare",
    "job_title": "Medical Officer - Inpatient Precertification",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Medical Officer – Inpatient Precertification is responsible for managing the Inpatient Precertification cases while ensuring that departmental goals, timeline of activities, and compliance measures are met.What You DoPrecertification team is functional on 24/7 basis. Therefore the Medical Officer will be working on flexible shift basis as per the schedule provided by the Team Leader.Adjudicates Cases at IP precertification level, authorizes decision within the stipulated turnaround time & with the highest quality standards in view with the policy terms and conditionsPerforming complete file review with regards to the multidisciplinary notes, TPR charts, physician order’s notes, lab reports, radiology reports, drug chart sheets, consultation notes, nursing notes, progress notes, etc.Requesting any medical documentation or finding any missing document which is essential in decision making.Performing review of DRG Severity of Illness (SOI) in line with revision of CPT codes / ICD codes, which are being up-coded by the provider – if required discussion with the treating doctor and the medical coders.Performing utilization review for DRG cases and FFS cases with regards to and not limited to final bill review + consumables mark ups + non covered item/services + overutilization of services.Performing review of claims as per CPT and ICD coding guidelines in line with insurance regulators (DHA,DOH/HAAD,MOH).Adhering to the cost containment protocols for medical management cases.Referring cases for second opinion when deemed necessary to confirm the best mode of management – also for cost containment to lesser Negotiating factor (NF) facilities within the member’s network or option for home country treatment.AI READINESS Work effectively in an environment shaped by artificial intelligence (AI), machine learning, data, analytics and cloud-based tools, using insights responsibly with our standards of data governance, security and ethical use.What You BringBachelor’s of Pharmacy / Dentistry / Medicine / Nursing / Physiotherapist / Paramedics01-02 years of Medical Practical Experience (reputable insurance provider, broker or a TPA experience a plus) OR Entry LevelPhysically fit to carry out duties.Certified Medical Coder [Preferable]Legally permitted to work in the country of operations.Physically fit to carry out duties.Fluency in MS Office (Excel, Word, Outlook, PowerPoint) and general internet navigation and research skills.How We HireAgency Statement Allianz Partners does not accept unsolicited CV’s or approaches from agencies. We only work with partners on our approved supplier list, under contract. Any unsolicited submission will not be consideredKey Benefits/What We OfferAllianz Partners is a world leader in B2B2C insurance and assistance, offering global solutions that span international health and life, travel insurance, automotive and assistance. Customer driven, our innovative experts are redefining insurance services by delivering future-ready, high-tech high-touch products and solutions that go beyond traditional insurance. Our products are embedded seamlessly into our partners’ businesses or sold directly to customers, and are available through four commercial brands: Allianz Assistance, Allianz Automotive, Allianz Travel and Allianz Care.At Allianz Partners, Artificial Intelligence (AI) is transforming service delivery and innovation. By leveraging Business Intelligence and Data Analytics, we enhance strategic decision-making and customer experiences. Our commitment to Ethical AI ensures responsible deployment, maintaining data integrity and trust. Conversational AI improves communication, while Emerging Technologies and Generative AI drive industry leadership and new opportunities. With robust Information Security Management, we protect sensitive information, ensuring compliance and security. Embrace the future of AI with Allianz Partners, where possibilities become realities.Allianz Group is one of the most trusted insurance and asset management companies in the world. Caring for our employees, their ambitions, dreams and challenges, is what makes us a unique employer. Together we can build an environment where everyone feels empowered and has the confidence to explore, to grow and to shape a better future for our customers and the world around us.At Allianz, we stand for unity: we believe that a united world is a more prosperous world, and we are dedicated to consistently advocating for equal opportunities for all. And the foundation for this is our inclusive workplace, where people and performance both matter, and nurtures a culture grounded in integrity, fairness, inclusion and trust.We therefore welcome applications regardless of ethnicity or cultural background, age, gender, nationality, religion, social class, disability or sexual orientation, or any other characteristics protected under applicable local laws and regulations.Great to have you on board. Let's care for tomorrow.Note: Having differen",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4263535725/",
    "job_id": "4263535725",
    "source": "linkedin",
    "company_name": "Minds United",
    "job_title": "IT COMPLIANCE & RISK",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Full TimeJob Purpose The IT Compliance & Risk Lead is responsible for the assessment of technology\\ vendor risks and control effectiveness across .....Job Purpose The IT Compliance & Risk Lead is responsible for the assessment of technology\\ vendor risks and control effectiveness across the IT disciplines. The IT Risk lead will identify, classify, and document control issues in banks environment by documenting assessment results, recommending corrective action, tracking remediation, evaluating policy and control standard exceptions, and regularly report to IT management.Key Accountabilities Supports the establishment of the IT risk management process and integration and maturing of the process across the IT disciplines and practices. Supports development of the technology risk framework, policies, standards, and risk taxonomy. Supports the implementation and adherence to the risk framework, in collaboration and conjunction with business-aligned risk partners. Evaluates and identify technology risk related to divisions and the enterprise, including emerging trends that may impact risk profile. Supports the self and control risk assessment (RCSA) for IT and engage with the IT stakeholders to define the controls in place, residual risk and treatment plans. Maintains a consolidated list of the technology risk at the enterprise level and ensure a continuous monitoring on the risks and corresponding mitigations plans. Implements risk assessments across the enterprise and build an overall profile of the technology risk. Provides credible challenge based on risk assessment results and ensure risk is being mitigated. Collaborates with division risk officers and subject matter experts to ensure policies and standards are practical, effective and efficientQualifications Bachelor’s/master’s degree in computer science or related field.Professional Certifications COBIT, ITIL, CRISC, ISACAExperience 6 – 8 YearsSkills Minimum 3-5 years of experience in IT risk and compliance role. Solid understanding of IT governance, information security policies, standards and industry best practices. Experience in technology and operational risks frameworks. Practical experience in scoping, conducting risk assessment, and documenting results. Detail oriented and able to meet tight deadlines. Excellent documentation skills and ability to communicate effectively across functional areas.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4336858274/",
    "job_id": "4336858274",
    "source": "linkedin",
    "company_name": "Bapco Energies",
    "job_title": "Logistics Officer",
    "location": "Awali, Southern Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362292912/",
    "job_id": "4362292912",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Relationship Officer/Relationship Manager (AO To JAVP) - (For Midland Bank PLC)-Job ID: 1457815",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Midland Bank PLC is looking for Relationship Officer/Relationship Manager (AO To JAVP)Job Description / ResponsibilityAcquire and manage Retail, SME, and/or Corporate customers to achieve assigned business targets.Mobilize CASA, term deposits, loans, trade finance, remittance, cards, and fee-based income.Develop and maintain strong customer relationships through regular visits and proactive engagement.Ensure proper customer onboarding, KYC, CDD/EDD, and documentation in compliance with Bangladesh Bank regulations and internal policies.Monitor portfolio quality, identify early warning signals (EWS), and support recovery and risk mitigation initiatives.Promote cross-selling of appropriate banking products and services based on customer needs.Ensure timely renewal, documentation updates, and regular follow-up of existing customer relationships.Maintain accurate customer MIS, call reports, and business pipeline tracking.Ensure strict compliance with AML/CFT requirements, regulatory guidelines, and ethical standards.For managerial roles (RM): Supervise, guide, and review the performance of Relationship Officers to ensure achievement of business and compliance objectives.Educational RequirementsBachelor/HonorsMinimum graduation with relevant background from reputed university without having no 3rd class/division or equivalent CGPA in any examination.Experience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s):BanksAdditional RequirementsAchieve assigned Business Targets.Generate new business while cross selling different products.Drive different sales promotions and campaigns.Efficient management of allotted portfolios.Ensure service excellence.Efficient management of customer feedbacks/complaints.Handle branch operational services with careMaintain SLA time with both internal and external customers.Ensure AML compliance and other regulatory policies & requirements.Ad-hoc responsibilities assigned by the Line Manager or Branch Manager.Deposit/loan attrition management.Cross-sell retail products and services.To ensure one stop service for customers and monitor that customers are not routed to different desks.Strong interpersonal and communication skills with effective business acumen.Adequate computer literacy to work on online software modules & MS Office packages.Self-motivated with good business network.Job LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4221805335/",
    "job_id": "4221805335",
    "source": "linkedin",
    "company_name": "Lukos",
    "job_title": "SCIF Security Officer",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Please note: This position is contingent upon the award of a contract. We will provide updates on the status of the contract and next steps during the hiring process.Minimum Qualifications SummaryCertification & Education Must possess a current US Passport with ability to travel and work overseas.Must be able to meet COMSEC briefing and Local Element management certification requirements available under the OPNAVINST 2201.4, DoD Instruction 8523.01 and Air Force Manual 17-1301.Must be able to complete an in-scope (per current DoD 6-year reinvestigation requirement), favorable, ST5 investigation (to include SBPR, PPR, T5R, or current enrollment in the DoD Continuous Evaluation (CE) / Continuous Vetting (CV) program), adjudicated for SCI eligibility by the DoD Central Adjudication Facility (DoD CAF) without conditions, exceptions, or waivers at the time of performance and must maintain the level of security required for the life of the contract.Must possess a TS/SCI Security ClearanceExperience RequiredPreferred: prior experience and operational knowledge executing all special security tasks; including physical, personnel, and information security at the SCI levelPreferred: prior experience and operational knowledge of maintaining SCIF operational records and accreditation documents to ensure compliance, implementation and interpretation of all applicable security directivesTen years’ military experienceJob ObjectiveUnder a five-year contract, the SCIF Security Officer will support the United States Marine Corps Forces, Central Command (MARCENT) and subordinate commands. The scope of the requirement includes professional services for MARCENT located aboard MacDill Air Force Base (AFB), Florida, which serves as a Component Command to U.S. Central Command (USCENTCOM). Specifically, the SCIF Security Officer will support the 5th MEB (also referred to as TF 51/5), which is located in the Kingdom of Bahrain. 5th MEB conducts tactical level command and control of Marine Corps forces within CENTCOM’s AOR. 5th MEB also conducts planning in support of contingencies, exercises, and executes Naval Integration actions.ResponsibilitiesProvide SCIF management servicesProvide operational support of SCIF to the G-2 Special Security OfficeExecute all special security tasks; including physical, personnel, and information security at the SCI levelAssist in managing the operations and administration of the SCIFMaintain SCIF operational records and accreditation documents to ensure compliance, implementation and interpretation of all applicable security directivesOversee the accounting, storage and destruction/disposition of SCI materialReport SCI violations, security incidents, and develop damage and risk assessmentsProvide expert level security support services (including intelligence community security expertise) and, specialized knowledge of SCI security programs, and adjudication of SCI access and investigation data via the use of DISS and NBISEducation & CertificationMust possess a current US Passport with ability to travel and work overseas.Must be able to meet COMSEC briefing and Local Element management certification requirements available under the OPNAVINST 2201.4, DoD Instruction 8523.01 and Air Force Manual 17-1301.Must be able to complete an in-scope (per current DoD 6-year reinvestigation requirement), favorable, ST5 investigation (to include SBPR, PPR, T5R, or current enrollment in the DoD Continuous Evaluation (CE) / Continuous Vetting (CV) program), adjudicated for SCI eligibility by the DoD Central Adjudication Facility (DoD CAF) without conditions, exceptions, or waivers at the time of performance and must maintain the level of security required for the life of the contract.Security ClearanceMust possess a TS/SCI Security ClearanceWork Location5th Marine Expeditionary Brigade, Task Force 51/5; Naval Support Activity Bahrain; Manama, BahrainTravel: Contractor personnel must support the projected travel in support of government requirements to MARCENT AOR and supporting locations, which includes but not limited to the following countries: Bahrain, United Arab Emirates (UAE), Saudi Arabia, Jordan, Egypt, France, Germany, United Kingdom, Oman, Qatar, Kuwait, Iraq, Israel, Afghanistan, Syria, Lebanon, Yemen, Pakistan, Turkmenistan, Uzbekistan, Kyrgyz Republic, Tajikistan, Kazakhstan, Djibouti, Cyprus, Turkey, Italy, and Greece. The ideal candidate will be available for travel on less than 24 hours-notice to support personnel recovery and training for forward deployed forces. The ideal candidate will possess the ability to execute OCONUS travel throughout the Central Command (CENTCOM) AOR.About LukosLukos has been delivering professional services to the Federal Government for 15 years. We help a variety of federal agencies in areas such as national security, homeland security, international development, training, analytics, healthcare, and other professional services. Since our founding, we have grown to support all",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369628077/",
    "job_id": "4369628077",
    "source": "linkedin",
    "company_name": "Nextcare",
    "job_title": "Medical Assessor - Outpatient Precertification",
    "location": "Manama, Capital Governorate, Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364509914/",
    "job_id": "4364509914",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer / Sr. Officer - Finance & Accounts (Factory) - For A Growing Animal Feed Manufacturing Company - Job ID : 1459223",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Growing Animal Feed Manufacturing Company is looking for Officer / Sr. Officer - Finance & Accounts (Factory)Job Description / ResponsibilityMaintain day-to-day accounting records of factory transactions.Record all expenses related to Raw materials, Packing materials, production consumables, Spare parts, Utilities, Repair & maintenance etc.Verify supporting documents (bill, challan, GRN, MR, gate pass) before posting.Maintain factory cash book, bank book, and ledger (manual & ERP).Prepare payment vouchers and submit for approval.Maintain vendor ledger and follow up on pending bills.Process Petty cash, Factory advances, Utility Bills etc.Coordinate with corporate accounts for return submission.Prepare and submit Daily expense report, Monthly factory accounts summaryProvide data to Head Office for Management accounts and budget control.Coordinate with Corporate Accounts.Ensure smooth financial flow at factory level.Maintain confidentiality of financial information.Educational RequirementsBachelor of Commerce (BCom)Bachelor of Business Administration (BBA) in AccountingSkills Required: Accounting, ERP Software, Accounting Software Tally PrimeExperience Requirements2 to 5 year(s)The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM),Poultry,Fisheries,Farming,Hatchery,Dairy,Agro based StartupJob LocationAnywhere in BangladeshSalaryTk. 30000 - 40000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361727006/",
    "job_id": "4361727006",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Special Asset Management Officer - For Dhaka Bank PLC. - Job ID: 1457456",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Dhaka Bank PLC. is looking for Special Asset Management OfficerJob Description / ResponsibilityDesignation: PO - SPOKey AccountabilitiesMonitor recovery/regularization/rescheduling of NPL portfolio in line with Bangladesh Bank and internal guidelines.Negotiate with clients and other relevant parties to implement strategies for recovery, restructuring, rescheduling, and settlement of classified loans and advances.Initiate legal processing upon requirement & maintain relationship with regulators, law enforcement teams and lawyers.Provide support, advice & guidance to the branches in recovery of the classified loans.Monitor proper utilization of budget for special asset management and maintain the quality of risk assets and ensure periodic review.Ensure compliance with internal policies and procedures and regulatory requirements with Bangladesh Bank.Prepare and present MIS, portfolio analysis, and recovery performance reports to senior management.Educational RequirementsBachelor/HonorsMinimum Bachelor DegreeExperience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s):BanksAdditional RequirementsMinimum 5 years` relevant experienceExcellent verbal and written communication skills both in Bangla and EnglishExcellent analytical skillsJob LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354007231/",
    "job_id": "4354007231",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Relationship Officer (SME Banking) - For Midland Bank PLC- Job ID : 1451905",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Midland Bank PLC is looking for Relationship Officer (SME Banking)Job Description / ResponsibilityDevelop sales strategies for SME product channels and manage the overall health of the existing portfolio.Source and acquire prospective SME business to achieve assigned targets.Target SME accounts using effective sales methodologies aligned with commercial banking and wealth management needs of customers.Monitor proper utilization of credit facilities in SME accounts, ensuring asset quality and conducting periodic facility reviews.Monitor non-performing SME loans and formulate appropriate restructuring and recovery strategies.Assess SME loan applications in line with approved credit policies and regulatory guidelines.Analyze business cash flows and recommend suitable structured loan products.Regularly monitor the existing SME portfolio and conduct post-disbursement visits to borrowers and guarantors to reduce PAR and NPL.Maintain in-depth knowledge of customers’ businesses and securities through regular visits and industry research.Cross-sell CASA, L/C, bank guarantees, and other relevant banking products.Support the Head of SME Banking in assigned projects, internal tasks, and market analysis; provide feedback on market trends, industry/sector performance, and portfolio quality.Ensure full compliance with internal policies, procedures, and applicable regulatory requirements.Educational RequirementsBachelor/HonorsMinimum graduation with relevant background from reputed university without having no 3rd class/division or equivalent CGPA in any examinationExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): BanksAdditional RequirementsStrong interpersonal and communication skills with effective business acumen.Adequate computer literacy to work on online software modules & MS Office packages.Self-motivated with good business network.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355702893/",
    "job_id": "4355702893",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Officer / Executive - Account & Finance (For Blue Planet Group) - Job ID : 1452896",
    "location": "Sreepur Upazila, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Blue Planet Group is looking for Senior Officer / Executive - Account & FinanceJob Description / ResponsibilityCheck daily local cash & credit purchase bills, petty cash book and all types of receipts & payments voucher. Perform Cash book audit, record of cash transaction & disbursements. Check salary, wages, OT, festival bonus, incentives etc. Perform daily bank transection. Bills received from Store, check proper documentation and posting in System. Check Import, Export & Local Transport bills. Any other Task Assign by Management.Educational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceMaster of Business Administration (MBA)CACC preferredSkills Required: Accounts and Finance, Payment, Accounts PayableExperience RequirementsAt most 2 year(s)The applicants should have experience in the following business area(s):Garments,Textile,Group of CompaniesJob LocationGazipur (Sreepur)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361841964/",
    "job_id": "4361841964",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Customer Relationship Officer (For SIBL Foundation Hospital & Diagnostic Center)-Job ID: 1458202",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "SIBL Foundation Hospital & Diagnostic Center is looking for Customer Relationship OfficerJob Description / ResponsibilityJob Context:Ensure excellent service standards, respond efficiently to customer needs and maintain customer satisfaction as priority.Job Responsibilities:Day-to-day functions seated to OPD and IPD patients in providing information, cordially receiving all clients, maintaining admission procedure by using ERP software.Maintain and input all financial charge related to the patients services. Maintain software process to post all charge to patient’s accounts.Assist in preparing and implementing charges of different services in the accounting system as required.Monitor and collect receivables from individual Patients Report delinquent accounts to the authority.Data entry of all patient charges and refunds.Maintain billing and doctor’s payment log and complete all crossovers billing.Complete all Medicare billing forms and back-up information required.Keep in touch with the patient parties to realize all dues.Communicate with the clinical staff to ensure availability all appropriate patient information.Deal with sensitive medical information and maintain confidentiality.Comply with any other assignment as instructed by the authority.Educational RequirementsBachelor/Honors2nd Class Bachelor’s Degree with computer literacy.Experience RequirementsAt least 1 year(s)Additional RequirementsAt least 1 year in hospital reception and billing.Positive attitudeCo-operative to colleaguesPro-active and innovative in solving problemsInterpersonal skillsOwnershipHonesty & IntegrityRespect to individualsDepartmental employee shall apply through proper channelJob LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364594411/",
    "job_id": "4364594411",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Admin & Finance- For Uttaran- Job ID: 1459124",
    "location": "Cox’s Bazar, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Uttaran is looking for Officer - Admin & FinanceJob Description / ResponsibilityProject : Nari Shakti Samaz Shakti (NSSS)Station : Ukhiya, Cox’s BazarSupervisor : Project Field CoordinatorProject Background:Uttaran is a national development organization working in the coastal region of Bangladesh since 1985 to uphold rights and entitlements and to improve the socio-economic condition of the poor and disadvantaged. Uttaran facilitates in getting access to and control over resources by the poor and disadvantaged to improve agricultural productivity and economic empowerment.Uttaran with the assistance of Helvetas Swiss Intercooperation is implementing Nari Shakti Samaz Shakti (NSSS) project. The objective of the project is to establish a gender-transformative enabling environment that empowers women and marginalized groups to foster safer, inclusive, and resilient communities in the vulnerable contexts of Cox’s Bazar. The project focuses on protecting women host and refugee communities by enhancing resilience, reducing disaster vulnerabilities and creating alternative livelihood opportunities. This project has been implementing in 4 camps of Ukhyia upazila and 1 camp of Teknaf upazila.Job responsibilities:The Officer-Admin & Finance will manage financial operations to ensure smooth and compliant implementation of the Project and other organizational initiatives in collaboration and communication with Helvetia's finance teamAdministration:Maintains Administrative control with records such as commitments and expenditure; initiate and process administrative action relating to travel arrangements, payments, Procurements, and delivery of equipment, supplies of inventories.Manage day-to-day administrative functions including office supplies, logistics, inventory and facility management.Set up, classify and maintain appropriate files in the office. Ensure proper supplies of materials; manage office premises, Vehicles and inventories.Maintain personnel files, leave records and support recruitment processes as needed.Prepare procurement calendar for the project, vendor enlistment and relevant contract preparation.Provide assistance to all staff in district; manage entitlements and benefits, including travel claims, leave, etc in line with approved budget and updated records of all transactions accordingly.Keep all relevant documentation and updated records of all transactions accordinglyMaintain and Keep track of all assets purchased under the project.Support the organization on documentation of meetings, workshops, training sessions.Practice, promote and endorse the issues of safeguarding policy among team members and ensure the implementation of safeguarding standards in every course of action.Financial Planning and ReportingAnalyze profitability by comparing actuals with forecasts.Prepare monthly, quarterly, and annual financial plans following the approved budget.Develop financial projections for the Project and submit fund requisitions to donors as per partnership agreement.Generate accurate and timely financial reports for internal and external stakeholders.Create on-demand financial reports as required by Uttaran’s management and donors.Compliance and Risk ManagementEnsure compliance with IAS and BAS accounting systems in project operations.Follow updated VAT, tax, and revenue compliance as per Bangladesh government regulations (Incl. monthly VAT-TAX return).Deduct and Deposit VAT and tax to the government treasury within deadlines.Update VAT-TAX schedule monthly basis and submit along with financial reports.Monitor procurement processes to ensure policy and compliance adherence before payment.Maintain audit‑ready documentation at all times and support internal/external audits and respond to audit observations by preparing management responses.Financial Operations and Record MaintenanceManage daily financial transactions and maintain books of accounts.Preserve and organize all financial documents in audit‑ready condition, including vouchers, ledgers, bills, and reports in accordance with UTTARAN policy and donor guidelines.Verify that all expenditures are eligible, properly documented, and compliant before processing payments.Maintain and update inventory and asset registers in line with organizational policies.Safeguard cash, bank cheques, audit reports, agreements, and other sensitive documents.Team Collaboration and Capacity BuildingOrient project team members on financial policies, norms, and compliance requirements.Participate in staff coordination meetings, share financial updates, and plan accordingly.Collaborate with programmatic teams to verify expenditures and monitor project activities.Support Uttaran’s management and donors with regular coordination and communication.Educational RequirementsBachelor/HonorsMastersBachelor’s or Master’s degree in Accounting, Finance, or a related field.Experience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s):NGOAd",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364508205/",
    "job_id": "4364508205",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Law Officers for the Documentation Unit - (For Bank Asia PLC) - Job ID - 1458731",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Bank Asia PLC is looking for Law Officers for the Documentation UnitKey PointsProviding legal opinions on the Bank`s day-to-day operational, corporate, and banking matters and Drafting, vetting & reviewing various agreementsJob Description / ResponsibilityProvide legal opinions on the Bank’s day-to-day operational, corporate, and banking matters.Draft, vet, and review various agreements, including cross-border agreements, Memorandum of Understanding (MoUs), undertakings, indemnity bonds, charge documents, and related instruments.Draft, vet, and finalize documentation relating to syndication financing, project finance, loan, and security arrangements.Vet internal policies, guidelines, and Standard Operating Procedures (SOPs) to ensure legal compliance.Possess sound and practical knowledge of Mercantile Law, the Law of Contract, Land Laws, the Transfer of Property Act, and relevant laws relating to inheritance.Demonstrate a clear understanding of the Bank’s charge documents obtained at the time of loan disbursement and their legal implications.Prepare, draft, and file charge creation and satisfaction forms and related documents with the Registrar of Joint Stock Companies and Firms (RJSCF).Vet property documents to ascertain rights, title, and interests in immovable property.Be capable of identifying authentic documents and detecting forged or fabricated documents submitted in connection with property or financial transactions.Prior experience in a Bank’s Credit Administration or Credit Department will be considered an added advantage.Educational RequirementsMastersA degree in Law, preferably LL.M, with LL.B (Hons) from a recognized university.Enrollment with the Bangladesh Bar Council.Bar-at-LawAn MBA from a reputed university or an additional Bachelor’s degree in another discipline.Skills Required: Legal AffairsExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): BanksAdditional RequirementsAt least 2-3 years of relevant professional experience in a scheduled Bank, Non-Bank Financial Institution (NBFI), Multinational Company, reputed law firm, or active legal practice in relevant areas.Practical experience in handling criminal cases including matters under scheduled offenses of the Anti-Corruption Commission, the Penal Code, the Negotiable Instruments Act, Artha Rin Suits and other related laws.Qualification to practice before the High Court Division of the Supreme Court of Bangladesh.Job LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361487907/",
    "job_id": "4361487907",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Accounts & Finance - (For Importer) - Job ID - 1456793",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Importer is looking for Officer - Accounts & FinanceKey PointsWe are looking for a person who is strong and proficient in use of MS office and working experience in accounting Tally Software.Who experience in VAT, TAX, Customs & SRO.Who like to work indoor & outdoor.Job Description / ResponsibilityMajor Duties & Responsibilities:Maintain petty cash & prepare all kind of vouchers, cash book, bill register, general ledger & different register related to finance & accounts.Strong and proficient in use of MS office and working experience in accounting Tally Software.Accounts data entry into all level of accounting in the company.Prepare and check all kinds of bill vouchers, Journal entries as per rules and regulation.Prepare monthly salary, bonus sheet preparation.Practical knowledge about TAX & VAT Compliance, SRO, Customs Law.Practical knowledge about banking.VAT, TAX & other Challan preparation.Any other tasks assigned by management.Educational RequirementsBachelor of Business Administration (BBA)Master of Business Administration (MBA)Skills Required: General Banking, Accounting Data Entry, Accounting, Accounts and Finance, VAT and Tax, xero, Computer Literacy Fluency in English speaking and writing, Tally PrimeExperience Requirements2 to 5 year(s)The applicants should have experience in the following business area(s): Wholesale, Poultry, Fisheries, Importer,Hatchery,DairyJob LocationDhakaSalaryTk. 28000 - 32000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357486891/",
    "job_id": "4357486891",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Customer Relationship Officer- For Altus Group- Job ID: 1456351",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Altus Group is looking for Customer Relationship OfficerJob Description / ResponsibilityJob Highlights: We are ALTUS “a growing International call who must be Fluent in English.Recruitment and manpower duties / calling companies in English in EuropeAssist senior management in developing sales networks and strategiesMaintaining relationships with current and potential clientsIdentifying new recruitment opportunities via internetDeveloping and maintaining client target lists and informationDeveloping internal tools for improving and maintaining databasesMaintaining client and candidate information.Providing support to the senior managerBuilding and maintaining relationship with customers.Contract with the policy holders of the company, as well as provide them various policy information.Monitor renewal collection for attaining good result.Maintain a positive attitude focused on customer satisfaction.Educational RequirementsBachelor/HonorsExperience RequirementsAt least 1 year(s)Additional RequirementsInterpersonal and communication skills.Good speaking Style, Smart talker and attractive voice.Good English Skill.Excellent interpersonal and communication skills.Fluently Speaking English and Good sales ability is MUST.Excellent Communication Skill in English over the call and email.Have to talk in English with Client of Europe by Call or Email.Office rules regulation must have to be followed.Computer skills in MS Office (Word, Excel, PowerPoint) Must have the ability to work in a team.Freshers are also encouraged to apply.Must have very good knowledge in English.Must have knowledgeComputer Operating.Skills & ExpertiseComputer skill",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371114836/",
    "job_id": "4371114836",
    "source": "linkedin",
    "company_name": "PER",
    "job_title": "Chief Risk Officer, Investment Bank and Asset Management Firm, Bahrain",
    "location": "Bahrain",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About our clientThis is a senior leadership mandate with responsibility for the firm’s overall risk management framework. The Chief Risk Officer will oversee credit, market, liquidity, operational, investment, and regulatory risk across both banking and private markets activities, working closely with the CEO, Board Risk Committee, and regulators. What the job involvesLead and continuously enhance the enterprise risk management framework across banking, asset management, private equity, and real assetsOversee risk assessment and monitoring for private markets investments, including private equity, real estate, and other real assetsEnsure robust governance, policies, and controls across balance sheet investments and managed vehiclesAct as primary liaison with regulators on all risk-related matters, ensuring ongoing compliance with regulatory requirementsProvide independent challenge and guidance to investment, credit, and business teams on risk-return decisionsChair or participate in key risk, credit, and investment committeesDevelop and embed a strong risk culture across the organisationLead and develop the risk function, ensuring it scales in line with the firm’s growthWho we are looking forSenior risk professional with extensive experience in banking and investment environmentsStrong exposure to private markets, including private equity, real assets, and alternative investmentsBackground may include regulated banks, investment banks, asset managers, or principal investment platformsProven experience engaging with Boards, senior management, and regulatorsDeep understanding of credit, market, liquidity, and investment risk frameworksAbility to operate as a trusted advisor while providing independent challengeStrong leadership, communication, and stakeholder management skillsPrior experience in the GCC or broader Middle East strongly preferred",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4278566276/",
    "job_id": "4278566276",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "PGS নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318428944/",
    "job_id": "4318428944",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2802714550/",
    "job_id": "2802714550",
    "source": "linkedin",
    "company_name": "Marico Bangladesh Ltd.",
    "job_title": "Commercial Finance Manager",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3617625383/",
    "job_id": "3617625383",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Zatiq নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3522889268/",
    "job_id": "3522889268",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "HSBC hiring Customer Service Executive, Dhanmondi Branch ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4008382802/",
    "job_id": "4008382802",
    "source": "linkedin",
    "company_name": "For Electra International (Job ID : 1281860)",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]