[
  {
    "url": "https://www.linkedin.com/jobs/view/4355292641/",
    "job_id": "4355292641",
    "source": "linkedin",
    "company_name": "Nationwide Middle East Properties LLC",
    "job_title": "Senior Accountant",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355244361/",
    "job_id": "4355244361",
    "source": "linkedin",
    "company_name": "Nationwide Middle East Properties LLC",
    "job_title": "Assistant Accountant",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354233403/",
    "job_id": "4354233403",
    "source": "linkedin",
    "company_name": "dubizzle Egypt",
    "job_title": "Senior Sales Account Manager - Dubizzle Cars (Heliopolis)",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354233316/",
    "job_id": "4354233316",
    "source": "linkedin",
    "company_name": "dubizzle Egypt",
    "job_title": "Senior Sales Account Manager-Nasr City",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "dubizzle Egypt is the leading marketplace for selling and buying online in the region. Our aim is to upgrade people's lives by facilitating deals and identifying attractive opportunities for both individuals and businesses. Our goal is to strengthen local economies, empower small businesses, and help everyone in making smarter choices for themselves, the market, and the planet.As part of dubizzle, we are alongside some of the strongest classifieds brands in the market. With a collective strength of 8 brands, we have more than 160 million monthly users that trust in our dedication to providing them with the best platform for their needs.As a Sales Account Manager your purpose is to seek new business opportunities by contacting and developing relationships with potential customers. They are responsible for developing leads from marketing campaigns and meeting sales quotas. They cultivate strong relationships with customers and ensure proper after-sales service. Ultimately, he/she will boost sales and contribute to dubizzle long-term business growth.In this role, you will: Communicate effectively to manage clients' expectations and ensure they receive a great dubizzle experience Achieve monthly (Targets renewal and acquisition with consistency) Become an expert on the Egyptian Real Estate market through combining the on-ground insights with dubizzle high level overview and data Increase our market share by selling our products to new customers Manage and arrange meetings with clients for acquisition, renewals, upgrade Increase our client satisfaction by performing account management services with them Regularly update reporting dashboard to reflect all sales activities Liaise with Finance, Customer Support, legal and Marketing department for any sales-related or client-related issues Collect market insights and keep up to date with laws and local development news. RequirementsBachelor's degree in marketing or sales or related field Excellent in English Communication written and speak 3 to 5 years of relevant sales experience Has a successful record in exceeding or achieving the assigned targets consistently Experience in farming and cold calls Knowledge of the real estate market in Egypt Knowledge of the Subscription industry Familiar with tech, ecommerce Familiar with Prop tech, Market place, Facebook, and other digital platforms Excellent in prospecting, cold calls and generating leads Excellent communication, negotiation, time management and presentation skills Excellent in converting lead into paying customer Positive/Flexible/Presentable/Committed Eager for success Has plug and play attitude Benefits A fast paced, high performing team. Comprehensive Health Insurance Life Insurance Rewards & Recognitions Learning & Development opportunities #Egyptdubizzle Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355977268/",
    "job_id": "4355977268",
    "source": "linkedin",
    "company_name": "Ethos Specialty Insurance Services LP",
    "job_title": "Analyst, Tax",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362505508/",
    "job_id": "4362505508",
    "source": "linkedin",
    "company_name": "CHAGEE",
    "job_title": "Tax & Reporting Manager (Vietnam)",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365229828/",
    "job_id": "4365229828",
    "source": "linkedin",
    "company_name": "Abu Dhabi Aviation",
    "job_title": "Commercial & Finance Administrator",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359136601/",
    "job_id": "4359136601",
    "source": "linkedin",
    "company_name": "Acumen",
    "job_title": "Legal Counsel, Hardest-to-Reach Amplify",
    "location": "Nairobi, Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369747706/",
    "job_id": "4369747706",
    "source": "linkedin",
    "company_name": "Profile Middle East LLC",
    "job_title": "Commissioning Manager",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364261142/",
    "job_id": "4364261142",
    "source": "linkedin",
    "company_name": "Filinvest Development Corporation",
    "job_title": "Compliance Manager (Utilities)",
    "location": "Muntinlupa City, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company: Philippine DCS Development Corp. (PDDC)Work Location: AlabangJob Summary: To ensure PDDC’s compliance with Philippine laws and other statutory and regulatory requirements.Key Responsibilities:Ensure PDDC’s compliance with statutory/regulatory requirements and other applicable laws.Initial Expected Output/Key ResultsSubmission of DENR and DOLE-required reports such as the Compliance Monitoring Report (CMR), Occupational Health & Safety Program and subsequent reports.Establish PDDC’s Compliance DepartmentLead the creation and implementation of PDDC’s sustainability, energy conservation and management, and occupational health and safety programs.Draft and process the approval of the relevant programs (energy management, environmental/health/safety)Conduct subsequent audits.TECHNICAL COMPETENCIES AND SKILLS:Strong leadership and team management skills, with the ability to inspire and motivate a diverse team.Excellent communication, negotiation, and presentation skills.Strategic thinker with strong analytical and problem-solving abilities.Ability to build relationships at all levels of the organization and with external customers/partners.Proficiency in MS Office and other data analysis tools.EDUCATION, TRAININGS, LICENSES REQUIRED:Must be a Certified Energy Auditor (CEA)With at least 3 years of experience in leading energy conservation, management and audit.Degree in Engineering, preferably in the areas of mechanical, electrical, civil, chemical, environmental and sanitaryPreferences:Certified Energy Manager and/or Certified Conservation OfficerCompleted the Basic PCO Training Course by an EMB-recognized training organization/institution within the last 3 years.Safety Officer 3 (SO3) under DOLE DO 252-25 (SO4 is a plus) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355300392/",
    "job_id": "4355300392",
    "source": "linkedin",
    "company_name": "KuCoin TR",
    "job_title": "Accountant",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354157802/",
    "job_id": "4354157802",
    "source": "linkedin",
    "company_name": "PwC South Africa",
    "job_title": "Junior Financial Modeller",
    "location": "City of Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354232883/",
    "job_id": "4354232883",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive / Assistant Manager- Supply Chain Management (For Sekandar Builders Ltd.)-Job ID: 1452566",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355212771/",
    "job_id": "4355212771",
    "source": "linkedin",
    "company_name": "Vale",
    "job_title": "Internal Audit Analyst (APAC & EME)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "JOB SUMMARYPerform risks- and value-based internal audit engagements by evaluating adequacy and efficiency of control measures in response to risks, with a focus on operational, finance and compliance audits. Conduct audits in accordance with internal audit best practices, IIA standards and VALE Internal Audit Charter. Add value and support VALE shareholders and management in achieving the strategic ambitions of the Company.MAIN CHALLENGESAble to grasp new concepts quickly, knowledgeable about risks, including but not limited to technology and fraud risks and being able to identify and assess risks and business impact.Apply innovation in audits.Able to complete audit deliverables and ad hoc projects within established timelines and contribute towards the achievement of department’s goals.Liaise with multicultural employees at different levels, including the top management on a regular basis.Flexible to travel 20%-40% of the time globally, including to remote locations.Able to operate across different time zones and locations. MAIN RESPONSIBILITIES Be a strategic advisor to the business, proactively identify and analyze risks to the business and provide recommendations to address risk factors.Conduct/Lead audit assignments, identify/analyze current and potential risk factors, assess adequacy of measures through effective use of data, technology and analytics.Collaborate with management to identify practical and effective solutions and prepare audit reports.Assess risks to the business based on understanding of processes and controls, review risk tolerance and ensure adequate controls are in place.Improve the level of governance, safeguard the Company’s assets and ensure the integrity of financial and operational information complies with applicable laws, standards and internal norms.Follow up with departments on audit action plans to ensure audit points are addressed and resolved.Design robust test procedures to ensure that risks are addressed, develop new audit programs and finetune existing programs per international auditing standards, Internal Audit Charter and internal procedures.Maintain proper communication and documentation related to audit engagements, and collaborative relationships with different stakeholders.Contribute to the continuous improvement of the department’s processes, support the interpretation of internal and external regulations and participate in internal work groups.Provide ad hoc support to Whistleblower Channel to investigate and/or oversee allegations. Take ownership for self-development and support the development of others.EXPERIENCE & QUALIFICATIONS Bachelor Degree in Finance / Accountancy / Business Administration or related disciplines.At least 4-7 years of relevant work experience, Big 4 accounting firms experience will be a plus.Knowledge and experience with new technology that will enhances productivity and effectiveness including but not limited to artificial intelligence, productivity tools, data intelligence is highly preferred. Proficient in Internal Controls, Risks, Project Management, Fraud Investigation, Data Analysis.Working knowledge of key business processes such as accounting, finance, project management, HR, sales, inventory, procurement, contracts, maintenance.Able to speak, read and write comfortably in English. Proficiency in Mandarin required due to frequent interactions with Chinese stakeholders.Professional accreditations in CA/CPA, CIA, CFE, CISA highly preferred.Analytical, communication and presentation skills.Able to work independently and in a team. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365225045/",
    "job_id": "4365225045",
    "source": "linkedin",
    "company_name": "Three Eight Six",
    "job_title": "Senior Accountant",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355243950/",
    "job_id": "4355243950",
    "source": "linkedin",
    "company_name": "Nedbank",
    "job_title": "Senior Audit Manager: CIB",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355223366/",
    "job_id": "4355223366",
    "source": "linkedin",
    "company_name": "Nedbank",
    "job_title": "Senior Manager Credit Support",
    "location": "Sandton, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358052657/",
    "job_id": "4358052657",
    "source": "linkedin",
    "company_name": "Al Tayer Group",
    "job_title": "Office Services Executive",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job PurposeThe Office Services Executive provides comprehensive administrative, logistical and coordination support to the Group Company Secretary’s Office. This role ensures effective delivery of Board-related services, departmental administration, and stakeholder support, with a strong emphasis on professionalism, accuracy, and relationship management. Essential Roles and ResponsibilitiesBoard Logistics & Travel CoordinationCoordinate all travel, hotel, transportation, catering, itinerary planning, and logistics related to onsite Board and Committee meetings.Liaise with other relevant internal functions and the Travel Agency to manage LPO requirements and ensure timely issuance of tickets, confirmations, and other travel‑related arrangements.Provide general support to Board members, including assisting with travel-related queries, HR/IT requests, and meeting-specific arrangements.Board Administration & CalendarsCoordinate with the Board Secretary on establishing annual calendar and scheduling ATG subsidiary board/committee meetings, and other director meetings as required, including with ATG senior management.Oversee meeting coordination by securing availability for attendance, issuing invitations, and ensuring participants are kept informed and aligned.Coordinate internal and external meetings for Board members across multiple time zones.Support Board member induction and offboarding administrative processes.Record-Keeping and DocumentationRecord notes and action points from team meetings and follow up to ensure actions are tracked and completed.Maintain organized document management repositories to ensure efficient storage, access, and upkeep of physical and digital governance records.Invoicing Processing & PaymentsManage end‑to‑end processing of Board member invoices, including preparation, approvals, submission to Finance, and tracking of monthly, quarterly, and ad‑hoc payments.Assist with expense processing for Board members as required.Departmental & Office AdministrationProvide comprehensive administrative support to the team including call handling, correspondence, team and stakeholder meeting scheduling and coordination, maintaining the department calendar, coordinating team travel, and processing expenses and invoices.Manage printing and stationary requisitions, consumables, access permissions, meeting room resources, and general office requirements.Job RequirementsEducation/Certification and Continued Education Graduate degree in any disciplineDiploma in Secretarial practices would be an advantageYears of ExperienceMinimum 10 years’ experience Knowledge and Skills Excellent organizational skills and attention to detail.Strong interpersonal skills – ability to build strong relationships with individuals at all levels of an organization.Strong written communication skills.Ability to exercise discretion and maintain confidentiality.Reliable, proactive and self-motivated.Proficient at Outlook and Word.Prior experience in event organization is highly beneficial. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354109487/",
    "job_id": "4354109487",
    "source": "linkedin",
    "company_name": "RLDatix North America",
    "job_title": "HR & Admin Officer",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362025579/",
    "job_id": "4362025579",
    "source": "linkedin",
    "company_name": "HCLTech Sri Lanka",
    "job_title": "Senior Analyst",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Senior Analyst/ Team Lead – Accounts PayableHCLTech Colombo, Western Province, Sri Lanka (On-site)📍 Location: Colombo, Western Province, Sri Lanka🏢 Company: HCLTech Sri LankaAre you passionate about accounting and finance operations and process excellence? Join our dynamic team at HCLTech Sri Lanka as a Senior Analyst/ Team Lead – Accounts Payable, where you'll play a key role in managing AP processes.Key Responsibilities:Execute full-cycle Accounts Payable operations: indexing, invoice processing, troubleshooting, T&E claim handling, and quality audits.Collaborate with internal and external stakeholders to resolve open issues efficiently.What We’re Looking For:Strong understanding of Accounts Payable processes.Excellent communication and stakeholder management skills.More than 4 year experience in Accounts Payable.Having team management experience more than 1 year.Ability to work in a fast-paced, transformation-driven environment.Apply now and be part of a global tech leader driving innovation and excellence in finance operations. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4336343460/",
    "job_id": "4336343460",
    "source": "linkedin",
    "company_name": "Encora Inc.",
    "job_title": "System Analysts",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "System AnalystWe have centralized and standardized the technology components into Singapore, creating a global footprint which can be utilized for supporting our regional subsidiaries and the branches around the world. We operate and support 19 countries with this architecture to provide a secure and flexible banking infrastructure.Our Operations divisions provide transactional customer services for our businesses while also focusing on cost efficiency through process improvements, automation and straight through processing.Experience: 6 yearsJob Mode: ContractWork Mode: On-siteResponsibilities Responsible for installing, configuring, testing and maintaining Informatica PowerCenter software Responsible for reviewing and understanding requirements and translating them into high-level and low-level documentation including source to target mapping Responsible for building of data mappings, sessions and workflows to meet requirements (Informatica 10.x or higher) Responsible for development of job schedules that integrate the upstream and downstream systems (e.g. Control-M) Responsible for unit testing, debugging, and performance testing, with key focus on data accuracy and integrity Accountable for on-time delivery of all documentation, design, build, testing, and deployment according to the work breakdown structures Work with production support teams as required to support production activities, including production migrations, continuity testing, environment migration activities Must have impeccable written and oral communication skills down to the mapping documentation level Ensure that documentation is captured, maintained, understood by and available to business and/or IT partnersEscalate critical technical issues and potential problems as needed to the Project Manager to address any related issues in advance of deadlinesRequirements: Should be independent, quick learner and team player Able to work independently with minimum guidance Have good communication skills (to work with various levels) Minimum 4 years or above with the relevant experience Proficiency in Informatica PowerCenter 10.x or higher preferably in a Unix (Linux/AIX) environment with AS400/Oracle sources and targets. Must have experience in Oracle 19c or higher (SQL*Plus, PL/SQL)/Experience in Unix Shell Scripting (Linux/AIX) Experience Job scheduling tools like Control-M Good to have experience in Change Control Management tools & Visio Have experience on all stages of Software Development Life Cycle (SDLC) Able to do requirement gathering, impact analysis, ETL mapping, build, unit testing, support SIT/UAT/ProductionAble to organize and prioritize assignments in a fast-paced and deadline-oriented environmentKey Domain/ Technical Skills: Proficiency in Informatica PowerCenter version 10.x or higher Experience in setting up, upgrading and troubleshooting Informatica PowerCenter infraExperience in analyzing and producing technical mapping design specificationsAbout EncoraEncora is the preferred digital engineering and modernization partner of some of the world’s leading enterprises and digital native companies. With over 9,000 experts in 47+ offices and innovation labs worldwide, Encora’s technology practices include Product Engineering & Development, Cloud Services, Quality Engineering, DevSecOps, Data & Analytics, Digital Experience, Cybersecurity, and AI & LLM Engineering.At Encora, we hire professionals based solely on their skills and qualifications, and do not discriminate based on age, disability, religion, gender, sexual orientation, socioeconomic status, or nationality. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365228835/",
    "job_id": "4365228835",
    "source": "linkedin",
    "company_name": "Maybank",
    "job_title": "IT Cyber Audit",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370736023/",
    "job_id": "4370736023",
    "source": "linkedin",
    "company_name": "Altis Recruitment",
    "job_title": "Senior Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Location: Canada, Hybrid with 3 days on-site and 2 days remoteLanguage: Strong written and spoken English communication requiredBackground Check Requirement: Standard employment verification and background screeningAbout the OpportunityOur client, a well established national organization within the retail and consumer services sector, is seeking a Senior Accountant to join their corporate finance team. This is a high impact role that blends month end reporting with planning and business partnership, giving you visibility across multiple departments and leaders.You will work closely with a small, collaborative team and senior finance leaders who value mentorship and development. With exposure to both operational finance and corporate governance, you will help deliver accurate reporting while influencing smarter business decisions across the organization.What’s in it for YouYou will join a people first culture that invests in growth, learning, and long term career progression. Expect hands on coaching, meaningful exposure to leadership, and the chance to move into broader finance roles over time. The team values balance, flexibility, and collaboration, with a hybrid schedule and a supportive environment where your contributions are recognized.Your ResponsibilitiesYou’ll lead monthly close activities including journal entries, reconciliations, and preparation of financial statements and schedulesYou’ll analyze results, investigate variances, and provide clear commentary and insights to finance leadersYou’ll partner with shared services, global teams, and corporate stakeholders to deliver forecasts, plans, and reporting requirementsYou’ll support budgeting and forecasting, and assist with various ad-hoc analysis and requests for special projectsYou’ll strengthen internal controls and ensure compliance with financial policies and governance standardsYou’ll contribute to process improvements and system modernization initiatives that enhance efficiency and data qualitySkills and Qualifications2 to 4+ years of progressive accounting or financial reporting experienceBachelor’s degree in Accounting, Finance, or related field, CPA designation or actively pursuingStrong understanding of month end close, reconciliations, and internal controlsAdvanced Excel skills with experience in ERP systems, ideally Oracle or shared services environmentsAnalytical mindset with the ability to translate data into actionable insightsProactive, detail oriented, and comfortable working in a fast paced, high accountability settingNote from the Hiring Manager“We’re looking for someone curious, ambitious, and eager to grow. If you want a place where you’ll be coached, challenged, and given real exposure to the business, this team will help you build a strong foundation for your finance career.”Why Partner with AltisIf you’ve never worked with a staffing agency before, we make it easy. We work with top employers across Canada who have great jobs to fill, each vetted and verified by our team. When you apply for a job with Altis, we get to know you as a candidate and learn what your strengths are. Then, if you’re a solid match, we handle all the logistics, advocating for you as a candidate for the role, providing access to coaching and connecting you directly with the hiring manager. And rest assured, all our services are free of cost for candidates. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354849267/",
    "job_id": "4354849267",
    "source": "linkedin",
    "company_name": "Medicana Sağlık Grubu",
    "job_title": "Bordro ve Özlük İşleri Uzmanı",
    "location": "Ataşehir, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368087786/",
    "job_id": "4368087786",
    "source": "linkedin",
    "company_name": "THE FLORA GROUP",
    "job_title": "Accounting Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371790713/",
    "job_id": "4371790713",
    "source": "linkedin",
    "company_name": "Ericsson",
    "job_title": "MOAI Business Finance CFO Office",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Join our TeamAbout this opportunity:We are here to perform strong performance drive on MOAI Business & Financial with value based financial insights which trigger proactive actions, To empower better decision-making & to drive financial performance to the right direction. We invest in the growth and development of our teams to deliver on our mission. We embrace digital transformation to create transparency, accelerate outcomes, and amplify our impact. We aspire to be a trusted, best in class Business Finance function.Ericsson is seeking an analytical and forward-thinking Financial Analyst to join our expanding team. In this crucial role, you will not only conduct meticulous financial analyses and projections based on our unit's targets, but you'll also craft and convey insightful reports that aid critical business decisions. As our Financial Analyst, you will act as the lynchpin of our financial planning and performance evaluations, ensuring our processes are in line with global protocols and designed to endorse value-creation.What you will do: Drive MA Financial Performance : Financial Planning, Target Setting, Financial Forecast Financial Closing, CU.MA Governance, Credit Management Support MA CFO & Other stakeholders with value based financial insights Drive financial model, cost management, including OPEX, ACOS, Hourly rate etc. Act as main interface to GF finance while ensuring close collaboration with MA/CU finance team Implement strong Management reporting. Creation of data visualization & Strategic insight (data storytelling) Drive Automation & Simplification. Utilize financial data to optimize business performanceWhy join Ericsson?At Ericsson, you´ll have an outstanding opportunity. The chance to use your skills and imagination to push the boundaries of what´s possible. To build solutions never seen before to some of the world’s toughest problems. You´ll be challenged, but you won’t be alone. You´ll be joining a team of diverse innovators, all driven to go beyond the status quo to craft what comes next.What happens once you apply?Click Here to find all you need to know about what our typical hiring process looks like.Encouraging a diverse and inclusive organization is core to our values at Ericsson, that's why we champion it in everything we do. We truly believe that by collaborating with people with different experiences we drive innovation, which is essential for our future growth. We encourage people from all backgrounds to apply and realize their full potential as part of our Ericsson team. Ericsson is proud to be an Equal Opportunity Employer. learn more.We are proud to announce at Ericsson, our employees have once again voted us as a Great Place to Work® and we have been officially Certified™ in 2025. Every year, more than 10,000 organizations from over 60 countries partner with the Great Place to Work® Institute for assessment, benchmarking and planning actions to strengthen their workplace culture and this Certification acknowledges our employees value their employee experience and our workplace culture.Primary country and city: MOAI RegionReq ID: 781082",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353962736/",
    "job_id": "4353962736",
    "source": "linkedin",
    "company_name": "Gorenje Bulgaria",
    "job_title": "Financial Controller",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362115689/",
    "job_id": "4362115689",
    "source": "linkedin",
    "company_name": "Grameen HealthTech Limited",
    "job_title": "Management Accountant",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionGrameen HealthTech Limited, a subsidiary of Grameen Group under Grameen Telecom Trust, is transforming healthcare in Bangladesh through digital, on-demand, end-to-end health services. Rooted in a strong legacy of social responsibility and innovation, the company delivers comprehensive healthcare solutions ranging from preventive to specialized care. By leveraging technology to overcome geographical barriers, it ensures accessible, personalized, and high-quality healthcare, with a strong focus on clinical excellence, customer experience, and long-term community wellbeing.Role ObjectiveAs a Management Accountant at Grameen HealthTech Limited, you will bridge the gap between traditional accounting and strategic decision-making. Beyond day-to-day financial operations, your primary focus will be providing the internal management team with the data, analysis, and insights necessary to drive the company’s growth, optimize costs, and ensure long-term financial sustainability.Department: Finance & AccountsLocation: Head Office, DhakaReports to: Chief Financial Officer (CFO)Key Responsibilities1. Revenue Assurance & Billing OperationsRevenue Integrity: Implement revenue assurance protocols for all products (B2B & B2C) to prevent leakage and ensure 100% billing accuracy.Invoicing & Dispatch: Generate invoices for all services and ensure timely dispatch to clients, partners, and relevant parties.Reconciliation: Reconcile sales data with collections to ensure all rendered services are properly accounted for.2. Strategic Analysis & Business SupportPartner with B2B, B2C, and Operations departments to evaluate business cases and service viability.Conduct feasibility studies and provide financial recommendations (Approve/Reject/Modify) for new projects or service launches.Analyze the company’s cost structures and develop comprehensive cost optimization strategies for the CFO to enhance profitability.3. Budgeting & Financial ControlLead the preparation and coordination of the Annual Budget.Perform variance analysis (Actual vs. Budget) and implement regular controls to ensure departmental spending remains within limits.Monitor Key Performance Indicators (KPIs) to track business health and financial trajectory.4. Reporting & MISPrepare and present Weekly MIS reports for the Management Committee, highlighting trends, revenue performance, and operational hurdles.Generate monthly financial statements, including Income Statements and Balance Sheets, ensuring they reflect the true economic state of the business.5. Operational Excellence & ComplianceOversee day-to-day bookkeeping and ledger maintenance using Tally accounting software.Calculate Tax and VAT obligations, prepare returns, and ensure 100% compliance with tax authority deadlines.Requirements & QualificationsEducation: BBA/MBA in Finance or Accounting. Professional enrollment or part-qualification in CMA, ACCA, or CA is highly preferred.Experience: 5-7 years of experience with a strong analytical background and a proven management accounting mindset.Technical Skills: Advanced proficiency in Tally Prime/ERP. Expertise in MS Excel (financial modeling, data visualization, and complex formulas).Competencies: Strong commercial acumen, ability to challenge the status quo with data-driven insights, and excellent presentation skills.Why Join Grameen HealthTech?This role offers a unique opportunity to move beyond \"record-keeping\" and become a strategic partner in a mission-driven organization. You will have a direct impact on how we scale our health-tech solutions to serve the community while ensuring the financial robustness of our operations.How to ApplyInterested candidates should submit their CV and a cover letter highlighting their experience to hr@ghl.healthcare with the subject: \"Application for Management Accountant – [Your Name]\".",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354222986/",
    "job_id": "4354222986",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Accounting Officer (For Best tech engineering) - Job ID - 1452445",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Best tech engineering is looking for Senior Accounting OfficerWorkplaceWork at officeEducational RequirementsBachelor of Commerce (BCom)Master of Commerce (MCom)বি.কম/এম.কম পাস।Experience RequirementsAt least 5 year(s)The applicants should have experience in the following business area(s): Garments,Group of CompaniesAdditional Requirementsসুয়েটার ফ্যাক্টরী / গার্মেন্টস এ কমপক্ষে ৫ বৎসরের হিসাব বিভাগে কাজের বাস্তব অভিজ্ঞতা ওএকক ভাবে হিসাব বিভাগ পরিচালনায় দায়িত্ব ও দক্ষতা থাকিতে হইবে।কর্মস্থল গাজীপুর।Job LocationGazipur",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4305315851/",
    "job_id": "4305315851",
    "source": "linkedin",
    "company_name": "For Great Wall New Energy",
    "job_title": "Account and Finance Officer",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372516851/",
    "job_id": "4372516851",
    "source": "linkedin",
    "company_name": "Arup",
    "job_title": "Junior Administrator",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A career at Arup offers you the chance to make a positive difference in the world. Independently owned and independently minded, Arup is the creative force at the heart of many of the world’s most prominent projects in the built environment. We believe that flexible arrangements, such as hybrid working, create a more inclusive way of working that supports our diversity and the wellbeing of our people.Dedicated to sustainable development, Arup is a collective of designers, consultants and experts working globally. Founded to be humane and excellent, we collaborate with our clients and partners using imagination, technology, and rigour to shape a better world.Junior Administrator (Dublin)Are you passionate about making a difference where you live and work? At Arup, our primary goal is to develop a truly sustainable built environment. Join Arup, and you will find yourself in a place where imagination, technology and rigor meet to solve some of the world’s most urgent challenges.For over 75 years, Arup has pushed the boundaries of what design and engineering can achieve. Founded by Ove Arup in 1946, we are an independent and purpose-driven firm with over 18,000 designers, engineers, planners, advisors, and experts from many disciplines worldwide. In Ireland, we have more than 800 staff in our offices in Dublin, Cork, Galway, and Limerick.We are currently looking to recruit a junior administrator to join our team in our Dublin HQ. This is an exciting and challenging role and the successful candidate will work in a fast-paced environment. As a receptionist in our Dublin office, the successful candidate will be the interface between the company and our clients, the friendly face that greets visitors and manages the front desk of our organisation. Your role is crucial as you will be the first point of contact for clients and guests.Your responsibilities⦁ Meet and greet all guests/clients.⦁ Answer all switchboard calls and dispatch callers to the most appropriate internal staff member in a prompt and professional manner.⦁ Ensure that the front office is managed efficiently and that all visitors/calls are dealt with in a timely, professional and friendly manner.⦁ Manage all incoming and outgoing correspondence by mail and email.⦁ Providing general administration support including processing invoices, booking meeting rooms where required and other administration duties.⦁ Dealing with and booking travel request.⦁ Post management (sign for all deliveries, distribute deliveries, ensure post is ready for collection)⦁ Assisting with any ad hoc duties that may arise.Your Education/Profile⦁ 2+ years experience in an Administrator role within a corporate environment⦁ Familiarity with receptionist tasks and general office coordination.⦁ Excellent telephone manner⦁ Excellent communications and interpersonal skills⦁ Professional demeanour, excellent customer service skills⦁ Good working knowledge of MS Word, Excel and Outlook⦁ Minimum Leaving Certificate education or equivalent⦁ ECDL or equivalent computer qualificationWhat to expect at Arup:⦁ A multicultural and informal working environment where you can develop professionally by being part of a team who enjoy what they do.⦁ Opportunities for short or long assignments at Arup’s offices and projects anywhere in the world.⦁ Employees are eligible for the Global Profit Share scheme, which is dependent on the firm’s financial performance.⦁ Competitive performance-based salary growth.⦁ A strong corporate culture committed to its values: quality of work, holistic approach, humane organization, straight and honourable dealings, social usefulness and reasonable prosperity.⦁ Continuous training and professional development that will allow you to adapt to the growing needs of our clients as we embrace digital transformation.⦁ You will be expected to become a member of a relevant and necessary professional organisation.Join us in shaping a better world.Our goal is to shape a better world, finding solutions for some of the world’s most complex problems. From climate action to social value, we consider the most expansive impacts of our work. Our drive to build a more sustainable, resilient and equitable future shapes our culture and has made us leaders in sustainable development. The successful candidate will join our multi-disciplinary design teams focusing on technical excellence and innovative solutions that create a better future for people, places, and the planet.'A better way'- Sustainability and Social EquityAt Arup, we strive to bring environmental sustainability and social equity together. We put sustainability at the heart of our projects and invest in research and development that helps tackle issues such as climate change and poverty. We have made a commitment to reach net zero by 2030 and to contribute meaningfully to the UN Sustainable Development Goals, creating shared value for our clients and our communities while safeguarding our planet. Read our net zero carbon plan here.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365279605/",
    "job_id": "4365279605",
    "source": "linkedin",
    "company_name": "Le Meas Executive Search",
    "job_title": "Head of Accounts Payable - Aircraft Leasing",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Accounts Payable – Aircraft Leasing My client – a leading aircraft leasing firm have an immediate requirement for the head of accounts payable in DublinThis role would suit an experienced Accounts Payable manager who has experience managing a team (4-5 staff) and is interested in working in a fast paced environment.Reporting to the Financial Controller this role will be responsible for Review, reconciliation, posting and allocation of invoices on General LedgerTimely and accurate generation and processing of paymentsData analysis and management reportingManagement of supplier queriesBank reconciliationsAssisting with VAT & CT calculationsGeneral administrationRequirements:5+ years Accounts Payable experiencePrevious management experience in Accounts PayablePrevious Aircraft Leasing experience an advantage but not essentialIf you are interested in this role please send a CV in confidence to Richard Goggin.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370956663/",
    "job_id": "4370956663",
    "source": "linkedin",
    "company_name": "Carne Group",
    "job_title": "Fund Valuations Manager",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Fantastic opportunity for a Valuation Manager to join the dynamic, growing Valuation’s function in Carne Group - the premier provider of Fund-Management solutions to asset managers across the world.What are the minimum requirements you need for the role?4-6 years of experience in valuation or management of complex investments through similar Asset Management, Advisory, Accounting, Banking or other similar roles.Direct experience in the fair market value assessment of one or more of the following sectors: Private Equity, Direct Private Debt, Leveraged Finance, Distressed Investments, Infrastructure and/or Real Estate required.Hold a relevant professional qualification such as CFA, FRM and/or CAIA.Excellent PC skills., knowledge of Python, Power BI or similar an advantageProfessional fluency in English (written and spoken).Knowledge of AIFMD, relevant legal regulatory frameworks would be considered as an advantageWhat is your role and your responsibilities?Manage and execute the valuation assessment of an allocated portfolio of client funds of complex illiquid investments held within funds managed by Carne on behalf of its clients through the application of relevant approaches and theory.Ensure excellence in all aspects of valuation assessment and reporting to Senior Management and the Board of Directors of the Management Company, regulatory authorities, auditors and Board of Directors of the funds while ensuring deadlines are met.Develop, implement robust valuation policies for each client AIF manage and ensure ongoing adherenceLiaise directly with Carne’s clients and its delegates (e.g. fund administrators, auditors, third party valuation agents etc..) to resolve valuation issues as they ariseWorking with financial models for discounted cash flow, market multiple and comparable market transaction analysisPreparing and presenting valuation analysis and reporting to clients in a clear and concise mannerContributing directly to the development of proposals, presentations and white papers and presenting them to current and prospective clientsDevelop and conduct internal trainings on ongoing basis on valuation methods and models, to the valuation team;Performing in-depth client, industry, market and competitor researchWhat Competencies do you require?Teamwork (Team player): Develops relationships within and across teams, working collaboratively to resolve potential challenges quickly.Effective Communication: Communicates effectively, engaging with others in a warm and professional mannerPlanning and Organising: Organises and plans work effectively, ensuring delivery to quality and timescales in the short and longer termAnalytical (Attention to detail): Analyses and understands relevant and complex information and data to draw appropriate insights.Strategic Focus (Problem-Solving): Thinks strategically, thrives on innovation, considers the wider picture to identify new approaches to enhance business impactAdaptability: Adapts approach and responds effectively to different situations, people and new opportunitiesDrive and Motivation: Highly motivated and driven, able to focus on what needs to be achieved and enthuses others to do this.Client-centric focus: Motivated by customer-facing environments, understanding their needs, and providing a good service.Who is Carne Group?Carne Group has established itself in the funds industry with $2tn in AUM supported by 600+ staff and four regulated management companies. Together with a large team of industry specialists, Carne serves more than 650+ traditional and alternative asset management clients from key fund jurisdictions and financial hubs including Ireland, Luxembourg, Zurich, Lisbon, London, New York, Cayman and Channel Islands.Excellence and innovation are central to Carne’s work and we are committed to attracting and retaining the best talent to deliver an unrivalled service to our clients. Whilst working with Carne, you will be provided with opportunities to develop your skills and experience by working in a dynamic, innovative, and multicultural environment where exciting careers are built.We love hearing from anyone who is enthusiastic about changing the asset management industry. Not sure if you meet all the requirements? Let us decide! Research shows that members of other under-represented groups tend not apply to jobs when they think they may not meet every qualification, when in fact, they do! At Carne we are committed to creating a diverse and inclusive environment and strongly encourage you to apply.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4178261641/",
    "job_id": "4178261641",
    "source": "linkedin",
    "company_name": "Recover নিয়োগ",
    "job_title": "Finance Director",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4129829747/",
    "job_id": "4129829747",
    "source": "linkedin",
    "company_name": "Accounts (For Pretty Group)-Job ID ...",
    "job_title": "Manager / Senior Manager",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4170459671/",
    "job_id": "4170459671",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "Assistant Manager ( Accounts & Finance)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3375383916/",
    "job_id": "3375383916",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Daraz hiring Tax Manager- Finance in Dhaka, Bangladesh",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4280615173/",
    "job_id": "4280615173",
    "source": "linkedin",
    "company_name": "(For A. Wahab & Co)-Job ...",
    "job_title": "Chartered Accountant (Assistant Director)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3966532884/",
    "job_id": "3966532884",
    "source": "linkedin",
    "company_name": "(For Reputed Chartered Accountancy Audit Firm)",
    "job_title": "CA Article Student",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4298779839/",
    "job_id": "4298779839",
    "source": "linkedin",
    "company_name": "Commure",
    "job_title": "Senior Accountant (Bangladesh)",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355310802/",
    "job_id": "4355310802",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Manager, Accounts & Finance (Team Lead)- For Agni Systems PLC - Job ID: 1452228",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354252803/",
    "job_id": "4354252803",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Accounts & Finance - (For Mugnee Multiple Limited) - Job ID - 1452461",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355310227/",
    "job_id": "4355310227",
    "source": "linkedin",
    "company_name": "VentureOne",
    "job_title": "Corporate Finance Manager",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345395097/",
    "job_id": "4345395097",
    "source": "linkedin",
    "company_name": "Yes4All",
    "job_title": "Finance Planning & Analysis Associate Manager",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362195764/",
    "job_id": "4362195764",
    "source": "linkedin",
    "company_name": "Redstone Agency Inc.",
    "job_title": "Staff Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360997159/",
    "job_id": "4360997159",
    "source": "linkedin",
    "company_name": "SecAI",
    "job_title": "Enterprise Account Sales Manager",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365258638/",
    "job_id": "4365258638",
    "source": "linkedin",
    "company_name": "Honeywell",
    "job_title": "Senior Account Manager - Flame and Gas Detection",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365251724/",
    "job_id": "4365251724",
    "source": "linkedin",
    "company_name": "Bosch Africa",
    "job_title": "Key Account Manager - Power tools",
    "location": "El Matar, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355282618/",
    "job_id": "4355282618",
    "source": "linkedin",
    "company_name": "dubizzle Egypt",
    "job_title": "Sales Account Manager - Dubizzle Cars (Heliopolis)",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355310749/",
    "job_id": "4355310749",
    "source": "linkedin",
    "company_name": "dubizzle Egypt",
    "job_title": "Sales Account Manager-Nasr City",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "dubizzle Egypt is the leading marketplace for selling and buying online in the region. Our aim is to upgrade people's lives by facilitating deals and identifying attractive opportunities for both individuals and businesses. Our goal is to strengthen local economies, empower small businesses, and help everyone in making smarter choices for themselves, the market, and the planet.As part of dubizzle, we are alongside some of the strongest classifieds brands in the market. With a collective strength of 8 brands, we have more than 160 million monthly users that trust in our dedication to providing them with the best platform for their needs.As a Sales Account Manager your purpose is to seek new business opportunities by contacting and developing relationships with potential customers. They are responsible for developing leads from marketing campaigns and meeting sales quotas. They cultivate strong relationships with customers and ensure proper after-sales service. Ultimately, he/she will boost sales and contribute to dubizzle long-term business growth.In this role, you will: Communicate effectively to manage clients' expectations and ensure they receive a great dubizzle experience Achieve monthly (Targets renewal and acquisition with consistency) Become an expert on the Egyptian Real Estate market through combining the on-ground insights with dubizzle high level overview and data Increase our market share by selling our products to new customers Manage and arrange meetings with clients for acquisition, renewals, upgrade Increase our client satisfaction by performing account management services with them Regularly update reporting dashboard to reflect all sales activities Liaise with Finance, Customer Support, legal and Marketing department for any sales-related or client-related issues Collect market insights and keep up to date with laws and local development news. RequirementsBachelor's degree in marketing or sales or related field Excellent in English Communication written and speak 1 to 3 years of relevant sales experience Has a successful record in exceeding or achieving the assigned targets consistently Experience in farming and cold calls Knowledge of the real estate market in Egypt Knowledge of the Subscription industry Familiar with tech, ecommerce Familiar with Prop tech, Market place, Facebook, and other digital platforms Excellent in prospecting, cold calls and generating leads Excellent communication, negotiation, time management and presentation skills Excellent in converting lead into paying customer Positive/Flexible/Presentable/Committed Eager for success Has plug and play attitude Benefits A fast paced, high performing team. Comprehensive Health Insurance Life Insurance Rewards & Recognitions Learning & Development opportunities #Egyptdubizzle Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354173435/",
    "job_id": "4354173435",
    "source": "linkedin",
    "company_name": "dubizzle Egypt",
    "job_title": "Sales Account Manager-New Cairo",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333458502/",
    "job_id": "4333458502",
    "source": "linkedin",
    "company_name": "Bosta",
    "job_title": "Senior Account Manager (Logistics Field)",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354294592/",
    "job_id": "4354294592",
    "source": "linkedin",
    "company_name": "ArabyAds",
    "job_title": "Senior Account Manager",
    "location": "Giza, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355222822/",
    "job_id": "4355222822",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager (VAT & Tax) - For SinoHealth Pharmaceuticals Ltd - Job ID: 1451976",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355310203/",
    "job_id": "4355310203",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Chief Financial Officer (CFO) - Finance & Accounts Department- For Epyllion Group- Job ID: 1452460",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362141831/",
    "job_id": "4362141831",
    "source": "linkedin",
    "company_name": "AIA Vietnam",
    "job_title": "Internal Audit, Consultant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354274774/",
    "job_id": "4354274774",
    "source": "linkedin",
    "company_name": "RMG | مجموعة ريناد المجد (لتقنية المعلومات)",
    "job_title": "SAP Architect",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318682318/",
    "job_id": "4318682318",
    "source": "linkedin",
    "company_name": "Lennor Group",
    "job_title": "SAP FICO Specialist",
    "location": "Taguig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333197371/",
    "job_id": "4333197371",
    "source": "linkedin",
    "company_name": "Allianz Commercial",
    "job_title": "Senior Underwriter",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366002634/",
    "job_id": "4366002634",
    "source": "linkedin",
    "company_name": "Ethos Specialty Insurance Services LP",
    "job_title": "Manager, Underwriting Operations",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365271624/",
    "job_id": "4365271624",
    "source": "linkedin",
    "company_name": "Confidential Jobs",
    "job_title": "Head of Commercial Banking Credit",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365207060/",
    "job_id": "4365207060",
    "source": "linkedin",
    "company_name": "Betrimex Vietnam",
    "job_title": "Financial Controlling Director (BTMi Group)",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366599601/",
    "job_id": "4366599601",
    "source": "linkedin",
    "company_name": "Group Hunting",
    "job_title": "Head of Financial & Regulatory Reporting & Tax - Banking",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "🎯 What you will ownEnd-to-end Financial & Regulatory Reporting: Financial Statements, provisioning, prudential ratios, SBV & Group reportingFull tax governance across VAT, CIT, FCT, FATCA, Transfer PricingPrimary contact point for SBV, Tax Authorities, External Auditors & ConsultantsFinance & tax advisory to business and product teams for new initiativesStrengthen internal control, governance, and reporting automationLead and develop the team, and act as Deputy / backup to Head of ERC👉 This is a decision-making role, not a back-office reporting position.👤 Who this role is built for10+ years in Finance / Accounting / Regulatory / TaxProven leadership experience (Manager / Senior Manager / Head)Strong exposure to banking regulations, VAS, IFRS, SBV frameworkComfortable working with senior stakeholders and regulatorsFluent English for Group and auditor communicationMindset of ownership, accountability, and control Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367724009/",
    "job_id": "4367724009",
    "source": "linkedin",
    "company_name": "Cathay United Bank",
    "job_title": "Loan & Trade Operations Team Head",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369362444/",
    "job_id": "4369362444",
    "source": "linkedin",
    "company_name": "UNV Bangladesh",
    "job_title": "Programme Associate",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354272913/",
    "job_id": "4354272913",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive (Office & Client Service) - For Dainik Chittro - Job ID: 1452103",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355320141/",
    "job_id": "4355320141",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Agro Manager (Bandarban) - For A well known Group of Companies - Job ID: 1452265",
    "location": "Bandarban District, Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354182172/",
    "job_id": "4354182172",
    "source": "linkedin",
    "company_name": "Veem",
    "job_title": "Compliance Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362523303/",
    "job_id": "4362523303",
    "source": "linkedin",
    "company_name": "SMJ ENERGY",
    "job_title": "Senior Finance Manager",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354230046/",
    "job_id": "4354230046",
    "source": "linkedin",
    "company_name": "Kalyon Holding",
    "job_title": "Corporate Finance Manager",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357562815/",
    "job_id": "4357562815",
    "source": "linkedin",
    "company_name": "WITS Southern Centre for Inequality Studies (SCIS)",
    "job_title": "Financial Systems Functional Analyst: Accounts Receivables and Cash Management (IT08) (IT.08.4)",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350221871/",
    "job_id": "4350221871",
    "source": "linkedin",
    "company_name": "Savills Vietnam",
    "job_title": "Nhân viên Lễ tân tòa nhà",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354244349/",
    "job_id": "4354244349",
    "source": "linkedin",
    "company_name": "Sütaş Group",
    "job_title": "Müşteri Kanal Mali Analiz Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365283491/",
    "job_id": "4365283491",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Senior Fund Accountant - Hedge Funds",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365023485/",
    "job_id": "4365023485",
    "source": "linkedin",
    "company_name": "Fido",
    "job_title": "Internal Auditor",
    "location": "Accra, Greater Accra Region, Ghana",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362174971/",
    "job_id": "4362174971",
    "source": "linkedin",
    "company_name": "TGS TW PLT",
    "job_title": "Audit Associate",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365291062/",
    "job_id": "4365291062",
    "source": "linkedin",
    "company_name": "Ascend Money",
    "job_title": "Head of Legal & Compliance (True Money Malaysia)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job OverviewThe Head of Legal & Compliance oversees and manages the Company’s legal, regulatory, and compliance framework, ensuring that all business activities adhere to applicable laws and internal standards. This role functions as an independent and objective advisor, evaluating regulatory requirements, internal policies, and compliance risks to support business growth and long-term sustainability.The incumbent will establish standards and implement processes to ensure effective identification, prevention, detection, and remediation of legal and compliance issues.This position reports functionally to the Regional Head of Legal and Regional Head of Compliance (based in Thailand), and a dotted line to the Country Managing Director (Malaysia).ResponsibilitiesLegal:Review, draft, and negotiate contracts and other legal documents related to the Company’s business.Manage and main legal documents, including DWR, certificate of incorporation, AOA, and other corporate documents.Provide practical, solution-oriented legal advice across business functions.Educate and guide internal teams to ensure compliance with legal standards.Collaborate and build trust with key stakeholders, including regional teams, business functions, and external partners or counsel.Support the Regional Head of Legal on both local and regional legal projects.Compliance:Regulatory Compliance AdvisoryOversee license maintenance and regulatory activities with BNM and other relevant authorities.Provide compliance advice on areas such as AML/CFT, KYC, outsourcing, business continuity, and technology risk.Develop and maintain the Country Compliance Program, including policies and procedures in line with Malaysian AML/CFT and e-KYC regulations.Ensure all regulatory reports are prepared and submitted accurately and on time.Partner with operations and product teams to embed compliance requirements into systems and processes.Serve as the Money Laundering Reporting Officer (MLRO).Manage AML-related activities, including suspicious transaction reporting, AML training, and onboarding compliance for customers and partners.Discharge all responsibilities as the nominated Compliance Officer in accordance with Malaysian laws.Monitoring, Controls & GovernanceConduct compliance risk assessments and develop action plans to address regulatory gaps.Support internal and external audits related to compliance or control initiatives.Develop and maintain an incident reporting and remediation framework.Collaborate with subject matter experts on data protection and information security risks.Provide periodic updates to senior management and organize governance meetings as required by regulation.Training & AwarenessPromote a strong compliance culture across all levels of the organization.Design and deliver regular compliance training and awareness programs.Risk & Fraud ManagementEstablish and maintain Risk and Fraud Management policies, standards/procedures in line with BNM’s regulation.Oversee non-financial risk management including operational, fraud, compliance, IT security, and business continuity risks within risk appetite and risk tolerance of a company.Supervise the design and testing of control frameworks.Support the implementation of Regional Risk and Fraud Management governance using tools, but not limited to, such as RCSA, PSAP risk assessment, incident management, key control testing, KRI monitoring, and etc.Build the risk culture in the organization.Requirements:Bachelor’s degree in law or a related field; a valid legal practicing license is an advantage.Minimum of 8 years’ experience in Legal and/or Compliance, with at least 3 years in a senior managerial role within financial services, fintech, or e-commerce sectors.Solid understanding of BNM regulations, e-money, remittance, AML/CFT, and e-KYC frameworks.Strong analytical and risk assessment skills with a practical, results-driven mindset.Strong understanding of risk and compliance frameworks in financial services and technology industries.Ability to communicate complex legal and regulatory issues clearly across all levels of the organization.Proactive, self-motivated, detail-oriented, and organized.Excellent command of written and spoken English.Experience working in a regional or cross-border environment is a plus.Proven ability to build strong relationships with internal and external stakeholders.Commercially minded, with the ability to balance compliance requirements and business objectives.Compliance certification eg; ACAMS, ACAML preferred Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365265714/",
    "job_id": "4365265714",
    "source": "linkedin",
    "company_name": "ARM International",
    "job_title": "Marine Assurance Superintendent",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354190038/",
    "job_id": "4354190038",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Digital Business Analyst",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354243389/",
    "job_id": "4354243389",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Front Desk / Customer Support Executive- For MOVES EDUCATION.- Job ID: 1452251",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362631439/",
    "job_id": "4362631439",
    "source": "linkedin",
    "company_name": "Xero",
    "job_title": "Business Analyst (Syft Analytics)",
    "location": "City of Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354174096/",
    "job_id": "4354174096",
    "source": "linkedin",
    "company_name": "Allianz Türkiye",
    "job_title": "Elementary Change Team Member-Business Analyst",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "\"Would you like to take your place in Allianz, which is the choice of those who care for tomorrow?”The Allianz Group is one of the world's leading insurers and asset managers with more than 100 million private and corporate customers in more than 70 countries. We are proud to be the Worldwide Insurance Partner of the Olympic & Paralympic Movements from 2021 until 2028 and to be recognized as one of the industry leaders in the Dow Jones Sustainability Index.Caring for our employees, their ambitions, dreams and challenges is what makes us a unique employer. Together we can build an environment where everyone feels empowered and has the confidence to explore, to grow and to shape a better future for our customers and the world around us. Join us and together, let’s care for tomorrow.We believe in the power of diversity and inclusion, in mutual respect and support. We are committed to ensure that our employees work in an environment that is inclusive and that everyone is treated with dignity and respect. We are constantly working on creating a workplace at which you can feel at home.At Allianz Turkey we proud to be recognized as a “Great Place To Work” and chosen as a top company of business world at 8 times by Capital Magazine.What do we expect you to bring?General Qualifications· Bachelor’s degree in Computer Science, MIS, Engineering, or other relevant fields· 4+ years of IT Business Analyst or IT Product Owner experience focused on creating product backlog, eliciting requirements, determining priorities and driving the development team for execution of backlog· Insurance sector and health domain experience is a huge plus.· Agile methodology experience and knowledge in iterative incremental delivery is desired.· Demonstrated ability to think creatively and strategically when implementing projects and solving problems.· Capability in understanding the technical aspects of the project.· Excellent interpersonal skills and ability to communicate effectively with both technical and non-technical audiences.· Strong coordination skills and willingness to take responsibilities.· Knowledge and understanding on SQL.· Experience in software development lifecycle and business analysis tools (e.g. JIRA, Confluence, Visio, Balsamic, SOAP UI etc..)· Fluency in English.. Having knowledge in Artificial Intelligence (AI) development, Data Analytics, Data Intelligence, AI/Data Strategy, and ChatGPT.How can you make an impact?· Working as a team member in agile project teams and taking business analyst and scrum master responsibilities.· Gather and analyze functional and non-functional requirements of the stakeholders and design the best solutions to meet their needs.· Convert business requirements into technical software specifications and prepare high-quality design deliverables including process modelling, data modelling, and integration details.· Support Product Owner and Key Business Resources to plan and execute UAT phases.· Support Project Manager in project coordination and project management activities.What we will offer you?Company:Working in Green certificated & pet friendly Allianz Tower / Allianz Kampüs with modern work spaces, gym & social areas.Working in agile, flexible, digital and social cultureFlexible working hoursWorking 40 hours a weekHybrid workingFlex summer (July – August)Part time workingBenefits:Yearly bonusTransportationLife insuranceEmployer sponsored pension & Family included health insuranceMeal Allowance (Cash/monthly)Leave Rights:School Report Day (Half Day) & First Day of school (Half Day)Allianz day offBirthday day offPaternity Leave – 30 daysMarriage Leave – 5 daysAfter 4 years of work, having extra one day annual leave each year (up to 26 days)And there is much more!Do the items above define you? Do you believe you can passionately and successfully carry out the tasks involved in the job description, that is the perfect match for you? Then, come and apply for the “Business Analyst -Elementary Change Team Member” position.While you await news from us, we would like to share a playlist with you to help you enjoy your time.https://open.spotify.com/playlist/1Zx2if289cAz4WClmUvsL5?si=b48f678f66424584“This is Allianz, life is quite different here!”#TutkuylaYürüyenlerinYolu #LetsCareForTomorrow #AllianzTürkiye\"Please find the clarification text about the processing of your personal data within the scope of the GDPR in the link below.\"https://www.allianz.com.tr/tr_TR/faydali-bilgiler-ve-linkler/is-basvurulari-kapsaminda-iletilen-kisisel-verilerin-islenmesi-hakkinda-aydinlatma.html Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346041470/",
    "job_id": "4346041470",
    "source": "linkedin",
    "company_name": "TMF Group",
    "job_title": "Associate CDD Officer (Contractual)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353998007/",
    "job_id": "4353998007",
    "source": "linkedin",
    "company_name": "PwC South Africa",
    "job_title": "SATIC PwC: Corporate Independence and Ethics & Business Conduct Manager",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365238358/",
    "job_id": "4365238358",
    "source": "linkedin",
    "company_name": "myZoi | Financial Inclusion Technologies",
    "job_title": "Treasury Manager",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Meet myZoimyZoi is changing lives for the better for those who deserve it the most. We are an exciting fintech start-up, a wholly owned subsidiary of Standard Chartered Bank, aiming to promote financial inclusion globally. Our vision is to provide a level playing field to the unbanked and the underbanked in accessing essential financial services in an affordable, convenient, and transparent fashion. We are looking for smart, ambitious, and purpose-driven individuals to join us in this journey. Please apply via the link below if you are interested.The RoleThe Treasury Manager will be responsible for ensuring optimal liquidity across multiple entities and banking partners, forecasting cash and capital needs, managing FX exposures, and ensuring compliance with regulatory capital requirements. The candidate will be expected to drive the management of Cash, Liquidity, FX, and Debt raising/Financing across the Group along with overseeing working capital management solutions. The candidate will be expected to be an expert generalist in all matters related to the treasury. Key ResponsibilitiesLiquidity & Cash Management Monitor daily cash positions across all operating accounts (domestic and international) Manage liquidity with the UAE Central Bank for Domestic Settlements (UAEFTS, ICCS, DDS, etc.) Ensure sufficient funding levels across nostro/vostro accounts for instant remittance and payout channels Forecast short-term and medium-term liquidity requirements across all bank accounts, incorporating inflows/outflows, settlement cycles, and seasonal trends Optimize cash deployment and minimize idle balances while ensuring operational readiness Capital Planning & Regulatory Requirements Monitor and maintain compliance with Central Bank capital adequacy and liquidity requirements Forecast capital requirements to support business growth, new products, and regulatory changes Plan and coordinate capital injections from shareholders as needed to meet regulatory thresholds Prepare capital adequacy reports for internal management and regulatory submission FX and Risk Management Monitor FX positions and exposures across currencies Liaise with banks and FX counterparties for pricing and execution of FX conversion. Also help setting up FX hedging strategies, if required Maintain up-to-date knowledge of market trends and regulatory changes affecting treasury and FX markets Banking Relationships Act as the primary point of contact for treasury-related matters with banking partners and the Central Bank Support opening, maintaining, and optimizing banking infrastructure for operational efficiency Treasury Operations Own and operate the treasury management process, ensuring strong controls and reporting Reconcile treasury transactions and coordinate with the finance team for accounting and audit purposes Support automation and system improvements related to treasury processes Reporting & Compliance Prepare daily, weekly, and monthly liquidity, capital, and treasury dashboards for internal management Ensure compliance with internal treasury policies and Central Bank reporting requirements Support internal and external audits related to treasury activities Key Stakeholders Finance team Management team CBUAE External stakeholders Standard Chartered Ventures and Group Who you are 10–12 years of treasury experience in a bank, fintech, or financial institution Strong understanding of liquidity management, capital adequacy, FX exposure, and settlement processes Proven ability to forecast liquidity and capital requirements across multiple bank accounts Prior experience dealing with Central Bank accounts, domestic settlement systems, and Nostro accounts Experience working with multi-currency environments and instant/remittance products Proficiency in treasury systems and Microsoft Excel; experience with TMS is a plus Excellent stakeholder management and communication skills Excellent analytical and problem-solving skills with attention to detail Ability to manage competing priorities in a cross functional environment Ability to work independently in a fast-paced, regulated fintech environment Preferred Experience with cross-border remittance operations Familiarity with regulatory reporting in the UAE Professional certifications such as ACT, CFA, or CTP are advantageous At myZoi we strive to create a both a product and a team that embraces equality, inclusion, diversity and freedom. We want people who can be themselves and bring their own brand of value to the team. Come and join us! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365254824/",
    "job_id": "4365254824",
    "source": "linkedin",
    "company_name": "noon",
    "job_title": "Onsite Operations Assistant",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365262780/",
    "job_id": "4365262780",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Senior Officer Accounts & Admin For Riser Real Estate",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354203615/",
    "job_id": "4354203615",
    "source": "linkedin",
    "company_name": "SBS Transit Ltd",
    "job_title": "Finance Executive, Accounts Payable @SKD",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job descriptionResponsibilitiesTo verify that the outgoing payments comply with financial policies and procedures.Reconcile the accounts payable ledger to ensure all bills and payments are accounted for and correctly posted.Verify and investigate any discrepancies by reconciling vendor accounts and monthly vendor statements.Generate detailed reports, including accounts payable status, aging reports, and payment forecasts.To verify and approve the Supplier onboarding form and Compass invoices.Carry out the month-end closing process, including reconciling accounts, adjusting discrepancies.Any other duties the superior assigns from time to time.Attend to internal and external auditors’ requests, queries, follow-up actions, etc.Assist new ERP finance AP data migration, i.e., data cleaning, and contribute to the creation of test cases, particularly those focusing on penny testing scenarios, to ensure comprehensive coverage. RequirementsAble to work with a high volume of transactions and maintain a high level of accuracy in entering the data in SAP SystemMinimum 3 years of relevant experience Minimum degree in Accountancy or equivalent Proficient in Excel with hands-on experience using SAP SystemAble to meet tight deadlines Good analytical skillPossess good sense of responsibilityWe regret to inform that only shortlisted applicants will be notified. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362113016/",
    "job_id": "4362113016",
    "source": "linkedin",
    "company_name": "Alnafitha IT",
    "job_title": "Collection Specialist",
    "location": "Riyadh Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Alnafitha IT is a leading independent provider of IT services and solutions in Saudi Arabia, founded in 1993.As a fully Saudi-owned company, we have established ourselves from a startup business to a market leader, offering a comprehensive range of IT solutions tailored to meet the unique requirements of our clients.Our expertise spans across various domains, including Microsoft, AWS, ManageEngine, and Zoho Solutions, ensuring that we deliver strategic IT solutions that drive digital transformation and operational excellence to our clients. With over 30 years of experience, Alnafitha IT has successfully completed more than 4,000 projects, serving over 3,000 satisfied customers, and collaborating with 65+ partners.Our commitment to excellence is evident in our customer-centric approach, which emphasizes engagement, collaboration, and a relentless pursuit of quality in every interactionOur vision is to be the Kingdom's most customer-centric provider for digital transformation and consultation, fostering innovation and excellence in all our solutions. We are dedicated to optimizing operational efficiency and ensuring effective resource utilization to enhance customer satisfaction and profitability At Alnafitha IT, we believe in empowering our employees and nurturing their growth, which is essential for driving leadership in technology and customer satisfaction. As we continue to expand our presence in the IT landscape, we remain committed to delivering cutting-edge solutions that not only meet but exceed our clients' expectations.Job Summary/ObjectiveThe Collection Specialist supports the collections process by ensuring accurate invoice preparation, submission, and follow-up. Working closely with clients, the Collection Specialist sends payment reminders, follows up on overdue accounts, and assists in negotiating feasible payment plans when necessary. The position also maintains up-to-date collection records, prepares basic status reports, and collaborates with the finance and accounting teams to ensure accuracy, compliance, and smooth payment processing Key Responsibilities:• Invoice submission & documentation• Assist in reviewing, validating, and processing invoices on Zoho Books / Zoho CRM, ensuring all related documents to ensure that all invoicing starts with accurate, complete, and up-to-date information, minimizing downstream errors or delays.• Support the preparation and uploading of financial claims and supporting documentation to government portals to meet government compliance standards and successfully initiate payment processing under formal contract terms• Collections Strategy Execution• Follow assigned credit terms and collection actions and prevent future overdue or any risk that might happen• Send reminders to clients for following up to decrease the overdue accounts and implement terms and conditions• Prepare weekly and monthly collection performance reports, including KPIs such as DSO, CEI, and collection trends, and provide recommendations for improvement. • Work on assigned priority accounts to support cash flow by addressing high priority accounts first• Client Communication• Assist in developing feasible payment schedules to facilitate timely payments and reduce outstanding debt while maintaining client relationships• Build and sustain Maintain positive interactions through providing consistent updates and support to clients regularly to encourage and foster good will and have a long-term relationship with clients• Performance Monitoring• Prepare and report on account statues and collection efforts to keep stakeholders informed and enable them to provide guidance• Assist in compiling data on collection performance through compiling data on trends, progress and issues• Collaboration and Communication• Work with accounting teams to improve collection processes and prevent future issues through teamwork• Handle financial disputes and clarification requests in coordination with Operations, Sales, and Finance teams• Coordinate with the finance team to gather necessary data to maintain accurate records and ensure compliance with financial standardsRequirementsQualifications - Education: Bachelor's degree in finance, Accounting, Business Administration, or a related field - Experience: From 2+ years of experience in collections or accounts receivable, preferably in the IT or technology sector - Practical experience with invoice processing, client communication, and payment follow-ups - Experience handling financial documentation and related government compliance requirements - Competent in using Excel and internal accounting systems for tracking invoices, compiling data, and reporting - Able to communicate clearly and appropriately with clients and internal teams to explain invoice issues or payment arrangements - Strong negotiation and persuasion abilities. - Analytical skills for reviewing financial data and preparing reports - Demonstrates initiative in following up on overdue accounts while",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354291208/",
    "job_id": "4354291208",
    "source": "linkedin",
    "company_name": "Awin Global",
    "job_title": "Senior Data Analyst (Finance)",
    "location": "Warsaw Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365260201/",
    "job_id": "4365260201",
    "source": "linkedin",
    "company_name": "国泰君安国际 Guotai Junan International",
    "job_title": "Investment Analyst, Asset Management",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4328757665/",
    "job_id": "4328757665",
    "source": "linkedin",
    "company_name": "Toluna",
    "job_title": "Senior Research Manager",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361714829/",
    "job_id": "4361714829",
    "source": "linkedin",
    "company_name": "Randstad Singapore",
    "job_title": "Investment Analyst / Associate - Infrastructure Credit",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368666206/",
    "job_id": "4368666206",
    "source": "linkedin",
    "company_name": "talents lab",
    "job_title": "Financial Controller - Fintech/Crypto",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The CompanyThis is a fast-moving FinTech company building the future of payments and crypto. With a new entity launching in Poland, the team is scaling operations across Europe and needs strong financial foundations to support that growth.You'll be joining a company where crypto meets traditional finance, where compliance matters as much as speed, and where your work directly impacts how money moves across borders, currencies, and platforms.The RoleWe're looking for a Financial Controller to own financial reconciliation and ensure the books are airtight. This is a hands-on role where you'll be responsible for making sure every transaction – across multiple currencies, wallets, and banking partners – is tracked, matched, and accounted for.You'll work closely with Compliance, Legal, and Leadership to keep the company audit-ready and regulatory-compliant. If you've worked in crypto or payments before, you know how complex reconciliation can get. We need someone who thrives in that complexity.What You'll DoOwn financial reconciliation across all payment channels, currencies, and crypto walletsManage monthly, quarterly, and annual financial closePrepare and review financial statements (P&L, Balance Sheet, Cash Flow)Ensure compliance with European regulations and Polish accounting and tax lawsHandle multi-entity and multi-currency accountingOversee cash flow, treasury, settlements, and banking relationshipsPartner with Compliance and Legal on regulatory reporting and auditsLead external audits and liaise with banks, regulators, and advisorsBuild and improve internal controls, processes, and automationSupport budgeting, forecasting, and financial planningWhat You Bring To The Table3+ years of experience in accounting or financeStrong knowledge of European accounting standards and Polish statutory requirementsExperience owning the full accounting cycleCrypto and FinTech experience is a must – you understand how digital assets move and how to reconcile themAdvanced Excel or Google Sheets skillsBachelors degree in Accounting, Finance, or related fieldYou must be located in Poland - MUSTNice to HaveBackground in a PSP (Payment Service Provider) environmentExperience working in regulated financial institutionsFamiliarity with AML/KYC-related financial reportingCPA, ACCA, CA, or equivalent certificationExperience with ERP systems (Xero, NetSuite, QuickBooks)What You'll GetEUR 2,500 – 3,000 / month based on experienceRemote or hybrid flexibilityHigh-impact role in a growing FinTech companyExposure to crypto and payment services operationsWork closely with leadership and influence strategyOpportunity to build scalable finance systems from the ground upWe work with companies that care about building inclusive, respectful teams where people feel safe to be themselves, grow, and belong. And if you ever have questions or doubts during the process, were always here to support you. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362138131/",
    "job_id": "4362138131",
    "source": "linkedin",
    "company_name": "HCLTech",
    "job_title": "PEGA Developer",
    "location": "Colombo District, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4281259834/",
    "job_id": "4281259834",
    "source": "linkedin",
    "company_name": "Virtusa",
    "job_title": "C#.Net Lead",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327661221/",
    "job_id": "4327661221",
    "source": "linkedin",
    "company_name": "WireHire",
    "job_title": "Business Controller - Healthcare",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354182578/",
    "job_id": "4354182578",
    "source": "linkedin",
    "company_name": "Bosch Indonesia",
    "job_title": "Head of Finance",
    "location": "Jakarta Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365252293/",
    "job_id": "4365252293",
    "source": "linkedin",
    "company_name": "SKINTIFIC",
    "job_title": "Business Assistant",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362119749/",
    "job_id": "4362119749",
    "source": "linkedin",
    "company_name": "PwC Indonesia",
    "job_title": "Associate & Senior Associate - Tax - Investment Accounting and Payroll",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365226479/",
    "job_id": "4365226479",
    "source": "linkedin",
    "company_name": "Maybank",
    "job_title": "Corporate Function & Internal Branch Audit",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354293078/",
    "job_id": "4354293078",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive / Assistant Manager, Taxation & Financial Reporting - For SWISH.GLOBAL - Job ID: 1452039",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365292980/",
    "job_id": "4365292980",
    "source": "linkedin",
    "company_name": "Coca-Cola HBC",
    "job_title": "Horeca Prestige Key Account Executive - Bucuresti",
    "location": "Bucharest Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Etapele procesului de recrutare: Interviu telefonic - Testate Online (email) – Interviu face-to-faceEchipa: VânzăriLocaţie: BucurestiContract: PermanentVei crește odată cu noi - la scară mare, cu impact dincolo de ce îți poți imagina.Ca Horeca Prestige Key Account Executive în echipa noastră de vânzări, vei extinde portofoliului în segmentul Horeca Prestige, prin identificare locațiilor relevante, construirea relațiilor de încredere, negocierea parteneriatelor premium și vei asigura integrarea lor în ecosistemul nostru.CE VEI FACERecrutezi proactiv noi locații premium, folosindu-te de rețeaua ta extinsă în Horeca și participând la evenimente relevante din piață.Identifici rapid oportunități de dezvoltare în piață — ai o mentalitate de tip “hunter”, orientată către rezultate și acțiune.Gestionezi și dezvolți portofoliul de locații Horeca Prestige, menținând relații solide, de încredere, bazate pe consultanță și profesionalism.Dezvolți business-ul clienților, prin înțelegerea nevoilor comerciale, recomandări strategice, dezvoltarea categoriilor și renegocierea termenilor și condițiilor acolo unde este necesar.Construiești parteneriate comerciale sustenabile, cu focus pe profitabilitate, gestionarea P&L per client, risc comercial, termene de plată și impact asupra portofoliului.Elaborezi planuri de acțiuni dedicate pentru fiecare client, cu obiective comerciale clare, implementare și follow-up.Negociezi și închizi contracte premium, cu puternică orientare către valoare, execuție și loializare a partenerilor.Colaborezi strâns cu echipele cross‑funcționale (Marketing, Trade Marketing, Supply Chain, Finance) pentru a maximiza impactul comercial și calitatea execuției.Monitorizezi performanța portofoliului, raportezi progresul, acționezi prompt în situații critice și asiguri o execuție impecabilă în locațiile cheie.NOUL NOSTRU MEMBRU TREBUIE SĂAibă minimum 3 ani de experiență în vânzări sau business development în Horeca.Demonstreze experiență solidă în recrutarea proactivă de locații Horeca și în gestionarea conturilor cu valoare ridicată.Dețină abilități avansate de negociere, influențare și închidere a parteneriatelor.Aibă cunoștințe financiare bune, inclusiv P&L, discounting, credit management și evaluarea riscurilor.Fie capabil(ă) să construiască propuneri comerciale coerente și profitabile.Manifeste o atitudine proactivă, orientată către rezultate și oportunități („hunter mindset”).Poată lua decizii rapid, demonstrând autonomie și rezistență la presiune.Manifeste flexibilitate în program, inclusiv disponibilitate pentru evenimente Horeca și activități în afara orelor standard.Lucreze eficient într-un mediu colaborativ, alături de echipe din funcțiuni diverse.Aibă studii superioare finalizate.Cunoască limba engleză la nivel avansat.Dețină cunoștințe de Excel la nivel mediu.Dețină permis de conducere categoria B.DESPRE NOUA TA ECHIPĂSuntem Coca-Cola HBC – o companie de bunuri de larg consum orientată spre creștere și partener strategic de îmbuteliere al The Coca-Cola Company. Operăm în 29 de piețe din Europa până în Africa, îmbuteliem, distribuim și vindem un portofoliu 24/7 de băuturi, creând valoare pentru oameni, clienți și comunități. Cu peste 30.000 de angajați din 70+ naționalități, prosperăm prin diversitate și oportunitate.Dacă ești gata să îți descoperi potențialul și să crești alături de o echipă care ridică mereu ștacheta, alătură-te Coca-Cola HBC.LA COCA-COLA HBC, DIVERSITATEA NE AJUTĂ SĂ EVOLUĂMIncluziunea și celebrarea diversității sunt parte din povestea noastră de creștere. Suntem dedicați formării unor echipe diverse care reflectă comunitățile pe care le deservim și creării unui mediu incluziv în care fiecare perspectivă unică este apreciată și ascultată. Construind constant un loc de muncă divers și incluziv, ne îmbunătățim deciziile și oferim soluții inovatoare și valoare comună. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367649319/",
    "job_id": "4367649319",
    "source": "linkedin",
    "company_name": "GlassRatner Canada",
    "job_title": "Chief Financial Officer",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365291962/",
    "job_id": "4365291962",
    "source": "linkedin",
    "company_name": "MUFG",
    "job_title": "Finance Transformation Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361978328/",
    "job_id": "4361978328",
    "source": "linkedin",
    "company_name": "Information and Privacy Commissioner of Ontario",
    "job_title": "Director of Investigations",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357403853/",
    "job_id": "4357403853",
    "source": "linkedin",
    "company_name": "Desjardins",
    "job_title": "Senior Advisor, Risk management",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358818535/",
    "job_id": "4358818535",
    "source": "linkedin",
    "company_name": "Desjardins",
    "job_title": "Senior Advisor, Operational risks",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362570113/",
    "job_id": "4362570113",
    "source": "linkedin",
    "company_name": "Sharp Decisions",
    "job_title": "Credit Risk Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372740849/",
    "job_id": "4372740849",
    "source": "linkedin",
    "company_name": "PMT Synergie inc.",
    "job_title": "Technicien(ne) à la paie et comptabilité",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373370094/",
    "job_id": "4373370094",
    "source": "linkedin",
    "company_name": "Xploy Solutions",
    "job_title": "Accountant",
    "location": "Santo Domingo de Guzmán, Distrito Nacional, Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4189157156/",
    "job_id": "4189157156",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Officer- For Prime Bank Foundation- Job ID : 1351305",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3129378468/",
    "job_id": "3129378468",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Citi hiring Finance Manager in Dhaka, Dhaka, Bangladesh",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345646129/",
    "job_id": "4345646129",
    "source": "linkedin",
    "company_name": "Job ID: 1442078 ...",
    "job_title": "Finance & Banking (For Pasha Group)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2025/",
    "job_id": "2025",
    "source": "linkedin",
    "company_name": "Western Quebec School Board",
    "job_title": "2025-2026 Opportunités d'enseignement - Commission scolaire Western Québec / 2025-2026 Teaching Opportunities - Western Québec School Board",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355242690/",
    "job_id": "4355242690",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Data Entry - (For Leading edge) - Job ID - 1452413",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3938638545/",
    "job_id": "3938638545",
    "source": "linkedin",
    "company_name": "Business Globalizer",
    "job_title": "Tax Accountant Specialist",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3458820480/",
    "job_id": "3458820480",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "A. Wahab & Co. hiring Assistant Director in Dhaka, Bangladesh",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]