[
  {
    "url": "https://www.linkedin.com/jobs/view/4365691371/",
    "job_id": "4365691371",
    "source": "linkedin",
    "company_name": "Iqbal Foods",
    "job_title": "assistant accounting manager",
    "location": "East York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361194965/",
    "job_id": "4361194965",
    "source": "linkedin",
    "company_name": "Choice Talents LTD",
    "job_title": "Accountant",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346049480/",
    "job_id": "4346049480",
    "source": "linkedin",
    "company_name": "Choice Talents LTD",
    "job_title": "Accountant",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362015434/",
    "job_id": "4362015434",
    "source": "linkedin",
    "company_name": "Confidential Careers",
    "job_title": "Senior Accountant",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4332585081/",
    "job_id": "4332585081",
    "source": "linkedin",
    "company_name": "Yes4All",
    "job_title": "Finance Business Partnering - Associate Manager",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354125315/",
    "job_id": "4354125315",
    "source": "linkedin",
    "company_name": "Oracle",
    "job_title": "Customer Success Services Sales Representative",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354118358/",
    "job_id": "4354118358",
    "source": "linkedin",
    "company_name": "Serviceplan Group",
    "job_title": "Senior Account Manager",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362031725/",
    "job_id": "4362031725",
    "source": "linkedin",
    "company_name": "Bybit",
    "job_title": "Funds Product Manager (Treasury / Reconciliation / Settlement)",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361926524/",
    "job_id": "4361926524",
    "source": "linkedin",
    "company_name": "Security Bank Corporation",
    "job_title": "Treasury Manager",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355285189/",
    "job_id": "4355285189",
    "source": "linkedin",
    "company_name": "Desjardins",
    "job_title": "Corporate Underwriting Advisor (Evolution & Solutions), Commercial Lines Insurance",
    "location": "Aurora, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357717125/",
    "job_id": "4357717125",
    "source": "linkedin",
    "company_name": "Beneva",
    "job_title": "Agent de bureau - gestion des contrats",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357466444/",
    "job_id": "4357466444",
    "source": "linkedin",
    "company_name": "INRS - Institut national de la recherche scientifique",
    "job_title": "Adjointe administrative ou adjoint administratif à la dotation (26009-74444)",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348113867/",
    "job_id": "4348113867",
    "source": "linkedin",
    "company_name": "Victoriaville & Co.",
    "job_title": "Copy of Administrative Assistant",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362024324/",
    "job_id": "4362024324",
    "source": "linkedin",
    "company_name": "Bluesky HR Consultancy Inc.",
    "job_title": "Management Associate (Relocating to Malaysia)",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358191991/",
    "job_id": "4358191991",
    "source": "linkedin",
    "company_name": "Choice Talents LTD",
    "job_title": "Graduate Trainee Assistant",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Location: Lagos and Enugu stateEmployment Type: Full-timeResponsibilitiesAssist with basic office dutiesAssist with business development activitiesPrepare and submit daily activity report.Handle other duties assigned by the supervisorQualificationsHND / BSc degree in related discipline0 - 1 year work experienceBe analytically minded with the ability to learn quickly.Be confident and possess leadership skills.Have excellent communication and interpersonal skills.Application Closing Date30th June, 2025.How to ApplyInterested and qualified candidates should send their application and CV to jobs@choicetalents.com.ng using the job title as the subject of the email. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365006904/",
    "job_id": "4365006904",
    "source": "linkedin",
    "company_name": "Choice Talents LTD",
    "job_title": "Front Desk Executive",
    "location": "Rivers State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365039886/",
    "job_id": "4365039886",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Operation Manager (Factory) for Green Route",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362395703/",
    "job_id": "4362395703",
    "source": "linkedin",
    "company_name": "Thrive",
    "job_title": "Compliance Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362020897/",
    "job_id": "4362020897",
    "source": "linkedin",
    "company_name": "HOPSCOTCH Season",
    "job_title": "Permanent Contract - Senior Account Manager - HOPSCOTCH SEASON VIETNAM H/F",
    "location": "Ho Chi Minh City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353948632/",
    "job_id": "4353948632",
    "source": "linkedin",
    "company_name": "Arab Bank",
    "job_title": "Country Risk Manager",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Accountabilities & Key Roles:Supervise and ensure the implementation of Information Security, Business Continuity & Operational Risk and related frameworks such as Outsourcing Risk Mgt, Reputational Risk Mgt, Strategic Risk Mgt, and New Product Development frameworks to minimize risk. Act as coordinator and facilitator for other Group Risk Management Related projects as necessary (Basle Ii, MRA, CLM, Collateral, etc…)Monitor treasury middle office activities and performance according to P&P and HO guidelines.Assess work procedures and controls to be implemented by all business lines and units if different from H.O. to identify any information security, business continuity & operational risk related issues.Conduct with the various business areas, business impact analysis & risk assessment workshops periodically for all AB business units and branches.Organize and provide information security, operational risk and business continuity awareness and training for all business units/ Branches.Ensure the bank’s preparedness to implement Basel Capital Accord II principles related to business continuity and operational risk. Ensure compliance with information security, business continuity plans, and operational risk controls frameworks and any related local laws and regulations.Maintain information security, business continuity and operational risk policies, procedures, checklists and documents.Follow-up with all business areas to ensure that any policy implementation issues and control gaps are implemented. Adherence to all Information Security policies and standards to protect the Bank’s employees, assets, resources and data from illegal or damaging actions by individuals, either knowingly or unknowinglyOperational RiskFacilitate RCSA, establishment of KRI, and loss reporting along with the implementation of risk related assessment frameworks (eg. Outsourcing, Reputational Risk, Strategic Risk, and Product Development).Implement the operational risk framework and all related Policies & Procedures.Ensure that “As is” and “To be” control deficiencies are addressed. Develop and maintain the area operational risk database and keep track of outstanding control issues.Business Continuity Ensure that all departments & branches develop and maintain their business continuity plans.Ensure that the most appropriate recovery strategies are selected based on cost benefit analysis, and endorsed it by senior management. Conduct business continuity plans’ testing. Plan and coordinate with premises the implementation of emergency evacuation plan for all AB premises owned or rented.Plan and coordinate the implementation of crisis management framework and incident response framework.Information Security Ensure IS plans, findings & recommendations, along with compliance exceptions reports are addressed and implemented on timely manner in the area.Ensure risk assessment and data classification are conducted on all information assets.Maintain an adequate level of information security awareness in the area.Education: Bachelor degree in Business Administration, Finance, BA or equivalent. Experience: 7 years experience, 3 of which in information security, business continuity and operational risk field.Clear understanding of information security, business continuity, and operational risk frameworks Good experience in conducting risk assessments, data classification, business impact analysis for bank’s core business.Good understanding of banking processes and products.English language level four according to AB classification.Competencies: Organizational, planning and coordinating skills.Training and presentation skills.Excellent written and verbal communication skills in English and Arabic languages.Excellent writing skills to draft policies, procedures and reports. Ability to concentrate on details, communicating with various types of users, Owning analytical skills.Ability to Plan and execute complex projects spanning multiple locations at the country level. Patience, flexibility, team playing.Possessing a global vision. What We Offer at Arab BankAt Arab Bank, we offer a purpose-driven and inclusive environment where innovation, continuous learning, and employee wellbeing are at the core. We are proud to welcome individuals of all generations, genders, and backgrounds, valuing the diverse perspectives that strengthen our culture and contribute to our success. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369104364/",
    "job_id": "4369104364",
    "source": "linkedin",
    "company_name": "Emirates Industrial Panel (EIP)",
    "job_title": "Assistant Finance Manager",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357422610/",
    "job_id": "4357422610",
    "source": "linkedin",
    "company_name": "Nedbank",
    "job_title": "Assistant Financial Officer",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359839816/",
    "job_id": "4359839816",
    "source": "linkedin",
    "company_name": "Hatch",
    "job_title": "Manager: Finance",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Requisition ID: 97992Job Category: FinanceLocation: Johannesburg, Gauteng, South AfricaJoin a company that is passionately committed to the pursuit of a better world through positive change. With more than 65 years of business and technical expertise in mining , energy , and infrastructure , our 10,000 colleagues in 150 countries tirelessly work toward bettering the industries in which we operate. With practical solutions that are safe, innovative and sustainable, we think globally while acting locally. Are you looking for an opportunity to join a diverse group of professionals who are committed to remaining exceptional? We look forward to hearing from you.As part of our Shared Services group, comprised of Finance, Marketing, Communications, Human Resources, Commercial, Legal and Facilities, we support the business achieve their goals through a range of strong technical capabilities. We ensure delivery of services through the skills of our people, methodologies, and systems.The Manager Finance performs a wide range of accounting and financial management duties in accordance with established accounting standards, internal controls, and regulatory requirements. The role provides technical accounting support to the Regional Finance Director and the Accounting and Finance Teams across multiple jurisdictions. The Manager Finance is responsible for overseeing financial operations, ensuring strong governance, maintaining accurate financial reporting, and supporting compliance with corporate, tax, payroll recording,and statutory requirements.Key ResponsbilitiesFinancial Reporting & Accounting Summarise current financial status by collecting information, reviewing, assisting, and/or preparing statements of financial position and profit and loss for companies in our jurisdictionsLiaise with and prepare financial reporting for African entitiesSubstantiate financial transactions by auditing supporting documentationMaintain accounting controls by preparing, updating, and recommending financial policies and proceduresVerify, allocate, post, and reconcile financial transactionsAnalyse financial information and summarise financial results for managementReview general ledger reconciliations to ensure accuracy and complianceSupport month-end close processes, including journals, reconciliations, and reportingAssist with year-end close procedures and prepare audit schedules for external auditors.Operational Finance and Internal Controls Reconcile financial discrepancies by collecting and analysing account informationDevelop, document, and maintain business processes and accounting policies to ensure strong internal controlsConduct financial and multiplier reviews of engagement performanceProvide guidance and support to accounting clerical staff.Payroll Accounting and Allocations Assist with SDH rate calculationsPerform salary variance calculations for the AIM regionValidate payroll allocations before uploading to SAPEnsure all payroll entries are accurately captured in SAPVerify salary transfers before releaseReconcile salary bank accounts and salary creditors before paymentProcess all salary-related third-party paymentsInvestigate ad hoc payroll-related queries from a finance perspectiveManage cross-charging of payroll costs across regions based on engagement assignments.Tax Compliance and Regulatory Accounting Perform hypothetical tax accountingManage tax equalisation/protection accounting and perform reconciliationsApply general knowledge of corporate tax, income tax, and employee tax to ensurecorrect treatment and complianceReview transactions to ensure accurate employee tax (PAYE/UIF/SDL) allocation and adherence to tax legislationManage compliance for South African Reserve Bank (SARB) applications, exchange control reporting, and related regulatory requirementsApply detailed knowledge of the VAT Act to ensure correct VAT classification, submission preparation, reconciliation, apportionment calculations, andTreatment of zero-rated/exempt supplies.Client and Stakeholder Engagement Contribute to strong client relationships through positive, professional engagement with client personnelCommunicate work status, challenges, and escalations to Managers and/or the DirectorCollaborate with internal teams to resolve complex accounting or compliance queries.RequirementsEducation and Experience Bachelor’s Degree in Finance, Accounting, or related fieldEquivalent practical experience in financial management, accounting, or auditing rolesMinimum strong working knowledge and practical application of IFRSProven experience preparing financial statementsExperience with general ledger functions and month-end/year-end close processesWorking knowledge of South African Reserve Bank regulations and exchange control requirements.Technical Skills Detailed, technical knowledge IFRS application in operational financeGeneral knowledge of corporate tax, company income tax rules, and compliance obligationsWorking knowledge of employee tax requirement",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362016280/",
    "job_id": "4362016280",
    "source": "linkedin",
    "company_name": "Binance",
    "job_title": "Finance/Admin Executive",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352735929/",
    "job_id": "4352735929",
    "source": "linkedin",
    "company_name": "FUN AND SUN",
    "job_title": "Accountant - Supplier Reconciliation",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354101556/",
    "job_id": "4354101556",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "General Manager / Deputy General Manager - Internal Audit- For Pretty Group- Job ID: 1451666",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Pretty Group is looking for General Manager / Deputy General Manager - Internal AuditJob Description / ResponsibilityThe General Manager / Deputy General Manager - Internal Audit holds a crucial role within the organization and will be responsible for overseeing and managing the total internal audit functions of all the facilities of the Group. This role ensures that the organization’s Internal Audit operations, financial reporting, and internal controls are efficient, effective, and compliant with relevant regulations and standards.Job location will be at Head Office, Dhaka.Internal Control & Risk Management:Review internal control procedures and identify key risk areas within the Group.Develop and propose appropriate controls to mitigate identified risks.Assess the effectiveness of internal controls and risk management processes.Internal Audit Function & Scope:Establish and lead the in-house internal audit function.Determine the internal audit scope and approach based on risk assessment.Ensure that audit work aligns with the organization's standards and best practices.Process Improvement & Compliance:Work closely with senior management to enhance risk management and internal controls.Focus on financial and process audits, ERP implementation, and wastage control.Ensure compliance with internal policies, regulatory requirements, and best practices.Team Development & Leadership:Develop the skills and competencies of internal audit staff.Foster a culture of continuous improvement within the audit team.Financial & Operational Analysis:Prepare accurate and timely reports for management, covering:Weekly Review MeetingsBudget Variance AnalysisCost & Margin (CM) VarianceRaw Material (RM) ProcurementRevenue RealizationIncentive AnalysisInventory ManagementCash & Bank AuditsBank ReconciliationPayments & B2B L/C Acceptance ReportsReview and finalize audit findings and observations, ensuring they are supported by audit evidence.Effectively manage audit findings and recommend corrective actions.Ensure audit reports are accurate, insightful, and delivered on time.You would perform any other tasks as assigned by the Management.Educational RequirementsBachelor/HonorsMaster / Graduation in Accounting from any reputed institution.Applicant must have completed CACC. CA or CMA (Professional Level) shall be preferred.Professional Certification in Qualified Internal Auditor (QIA) will be given preference.Skills Required: Internal Audit, Financial Audit, Process AuditExperience RequirementsAt least 15 year(s)The applicants should have experience in the following business area(s):Garments, Textile, Group of Companies, Sweater IndustryAdditional RequirementsCommunication skills in both English and Bengali in verbal and written.Ability to work independently and as part of a team.Be able to cope with pressure, flexible, and adaptable.Highly self-motivated, self-directed, and proactive.Well conversant with IT equipment.Job LocationDhaka (GULSHAN 2) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343105427/",
    "job_id": "4343105427",
    "source": "linkedin",
    "company_name": "Sapo Technology JSC",
    "job_title": "Process Quality Assurance",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4347998953/",
    "job_id": "4347998953",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Senior External Auditors - Dubai/ Sharjah",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353948624/",
    "job_id": "4353948624",
    "source": "linkedin",
    "company_name": "IHG Hotels & Resorts",
    "job_title": "Income Auditor",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365468906/",
    "job_id": "4365468906",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Audit Manager",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369128183/",
    "job_id": "4369128183",
    "source": "linkedin",
    "company_name": "Sanlam",
    "job_title": "Risk Assurance Specialist-FTC",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365057264/",
    "job_id": "4365057264",
    "source": "linkedin",
    "company_name": "Dis-Chem",
    "job_title": "ESG Analyst",
    "location": "Midrand, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Dis-Chem Pharmacies’ in Midrand has an opportunity available for an ESG Analyst to join the team. The purpose of this role is to research and analyse ESG data to identify ESG risks and opportunities to inform that ESG tragedies.Minimum Requirements…Essential:Grade 12 – Matric or a Senior CertificateDegree in Environmental Science / Social Science Management / Project Management or related fieldMinimum of 3 - 5 years’ experience in ESG or sustainable development related field.Experience in developing and implementing ESG metrics and data analyticsJob Specification…ESG Analysis and Reporting:Establish and implement ESG data management frameworkAnalyse data to inform and support ESG materiality assessment process including peer benchmarkingIdentify key ESG risks and opportunities that can impact ESG performance, reputation and operationsConduct monitoring and measurements of ESG performance indicators and reportingConduct due-diligent studies and ESG performance evaluation of suppliers within the value chainAssess and maintain the ESG Materiality MatrixAssess the ESG rating from rating agencies to determine the gaps and implement appropriate controls to support ESG strategySupport the development of the ESG risk frameworkPlan for and coordinate non-financial assurance processSupport in the preparation of ESG-related Board and Committee materials and reports, as well as support the communications narrative and content for the Group’s ESG activitiesSupport ESG disclosures and reportingRegulatory Compliance:Monitor ESG regulatory and standards developments and implement initiatives to ensure complianceConduct an in-depth research and data analysis to assess the ESG performance, peer and industry benchmarkingStakeholder Liaison:Collaborate with the internal and external stakeholders to inform the development and implementation of the ESG strategies and policiesGeneral:Adhere to Dis-Chem Policies and Standard Operating Procedures.Adhere to Health and Safety rules and regulations.CompetenciesEssential:Strong knowledge of ESG data management.Critical thinking, capacity to evaluate complex information, identify patterns and draw meaningful conclusionsUnderstanding business operations and communicating - various levels and departments within the organisationStrong written and verbal communication skills to effectively convey complex ESG concepts and findings to diverse stakeholders.Builds constructive working relationships characterised by a high level of acceptance, cooperation, and mutual respectAttention to detail to ensure accuracy and reliability of ESG AnalysisStrong project management and organisational skills to meet reporting deadlines and manage multiple tasks simultaneously.Computer skills – Microsoft Office (Word, Excel, PowerPoint, Outlook, MS Project), ESG Frameworks and standards, Data visualisation tools Special conditions of employment:Occasional travelingSouth African citizenMIE, clear criminal and creditDriver’s license and own reliable transport. Remuneration and benefits:Market related salaryMedical aidProvident fundStaff account ONLY SUCCESSFUL APPLICANTS WILL BE CONTACTED. IF YOU HAVEN`T BEEN CONTACTED WITHIN TWO WEEKS AFTER THE CLOSING DATE CONSIDER YOUR APPLICATION AS UNSUCCESSFUL. Dis-Chem Pharmacies is an equal opportunity employer. Dis-Chem’s approved Employment Equity Plan and targets will be considered as part of the recruitment process aligned to Dis-Chem’s Employment Equity & Transformation Strategy. Dis-Chem actively supports the recruitment of People with Disabilities. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368276347/",
    "job_id": "4368276347",
    "source": "linkedin",
    "company_name": "Mediclinic Group",
    "job_title": "Unit Manager - Orthopaedic",
    "location": "Pretoria, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Important NoticeMediclinic wants to alert candidates that third parties are from time to time fraudulently advertising vacancies at Mediclinic and / or offering employment contracts with subsequent payment instructions to accounts linked to the fraudulent activity. Please note that Mediclinic will never request payment for an application or offer made. All official vacancies are advertised on the Mediclinic career website and candidates are advised to visit the site to confirm the validity of vacancies.Unit Manager - OrthopaedicApply now » Start applying with LinkedIn Choose how often (in days) you want to receive a notification: Apply Now Choose how often (in days) you want to receive a notification:Please wait...Search Jobs by Keyword | Search Jobs by Location | Back to Southern AfricaShare this JobChoose how often (in days) you want to receive a notification:Mediclinic Highveld | Trichardt | South Africa Closing date: 12/01/2026Number of positions: 1Recruiter name: Ronel Melanie JansenReference number: 66108Workplace Type: On-sitePermanentPlease note if you are an internal employee on a fixed term contract please apply using an external candidate profile and not your employee profileMAIN PURPOSE OF JOBThe Unit Manager manages a specific nursing unit, e.g. a surgical ward, to ensure safe patient care and a positive client experience. They further manage human and other resources to ensure that staff are engaged and processes are optimised.KEY RESPONSIBILITY AREASEnsure safe patient care by meeting set clinical quality standards according to company policies and proceduresManage and mitigate clinical risks in the unitLead and manage the staff in the unitManage the unit's operational and capital expenses according to financial and budget guidelines and ensure optimal utilisation of resourcesManage and actively contribute to a positive client experience in the hospitalSupport the achievement of interdepartmental outcomesManage key stakeholder relationsRequired EducationESSENTIAL EDUCATION: Professional Nurse qualification, and Postgraduate Diploma in Health Services Management or an Accredited Management Qualification OR 5 years of leadership experience in a hospital, andPostgraduate Diploma in Nursing if managing a specialist unit (e.g. Perioperative Nursing)Desired EducationN/ARequired ExperienceESSENTIAL MINIMUM EXPERIENCE: 5 years of Professional Nurse experience in a hospital2 years of leadership experience in a hospitalDesired ExperienceN/ARequired Job Skills And KnowledgeAuditing and accreditation processesClinical risk managementComputer literate (Microsoft Office)Continuous improvement and quality assurance methodologiesFinancial managementHealthcare industryHuman resource processes including employee relationsInfection prevention and controlManagement of staff productivityNursing functional knowledgePatient complaint managementRelevant nursing legislationAll applicants will be considered, with the understanding that preference will be given in accordance with the Employment Equity Plan of Mediclinic Southern Africa, as well as internal applicants/employees that meet the minimum requirements.Please note if you are an internal employee on a fixed term contract please apply using an external candidate profile and not your employee profileApply now » Start applying with LinkedIn Choose how often (in days) you want to receive a notification: Apply Now Choose how often (in days) you want to receive a notification:Please wait...Find Similar JobsSouthern Africa - Internal, Search By Keyword - MCSA, Search By Keyword, Hirslanden - InternalJoin our Talent CommunityBecome a part of our Talent Community and we will get in touch with you as soon as there is a relevant opening that fits your skills, interests and experience.Sign UpJob Type: NursingApply now » Start applying with LinkedIn Choose how often (in days) you want to receive a notification: Apply Now Choose how often (in days) you want to receive a notification:Please wait...Video Token: KDIu6uSOve4Apply now » Start applying with LinkedIn Choose how often (in days) you want to receive a notification: Apply Now Choose how often (in days) you want to receive a notification:Please wait...Custom Field 1: v1658243237/MCSA_job_advert_header_mbsg7o.jpgApply now » Start applying with LinkedIn Choose how often (in days) you want to receive a notification: Apply Now Choose how often (in days) you want to receive a notification:Please wait...Job Segment: Infection Control, Orthopedic, Risk Management, Patient Care, Quality Assurance, Healthcare, Finance, Technology Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362015465/",
    "job_id": "4362015465",
    "source": "linkedin",
    "company_name": "Techcombank (TCB)",
    "job_title": "Risk System Business Analyst",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job PurposePlay the role of Biz owner, Product owner of the systems: LOS – Individual; LOS-SME; Limit management system; EW System – Individual; EW System – SME...)Maximizing the value of the product/ system by designing and optimizing the product backlog, defining product vision, and ensuring alignment with business objectives, be the primary liaison between stakeholders and the development teamKey ResponsibilitiesDigital Process Re‑engineering: Lead end‑to‑end credit journey design (origination/approval, disbursement, post‑loan servicing, collections), streamlining workflows to minimize manual steps and maximize automation; translate process changes into prioritized backlog items with measurable outcomes. Technology Integration Ownership: Define and prioritize integration requirements related systems; Backlog Design & Optimization: Structure epics/features/stories to reflect E2E processes, maintain clear DoR/DoD and ROI‑based prioritization; continuously refine based on metrics and stakeholder feedbackGather and analyze requirements from stakeholders and translate them into clear user stories and acceptance criteria.Validate deliverables against business objectives and approve product increments.Monitor market trends and propose enhancements to improve product performance and user experience.Maintain transparent communication with stakeholders regarding progress, risks, and changes.Success Profile - Qualification and ExperiencesDegree/Occupation: University graduate or above majoring in conomics/ finance/ banking/ statisticsMinimum 5 years experience in as a Product Owner or Business Analyst in an Agile/Scrum environment.Have experience in building & managing technology systems in banks Familiarity with LOS/LMS, decision engines, workflow/BPM tools, and data lake architecturesStrong understanding of software development lifecycle and Agile methodologiesHave knowledge of risk management operations (risk policies, data - risk models, appraisal and approval processes; early warning work...) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365023742/",
    "job_id": "4365023742",
    "source": "linkedin",
    "company_name": "VMO Careers",
    "job_title": "Business Analyst Japanese_Hanoi",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353927785/",
    "job_id": "4353927785",
    "source": "linkedin",
    "company_name": "Pegasus Airlines",
    "job_title": "Business Analyst - Digital - Hybrid",
    "location": "Pendik, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365045620/",
    "job_id": "4365045620",
    "source": "linkedin",
    "company_name": "Dubai Holding",
    "job_title": "Executive – Document Control and Administration - Dubai Holding Land Estates",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361926021/",
    "job_id": "4361926021",
    "source": "linkedin",
    "company_name": "Ant International",
    "job_title": "Payment Channel Price and Billing Operation",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362104302/",
    "job_id": "4362104302",
    "source": "linkedin",
    "company_name": "Borr Drilling",
    "job_title": "Senior Regional Reporting and Compliance Accountant",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357408159/",
    "job_id": "4357408159",
    "source": "linkedin",
    "company_name": "ESAS YMM VE BAĞIMSIZ DENETİM LİMİTED ŞİRKETİ",
    "job_title": "Muhasebe Uzmanı",
    "location": "Sisli, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362420761/",
    "job_id": "4362420761",
    "source": "linkedin",
    "company_name": "KUWAIT JOBS HERE",
    "job_title": "Admin Assistant Job In Kuwait",
    "location": "Salmiya, Hawalli, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361917608/",
    "job_id": "4361917608",
    "source": "linkedin",
    "company_name": "Team Saudi",
    "job_title": "Senior Coordinator, Athlete Performance (1027)",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348905122/",
    "job_id": "4348905122",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "T&L: HR Reward Assistant Manager/Manager",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Date: 5 Feb 2026Service Line / Portfolios: Global Employer ServicesLocation:Singapore, Singapore, SGTitle: Global Employer Services Service Line (based in Singapore) – HR Rewards Assistant Manager/ManagerAre you ready to unleash your potential?At Deloitte, our purpose is to make an impact that matters for our clients, our people, and the communities we serve.We believe we have a responsibility to be a force for good, and WorldImpact is our portfolio of initiatives focused on making a tangible impact on society’s biggest challenges and creating a better future. We strive to advise clients on how to deliver purpose-led growth and embed more equitable, inclusive as well as sustainable business practices.Hence, we seek talented individuals driven to excel and innovate, working together to achieve our shared goals.We are committed to creating positive work experiences that foster a culture of respect and inclusion, where diverse perspectives are celebrated, and everyone is recognised for their contributions.Ready to unleash your potential with us? Join the winning team now!Work you’ll doThe successful candidate will work in a fast growing and specialist team advising our clients in all areas of how and why employers reward and pay their employees, including reward strategy, board and executive pay, and designing and operating incentive arrangements.RoleWe are building a true advisory practice, and we work in partnership with our clients to deliver high quality, high impact advice. While no day is the same, typical areas of focus for this role are: Driving research and working with our clients to create strategies to optimise their approaches to rewarding their workforce, and modelling the financial and strategic impacts of reward program design changes Conducting market assessments, research and analysis to understand industry and organisation-specific issues, including business strategy, corporate performance, compensation and rewards practices and trends, and best practices Supporting the design of executive pay strategies and conducting executive and non-executive director pay benchmarking Supporting clients with the design, implementation and operation of equity and cash incentive plans in locally and globally, including tax and regulatory considerations Advising on reward matters in an M&A or transactions environment Providing support on proposals and business development activity (e.g. preparing slides, bid responses, developing your own client relationships) and collaborating with other leaders to grow our advisory business in the market Your role as a leaderAt Deloitte, We Believe In The Importance Of Empowering Our People To Be Leaders At All Levels. We Connect Our Purpose And Shared Values To Identify Issues As Well As To Make An Impact That Matters To Our Clients, People And The Communities. Additionally, Managers Across Our Firm Are Expected ToDevelop diverse, high-performing people and teams through new and meaningful development opportunities.Collaborate effectively to build productive relationships and networks.Understand and lead the execution of key objectives and priorities for internal as well as external stakeholders.Align your team to key objectives as well as set clear priorities and direction.Make informed decisions that positively impact the sustainable financial performance and enhance the quality of outcomes.Influence stakeholders, teams, and individuals positively – leading by example and providing equal opportunities for our people to grow, develop and succeed.Lead with integrity and make a strong positive impact by energising others, valuing individual differences, recognising contributions, and inspiring self-belief.Deliver superior value and high-quality results to stakeholders while driving high performance from people across Deloitte.Apply their understanding of disruptive trends and competitor activity to recommend changes, in line with leading practices.Requirements Strong analytical, consultative, quantitative, problem solving and project management skills, honed through reward advisory-related projects or relevant in-house experience Able to synthesize, assess and communicate information effectively. You can use analysis, experience and judgement to develop meaningful insights and recommendations for clients. Comfortable working in ambiguity. You are able to work in a fast-paced environment with sometimes unpredictable circumstances or changes and make informed decisions without all the information. Bachelor's degree in Accounting, Finance or other business-related field, with a Professional Qualification Due to volume of applications, we regret only shortlisted candidates will be notified. Candidates will only be contacted by authorised Deloitte Recruiters via firm’s business contact number or business email address.Requisition ID: 111802In Singapore, the services are provided by Deloitte and other related entities in Singapore(\"Deloitte in Singapore\"), which are affiliates ",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362121481/",
    "job_id": "4362121481",
    "source": "linkedin",
    "company_name": "Univerz HR Consulting Pte Ltd",
    "job_title": "Treasury Manager",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368211429/",
    "job_id": "4368211429",
    "source": "linkedin",
    "company_name": "The Edge Partnership - The Edge in Asia",
    "job_title": "Operations Analyst (HFT)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360604707/",
    "job_id": "4360604707",
    "source": "linkedin",
    "company_name": "JLL",
    "job_title": "Senior Finance Analyst",
    "location": "Warsaw Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Location: WarsawWork model: hybrid (2 days working from the office - Warsaw Spire building)Type of contract: contract of employmentRole summary:The Senior Finance Analyst is an integral part of the Client Finance team, supporting the Client Finance Director with managing the financial and commercial aspects of client contracts working within a complex and high performing finance function.Responsibilities:Responsibility for delivering effective financial control processes with specific focus on the management of changeConfiguration and set up of financial and client reporting systemsDefining and implementing financial processes to deliver an effective change management solutionUnderstanding and interpreting client contract financial process commitments, including KPI reportingSetting up high quality financial reporting to the JLL Account Team and the client (glide path performance reporting, budget variance reporting etc.). Supporting the commercial management and analysis of the Account (planning & forecasting; savings tracking; etc.)Development of new tools and processes to standardise and improve service deliveryWork as a proactive team member of Client Finance teams alongside SME’s in Sourcing, HR, Technology and Service DeliveryEngage and build relationships with finance professionals in JLL Clients in support of finance processes on transitionsTrain and support Client Delivery teams in financial processesAbility to quickly analyse process and performance trends and issues; and propose corrective solutions. Ensure compliance to relevant policies and procedures – make recommendations to ensure procedures are maintained, up to date and reflect ongoing project delivery needsAssist wider client team in developing and enhancing the client delivery platform. Requirements:2-3 years’ experience in a similar position (working with international teams and clients). Confident and articulate with an eye for detailMotivated, positive and flexible in approach to work and able to develop others in such an approach. Proactive in identifying issues and potential solutions. Self – supporting; diligent; can deliver to tight deadlines. Ability to learn quickly, and desire to develop. Ability to work collaboratively and through challenges with the client; other members of the account and corporate teams. Customer Service: Commitment to solve requests and problems. Strong interpersonal and communication skills. Excellent Excel modelling skills, proficient in other Office toolsExperience of major ERP systems (Peoplesoft, SAP, JDEdwards) desirableWhat we offer:Contract of employmentBenefits package (private healthcare, cafeteria system, life insurance)Long-term career growth opportunitiesTraining and development programs to enhance your skillsModern office in an attractive location (Warsaw Spire) near the subway station (hybrid working model) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361976563/",
    "job_id": "4361976563",
    "source": "linkedin",
    "company_name": "Acuity Analytics",
    "job_title": "Analyst - Investment Banking",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354127336/",
    "job_id": "4354127336",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Business Development Manager (Automotive Spare Parts) - For ACI Motors - Job ID: 1451576",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348126334/",
    "job_id": "4348126334",
    "source": "linkedin",
    "company_name": "Alstom",
    "job_title": "Technical Project Manager",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357553458/",
    "job_id": "4357553458",
    "source": "linkedin",
    "company_name": "RubyPlay",
    "job_title": "Vice President Finance",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "RubyPlay is a place where passion meets competence. Since 2017, we’ve made more than 200 innovative games and built more than 100 strong partnerships globally!Proud to be:The Winner at BFTH Arena Awards — Best Online Casino GameShortlisted for SBC Awards 2024 — Casino/Slots Developer of the YearA strong player on 10+ markets globallyBeloved workplace for hundreds of specialists from 34 countriesWe are now growing our team and looking for driven professionals ready to build their careers in a strong, international studio with a product that’s making waves worldwide.We are seeking a VP of Finance to lead our global finance organization. In this role, you will be the CFO’s right hand and the manager of the department.You will not only ensure the integrity of our financial reporting and compliance but also drive business performance through deep cross-functional partnership. You will build a scalable infrastructure capable of supporting high-volume transaction growth while optimizing margins and mitigating risk.Here’s How You’ll Make an Impact:1. Financial Operations, Reporting & Tax Direct all accounting operations (GL, AP, AR, Treasury) ensuring a timely and accurate monthly, quarterly, and annual close processManage multi-entity consolidation and navigate the complex international tax landscape of iGaming (VAT, Gaming Duties, Transfer Pricing, and Corporate Tax)Lead the relationship with external auditors, ensuring clean audits and swift resolution of any findingsManage cash flow forecasting, liquidity, and FX risk strategies across multiple currencies2. FP&A & Strategic Business PartneringPartner with the CCO and Sales leadership to model and approve deal structures (revenue share, fees, minimum guarantees) to ensure profitability before contracts are signedCollaborate with relevant stakeholders to assess the ROI of R&D investments and new market entriesLead the annual budgeting process and rolling forecasts, providing the management team with clear visibility into future performanceMove finance beyond \"gatekeeping\" by providing department heads with actionable dashboards and data to manage their own P&Ls effectively3. Operational Excellence & AutomationOwn the financial tech stack (ERP, FP&A). Lead the implementation of automations to streamline the \"agreement-to-Cash\" and \"PO-to-Pay\" cyclesDesign automated reconciliation processes between platform gaming data (backend) and financial ledgers to handle high transaction volumes with minimal manual interventionContinuously audit internal workflows to eliminate bottlenecks, ensuring the finance function can scale without a linear increase in headcount4. Procurement & Cost OptimizationAssist negotiations on \"material expense\" contractsProactively review vendor performance and costs. Challenge legacy spend and drive economies of scale as the business growsMonitor gross margins closely, identifying cost creep in hosting or third-party provider fees and initiating corrective actions5. Technical Accounting, Legal & ComplianceServe as the internal expert on technical accounting (e.g., IFRS)Partner with the Legal team to review financial clauses in commercial contracts and vendor agreementsEnsure all financial reporting requirements for gaming licenses are met accurately and on time6. Team Leadership & DevelopmentMentor and manage a diverse finance team. Foster a culture of accuracy, accountability, and curiosityEnsure the team remains up-to-date on changing regulatory and accounting standardsWhat Makes You A Strong Candidate:10+ years of finance experience, with significant time spent in a leadership role (Director/VP)iGaming experience - advantage, high pace growth company experienceCPA / ACCA / ACA qualified (or equivalent)Knowledge of IFRS and revenue recognition in a digital economyExperience implementing or optimizing ERPs and FP&A tools.Strong negotiation skills for both revenue deals and vendor procurementTrack record of retaining top talent and building cohesive teamsA finance leader who enjoys the details but can also present the big picture to the management teamWhy You’ll Love It Here:Remote-first flexibility — Work from anywhere with a setup for deep focus and work-life balanceLearning & growth — Development budgets and dedicated days to upskill and explore new areasHealth & wellness — Medical coverage and well-being budgets to help you feel balanced, strong, and supportedYearly bonus — Rewards based on company success and your impactCareer growth — Vertical and horizontal opportunities to grow and advanceGlobal team — Talented, diverse colleagues you’ll enjoy working withInterested in becoming a RubyPlayer and making a mark in the iGaming world? Join us! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361016704/",
    "job_id": "4361016704",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Financial Controller | Consulting",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354097117/",
    "job_id": "4354097117",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Head of Branch / Manager of Sub-Branch - For Midland Bank PLC- Job ID : 1451844",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356201709/",
    "job_id": "4356201709",
    "source": "linkedin",
    "company_name": "Hays",
    "job_title": "Kontroler finansowy",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4262036537/",
    "job_id": "4262036537",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Embedded Linux Senior Software Engineer - Optimisation",
    "location": "Kuwait City, Al Asimah, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354057663/",
    "job_id": "4354057663",
    "source": "linkedin",
    "company_name": "Villvay",
    "job_title": "Associate Tech Lead / Tech Lead – Elasticsearch Engineering (Search Systems)",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4311569328/",
    "job_id": "4311569328",
    "source": "linkedin",
    "company_name": "Robusta Studio",
    "job_title": "Data Automation Solution Expert (Google tools) - Remote - Octopus - Immediate hi",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4305786564/",
    "job_id": "4305786564",
    "source": "linkedin",
    "company_name": "Activate Interactive",
    "job_title": "Systems Analyst",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364218369/",
    "job_id": "4364218369",
    "source": "linkedin",
    "company_name": "SKINTIFIC",
    "job_title": "Accounting Manager",
    "location": "South Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Responsibilities:Handle the full end-to-end accounting process.Prepare and review journal entries to ensure accuracy and compliance with accounting principles.Prepare accurate and timely financial statements (monthly, quarterly, and annual).Manage the month-end and year-end closing processes.Ensure compliance with all applicable accounting standards, tax regulations, and internal controls.Analyze financial data and provide insights to management.Coordinate with external auditors and tax advisors.Develop and implement accounting policies and procedures.Requirements:Minimum 5 years relevant working experience in Accounting and 2 years in a managerial position.Strong communication both in Bahasa Indonesia and English.Strong understanding of accounting principles and financial statement preparation.Proven experience in handling end-to-end accounting processes.Strong skills in preparing journal entries and creating financial statements.Experience in managing the closing process (month-end and year-end).Excellent analytical, problem-solving, and decision-making skills.Proficiency in accounting software and MS Excel.Available to follow work from office scheme (Location: Mega Kuningan, South Jakarta).Able to join immediately. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365241899/",
    "job_id": "4365241899",
    "source": "linkedin",
    "company_name": "LinkIT 360",
    "job_title": "Finance and Accounting Manager",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368976131/",
    "job_id": "4368976131",
    "source": "linkedin",
    "company_name": "Egis Pharmaceuticals PLC",
    "job_title": "Raktári adminisztrátor",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361766982/",
    "job_id": "4361766982",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Credit Analyst",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4271283535/",
    "job_id": "4271283535",
    "source": "linkedin",
    "company_name": "KÜRT Information Management & Data Recovery Co.",
    "job_title": "Kiberbiztonsági Auditor",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364237724/",
    "job_id": "4364237724",
    "source": "linkedin",
    "company_name": "Sompo Insurance Indonesia",
    "job_title": "Financial Planning Analyst",
    "location": "South Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370371965/",
    "job_id": "4370371965",
    "source": "linkedin",
    "company_name": "Alignerr",
    "job_title": "Accounting Instructor (AI Training)",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About The RoleWe’re seeking accounting instructors to help evaluate AI systems trained on accounting principles and financial reporting logic. Organization: Alignerr (Powered by Labelbox) Location: Remote Type: Hourly / Task-based Contract Compensation: $35-70 /hour Commitment: 10-40 hours/weekWhat You’ll Do Review accounting questions and explanations used in AI training. Assess accuracy of concepts such as financial statements, bookkeeping, and controls. Identify errors, edge cases, and misleading explanations. Provide structured feedback to improve precision and clarity. Work independently and asynchronously to meet project deadlines.Who You Are 3+ years of experience teaching accounting at the postsecondary level. Strong understanding of financial and managerial accounting principles. Able to evaluate written quantitative and rule-based reasoning. Comfortable reviewing structured content at scale.Nice to Have CPA or Master’s degree in Accounting. Experience with audits, financial analysis, or applied accounting. Familiarity with AI or model evaluation workflows.Why Join Us Competitive pay and flexible remote work. Lead a team working on cutting-edge AI projects. Exposure to advanced LLMs and how they’re trained. Freelance perks: autonomy, flexibility, and global collaboration. Potential for contract extension.Application Process (Takes 10-15 min) Submit your resume Complete a short screening Project matching and onboardingPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355311818/",
    "job_id": "4355311818",
    "source": "linkedin",
    "company_name": "Ninety One",
    "job_title": "Client Lifecycle Analyst",
    "location": "City of Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About Ninety One:Ninety One is South Africa’s largest investment manager and the only one with a global presence. The firm has 22 offices across 15 countries on five continents and manages R3.4 trillion of assets on behalf of clients (as at 31 December 2025).Established in Cape Town in 1991 as part of the Investec Group, Ninety One demerged and rebranded in 2020, becoming an independent firm dual-listed in London and Johannesburg. Always an active manager, Ninety One today offers strategies across equities, fixed income, multi-asset and private markets to institutions, advisors and individual investors around the world.About the team:The Client Lifecycle Management (CLM) Team is a newly formed, centralised function designed to support the investment activity of both individual and institutional clients across the Ninety One global fund ranges. The team plays a pivotal role in facilitating fund investment inflows and outflows by managing key client lifecycle events, with a primary focus on executing Anti-Money Laundering (AML) and Know Your Client (KYC) due diligence throughout the full client relationship. As a dedicated centre of expertise, the CLM team ensures AML servicing is delivered with consistency, efficiency and rigour. Acting as a professional interface with clients, the team is responsible for requesting, collecting and sensibly assessing AML/KYC information to ensure full regulatory compliance.Operating in close partnership with Compliance, Legal, Fund Operations, Client Operations and Onboarding, the CLM Team helps to ensure clients are appropriately managed and monitored across all lifecycle stages. A critical enabler of the team’s effectiveness is a specialised client lifecycle management system, which supports automation, reduces delays and strengthens oversight. This technology allows the team to deliver a seamless, professional and compliant experience for clients while ensuring regulatory compliance.In this role you will:Ensure clients are appropriately onboarded by completing initial KYC due diligence on individual and institutional clients, including engaging with clients to understand corporate structures and obtain required documentationOversee KYC refreshes, ongoing due diligence (ODD) and politically exposed person (PEP) approval processesMonitor progress of onboarding and due diligence processes involving third parties and internal stakeholdersServe as the primary point of contact for KYC-related queries and communicationManage query resolution from clients, third parties and internal teams like Client Group and Client OperationsCollaborate with key internal and external stakeholders, including Legal, Compliance, Onboarding, Fund Operations and transfer agents, to ensure timely, policy compliant completion of KYC requirementsMonitor risks, trends and issues to ensure effective controls are in place, proactively escalating high-risk cases or anomalies and adapting processes to support continuous improvementMaintain accurate records to support audit and reporting requirementsSource, aggregate and present reportable information in formats required by fund committees, boards, investors and managementStay informed on evolving KYC, AML and regulatory requirements and ensure team compliance with these standardsOperate effectively within specialised CLM platforms and work with technology teams to streamline workflows, reduce manual interventions and enhance automation, monitoring and regulatory readinessDevelop and maintain strong working relationships across all relevant internal functions and external service providersYou should consider applying if you have:An undergraduate degree in law, commerce, or a related field2-3 years relevant work experience at a financial institution, bank, asset manager, development finance institution or professional services, law, accounting or consulting firmExperience in client-facing roles, with the ability to manage challenging or sensitive conversations professionallyFamiliarity with client lifecycle management (CLM) platforms, as well as AI tools or low-code/no-code automation toolsSome of the attributes we look for in a person:A client focused and collaborative mindsetIntellectual curiosity and a willingness to ask thoughtful questionsThe ability to ‘approach and own’ and continuously identify opportunities to develop processes and controlsResults-oriented and motivated by achieving meaningful outcomesStrong verbal and written communication skillsDetail orientated, well organised and comfortable working in a challenging, dynamic environment Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364246709/",
    "job_id": "4364246709",
    "source": "linkedin",
    "company_name": "TMF Group",
    "job_title": "Junior Client Administrator/Junior Client Accountant",
    "location": "City of Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369465375/",
    "job_id": "4369465375",
    "source": "linkedin",
    "company_name": "M3 Human Capital Management (Pty) Ltd",
    "job_title": "Business Analyst",
    "location": "Stellenbosch, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361301453/",
    "job_id": "4361301453",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Finance Analyst - Contractor",
    "location": "Mechouar, Casablanca-Settat, Morocco",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About AbbottAbbott is a global healthcare company committed to helping people live not just longer, but better. We employ around over 100,000 people in 150+ countries with a diverse portfolio spanning pharmaceuticals, nutrition, diagnostics and devices.At Abbott, you have the opportunity to make a positive impact on the world through challenging and rewarding work as part of a highly successful and trusted organization that is shaping the future of health. Realize your potential!Core Job ResponsibilitiesDetailed SG&A analysis including department budgets by preparing monthly tracker for actuals and performance vs planFollow up on monthly payments to vendors/suppliers and assure timely settlements for Abbott duesAssist the FP&A manager in the performing weekly reporting “sales flash, LBEc”Assist the FP&A manager in the performing month end close “actual reporting, preparing monthly reports (F.1.0., etc)Assist the FP&A manager in the preparation of cash flow plan, LBEs’Monitor monthly cash flow results and prepare comparison vs different scenariosTrack receivables and communicate with distributors to make sure payments are done timely.Key Success FactorsFocus - Assist the finance Head and the FP&A Manager for the closings and reporting of the affiliate Budgeting & ReportingWill have expert knowledge of finance processes and procedures as applied to a major department/ functional area and or part of the business, and ensure P&L & Cash Flow budget preparation and submission in the systemEnsure corporate policies and procedures are implemented and where necessary, proper deviations are obtained to be in line with market conditionsWill have professional financial skills extensive experience of applying financial solutions in a business environment.Having strong time management skills including organization, prioritization, planning and stress management to meet key goals of the position in the required timelines.QualificationsBTS in Accounting or 1st degree (in commerce or Economics)Experience: 2 years experienced in Accountancy / financial analysis Knowledge in GAAP and/or local country reporting requirements Advanced level spreadsheet experience Multi-national exposureFluent French language, in addition to English. Arabic a plusStrong systems background (GL system / Planning system / Microsoft) Very organized person with good time management skills Quality Orientation in deliverables.Follow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life. Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobalFor further information, and to apply, please visit our website via the “Apply” button below. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361380159/",
    "job_id": "4361380159",
    "source": "linkedin",
    "company_name": "Allianz Services",
    "job_title": "Financial Controller",
    "location": "Bucharest, Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358012189/",
    "job_id": "4358012189",
    "source": "linkedin",
    "company_name": "Umana Fertility",
    "job_title": "Financial Controller",
    "location": "Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364881645/",
    "job_id": "4364881645",
    "source": "linkedin",
    "company_name": "SCOR",
    "job_title": "Operations Manager",
    "location": "Bucharest, Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The Operations Manager plays a critical role in ensuring the smooth and efficient functioning of the organization's operational infrastructure. This role encompasses oversight of core business operations, procurement, facility management, business continuity planning, and office security. The ideal candidate is a strategic thinker with strong leadership skills and a hands-on approach to operational excellence.As a leading global reinsurer, SCOR offers its clients a diversified and innovative range of reinsurance and insurance solutions and services to control and manage risk. Applying \"The Art & Science of Risk,\" SCOR uses its industry-recognized expertise and cutting-edge financial solutions to serve its clients and contribute to the welfare and resilience of society in around 160 countries worldwide.Working at SCOR means engaging with some of the best minds in the industry - actuaries, data scientists, underwriters, risk modelers, engineers, and many others - as we work together to find solutions to pressing challenges facing societies.As an international company, our common culture is defined by \"The SCOR Way.\" Serving both to build momentum that drives the Group forward and as a compass to guide our actions and choices, The SCOR Way is anchored by five core values, reflecting the input of employees at all levels of the Group. We care about clients, people, and societies. We perform with integrity. We act with courage. We encourage open minds. And we thrive through collaboration.SCOR supports inclusion and the diversity of talents, and all positions are open to people with disabilities.At our brand-new Shared Business Platform (SBP) in Bucharest, we offer a dynamic environment where career growth is actively supported through internal mobility, globally recognized certifications, and continuous professional development. We value work-life balance, offering flexible work arrangements, and wellbeing initiatives that help you thrive both personally and professionally.Now, let's explore this exciting opportunity so that you can be part of our mission.The Operations Manager is responsible for leading and optimizing the organization's operational functions to ensure seamless execution of business activities. This role encompasses strategic oversight and hands-on management across procurement, facilities, business continuity, office security, and risk mitigation. The Operations Manager will drive operational efficiency, ensure compliance with internal policies and external regulations, and foster cross-functional collaboration. By implementing robust systems and processes, the role supports the organization's resilience and readiness for disruption, while cultivating a high-performance culture within the operations team.Operational OversightLead and coordinate daily business operations to ensure efficiency and alignment with strategic goals.Monitor and improve operational workflows, systems, and processes.Procurement ManagementOversee procurement activities including vendor selection, contract negotiation, and purchasing.Ensure cost-effective sourcing and compliance with procurement policies. Facility ManagementManage office facilities and ensure they are safe, functional, and well-maintained.Coordinate with external service providers for maintenance, cleaning, and repairs.Business Continuity PlanningDevelop and maintain business continuity and disaster recovery plans.Conduct risk assessments and ensure readiness for operational disruptions. Office SecurityImplement and monitor office security protocols, including access control and emergency procedures.Liaise with security vendors and ensure compliance with safety regulations. Team LeadershipSupervise and develop operational staff, fostering a culture of accountability and continuous improvement. Performance MonitoringDefine and track key performance indicators (KPIs) to evaluate operational effectiveness.Prepare reports and present insights to senior leadership. Stakeholder CollaborationCollaborate with internal departments (e.g., HR, IT, Finance) and external partners to support operational initiatives. Risk ManagementDevelop and implement a risk management framework for operational, financial, legal, and reputational risks for the SBP in line with Global Risk FrameworkConduct risk assessments and recommend mitigation strategies.Oversee incident reporting, investigation, and resolution processes. At least 5 years of experience in operations, procurement, or facilities management.Strategic mindset with operational agility.Excellent communication and interpersonal abilities.Knowledge of business continuity planning and office security best practices.Ability to manage multiple priorities in a dynamic environment.High attention to detail and commitment to operational excellence.Bachelor's degree in Business Administration, Operations Management, or related field (Master's preferred). Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369145625/",
    "job_id": "4369145625",
    "source": "linkedin",
    "company_name": "CanDeal",
    "job_title": "Senior Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369780759/",
    "job_id": "4369780759",
    "source": "linkedin",
    "company_name": "Helios Talent",
    "job_title": "Directeur(trice) des Finances",
    "location": "Quebec City metropolitan community, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361041860/",
    "job_id": "4361041860",
    "source": "linkedin",
    "company_name": "INRS - Institut national de la recherche scientifique",
    "job_title": "Agente ou agent de gestion financière (26011-74679)",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353967767/",
    "job_id": "4353967767",
    "source": "linkedin",
    "company_name": "Randstad Türkiye",
    "job_title": "Global Senior Financial Controller",
    "location": "Beykoz, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361320989/",
    "job_id": "4361320989",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Collection Analyst with French",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356638197/",
    "job_id": "4356638197",
    "source": "linkedin",
    "company_name": "CBI Home Health",
    "job_title": "Accounts Payable Coordinator - Toronto",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "CBI Home Health supports people at home and in the community. We are one of Canada’s leading specialized community services, home, and integrated care providers, operating in more than 800 communities across the country. Our teams work together to deliver the right care at the right time, helping people live safely, independently, and with dignity. Come find out why we have been recognized by Deloitte as one of Canada’s Best Managed Companies for the 18th year in a row. Learn more at cbihomehealth.caBecause Your Care Matters.CBI Home Health is looking to hire a Full-Time Accounts Payable Coordinator in Toronto.Salary Range: The salary range for this position is $45,000 - $55,000 per year. Vacancy Disclosure: This job posting is for an existing vacancyWhy CBI Home Health?CBI Home Health is more than a workplace – it’s a community. We foster a supportive, inclusive environment where your ideas are valued, your growth is encouraged, and your well-being matters. Here, you’ll work alongside passionate professionals who are committed to making a difference for clients and for each other.Our Total Rewards Offerings IncludeHybrid working environment, which allow work-life balance and focus on quality of lifeComprehensive benefits and rewards package, including group health, dental and vision benefits, paid 100% by the employerEmployee Assistance ProgramPaid orientation, training and development with opportunities to grow your careerWhat You Will DoAs a key member of the Finance team, the Accounts Payable Coordinator will use knowledge and experience to support the timely and accurate execution of full cycle accounts payable functions. This position will report to Manager, Accounts Payable.Full cycle Accounts Payable functions using ticketing dashboardFollow-up with vendors and reconcile payment queries and statement of accountsMaintain new and existing vendor profilesAssist in preparing monthly accruals, various account reconciliation; audits, and other administration duties and responsibilities as assignedAssist in ongoing improvement of existing processes and systemsPrepare reports as requested by Accounting Team Lead and Senior AP CoordinatorTrack and manage high-volume payments, including importing/exporting data upload in software systems, with rigorous verification for accuracy and completeness.Generate and post regular and ad-hoc journal entries to ensure accurate financial recordkeeping.Respond promptly and professionally to inquiries internally and externallyMonthly credit card reconciliationsPrepare and process payments via EFT, wire transfers, cheques, and bill payments, adhering to established procedures and deadlines.Preform month-end AP closing activities, ensuring accuracy and meeting deadlinesCollaborate with cross-functional teams to resolve discrepanciesWhat You Will Need To Be SuccessfulCollege diploma or equivalent experience in a related discipline2 - 3 years of Accounts Payable experience with direct experience in PO, non-PO invoice processing and exception handling.Intermediate Microsoft Excel skills is required for this roleNetSuite Oracle experience will be an assetExperience in Consolidated invoices preferredWorking with multiple locations allocations preferredStrong awareness of accounting best practices and client confidentiality obligations in the workplaceExcellent organizational skills and attention to detail. Ability to interact with all levels within the organization.Ability to work independently as well as part of a team with guidance from Manager/ Department Lead as needed.Aptitude to grasp and apply lean six-sigma concepts in transactional processing.Problem solver with strong decision-making skills, who thrives in a fast-paced environmentWorking knowledge of Microsoft Office Suite and accounting software/platforms Recruitment Technology Disclosure: We use technology and automation to support administrative aspects of our recruitment process. Artificial Intelligence is not used to evaluate, rank, or select candidates. All hiring decisions are made by people.CBI Home Health is committed to a diverse, equitable, and inclusive workplace. We welcome applications from all qualified individuals and are committed to providing accommodations throughout the hiring process in accordance with applicable legislation. Please advise your recruiter if you require an accommodation.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360516305/",
    "job_id": "4360516305",
    "source": "linkedin",
    "company_name": "Osler, Hoskin & Harcourt LLP",
    "job_title": "Director, Client Billing Services",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Osler, Hoskin & Harcourt LLP is one of Canada’s leading business law firms. Advising many of Canada’s corporate leaders, as well as U.S. and international parties with extensive interest in Canada, our more than 1,000 firm members are based in offices in Toronto, Montréal, Ottawa, Vancouver, Calgary and New York.Osler prides itself on attracting and maintaining some of the brightest talent in the legal arena. Our lawyers, students, management and staff have created a unique firm culture which nurtures mentoring and the exchange of ideas. Osler is a dynamic and exciting place to further your career or carve out a new path.Reporting to the Chief Financial Officer, the Director, Client Billing Services is responsible for the oversight of the Firm’s Client Billing Services (CBS) department. The position establishes, monitors compliance, and sets best practices for the Firm around matter setup, time entry, billing, credit and collection activities. This role oversees the entire process from initial matter setup, through revenue cycle, billing and collection processes are captured accurately in the Firm’s systems and ensures that client and matter records are set up properly, timely capture of fees and disbursements, billing alterations are properly documented and auditable, and all CBS activities are captured and communicated.This job posting is for an existing vacancy.Major Responsibilities Directs management team in three main functional CBS areas:Billing Compliance: Responsible for overseeing client and matter setup, including the establishment and maintenance of rate structures. Acts as the primary subject matter expert on Outside Counsel Guidelines (OCGs) relating to billing and collection, ensuring setups are compliant and collaborates closely with the eBilling team to address and resolve invoice rejectionsBilling team: Oversees the docketing process, draft invoice (prebill) review, and the issuance of invoices. Manages the use of eBillingHub and other client eBilling platforms, ensuring seamless integration and functionalityCollection team: Leads the assessment of client credit risk and spearheads the collection of aged accounts receivable, implementing strategies to minimize outstanding balancesDevelops, implements, and operates an effective automated billing and collection process in co-operation with other groups and departmentsMaintains and adjusts service level agreements to ensure alignment with exceptional client service standardsDirects the Firm's billing and collection analysis, cash receipt forecasting, bad debt control, and valuation of work in process (WIP) and accounts receivable (AR)Manages communication processes to provide partners and management with pertinent financial analyses, reports and risk exposure when it comes to WIP and AROversees and coordinates the resolution of challenges associated with the allocation of client payments. This entails collaborating with the accounting department to enhance existing procedures and implementing advanced technological solutions to refine the payment application processDevelops department and Firm policies and guidelines for approval such as the Billing Management Committee policy. Monitors these policies and guidelines by identifying timekeepers who have not complied with the Firm’s financial guidelinesDevelop and maintain a team-based culture that fosters collaboration, knowledge sharing and client centric focusProvides professional leadership to the Firm’s CBS staff and develops an effective training and education program in order to meet the Firm’s future CBS staff requirements. The training program should focus internally to CBS and other finance members but ongoing training programs for partners and their assistantsLeads and manages continuous improvement of financial systems, billing management committee policies, efficiencies of procedures and internal controlsActs as a mediator to resolve issues with clients such as problems with invoices or with legal services provided by the Firm’s legal professionals. As an objective observer, this position will meet with the lawyer/management team to review and resolve the client’s problem and evolve the Firm’s processes to address systemic issuesJointly responsible (with the CFO) to the Audit, Risk & Finance Committee (AFRC) and Billing Management Committee (BMC) as it relates to billing and collection activities Work with third party external suppliers as required to:Conduct credit assessments on clients, and collaborate with third-party collection agencies to recover funds owed to the FirmOversee the installation, upgrading, and maintenance of software that supports the CBS processesCreate and maintain with the Manager, Collections a process to evaluate the collection risk associated with new and ongoing clientsPosition RequirementsEducation and ExperienceThe position requires a university degree and a minimum of ten years of billing and collection experience. Experience working in a professional ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370452875/",
    "job_id": "4370452875",
    "source": "linkedin",
    "company_name": "Company 3",
    "job_title": "Client Services Representative",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Business Unit: Company 3Position: Client Services RepresentativeLocation: Toronto, ON (On-Site)Hours of Operation: 10:00am - 6:00pm ESTPay Range: $19.00 - $22.00 CAD hourlyPosition SummaryCompany 3 Toronto provides Post Production services to some of the world’s top content creators and is known for its creative artistry, pioneering technology and global reach. Reporting to the Head of Production, the Client Services Representative will be responsible for organizing, managing and coordinating all the daily functions with the role, including but not limited to reception duties, managing meeting room bookings, ensuring client needs are met, and other administrative duties as needed.Main DutiesThe Client Services Representative will be responsible for greeting all visitors in a friendly and professional manner, handling all incoming calls, and notify staff of client/visitor arrival in a timely fashion. They will manage meeting room bookings, coordinate office supply and food and beverage orders, while ensuring security protocols are followed. They will be responsible for the following:Order and provide lunches and food and beverage service for clients Maintain relationships with Producers and staff to ensure all clients’ needs are met including preferences and dietary restrictions Create and distribute security badges and reports as required. Communicate with vendors and maintain relationships (e.g. custodian services, parking provider). Help with ensuring the accuracy and coding of vendor invoices. Complete accurate expense reports. Provide administrative duties for various departments. Maintain tidy reception, conference room and common areas. Other duties as assigned.What You BringThe ideal candidate will have excellent customer service skills and strong written and verbal communication. They must have strong organizational skills and attention to detail, with the ability to learn and process information quickly. As well as being able to work in a fast-paced environment while effectively managing priorities. Additional desired skills include:Possess solid keyboarding skills and a good working knowledge of MS Word, Excel and Outlook. Prior experience in administrative role or hospitality role an asset. Understanding of the Post Production business a plus. Food Handler and Smart Serve certifications a plus. Ability to interact with all levels of an organization up through the executive level, maintaining professionalism. Able to work overtime when required.About The CompanyCompany 3, including its various business units and family of brands, provides a full range of Creative Services for content creators, including conceptual design, pre-vis, look development, ideation and rapid prototyping, 3D animation/CGI, motion graphics/designers, matte painting, compositing, dailies and production services, color grading, post-production finishing, marketing/trailers, live-action production, experiences, and more.Diversity And Inclusion At Company 3Creativity has diversity at its core. We celebrate the value of each unique experience by being dedicated to fostering the most diverse, equitable, and inclusive culture where every employee feels empowered and safe to show up to work as their full self.It is our policy to provide equal employment opportunities to all applicants and employees. Please inform the Company's HR representative if you need assistance completing any forms or otherwise need any accommodation or support in order to participate in the application process.The listed pay range represents the lowest to highest range that we in good faith believe we would pay for this role at the time of this posting. This range may be modified in the future. An employee’s pay position within the range may be based on several factors including, but limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, local currency exchange rates, performance, shift, travel requirements, sales or revenue-based metrics, applicable law, and business or organizational needs.The benefits for eligible part-time employees working 25 or more hours per week and full-time employees in the US include a comprehensive package of health, retirement, and insurance benefits and paid time off. The benefits for eligible project hires and part-time employees working less than 25 hours per week in the US include retirement, select insurance benefits, and where required by law, health benefits. For roles filled in Canada and other territories, local benefits plan offerings as adopted and amended from time to time will apply.The above compensation and benefits information is provided in accordance with various state, provincial, and local pay transparency laws.This position is for an existing vacancy. Both external and internal candidates can apply for this role through the Company’s Career Page. The Company generally only contacts those individuals who have submitted an application which it wishes",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371793678/",
    "job_id": "4371793678",
    "source": "linkedin",
    "company_name": "Ericsson",
    "job_title": "MOAI Business Finance CFO Office",
    "location": "Chattogram, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Join our TeamAbout this opportunity:We are here to perform strong performance drive on MOAI Business & Financial with value based financial insights which trigger proactive actions, To empower better decision-making & to drive financial performance to the right direction. We invest in the growth and development of our teams to deliver on our mission. We embrace digital transformation to create transparency, accelerate outcomes, and amplify our impact. We aspire to be a trusted, best in class Business Finance function.Ericsson is seeking an analytical and forward-thinking Financial Analyst to join our expanding team. In this crucial role, you will not only conduct meticulous financial analyses and projections based on our unit's targets, but you'll also craft and convey insightful reports that aid critical business decisions. As our Financial Analyst, you will act as the lynchpin of our financial planning and performance evaluations, ensuring our processes are in line with global protocols and designed to endorse value-creation.What you will do: Drive MA Financial Performance : Financial Planning, Target Setting, Financial Forecast Financial Closing, CU.MA Governance, Credit Management Support MA CFO & Other stakeholders with value based financial insights Drive financial model, cost management, including OPEX, ACOS, Hourly rate etc. Act as main interface to GF finance while ensuring close collaboration with MA/CU finance team Implement strong Management reporting. Creation of data visualization & Strategic insight (data storytelling) Drive Automation & Simplification. Utilize financial data to optimize business performanceWhy join Ericsson?At Ericsson, you´ll have an outstanding opportunity. The chance to use your skills and imagination to push the boundaries of what´s possible. To build solutions never seen before to some of the world’s toughest problems. You´ll be challenged, but you won’t be alone. You´ll be joining a team of diverse innovators, all driven to go beyond the status quo to craft what comes next.What happens once you apply?Click Here to find all you need to know about what our typical hiring process looks like.Encouraging a diverse and inclusive organization is core to our values at Ericsson, that's why we champion it in everything we do. We truly believe that by collaborating with people with different experiences we drive innovation, which is essential for our future growth. We encourage people from all backgrounds to apply and realize their full potential as part of our Ericsson team. Ericsson is proud to be an Equal Opportunity Employer. learn more.We are proud to announce at Ericsson, our employees have once again voted us as a Great Place to Work® and we have been officially Certified™ in 2025. Every year, more than 10,000 organizations from over 60 countries partner with the Great Place to Work® Institute for assessment, benchmarking and planning actions to strengthen their workplace culture and this Certification acknowledges our employees value their employee experience and our workplace culture.Primary country and city: MOAI RegionReq ID: 781082",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359527871/",
    "job_id": "4359527871",
    "source": "linkedin",
    "company_name": "TTC Pension Plan",
    "job_title": "Investment Analyst/Associate (Public Markets)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Position title: Investment Analyst/Associate (Public Markets)Reports to: Director, Public MarketsEmployee Status: Permanent Full-timeWork hours: 35 hoursSalary Range: $80,000k to $130,000k annually + 10% BonusLocation: Toronto, Ontario / Hybrid; 2 Bloor St. E.Posting Date: Wednesday, February 4, 2026Closing Date: Wednesday, February 18, 2026Why join the TTC Pension Plan (TTCPP)We care about the employees who work at TTCPP and the excellent services they provide to our members! As a member of the team, you play a critical role in the success of TTCPP. By working together as we live out our values, we can meet our vision and our mission!TTCPP is a defined benefit pension plan established in 1940 for employees of the Toronto Transit Commission, the Amalgamated Transit Union Local 113, and TTCPP. For more than 80 years, we have been providing a secure retirement income for our members. The Plan is fully funded and strong with more than 27,000 members and $9.0 billion in net assets.Our VISION is clear: To always be there for our members–today and for a lifetime.Our MISSION: Providing a financially secure retirement for our members by delivering a pension for life at a reasonable cost. Supporting our members with responsiveness, open communication and hands-on service, now and throughout their retirement.Our VALUES: Sustainability, Accountability, Communication, Knowledge, and ProfessionalismLearn more about who we are!Position SummaryAt TTCPP, we're committed to delivering strong long-term pension outcomes for our members through thoughtful stewardship, disciplined investment management, and a culture built on collaboration and integrity. The Investment Analyst/Associate will be responsible for supporting the Public Markets team in the sourcing, due diligence, and monitoring of public market investments across strategies such as developed market equities, emerging market equities, fixed income and absolute return strategies (hedge funds). This individual will contribute to investment decision-making, portfolio construction, and reporting, while collaborating with internal stakeholders and external fund managers.What will I do?As the Investment Analyst/Associate, Public Markets, you will:Collaborate with team members to monitor existing investments, including joining update calls, preparing portfolio review materials, and tracking market developments.Maintain a structured peer group monitoring process to deepen understanding of the Equity and Fixed Income manager universe and identify top-quality managers and opportunities.Support investment manager due diligence across quantitative and qualitative dimensions, evaluating investment processes, team capabilities, and portfolio fit.Conduct research and develop views on investment strategies, performance drivers, and industry trends.Prepare investment memos and recommendations for new and existing opportunities.Assist with quarterly portfolio reviews, including analysis and reporting.Enhance monitoring of existing investments through portfolio performance attributionContribute to research projects aimed at improving portfolio construction and risk management practices.Take on special projects and other duties as assigned; demonstrate flexibility in a dynamic environment.What will help me be successful?Skills & Qualifications Undergraduate degree in a finance-related discipline (e.g., Business, Economics, Mathematical Finance, Financial Engineering); Master’s degree considered an asset.Completion of or progress towards CFA or CAIA, or an equivalent related designation, is a strong asset.Associate – 3+ years of experience in asset management, external manager research, alternative investments, pension plans, or a related field.Analyst – 1 to 3 years of experience in asset management, external manager research, alternative investments, or a related field.Strong understanding of performance measurement, reporting methodologies, and risk characteristics.Strong organizational skills; self-motivated and eager to develop investment and research expertise.Advanced Excel skills, including the ability to build financial models and perform complex data analysis. Programming experience (Python, VBA) is an asset.Proficiency in MS Office (Word, Excel, Outlook, PowerPoint); familiarity with eVestment and Bloomberg preferred.Availability and readiness to travel domestically and internationally on occasion.Key Success Attributes Outstanding written and verbal communication, able to distill complex analysis into clear, compelling presentations.Strong critical thinking, problem-solving ability, and intellectual curiosity.Exceptional attention to detail and accuracy in analysis and documentation.Collaborative mindset with the ability to build strong internal and external relationships.Results-oriented, detail-focused, and committed to excellence.High integrity, professional judgement, and ability to handle sensitive information.Ability to work independently, manage multiple priorities, a",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372018312/",
    "job_id": "4372018312",
    "source": "linkedin",
    "company_name": "Truenorth Executive Search, Inc.",
    "job_title": "Chief Financial Officer – Consumer Services – Acquisitive Growth, 78936",
    "location": "Vaughan, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Chief Financial Officer – Consumer Services – Acquisitive Growth Our client is a middle-market consumer services company and is a dominant industry player in their sector. With aggressive new growth initiatives being launched our client requires a Chief Financial Officer to drive organic and acquisitive strategies to move the business to the next level and beyond. You will be deeply involved at a strategic and tactical level working as a valued member of the executive team. You will oversee a “lean and mean”, fast-paced team with responsibility for building out the Finance, Accounting, Information Technology, and Human Resource functions.This is a true “roll up your sleeves” environment where you will wear multiple hats and contribute on a significant level to operational transformation and optimization. You will also focus on upgrading reporting on and visibility into all areas of the business, from service offering ROI and regional operational performance to acquisition integration efficiency and banking relationships. The ideal candidate will have a combination of the following experiences: consumer services experience, multi-location/multi-region jurisdiction, acquisitions and integration, management of lending relationships, optimal utilization of IT, HR and/or other operational functions for organization transformation. Experience in the Consumer-facing financial services, automotive, foodservice and/or professional or household services would be an asset. Candidates must be available for short duration quarterly travel to Western Europe on a quarterly basis.A competitive base and bonus opportunity is offered along with compelling equity incentives.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364377966/",
    "job_id": "4364377966",
    "source": "linkedin",
    "company_name": "Evince Group",
    "job_title": "Executive - Internal Audit for Gazipur factories",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369029271/",
    "job_id": "4369029271",
    "source": "linkedin",
    "company_name": "Aviso",
    "job_title": "Regulatory Compliance Analyst, Temporary",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364432772/",
    "job_id": "4364432772",
    "source": "linkedin",
    "company_name": "EWOR",
    "job_title": "Biotech Co-Founder / CFO (100 % remote) (m/f/d)",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371777388/",
    "job_id": "4371777388",
    "source": "linkedin",
    "company_name": "Xerox",
    "job_title": "Tax Manager",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About Xerox Holdings CorporationFor more than 100 years, Xerox has continually redefined the workplace experience. Harnessing our leadership position in office and production print technology, we’ve expanded into software and services to sustainably power the hybrid workplace of today and tomorrow. Today, Xerox is continuing its legacy of innovation to deliver client-centric and digitally-driven technology solutions and meet the needs of today’s global, distributed workforce. From the office to industrial environments, our differentiated business and technology offerings and financial services are essential workplace technology solutions that drive success for our clients. At Xerox, we make work, work. Learn more about us at www.xerox.com.ResponsibilitiesCompliance & Reporting:Ensure accurate preparation, review, and submission of VAT returns, EC Sales Lists, Intrastat reports, and other related filingsManage VAT audits and tax authority communications, ensuring timely responses and resolutionStay up-to-date with VAT regulations and ensure company practices are in line with legal requirementsAdvisory:Provide VAT guidance to leadership, finance, and business teams for transactions and contractsAssess VAT implications of cross-border transactions and ensure the proper VAT treatment for domestic and international activitiesAdvise on VAT structuring to reduce liability and create efficient tax solutionsProcess Optimization:Develop and implement robust VAT compliance processes, policies, and systemsCollaborate with finance, accounting, and operations teams to optimize systems for VAT handlingIdentify VAT opportunities for savings, recoveries, and efficienciesTraining & Education:Educate internal teams on VAT compliance requirements and best practicesProvide periodic training on VAT changes, risks, and implicationsRisk Management:Mitigate VAT risks through proactive review of business operations and transaction flowsAddress any discrepancies, reconciling records to ensure accurate VAT reportingQualificationsEducation & Experience:Minimum 5+ years of experience in VAT or indirect tax, preferably in a multinational setting or a tax advisory firmAt least 1+ year of people management experienceBachelor’s or Master’s degree in Accounting, Finance, Taxation, Law, or a related fieldSolid understanding of European VAT legislation and cross-border transactions; knowledge of global VAT/GST regulations is a plusSkills:Strong analytical skills with the ability to interpret complex VAT lawsProficiency with VAT reporting tools and ERP systems (e.g., SAP, Oracle, NetSuite)Excellent communication skills for writing reports, discussing VAT matters with tax authorities, and training internal teamsDetail-oriented with strong organizational and documentation skillsProven track record of managing VAT audits and resolving indirect tax issuesAdvanced in English Preferred Traits:Ability to work independently and collaboratively in a teamStrategic thinker with the ability to see the bigger picture of VAT optimizationStrong interpersonal skills for networking with stakeholders, advisors, and authorities",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4060626204/",
    "job_id": "4060626204",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ACCA Trainee/ Jr. Finance Associate (For OTG Bangladesh)-Job ID",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3617625383/",
    "job_id": "3617625383",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Zatiq নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358586640/",
    "job_id": "4358586640",
    "source": "linkedin",
    "company_name": "Kassen Recruitment",
    "job_title": "Associate Manager, Tax",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A professional services firm is seeking an Associate Tax Manager to join its growing advisory team. This role offers the opportunity to take on leadership responsibilities in client engagements while continuing to develop expertise in complex tax matters. You'll gain exposure to a wide variety of clients across industries, contribute to strategic planning, and support the growth of the practice through mentorship and collaboration.What You'll DoLead and support client engagements, delivering high-quality tax advisory services.Work alongside senior leaders on planning strategies for a variety of organizations.Review and support the preparation of corporate and personal tax returns.Conduct research on technical tax issues and present findings clearly.Mentor and guide junior professionals, supporting their development.Contribute to business development by identifying opportunities and building relationships.Manage multiple projects effectively, balancing deadlines and priorities.Recommend process improvements to strengthen efficiency and team performance.What You Bring:CPA designation (required).5+ years of progressive experience in public practice or professional services.Advanced tax training (e.g., CPA In-Depth Tax Program or Master's in Taxation) completed or in progress.Strong technical expertise in both tax planning and compliance.Excellent communication skills, with the ability to explain complex concepts to clients and colleagues.Proven project management and organizational skills.A proactive, growth-minded approach with leadership potential.Experience preparing or reviewing complex tax memorandums is considered an asset.Why Join:This is a strong opportunity for a professional looking to step into a leadership role while continuing to learn and progress. You'll gain exposure to diverse and challenging client work, collaborate with senior leaders, and contribute directly to the success of a dynamic advisory practice.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295518761/",
    "job_id": "4295518761",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Executive (For Anwar Group of Industries.)-Job ID: 1403601",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370703320/",
    "job_id": "4370703320",
    "source": "linkedin",
    "company_name": "STRIVE Search",
    "job_title": "Site Clerk - Dublin 18",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Site ClerkFull time permanent position.Site based in Kilternan, Dublin 18.This role will is a mix of administration & procurementBackgroundOur client is a family run company that takes a lot of pride in the quality of what they deliver. They focus on building well designed homes in good locations, close to amenities and transport links. There’s a real emphasis on good workmanship and attention to detail across all developments.Package detailsNegotiable base salary (DOE)Annual salary reviewsBonusPensionClear progression pathsResponsibilitiesCoordinate day to day site administration, including filing, record keeping, and reporting.Prepare and manage site documentation, such as site diaries, progress reports, and health & safety records.Liaise with subcontractors, suppliers, and internal teams to ensure smooth site operations.Assist with budgeting, tracking costs, and processing invoices and payments.Manage purchasing and procurement of materials, ensuring timely delivery and cost control.Support the site manager with scheduling, planning, and general project coordination.Key skills required1+ years of experience in a similar role within the construction sector in Ireland.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374722981/",
    "job_id": "4374722981",
    "source": "linkedin",
    "company_name": "GMC Utilities Group",
    "job_title": "HSQE Manager",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362122514/",
    "job_id": "4362122514",
    "source": "linkedin",
    "company_name": "Cantor Fitzgerald Ireland",
    "job_title": "Portfolio Manager Assistant",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Description Title: Portfolio Manager AssistantLocation: Dublin, IrelandReporting to: Global StrategistContract Type: Full time & Permanent Role Summary:The role requires someone who is self-motivated and whose priority is to place the interests of the client always to the fore. Relationship building is critical as this is seen as a corner stone to growing business and the retention of business.Forging strong relationships with the other teams in Cantor Fitzgerald to help bring the brand to a wider audience.Under The Central Bank of Ireland’s (CBI) Individual Accountability Framework (IAF) established under The Central Bank (Individual Accountability Framework) Act 2023 (IAF Act), as an expected Control Function holder, you have a Duty of Responsibility under the CBI Common Conduct Standards. These standards include: acting with honesty and integrity, acting with due skill, care and diligence, co-operating in good faith and without delay with the Central Bank of Ireland acting in the best interest of customers and treating them fairly and professionallyoperating in compliance with standards of market conduct and trading venue rulesResponsibilitiesAssisting with the development of long-term client relationships through effective management of service requirements and subsequent delivery to private, corporate and intermediary clients under the remit of the Global Strategist. Providing services as required to Global Strategists clients, including placing pre-trade orders, trade orders and after trade reporting as required, issuance of valuation reports, tax reports, reviewing client mandates, completion of client reviews, updating KYC and other DCI system regulatory updates.Assisting Global Strategist with the development new business opportunities and generating wider revenue streams with existing clients via Cantor Fitzgerald IrelandAssisting the Global Strategist with the development of an annual business plan, including relationship plans for each client, relating to commission and commission growth, fee and fee growth, portfolio performance and funds under management targets.Support the production of quarterly factsheets across all discretionary products.Client entertainment – proactive involvement with client base in terms of social events, sporting events etc.Skills & CompetenciesExcellent oral and written communications skills are requiredAttention to detail is exceptionally important for the roleAbility to show initiative and work within in teamHigh level of proficiency in MS Word, Excel, Outlook and PowerPointMeet Central Bank requirements for Minimum Competency and Fitness and Probity (after training and completion of necessary qualifications)RequirementsDegree in Business, Finance or related fieldSeek to achieve at the earliest possible time Minimum Competency in accordance with MCC Central Bank of Ireland. QFA, Registered Stockbroker or APA (Savings & Investments) and related professional subscription. This will be a Control Function role under the Central Banks Fitness & Probity standards. Genuine interest in investment marketsIt is an indispensable condition of the tenure of employment that the Employee be a member of a CPD member under Minimum Competency.You will be required to achieve as soon as possible the necessary qualifications to achieve a CF-3, CF-4 and CF-10 designation under the Central Bank’s Fitness & Probity standards. CF-3 - Giving of advice to a customer of the regulated financial service providerCF-4 - Provider CF4 Arranging a financial service for a customer of the regulated financial service providerCF-10 - Dealing in or having control over property of a customer of the regulated financial service provider",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326478995/",
    "job_id": "4326478995",
    "source": "linkedin",
    "company_name": "Revolut",
    "job_title": "Operations Manager (Banking)",
    "location": "Greater Dublin",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4200346564/",
    "job_id": "4200346564",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Manager (For DHANMONDI GENERAL AND KIDNEY ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350180422/",
    "job_id": "4350180422",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346124773/",
    "job_id": "4346124773",
    "source": "linkedin",
    "company_name": "(For Bardown Sports Inco.)",
    "job_title": "Accounts Payable Manager",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348095370/",
    "job_id": "4348095370",
    "source": "linkedin",
    "company_name": "For Priyo Limited- Job ID",
    "job_title": "Accounts Officer / Bookkeeper",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4125911121/",
    "job_id": "4125911121",
    "source": "linkedin",
    "company_name": "(For Blessing ...",
    "job_title": "Assistant Manager / Manager (Accounts & Finance)",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359829087/",
    "job_id": "4359829087",
    "source": "linkedin",
    "company_name": "SEHA - Abu Dhabi Health Services Co.",
    "job_title": "Senior Financial Analyst-SEHA-Radiology Finance",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionResponsible for overseeing, developing and completing the management reports and the production of a variety of ad hoc reports and checks for accuracy and compliance with management requirements, reconciling and forecasting internal accounts, supervising and overseeing the duties carried out by the Financial Analyst to ensure that work produced is accurate and timely by establishing necessary financial and control systems. Also responsible for liaising closely with the stakeholders and information providers to ensure requirements are met and maintains beneficial relationships with staff in external organizations to share data that will aid financial analysis and reporting.ResponsibilitiesEnsuring the smooth working of the department/section Supervising the formulation and maintenance of the department’s/section’s finance and accounting policies and procedures manual to ensure policies and procedures are currentEnsuring policies and procedures changes are documented and implemented by concerned subordinates and constantly reviewed and updatedOverseeing developing and completing the accuracy of month-end management reportsAnalyzing financial data and relevant information and interpreting data for the purpose of determining past financial performanceOverseeing the production of a variety of ad hoc reports as and when required by Management covering areas such as budget information, data comparison and benchmarking information and checks for accuracy and compliance with Management requirementsPlanning and conducting complex studies to determine cost of business activities.Recommending budget adjustments and cost improvement measurementsAnalyzing complex statistical and financial data and relevant information; interpreting data to project a financial probabilityDeveloping financial reports for forecasting, trending and results analysisEstablishing and overseeing financial and control systems and proceduresSupervising the analysis of obtained information and reviews all work prior to submission to management to check reports for accuracy and good presentationSupervising Working with the Financial Analyst when required to acquire financial and quantitative information, using various internal and external sources to ensure timely submission of such data to ManagementSupervising the duties assigned to the Financial AnalystProviding work direction and ensures that work produced and submitted to the management is accurate and within established timeframesCoordination Establishing and maintaining a mutually beneficial relationship with similar level staff in related external organisationsWorking to develop and maintain an appropriate mechanism for sharing data, to aid financial analysis and reportingWorking closely with budgeting section on matter related to budget and collection of required information for financial analysis and reporting purposesLiaising closely with the management and finance in order to discuss reporting requests and findings to ensure that management requirements are fully and accurately metEnsuring good customer service in the accounts department/section Promoting a service oriented attitude in addressing employee queries effectivelyMaintaining collaborative and effective relationship with other key management personnel and keeping abreast of significant economic, social and technical trends, and regulatory guidelines, which may influence assigned functionsAnswering employees queries and concerns during their service at the facilityContributing to team effort Planning and supervising the day to day activities of the department/section; streamlining processes wherever possibleEvaluating workload, conducting performance evaluation and initiating necessary disciplinary actionsProviding on the job training and orienting the team during course of workQualificationsQualification :-Special Certificate:-Required4-6 years of relevant experience in a similar roleDesiredExperience in a large healthcare facilityAbout UsAbu Dhabi Healthcare Company (SEHA) is the largest and most comprehensive healthcare network in the UAE that was established in 2007 with the objective of operating all public hospitals and clinics across the Emirate of Abu Dhabi.SEHA is committed to delivering world-class healthcare services using the most advanced diagnostics and systems across its network of public healthcare centers and hospitals in addition to partnering with global leaders in healthcare, including world renowned organizations such as the Mayo Clinic. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360589597/",
    "job_id": "4360589597",
    "source": "linkedin",
    "company_name": "Suntory PepsiCo Vietnam Beverage",
    "job_title": "Accounting Manager - A/P",
    "location": "Củ Chi, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356741025/",
    "job_id": "4356741025",
    "source": "linkedin",
    "company_name": "ConnectOS",
    "job_title": "Junior Admin Accountant (AU Financial Service, Hybrid)",
    "location": "Metro Manila",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357505494/",
    "job_id": "4357505494",
    "source": "linkedin",
    "company_name": "Northbourne Advisory",
    "job_title": "Senior Executive: Strategic Communications",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357722054/",
    "job_id": "4357722054",
    "source": "linkedin",
    "company_name": "CBDI",
    "job_title": "Head of Accounting",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364927533/",
    "job_id": "4364927533",
    "source": "linkedin",
    "company_name": "RBC",
    "job_title": "Senior Manager, OEM Relationships - Automotive Finance",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362108288/",
    "job_id": "4362108288",
    "source": "linkedin",
    "company_name": "Clarity Recruitment",
    "job_title": "Internal Audit Consultant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362113410/",
    "job_id": "4362113410",
    "source": "linkedin",
    "company_name": "Hitachi Digital Services",
    "job_title": "SAP SD/CS Lead",
    "location": "Ho Chi Minh City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354292513/",
    "job_id": "4354292513",
    "source": "linkedin",
    "company_name": "Risewave Consulting, Inc.",
    "job_title": "SAP Consultant (FI, PP, MM, SD, ABAP)",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355296083/",
    "job_id": "4355296083",
    "source": "linkedin",
    "company_name": "Zurich Insurance",
    "job_title": "Auto Underwriter, Middle Market",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355206039/",
    "job_id": "4355206039",
    "source": "linkedin",
    "company_name": "Desjardins",
    "job_title": "Corporate Underwriting Advisor (Evolution & Solutions), Commercial Lines Insurance",
    "location": "Aurora, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360966144/",
    "job_id": "4360966144",
    "source": "linkedin",
    "company_name": "Randstad Canada",
    "job_title": "Controller",
    "location": "North York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360996319/",
    "job_id": "4360996319",
    "source": "linkedin",
    "company_name": "Viventis Search Asia",
    "job_title": "Financial Controller",
    "location": "Manila, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368854869/",
    "job_id": "4368854869",
    "source": "linkedin",
    "company_name": "Hays",
    "job_title": "Analyste opérationnel",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362190898/",
    "job_id": "4362190898",
    "source": "linkedin",
    "company_name": "Pomerleau",
    "job_title": "Administrative assistant - Preconstruction",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345547945/",
    "job_id": "4345547945",
    "source": "linkedin",
    "company_name": "Choice Talents LTD",
    "job_title": "Data Entry and ERP Personnel",
    "location": "Ajah, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365060532/",
    "job_id": "4365060532",
    "source": "linkedin",
    "company_name": "QStaffers",
    "job_title": "Document Controls Specialist",
    "location": "El Sheikh Zaid, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369160136/",
    "job_id": "4369160136",
    "source": "linkedin",
    "company_name": "Deel",
    "job_title": "Compliance Analyst",
    "location": "Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337848204/",
    "job_id": "4337848204",
    "source": "linkedin",
    "company_name": "PalmPay",
    "job_title": "Senior Compliance Officer – Health Check Team at Palmpay Limited",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360897532/",
    "job_id": "4360897532",
    "source": "linkedin",
    "company_name": "IHH HEALTHCARE MALAYSIA",
    "job_title": "Assistant Finance Manager (Management Reporting)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Key accountabilitiesThe functions provided by the Management Reporting team includes the following:To ensure month end financial and management reports are prepared accurately and timely;Prepare monthly account in accordance with accounting standard and group accounting policy;Maintain financial records in accordance with policy and procedure;Conduct monthly con call with Finance Operation team to analyse the financial position of the hospital and review of budget achievement;Conduct ad-hoc con call with Finance Operation team to identify and provide guidance to the operation team when issue identified.Qualification and Experience Candidate must possess at least a Professional Certificate, Bachelor's Degree in accountancy or equivalent.At least 6 year(s) of working experience in the related field is required for this position.Expected to have a strong theoretical grounding, including knowledge of financial reporting standards and IT literacy.Highly committed and able to work independently within tight deadlines.Good in English writing. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365061832/",
    "job_id": "4365061832",
    "source": "linkedin",
    "company_name": "Özak Global Holding",
    "job_title": "Bütçe ve Planlama Müdürü",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366802629/",
    "job_id": "4366802629",
    "source": "linkedin",
    "company_name": "STÄUBLI",
    "job_title": "Finance Executive",
    "location": "Puchong, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354149779/",
    "job_id": "4354149779",
    "source": "linkedin",
    "company_name": "Çalık Renewables",
    "job_title": "Budget and Reporting Specialist",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "At Çalık Renewables, we are committed to shaping the future of global energy with innovative and sustainable solutions. In line with our global growth strategy, we contribute to the clean energy transition through project development, asset management, and green energy trading. With a dynamic structure built on transparency, collaboration, flexibility, and an entrepreneurial spirit, we continue to create value in the renewable energy sector. As a company committed to excellence in renewable energy, we are looking for a Budget and Reporting Specialist to support the Çalık Renewables Istanbul, Türkiye. If you are an experienced professional who thrives in an international business environment and wants to be part of a renewable energy company, we invite you to apply!QualificationsMinimum 2-4 years of experience in financial planning, reporting, and analysis.Experience in the energy sector or infrastructure projects is a strong advantage.Knowledge of IFRS (International Financial Reporting Standards).Audit experience (preferably Big Four) is a plus.Advanced proficiency in English (written and spoken)Strong analytical, communication, and interpersonal skills; team-oriented and results-driven.Experience in SAP is needed, knowledge of BI tools is a plus.ResponsibilitiesPrepare consolidated financial statements and ensure timely and accurate reporting in compliance with TFRS/IFRS.Work with external auditors and regulatory bodies to ensure full compliance and transparency.Take active role in budgeting and forecasting processes, including variance analysis and scenario planning.Prepare and analyze monthly, quarterly, and annual management reports for senior leadership.Monitor key financial KPIs and support performance improvement initiatives.Take active role in preparation of ad-hoc reports and presentations for executive management and board meetings.Take active role in digital transformation initiatives within the finance function, including automation and system enhancements. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353931628/",
    "job_id": "4353931628",
    "source": "linkedin",
    "company_name": "Mercedes-Benz Türk A.Ş.",
    "job_title": "R&D Center Management - Budget Specialist",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354019417/",
    "job_id": "4354019417",
    "source": "linkedin",
    "company_name": "Americana Restaurants",
    "job_title": "Senior Internal Auditor",
    "location": "Sharjah Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351263837/",
    "job_id": "4351263837",
    "source": "linkedin",
    "company_name": "arsaVev",
    "job_title": "İç Kontrol ve Teftiş Uzmanı",
    "location": "Şişli, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343947746/",
    "job_id": "4343947746",
    "source": "linkedin",
    "company_name": "IHG Hotels & Resorts",
    "job_title": "Assistant Income Auditor",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357531720/",
    "job_id": "4357531720",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager, Market Audit- For ACI PLC- Job ID: 1456180",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353214169/",
    "job_id": "4353214169",
    "source": "linkedin",
    "company_name": "Vodafone",
    "job_title": "Vodafone Finansman A.Ş - Compliance Executive",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368635021/",
    "job_id": "4368635021",
    "source": "linkedin",
    "company_name": "M-DAQ Global",
    "job_title": "Operational Risk Analyst",
    "location": "Petaling, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329955593/",
    "job_id": "4329955593",
    "source": "linkedin",
    "company_name": "PixelChain",
    "job_title": "Business Analyst - UAE (Onsite)",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356860109/",
    "job_id": "4356860109",
    "source": "linkedin",
    "company_name": "Arada",
    "job_title": "Technical Administrator",
    "location": "Sharjah, Sharjah Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366011135/",
    "job_id": "4366011135",
    "source": "linkedin",
    "company_name": "Blue Pearl HQ",
    "job_title": "Personal Assistant (PA) to CEO",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Blue Pearl is seeking a highly organized, proactive, and detail-oriented Personal Assistant to support the CEO. The successful candidate will play a critical role in ensuring the smooth day-to-day operation of the CEO’s office, managing schedules, meetings, travel, and logistics, while providing professional administrative and operational support.Key Responsibilities:Executive & Diary Management Manage and maintain the CEO’s diary, ensuring efficient scheduling and prioritization of meetings. Coordinate internal and external meetings, including preparation and follow-ups. Act as the primary point of contact between the CEO and internal/external stakeholders. Meetings & Office Coordination Book and manage boardrooms and office meetings. Prepare agendas, take accurate minutes during meetings, and distribute action items. Ensure meeting logistics are arranged (venues, equipment, catering where required). Travel & Accommodation Book flights, accommodation, and ground transportation for the CEO. Manage travel itineraries and ensure seamless end-to-end travel arrangements. Events & Logistics Coordinate logistics for company events, workshops, and executive functions. Liaise with vendors, venues, and service providers to ensure successful event execution. Administrative Support Handle confidential and sensitive information with discretion. Assist with general office administration duties as required. Support ad-hoc tasks to ensure the smooth running of executive and office operations. RequirementsKey Requirements: Proven experience as a Personal Assistant, Executive Assistant, or similar role. Strong organizational and time-management skills. Excellent written and verbal communication skills. Ability to multitask, prioritize, and work under pressure. High level of professionalism, discretion, and confidentiality. Proficiency in Microsoft Office / Google Workspace tools. Strong attention to detail and problem-solving ability. Desirable Skills & Attributes: Experience supporting C-level executives. Event coordination or logistics experience. Proactive, self-driven, and solution-oriented mindset. Ability to work independently and collaboratively. Why Join Blue Pearl? Opportunity to work closely with executive leadership. Exposure to strategic business operations. Dynamic, fast-paced, and professional environment. Career growth and development opportunities. Must be based in JHB North as the role is on-site . Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362373101/",
    "job_id": "4362373101",
    "source": "linkedin",
    "company_name": "PGE Polska Grupa Energetyczna",
    "job_title": "Specjalistka/ Specjalista w Biurze Zarządu",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357413303/",
    "job_id": "4357413303",
    "source": "linkedin",
    "company_name": "KPMG Poland",
    "job_title": "Administration/Finance Analyst - Global Mobility Services",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366020152/",
    "job_id": "4366020152",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Quantitative Analyst, Counterparty Credit Risk Models",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368671761/",
    "job_id": "4368671761",
    "source": "linkedin",
    "company_name": "Korn Ferry",
    "job_title": "Brokerage Revenue and Processing Controller",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293732044/",
    "job_id": "4293732044",
    "source": "linkedin",
    "company_name": "Cloud Solutions International",
    "job_title": "Tech Lead",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4274458824/",
    "job_id": "4274458824",
    "source": "linkedin",
    "company_name": "InEight",
    "job_title": "Software Engineer (.NET)",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367793667/",
    "job_id": "4367793667",
    "source": "linkedin",
    "company_name": "HCLTech Sri Lanka",
    "job_title": "Java - Technical Lead",
    "location": "Colombo District, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are HCLTech, one of the fastest growing large tech companies in the world and home to 219,000+ people across 60 countries, supercharging progress through industry-leading capabilities centered around Digital, Engineering and Cloud.Responsibilities:Develop, and maintain high-performance Java backend applications and microservices.Build and manage real-time streaming pipelines using Apache Flink and/or Kafka Streams.Develop event-driven microservices integrated with Kafka, Schema Registry, and serialization formats (AVRO/JSON).Implement and optimize database interactions using PostgreSQL or SQL Server with Spring Data JPA/JDBC.Participate in code reviews, performance tuning, and troubleshooting production issues.Collaborate with cross-functional teams (product, QA, DevOps) to deliver reliable solutions.Support CI/CD pipelines, containerization (Docker), and deployment on Kubernetes.Implement monitoring, logging, and alerting using tools like Spring Actuator.Ensure adherence to security best practices, including encryption and access control.Create and maintain technical documentation using Jira and Confluence.Key Requirements:Strong experience in Java and SQLHands-on experience with Apache Flink or Spring Boot Microservices.Experience building Java microservices using Kafka Streaming (AVRO/JSON) with Schema Registry.Database experience with PostgreSQL or SQL Server using Spring Data JPA/JDBC.Experience with caching technologies: Spring Cache, Redis, Caffeine, or in-memory caches.Strong knowledge of multi-threading, concurrency, and asynchronous processing.Experience in unit and integration testing, including mocking.Familiarity with Jira and Confluence for technical documentation.Willing to relocate to Singapore.Good to Have:Python, Linux/shell scripting, database schema designCDC concepts, Kafka integrationDevOps & Monitoring: Docker, Kubernetes, Spring ActuatorSecurity: Encryption, RBAC, secure Kafka & DBDocumentation: Jira, Confluence Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361465192/",
    "job_id": "4361465192",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Adminisztrációs munkatárs - Lakossági Fedezetlen és Mikrovállalati Operáció (határozott időre)",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "wherewework.hu on behalf of:Erste BankNálunk lehetőséged lesz:A magyarországi pénzügyi szektor egyik piacvezető, nemzetközi háttérrel rendelkező, stabil, innovatív bankjánál megismerni a lakossági fedezetlen hitelek és a mikrovállalati hitelek feldolgozási folyamatának rejtelmeit. Tapasztalt szakemberek által betekintést nyerni a fedezetlen hitelek - mint a hitelkártya és a személyi kölcsön - valamint a mikrovállalati hitelek ellenőrzési feladataiba. Aktívan részt vehetsz ezen termékek rögzítésében és döntési előkészítésében. A nálunk töltött időszakban tanultakat tovább kamatoztatni esetlegesen egy főállású pozícióban. Csatlakozz hozzánk, amennyiben:Érdeklődsz az operációs terület iránt és szívesen betekintenél egy nemzetközi bank mindennapjaiba. Felhasználói szinten használod az MsOffice alkalmazásokatAktív hallgatói jogviszonnyal rendelkezel. Gyorsan tanulsz, proaktív hozzáállás jellemez. Ambiciózus és terhelhető vagy. Gyakorlati ismeretek révén is szeretnél fejlődni. Jók a kommunikációs készségeid. Heti 30 órában tudsz dolgozni tartósan, 2026 év végéig. Miért jó nálunk dolgozni?Egy támogató, egymást segítő csapat része lehetsz, melynek tagjai elősegítik szakmai fejlődésedet. Rugalmas munkaidőt biztosítunk. Többféle közösségi programon lehetőséged lesz jobban megismerni kollégáidat. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358090954/",
    "job_id": "4358090954",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Operational Risk Analyst",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362140385/",
    "job_id": "4362140385",
    "source": "linkedin",
    "company_name": "Permata Bank",
    "job_title": "Corporate Credit Analyst",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4199400303/",
    "job_id": "4199400303",
    "source": "linkedin",
    "company_name": "ABeam Consulting Indonesia",
    "job_title": "Financial Industry IT Consultant",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353485421/",
    "job_id": "4353485421",
    "source": "linkedin",
    "company_name": "Sun International",
    "job_title": "PR & Marketing Manager",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job PurposeThe marketing manager is responsible for developing and implement integrated marketing strategies that support the hotel's revenue goals, enhance brand visibility, and drive customer engagement across all channels. The Marketing Manager plays a key role in positioning the hotel as a leading destination for hospitality, conferencing, events, and leisure.Key Performance AreasPlan and execute multi-channel marketing campaigns to support room nights, MICE, F&B, and leisure servicesEnsure campaigns are delivered on-brand, on-time, and within budgetMaintain consistent brand messaging across all platforms and materialsDevelop engaging content (copy, visuals, video) for digital and offline channelsManage website content, SEO, paid media, and social media platformsTrack and improve online performance, engagement, and lead generationSupport PR efforts, media engagement, and influencer collaborationsMonitor guest reviews and social sentiment to protect and enhance reputationAnalyse customer data, competitor activity, and market trendsTranslate insights into actionable marketing strategiesWork with Sales, Revenue, and Operations to align marketing efforts with commercial goalsCreate promotional materials, proposals, and event support collateralEnsure all marketing activities comply with POPIA, CPA, and brand guidelinesManage usage rights, image licensing, and supplier contractsLead public relations strategy including press release development, media pitching, and crisis communication managementBuild and maintain strong relationships with media, journalists, influencers, and key opinion leadersPlan and manage promotional events, launches, and sponsorships to increase brand visibility and customer engagementCoordinate and oversee on-site and virtual promotional activities, ensuring smooth execution and effective follow-upQualifications And ExperienceDegree in Marketing / PR / Communication8 years Marketing / PR and promotions experience, including in media relationsExperience in planning and delivering a Public Relations and Communications strategy including Social MediaWork Conditions And Special RequirementsAbility to travelAbility to work shifts that meet the operational requirementsSkills And Knowledge PR skills Market research Strong English Verbal and Written Communication skills Business Acumen Digital acumen including Social Media platforms Networking skills Financial Acumen Cultural understanding and protocolEquityPreference will be given to employees from the designated groups in line with the provisions of the Employment Equity Act, No. 55 of 1998, SISA internal recruitment policy as well as units employment equity plans.#ST Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354088595/",
    "job_id": "4354088595",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive- Accounts- For A Reputed RMG Group of Company - Job ID: 1452212",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366806484/",
    "job_id": "4366806484",
    "source": "linkedin",
    "company_name": "Staffwise",
    "job_title": "Senior Payroll & Bookkeeper – Insrep Construction",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368659133/",
    "job_id": "4368659133",
    "source": "linkedin",
    "company_name": "EPIC Business Human Strategy",
    "job_title": "Senior Financial Controller - MagnaPharm",
    "location": "Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365030534/",
    "job_id": "4365030534",
    "source": "linkedin",
    "company_name": "PwC au Maroc",
    "job_title": "Consultant Risk – Gouvernance, Conformité et Gestion des Risques",
    "location": "Casablanca Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job Description & SummaryAu sein de l’équipe Risk de PwC au Maroc, vous interviendrez pour la veille réglementaire applicable à l’ensemble des acteurs financiers sur des aspects risques, conformité, contrôle interne, sécurité financière, etc.Vous travaillez pour les Directions Générales, les Directions de la Conformité, les Directions du Contrôle Permanent et les Directions de l'Audit Interne des plus grands établissements financiers (Banque / Assurance).Vos Thématiques Principales D’intervention SerontRisques non financiers : réalisation de diagnostics, cartographie, documentation des processus, gestion des incidents.Contrôle Permanent : définition de la gouvernance, plans de contrôle, formalisation des fiches de contrôles, accompagnement d’outils et conduite de changementConformité réglementaire : lutte contre le blanchiment (LCB-FT), KYC & KYT, Traitement des alertes AML, sanctions & embargos, anticorruptionTransformation et modernisation des dispositifs de Risk & Compliance : Accompagnement à la mise en œuvre de systèmes d’information Risque & ConformitéContribution à des projets de transformation IT ou d’amélioration continue, en lien avec les équipes DSI, data et métiersProgrammes de remédiation ou de mise en conformité à la suite de contrôles d’autoritésSensibilisation et formation des équipes clients aux bonnes pratiques réglementairesVous êtes diplômé(e) d'une école d'ingénieur ou de commerce ou d'une université.2 à 5 ans d’expérience au sein d’un cabinet d’audit / de conseil ou au sein d’un organisme bancaire ou assurantielAppétence pour les projets IT, la transformation des opérations et processus digitaux, ou la data governanceQualités rédactionnelles et de communication, du leadership, une forte curiosité intellectuelle et une grande adaptabilité.Excellent relationnel.Niveau d’anglais courant.Ces Avantages Que Nous Vous OffronsEnvironnement de travail et FlexibilitéProgramme Be Well, Work Well pour prendre soin de sa santé ;Écosystème de santé pour trouver à qui parler, être écouté et aidé quelles que soient vos difficultés professionnelles ou personnelles ;Mobilité nationale et internationale possible ;Accès illimité à notre plateforme de formation.Prêt à relever le défi ? Postulez dès maintenant ! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360967165/",
    "job_id": "4360967165",
    "source": "linkedin",
    "company_name": "The Mirillion Group",
    "job_title": "Chief Financial Officer",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354233852/",
    "job_id": "4354233852",
    "source": "linkedin",
    "company_name": "National Bank of Canada",
    "job_title": "Senior Credit Risk Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350256242/",
    "job_id": "4350256242",
    "source": "linkedin",
    "company_name": "roobit_",
    "job_title": "Treasury Specialist",
    "location": "Istanbul, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About ROOBITRootech Kripto Varlık Alım Satım Platformu A.Ş. (ROOBIT) is a cryptocurrency trading platform operating in line with the regulations of the Capital Markets Board of Turkey (SPK) dated March 13, 2025. We prioritize user security and transparency in all our operations.We are looking for highly responsible and financially insightful team member to join our Treasury & Risk Department as Treasury Specialist.Key ResponsibilitiesExecute cryptocurrency buy/sell transactions on behalf of the companyManage liquidity positions and cash flow in line with defined trading plans and liquid reserve strategiesMonitor and reconcile balances of bank accounts and crypto walletsMaintain communication and trading operations with business partnersCarry out onboarding processes with new counterpartiesPrepare required reports and analyses related to treasury activitiesDetect system alerts and transaction anomalies, report them to relevant teams, and contribute to system improvement processesMonitor and report developments in financial markets, cryptocurrencies, and the economyQualificationsBachelor’s degree in Economics, Business Administration, Finance, Mathematics, Statistics, Engineering, or related fieldsMinimum 2 years of experience in cryptocurrency trading operations within crypto companies and/or other financial institutionsWillingness and ability to work on a 24/7 shift basisKnowledge of Capital Markets Board regulationsProficiency in MS Office applicationsStrong written and spoken English skills (mandatory for communication with international business partners)For male candidates: Completed or deferred military serviceWhy ROOBIT?An opportunity to be part of Roobit, a technology-driven platform in the growing cryptocurrency industrySupportive team culture that encourages continuous learning and developmentSpace to take responsibility, demonstrate initiative, and make an impactChance to actively contribute to innovative projectsApplicationTo apply, please send your CV to ik@roobit.com with the subject line “Treasury Specialist”. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361268194/",
    "job_id": "4361268194",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Billing & Order Entry Specialist with Dutch",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364963079/",
    "job_id": "4364963079",
    "source": "linkedin",
    "company_name": "Kelly",
    "job_title": "AML Operations Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Grow your career as a AML Operations Analyst II with an innovative global bank in Toronto, ON. Contract role with strong possibility of extension. Join one of the world's most renowned global banks and trusted brand with over 200 years of continuously evolving financial services worldwide. You will work alongside some of the smartest minds in the industry who are excited to share their knowledge and to learn from you.Contract Duration: 6+ MonthsKey ResponsibilitiesFinancial Crime Advisory & Subject-Matter ExpertiseServe as an internal specialist on AML/ATF, Sanctions, and Anti-Bribery/Anti-Corruption (ABAC) matters.Provide guidance and recommendations to business partners on AML/BSA, Sanctions, and ABAC-related issues.Escalate sensitive or high-risk matters to senior management promptly.Investigations & Case ManagementConduct thorough, well-documented investigations involving AML/ATF, Sanctions, and ABAC concerns.Identify, document, and resolve escalated operational exceptions and refer complex issues when required.Complete regulatory filings and law enforcement reporting for management review and approval.Risk Management & Regulatory ComplianceSupport risk identification, analysis, and mitigation in alignment with regulatory requirements and industry best practices.Protect the organization by identifying and escalating non-standard or high-risk transactions.Comply with all internal/external audit requirements; participate in audit reviews and provide recommendations.Program Governance & Policy SupportAssist in drafting, maintaining, and enhancing policies, procedures, and frameworks to prevent compliance breaches.Contribute to the ongoing effectiveness of AML, Sanctions, and ABAC surveillance programs.Maintain a strong culture of risk management and controls aligned to the bank’s risk appetite.Reporting, Analytics & Trend MonitoringProvide trend analysis, insights, and reporting on AML, Sanctions, and ABAC findings to management.Prepare operational performance reports related to financial crimes activities.Monitor emerging risks, regulatory developments, and industry trends to assess potential business impacts.Operational ExcellencePrioritize and manage workload to meet defined SLAs for accuracy, timeliness, and productivity.Handle sensitive information with discretion and maintain strict confidentiality.Collaborate effectively across teams to strengthen the bank’s overall financial crime framework.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372231469/",
    "job_id": "4372231469",
    "source": "linkedin",
    "company_name": "TD Securities",
    "job_title": "Wealth Investment Management National Office Intern/Co-Op (Summer 2026)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role TypeInternship/Co-opWork TermSummer/Term 3Work Location:Toronto, Ontario, CanadaHours37.5Pay Details$48,000 - $68,000 CADTD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The base pay actually offered may vary based upon the candidate's skills and experience, job-related knowledge, geographic location, and other specific business and organizational needs.As a candidate, you are encouraged to ask compensation related questions and have an open dialogue with your recruiter who can provide you more specific details for this role.Job DescriptionWealth Investment Management National Office Co-opJob Description SummaryProvides a range of operational and analytical support and/or performs transactions and/or other processing activities within a well-defined functional area. The expected outcome of this program is to provide introductory experience in a professional setting. After successful completion of this program, occupants should be equipped with skills and experiences that contribute to the completion of their studies and prepare them to build a career in their chosen discipline.Key AccountabilitiesCUSTOMERSupport successful execution of relevant reporting, operational requests, and relevant transactional requests for the business unit and/or client Conduct less complex analytics and research, and obtain/share internal and external relevant business/market data Assist with building and reviewing internal models, tools, processes, policies, presentations, and other related materials; challenge team and improve the underlying processes of functional area Assist with various initiatives, as assigned For Technology Solutions ProgramsAssist teams with designing and building software, applications, etc. according to business requirements, UX designs, and architectural guidelines, and ensure that high-quality products SHAREHOLDERPrioritize and manage own workload to meet SLA requirements for service and productivity Consistently exercise discretion in managing information and all matters of confidentiality; escalates issues where appropriate Access systems, understand and apply system capabilities, ensure information is completed timely and accurately Update and contribute to the preparation of procedural documents in support of day-to-day operations Escalate non-standard or high risk activities as deemed appropriate Follow internal and industry regulations and operating practices in completing and recording transactions Be knowledgeable and/or aware of industry developments Acquire and apply expertise in the discipline, provide guidance, assistance and direction to others Protect the interests of the organization – identify and manage risks, and escalate non-standard, high risk activities as necessary Maintain a culture of risk management and control, supported by effective processes in alignment with risk appetite EMPLOYEE / TEAMParticipate fully as a member of the team, support a positive work environment that promotes service to the business, quality, innovation and teamwork and ensure timely communication of issues/ points of interest Support the team by continuously enhancing knowledge / expertise in own area and participate in knowledge transfer within the team and business unit Participate in personal performance management and development activities, including cross training within own team Keep others informed and up-to-date about the status / progress of projects and / or all relevant or useful information related to day-to-day activities Contribute to a fair, positive and equitable environment that supports a diverse workforce Act as a brand ambassador for your business area/function and the bank, both internally and/or externally BREADTH & DEPTHWorks autonomously and performs multiple and/or diverse tasks that are complex, involving multiple steps, systems, and jurisdictions Transactions and activities require expert knowledge across a broad range or variety of products, processes or systems within own area of specialty and where transactions could be characterized by moderate to high risk Gathers and analyzes data to identify and solve complex problems, escalates as required Uses sound judgement and understanding of process/policy risk when recommending exceptions outside general practices or guidelines. Generally interacts with internal customers / partners for functions performed and/or external customers May provide process / policy guidance to others (e.g. within team, internal partners) Focus of work is weekly, monthly and/or longer with addition of ad-hoc and initiative based requests, as required Process subject matter expert in a range of technical processes and procedures through job related",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371558729/",
    "job_id": "4371558729",
    "source": "linkedin",
    "company_name": "Altis Recruitment",
    "job_title": "Chief Financial Officer",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Location: Downtown Toronto, expected in office 4-5 days per weekType: Permanent, Full-TimeLanguage: Strong written and verbal communication skills in EnglishBackground Check Requirement: References and criminal background check requiredAbout the OpportunityThis is a rare opportunity to step into a true builder role at a mission-driven, high-growth HR technology organization operating at the intersection of workforce development, public sector impact, and SaaS innovation. With a proven platform, strong revenue momentum, and recent capital investment, the organization is entering its next phase of disciplined, international growth.As Chief Financial Officer, you will partner closely with the CEO and board to shape financial strategy while helping scale a business that supports people navigating career transitions. You will work alongside a strong controller and leadership team, bringing clarity, rigor, and insight to complex, multi-entity operations while acting as a trusted second-in-command across the business.What’s in it for YouYou will join a people-first organization with a healthy foundation, no short-term fundraising pressure, and a clear mandate to build rather than fix. This is a role for a strategic leader who values collaboration, curiosity, and shared ownership.You will have meaningful exposure to board-level decision-making, international expansion, and product evolution, all within a culture that values flexibility, trust, and rolling up your sleeves when it matters most.Your ResponsibilitiesYou’ll act as a strategic and hands-on business partner to the CEO, helping translate vision and growth priorities into executable financial and operational plans.You’ll own the financial strategy, supporting multi-year growth, runway planning, and capital allocation.In this role, you’ll partner with the CEO and leadership team on pricing, investment decisions, and market expansion.You’ll lead forecasting, budgeting, and financial modeling across geographies and business lines.You’ll build and scale financial systems, controls, and reporting in a multi-currency environment.You’ll oversee accounting, compliance, and risk management, ensuring accuracy and discipline as the business grows.You’ll lead board, investor, and external stakeholder reporting with clarity and confidence.Skills and QualificationsCPA designation and Big 4 firm experience required.12-15 years of finance leadership experience in SaaS environments.Deep experience with multi-currency, multi-entity operations and international reporting.Experience partnering with CEOs and boards on strategic and operational decisions.Strong command of SaaS metrics and unit economics, with the ability to operationalize insights.A low-ego, hands-on leadership style with strong cross-functional and operational instincts.Note from the Hiring Manager (CEO)“We’re looking for a true partner, someone who thinks strategically but isn’t afraid to roll up their sleeves. This role is about building together, challenging ideas respectfully, and helping the business reach its full potential.”Why Partner with AltisIf you’ve never worked with a staffing agency before, we make it easy. We work with top employers across Canada who have great jobs to fill, each vetted and verified by our team. When you apply for a job with Altis, we get to know you as a candidate and learn what your strengths are. Then, if you’re a solid match, we handle all the logistics, advocating for you as a candidate for the role, providing access to coaching and connecting you directly with the hiring manager. And rest assured, all our services are free of cost for candidates.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363955079/",
    "job_id": "4363955079",
    "source": "linkedin",
    "company_name": "Avanciers Inc.",
    "job_title": "Risk/Compliance Specialist",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Avanciers Incorporated is hiring a Risk/Compliance Specialist for one of our clients.Job Title: Risk/Compliance SpecialistJob Location: Toronto, ON – Hybrid(3 days onsite in a week)Employment Type: ContractDuration: 6+ MonthsThis is an active job and application deadline is February 20, 2026(This posting may close earlier if a suitable candidate is found)Job description: Lead enterprise risk assessments by analyzing data from multiple sources to identify control gaps, assess remediation strategies, and strengthen organizational risk posture across business and technology domains.Interpret regulatory policies, legislation, and security standards to provide clear, actionable guidance to senior management and executives, translating compliance requirements into operational implementations.Design, map, and scope internal control frameworks, delivering gap analysis, control design, and remediation planning across areas including logical access control, secure development, security architecture, and privacy.Drive risk, governance, and compliance initiatives through strong stakeholder engagement, expert communication, and application of technical security, agile development, and risk management principles, with GRC tool experience as an added advantage.Artificial Intelligence (AI) DisclosureWe use AI-enabled tools to assist in screening applications based on job-related criteria.Our Commitment to Diversity and InclusionAvanciers Incorporated is an equal opportunity employer committed to creating an inclusive and accessible workplace. We welcome applications from all qualified individuals regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or any other protected characteristic. We are committed to providing accessible employment practices that comply with the Accessibility for Ontarians with Disabilities Act (AODA).Important Information for ApplicantsOnly candidates selected for an interview will be contactedProof of qualifications may be requestedBackground checks may be conducted as part of the hiring processAvanciers Incorporated does not use Canadian Social Insurance Numbers (SIN) during the application processAvanciers Incorporated thanks all applicants for their interest; however, only those selected for an interview will be contacted.Avanciers Incorporated www.avanciers.com",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3787261770/",
    "job_id": "3787261770",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Paakhi নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356424612/",
    "job_id": "4356424612",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Officer - (Research and Publication)- For Centre for Development Innovation & Practices - CDIP- Job ID: 1453928",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365525635/",
    "job_id": "4365525635",
    "source": "linkedin",
    "company_name": "Fastnet",
    "job_title": "Financial Accountant",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Financial Accountant (Newly Qualified) DublinOur Dublin based client is looking for a newly qualified Accountant to join their team on a permanent basis. The successful candidate will be responsible for maintaining accurate financial records, ensuring compliance with statutory and regulatory requirements, and supporting the production of timely and reliable financial reports. Working closely with the finance team and wider business, the role plays a key part in month-end and year-end processes, financial controls, and audit preparation.ResponsibilitiesPreparation of monthly management accounts which are reported to the Senior Leadership Team.Manage month-end and year-end close processes, including journals, accruals, prepayments, and reconciliations.Maintain the general ledger and ensure the accuracy and integrity of financial data.Support statutory accounts preparation and act as a key contact for external auditors.Ensure compliance with tax requirements (e.g. Payroll, VAT, corporation tax support).Maintain and improve financial controls and accounting processes.Support budgeting and forecasting with accurate historical financial information.Provide financial information and analysis to support management decision-making.Support the organisation as required with ad-hoc external reporting requirements.Requirements: Fully qualified accountant (ACA, ACCA, CIMA or equivalent).Experience preparing statutory accounts and supporting external audits.Solid knowledge of relevant accounting standards.Good understanding of tax compliance requirements (payroll, vat and corporation tax).Strong Microsoft Office skills particularly in Excel.Strong analytical and problem-solving detail.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371540886/",
    "job_id": "4371540886",
    "source": "linkedin",
    "company_name": "Research Ireland",
    "job_title": "Finance Administration Officer",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361908640/",
    "job_id": "4361908640",
    "source": "linkedin",
    "company_name": "Infosys BPM",
    "job_title": "Financial Analyst",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Role: Fundamental AnalystRole Designation: Process ExecutiveLocation: Dublin, IrelandAbout Infosys BPM LtdInfosys BPM is a global leader in business process management, offering integrated IT and BPM solutions to drive transformation, efficiency, and customer experience. With 35 delivery centers across 14 countries and over 42,000 employees, it serves clients worldwide using advanced frameworks, automation, and technology.Role Overview: Fundamental Analyst - SpanishThis position is an excellent entry opportunity to gain a comprehensive understanding of the industry through financial reporting standards and enable you to learn facets of the assigned industry, and as well as apply this knowledge to your daily responsibilities.This role involves researching and analysing company financial data for Fundamental’s product in support of the EMEA markets.Key Responsibilities:Research and Analyse financial data from companies annual/quarterly reportsConduct company specific financial researchMaintain, improve, and deliver accurate and high-quality information for the Client Terminal on a timely basisFinancial Data Processing Responsibilities:Analyse and extract company performance data from financial statement like Balance Sheet, Income Statement & Cash flow statement of all the listed companies globally, both in English and your market languageStandardize the data available in Income statement, Balance Sheet and Cash Flow statement in accordance with the collection policyWork within various global accounting principles, GAAP, IFRS etc. Essential:Bachelor’s Degree (or equivalent) in a relevant subject or relevant work experienceFluent in English and SpanishAn understanding of the components of financial statementsCustomer focus, Problem solver with excellent communication, interpersonal skillsAbility to prioritize tasks accordingly and work to tight and conflicting deadlinesSpeed and accuracy when processing data with a high level of attention to detailDesirable:Advanced Excel Skills (lookups, pivot tables)Benefits for youPerformance related bonusTax Saver Scheme – which allows for employees to purchase travel tickets/ bike tax freeHealth Insurance - 10% off a health insurance plan with Irish Life.Company contribution pension schemeSick Pay – Entitled to 6 days of sick leave per year after probation period is passed.2 days study leaveAccess to extensive variety of upskilling coursesRelocation supportBy applying for this job posting using LinkedIn Easy Apply you confirm that you have gone through the Infosys privacy noticehttps://globalcareers.infosysbpm.com/infosysbpm/privacy-notice#ireland",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362142391/",
    "job_id": "4362142391",
    "source": "linkedin",
    "company_name": "Infosys BPM",
    "job_title": "Financial Analyst",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4334805779/",
    "job_id": "4334805779",
    "source": "linkedin",
    "company_name": "The Panel",
    "job_title": "Professional Support Lawyer - Banking & Finance",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4223524747/",
    "job_id": "4223524747",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts & Payroll Officer (For Mates Global)-Job ID: 1364184",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318428944/",
    "job_id": "4318428944",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4225627012/",
    "job_id": "4225627012",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Sr. Officer, Treasury (For Rahimafrooz Storage Power Business)-Job ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4236310043/",
    "job_id": "4236310043",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]