[
  {
    "url": "https://www.linkedin.com/jobs/view/3426414938/",
    "job_id": "3426414938",
    "source": "linkedin",
    "company_name": "Elife Transfer",
    "job_title": "Senior Lead Software Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Our company: A fast-growing start-up headquartered in San Francisco, CA, USA in the heart of Silicon Valley. We recruit worldwide as our customer base is global. All employees outside San Francisco headquarter work remotely. Elife is a Startup developing innovative technology in the passenger transport industry, providing any type of ground transportation worldwide, including Group/event transportation, NEMT transportation, senior and disability transportation, pet relocation, bilingual driver for non-English speak clients. Our market is the world. Our customers are everywhere. Our platform and apps are built on the cloud. We have endless exciting problems to solve and we only use the best and latest technology. Vacancy: Sr. Software Engineer / Backend Developer Responsibility · Develop backend applications for customers worldwide. · Work with team members including frontend, backend, testing, and App design · Develop Python/MySQL backend hosted on Amazon Web Service · Enhance and maintain existing software applications · Design highly scalable and testable code · Discover and fix programming bugs What We’re Looking For: · Bachelor's degree in computer science or equivalent. · +6 years experience in similar positions developing web and apps. . Hands on coder, and architect . Excellent communication skills · Design highly scalable and testable code. · Time management · Analytic · Work globally · Can do attitude · Fast learner · Team players Our Apps · Single page web app running on both PC and mobile devices. · Python/MySQL backend hosted on Amazon Web Service. · Our customers and markets are worldwide in North America, South America, Asia, Europe and Africa. We hire front-end, back-end and full stack engineers at all levels of experience. The ideal candidate will be responsible for developing high-quality applications. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Truck Transportation"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/1903111262/",
    "job_id": "1903111262",
    "source": "linkedin",
    "company_name": "Field Nation",
    "job_title": "Senior Software Engineer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "The fastest growing Cloud Based Marketplace Company, Field Nation is looking for a “Senior Software Engineer” for its development team. As we are rising day by day, our needs are evolving and to keep pace with the evolution we need experts like you to contribute, learn and grow with us. As a Senior Software Engineer you will be contributing to the integral development of the team with high level of professionalism and accountability. This position will also offer the chance to work in a fast-paced, hyper growth environment where innovative ideas are encouraged and collaboration is a must. This position is located in Uttara, Dhaka. Key Responsibilities Work in a global team environment to develop new features for our cutting edge technology SaaS solution hosted on AWS. Architect and implement scalable, secure, and reliable solutions. Assist in preparing technical specs for development by other developers. Assist in team testing to ensure top code quality. Job Requirements Expert on PHP, OOP, MVC, MySQL, and JavaScript. Experience with OOP JS, node.js, and express.js. Experience with ES6 and react.js. Knowledgeable in CSS3, Bootstrap Grid System, HTML5. Ability to work individually and independently with minimal supervision. Self-managed, independent, initiative and proactive. Open to learn new technologies. Strong written and verbal communication skills in English. Additional Qualifications Relational database performance optimizations. Experience with REST APIs. Experience with typescript. Familiarity with the Git version control system. Familiarity with package management tools (NPM, Composer, Webpack, etc). Familiarity with DevOps processes and tools (Docker, Kubernetes, etc). Experience in automated testing processes. Familiarity with unit testing. Knowledge of Linux or other Unix-based systems. Ability to work in a team. Willingness to work from 1 PM to 10 PM BD time. Willing to work at Uttara, Dhaka. Education B.Sc. / M.Sc. in Computer Science & Engineering from any reputed University or equivalent practical experience. At least 4 years of experience in full-stack software development. Office Location: Uttara, Dhaka (Currently we are working from home due to COVID-19) Salary And Benefits Competitive salary based on experience and qualification. Contributory Provident Fund and Gratuity benefit. Sound work-life balance - Regular working hours: 8 hours/day, 5 days a week. Friendly work environment. Flexible leave/vacation policy. A great learning opportunity. The opportunity to work with cross-cultural teams with the US. Performance evaluation & Increment. Office hour 1 PM to 10 PM. Employee Transportation Facility (Subject to availability). Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting, Software Development, and Technology, Information and Internet"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357101934/",
    "job_id": "4357101934",
    "source": "linkedin",
    "company_name": "Job Vacancy in Bangladesh",
    "job_title": "Back End Developer",
    "location": "Singapore",
    "salary": "",
    "employment_type": "Part-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Job Vacancy in Bangladesh Mahedi Raza Rajani Mahedi Raza Rajani Export Executive | Accounting & Finance Professional | International Business Role Description This is a part-time remote role for a Back End Developer. The primary responsibilities include designing, developing, and maintaining server-side applications, ensuring system functionality and database integration, and collaborating with front-end developers for seamless operations. The Back End Developer will also use programming skills and best practices in software development to optimize performance and scalability. Qualifications Proficiency in Back-End Web Development and Software Development Experience with Object-Oriented Programming (OOP) Strong Programming skills across various languages Understanding of integration with Front-End Development Excellent problem-solving and analytical skills Strong communication and teamwork abilities Bachelor’s degree in Computer Science, Software Engineering, or related field preferred Previous experience with remote work could be advantageous Show more Show less Seniority level Entry level Employment type Part-time Job function Engineering and Information Technology Industries Human Resources"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4256195493/",
    "job_id": "4256195493",
    "source": "linkedin",
    "company_name": "Easy Recruit Global",
    "job_title": "Jax + TensorFlow",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Temporary",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We are looking for an experienced Machine Learning Engineer with deep hands-on expertise in JAX and a solid understanding of TensorFlow. In this role, you will lead the migration of TensorFlow models and training pipelines to JAX while ensuring model fidelity and performance remain consistent. You will also design tools and frameworks to support seamless future framework transitions. This is a high-impact engineering role focused on low-level model internals, performance benchmarking, and framework interoperability. What does day-to-day look like: Translating production-grade machine learning models from TensorFlow to JAX Designing and executing robust evaluation pipelines to ensure model fidelity post-migration Developing tools and scripts to automate framework translation and validation Collaborating with research and product teams to align performance metrics and validation needs Conducting performance benchmarking and profiling to ensure optimal model efficiency Building reproducible ML workflows and ensuring version-controlled development Requirements: Proven experience with JAX and NumPy in real-world ML projects Strong understanding of TensorFlow, including internals and model structure Experience with migrating models between frameworks and ensuring parity Solid grasp of ML training workflows, loop mechanics, and evaluation metrics Strong Python programming skills and clean, modular code practices Familiarity with ML experiment tracking and reproducibility tools (e.g., MLFlow, Weights & Biases) [Bonus] Preferred Qualifications: Experience with other ML libraries (e.g., PyTorch, Flax) Background in ML research or scientific computing Experience with production model monitoring and governance Perks : Work in a fully remote environment Opportunity to work on cutting-edge AI projects with leading LLM companies Offer Details: Commitments Required: At least 4 hours per day and minimum 20 hours per week with overlap of 4 hours with PST Employment type: Contractor assignment (no medical/paid leave) Duration of contract: 2 months; [expected start date is next week] Show more Show less Seniority level Mid-Senior level Employment type Temporary Industries Human Resources Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4012618356/",
    "job_id": "4012618356",
    "source": "linkedin",
    "company_name": "Thirtymins Limited",
    "job_title": "Software Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Thirtymins Limited Abul Basher Emon Abul Basher Emon Founder of My Ride | Director at Sole Mound Ltd | Founder at Eti IT Park | Proprietor at Eti Properties | Reciter at বাঙালী বণিক Company Description ThirtyMins Ltd is an innovative halal food delivery service that provides high-quality and delicious halal meals to Muslim customers. The company ensures all delivered food complies with Islamic dietary laws by working closely with halal-certified restaurants and suppliers. With a diverse menu offering traditional Middle Eastern, Asian, and Western cuisine, ThirtyMins Ltd prioritizes quality, diversity, and convenience. Customers can easily order and track deliveries through the user-friendly online platform and mobile app. Role Description This is a full-time remote role for a Kotlin Developer at ThirtyMins Ltd. The Kotlin Developer will be responsible for tasks such as back-end web development, software development, and programming. Object-Oriented Programming (OOP) principles will be utilized to create efficient and effective solutions for the company's platform. Qualifications Computer Science skills Back-End Web Development and Software Development expertise Programming knowledge Proficiency in Object-Oriented Programming (OOP) Experience in Kotlin programming language Strong problem-solving skills Ability to work independently and remotely Bachelor's degree in Computer Science or related field Salary Range: 30000-80000 BDT Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries Accommodation and Food Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3901937705/",
    "job_id": "3901937705",
    "source": "linkedin",
    "company_name": "Perceptron",
    "job_title": "Software Developer Intern",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Title: Intern Software Developer. COMPANY: PERCEPTRON. Location: Remote. Duration: 3 months at least. Salary: Unpaid. Time: Flexible Work hours."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4019946867/",
    "job_id": "4019946867",
    "source": "linkedin",
    "company_name": "CrowdPlat",
    "job_title": "Web Developer - Part Time / Freelance Work",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Contract",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Overview: We are looking for a talented Web Developer to assist with the development and maintenance of webpages for our Lyme disease diagnostic project. In this role, you will work closely with designers and content specialists to create and update webpages that are user-friendly, responsive, and visually appealing. The ideal candidate will have a strong background in web development and experience with content management systems (CMS). Responsibilities: Develop and update webpages in collaboration with the design and content teams. Ensure that all webpages are functional, responsive, and optimized for various devices and browsers. Implement web design elements and features that enhance the user experience. Assist in maintaining and improving existing websites, troubleshooting issues as needed. Ensure that all web content is compliant with accessibility standards (508 compliance). Stay up to date with emerging web technologies and best practices. Qualifications: Bachelor’s degree in Web Development, Computer Science, or a related field. At least 3 years of experience in web development, with a strong focus on front-end development. Proficiency in HTML, CSS, JavaScript, and experience with content management systems (e.g., WordPress, Drupal). Familiarity with 508-compliance and web accessibility standards. Experience working with designers to bring visual concepts to life. Strong problem-solving skills and attention to detail. Ability to manage multiple tasks and meet deadlines in a remote work environment. Show more Show less Seniority level Mid-Senior level Employment type Contract Job function Engineering and Information Technology Industries Outsourcing and Offshoring Consulting, IT Services and IT Consulting, and IT System Custom Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322801079/",
    "job_id": "4322801079",
    "source": "linkedin",
    "company_name": "Retreat",
    "job_title": "Software Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "### Software Engineer. # Software Engineer. ### Software Engineer, Platform - Asia. ### Full Stack Software Engineer. * Software Engineer ( .Net ) - (For Leading Multinational Software Company)-Job ID: 1452157. ### Software Engineer ( .Net ) - (For Leading Multinational Software Company)-Job ID: 1452157. * Software Engineer, Data Infrastructure & Acquisition - Dhaka, Bangladesh. ### Software Engineer, Data Infrastructure & Acquisition - Dhaka, Bangladesh. * Software Engineer, iOS Core Product - Dhaka, Bangladesh. ### Software Engineer, iOS Core Product - Dhaka, Bangladesh. * Software Engineer, iOS Core Product - Asia. ### Software Engineer, iOS Core Product - Asia. * Junior Software Implementation Engineer - (For Codemen Solutions Limited) - Job ID - 1455446. ### Junior Software Implementation Engineer - (For Codemen Solutions Limited) - Job ID - 1455446. * Senior Software Engineer, AI Model serving - Asia. ### Senior Software Engineer, AI Model serving - Asia. ### Go Engineer. * [Transportation Management System - Lead Full Stack Python/FastApi/React Engineer [REMOTE]](https://bd.linkedin.com/jobs/view/transportation-management-system-lead-full-stack-python-fastapi-react-engineer-remote-at-anovium-4163289640?"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317406530/",
    "job_id": "4317406530",
    "source": "linkedin",
    "company_name": "Softopark It Ltd.",
    "job_title": "Passionate Webflow Developers",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Softopark It Ltd. Abdul Hasib Abdul Hasib Chief Executive Officer at SOFTOPARK.COM Company: Softopark IT Ltd Location: Office-based in Dhaka, Bangladesh Positions: 2 Salary: 20,000 – 30,000 BDT/month Probation: 3 months (Salary review after probation) 🎯 About the Role Softopark IT Ltd is looking for skilled and passionate Webflow Developers to join our team. You’ll be responsible for transforming Figma designs into pixel-perfect, responsive websites on Webflow, ensuring performance, aesthetics, and interactivity meet top-notch standards. This position requires physical attendance at our office. 🧠 Key Responsibilities ✅ Convert Figma designs into Webflow websites (pixel-perfect accuracy) ✅ Develop and maintain responsive, SEO-friendly web pages ✅ Collaborate with designers on animations & interactions ✅ Optimize pages for speed, performance, and best practices ✅ Stay up-to-date with the latest Webflow & web dev trends ✅ Work independently and meet project deadlines ✅ Assist in troubleshooting and resolving any technical issues that arise during or after development ✅ Familiarity with Webflow’s CMS and building dynamic websites using it ✅ Familiarity with third-party integrations (e.g., Zapier, Google Analytics, or email marketing tools) ✅ UI/UX design experience or understanding 💡 Requirements 🟢 Proven experience with Webflow (Portfolio required) 🟢 Strong knowledge of HTML, CSS, and JavaScript 🟢 Bonus: Familiarity with WordPress 🟢 Excellent communication & time management 🟢 Detail-oriented and quality-driven 🟢 Comfortable working with physical office attendance 🟢 Office hours: 9:00 PM to 5:00 AM (BDT) 📩 How to Apply Send your Resume + Portfolio to: 📧 info@softopark.com 📞 +8801616-577796 📍 Nahar Tower, 124-Avenue 3, Block C, Banasree, Rampura, Dhaka - 1219 Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2330877371/",
    "job_id": "2330877371",
    "source": "linkedin",
    "company_name": "Field Nation",
    "job_title": "Associate Software Engineer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Why is this role important to Field Nation? The Associate Software Engineer is an entry-level software engineer position that plays a crucial role for our product teams. As experts on our product functionality as well as the code that makes it all work, they are the go-to people when questions or difficulties arise. They're responsible for investigating advanced problems not fit for our standard support and coming up with the solutions. What You’ll Do Monitoring and responding promptly to incoming support tickets regarding software defects. Filtering through complex customer details to determine the root of an issue. Identifying and implementing a quick solution when problems arise and helping to plan out long-term resolution. Communicating effectively to the team when problems arise and ensure they receive a timely response. Keeping a pulse on areas of concern that may need additional support and bringing that insight to their teams product planning meetings. Providing exceptional customer support and relationship management. Being a subject matter expert in product functionality and use to drive customer-based solutions. Job Requirements Previous experience in web and software development (can be combination of education and work experience) The ability to think independently while also working collaboratively to creatively and quickly solve customer problems. Ability to identify, propose and implement solutions. Demonstrated effective oral and written communication skills, including poise in pressure situations. The ability to convert technical terminology into layman's terms. Strong analytical and problem solving skills. An interest in software development and being a part of a product company. Additional Requirements Experience with relational databases such as MySQL Demonstrated knowledge of web technologies, such as javascript Experience with PHP, OOP and MVC Experience with OOP JS, node.js, and express.js. Willing to work at Uttara, Dhaka.(We are doing Work From Home due to the Covid-19 ) Education Bachelor or Master level degree in Computer Science or Engineering from a reputed University or equivalent practical experience 1 years experience in software development. Office Location Uttara, Dhaka. (We are doing Work From Home due to the Covid-19 ) Office Time 1pm-10pm Salary range 30-50k Salary & Benefits Competitive salary based on experience and qualification. Contributory Provident Fund and Gratuity benefit Sound work-life balance - Regular working hours: 8 hours/day, 5 days a week Friendly work environment. Flexible leave/vacation policy. A great learning opportunity. The opportunity to work with cross-cultural teams with the US. Annual performance evaluation and increment. Yearly bonus. Office hour 1 pm to 10 pm. Employee Transportation Facility. (Subject to Availability) ﻿ Why Field Nation? At Field Nation, we are breaking the barriers to work and enabling the gig economy. We’re a tech company that offers a web-based marketplace solution for buyers and sellers of contract services to simply connect, work, and manage their business. We look for collaborators, innovators, and problem solvers to join us in our common purpose of changing the way work gets done. We were named a Top Workplace by the Star Tribune in 2017, 2018, 2019, and a Top 150 Workplace in 2020. We look to hire extraordinary people and provide them extraordinary benefits. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting, Software Development, and Technology, Information and Internet"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4062684005/",
    "job_id": "4062684005",
    "source": "linkedin",
    "company_name": "The Flutter Way",
    "job_title": "Flutter Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "The Flutter Way Bangladesh. 1 year ago Be among the first 25 applicants. See who The Flutter Way has hired for this role. No longer accepting applications."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4104058350/",
    "job_id": "4104058350",
    "source": "linkedin",
    "company_name": "Studio Dev Hub",
    "job_title": "Full Stack Developer III",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Posted 7:59:06 AM. Job Title: Full Stack Developer (JavaScript, Vue.js and API management)Location: Hybrid…See this and similar jobs on LinkedIn."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3081216080/",
    "job_id": "3081216080",
    "source": "linkedin",
    "company_name": "Square Health Limited",
    "job_title": "Software Engineer (Java)",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Square Health Limited Mozammel Hoque (Tushar), CLDP, CTMP Mozammel Hoque (Tushar), CLDP, CTMP L&D | Talent Management | OD | Assessment Center | HRBP | Tech HR | at Square Pharmaceuticals PLC. We are looking for a Software Engineer responsible for building Java-based applications. This includes anything between complex groups of back-end services and their client-end (desktop and mobile) counterparts. Your primary responsibility will be to design and develop these applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality are essential. You will work as part of a software development team and be responsible for designing, implementing, and maintaining Java applications. # Responsibilities Able to review, recommend, and develop code for complex, data-intensive web-based platforms. Ensure the quality of software by writing clean code adhering to best practices. Document code consistently throughout the development process and perform peer code review. Maintain and follow the agile software development process and lifecycle. Write secured software to ensure the protection of sensitive data. Analyze bugs and innovate solutions on a regular basis. Responding promptly and professionally to bug reports. Research and code with new tools, libraries, APIs and frameworks. Manage individual task priorities, deadlines, documents and deliverables Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review. Mentoring and guiding other engineers to best software industry practices, tools and processes. # Requirements The candidate should have a minimum of 4 year of practical experience in the following areas: Java Java EE & Spring Framework (Spring Boot) Spring Security JPA/Hibernate JavaScript HTML5 & CSS3 Angular 2/4/5, TypeScript SOAP/WSDL/REST/XML/JSON Tomcat /Apache/Jboss. Git Maven/Gradle MySQL/PostgreSQL/Oracle. MongoDB. CI/CD tools: Jenkins Good knowledge in Linux (Preferred) Spring Cloud, ELK Stack, Docker Knowledge in AWS and Kubernetes will be plus point. Ability to work individually and independently with minimal supervision. Candidates need to be highly professional, friendly, courteous, and able to meet the committed deadlines. Have to understand technical documents and business process. Should have a strong agile/scrum methodology experience. # Qualifications BSc. in CSE / ECE / EEE or any related discipline. Additional certifications are a plus but not required. # Salary Negotiable ( Salary will be calculated based on candidates prior knowledge, experience, and expertise level. ) # Compensation & Other Benefits Yearly increment based on performance. Two yearly festival bonuses. Two weekly holidays. Full subsidize lunch facilities. And other benefits as per the company’s policy. # Other Information Total Vacancy: 2 (Two). Job Context: Software Engineer (Intermediate level). Workplace: Mohakhali, Dhaka (Work at office). Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3209898585/",
    "job_id": "3209898585",
    "source": "linkedin",
    "company_name": "Stealth Startup",
    "job_title": "Sr. Software Developer ( Node + Vue)",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Way of working : This is a remote opportunity We are looking for an expert JavaScript developer who is highly skilled with Vue.js and Node. Your primary focus will be developing userfacing web applications and components. You’ll implement them with the Vue.js framework, following generally accepted practices and workflows. You will ensure that you produce robust, secure, modular, and maintainable code. You will coordinate with other team members, including back-end developers and UX/UI designers. Your commitment to team collaboration, perfect communication, and a quality product is crucial. Responsibilities -Developing user-facing applications using Vue.js -Building modular and reusable components and libraries Development of backend services that power our products and taking responsibility for scalability and reliability of them. -Optimizing your application for performance Contribute to the entire development life cycle of analysis, design, implementation and test. - Implementing automated testing integrated into development and maintenance workflows Staying up-to-date with all recent developments in the JavaScript and Vue.js space - Keeping an eye on security updates and issues found with Vue.js and all project dependencies --Proposing any upgrades and updates necessary for keeping up with modern security and development best practices Requirements -Proficiency in Node.js for minimum 3 years - Highly proficient with the JavaScript language and its modern ES6+ syntax and features Highly proficient with the Vue.js framework and its core principles such as components, reactivity, and the virtual DOM Exposure to developing apps using NodeJS, JavaScript, MySQL. -Familiarity with the Vue.js ecosystem, including Vue CLI, Vuex, Vue Router, and Nuxt.js Good understanding of HTML5 and CSS3 Understanding of server-side rendering and its benefits and use cases -Knowledge of functional programming and object-oriented programming paradigms Ability to write efficient, secure, well-documented, and clean JavaScript code Familiarity with automated JavaScript testing, specifically testing frameworks such as Jest or Mocha Proficiency with modern development tools, like Babel, Webpack, and Git Experience with both consuming and designing RESTful APIs Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Technology, Information and Internet"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3789556463/",
    "job_id": "3789556463",
    "source": "linkedin",
    "company_name": "Buzz Geek, LLC",
    "job_title": "WordPress Web Developer",
    "location": "...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Context. We are seeking for a skilled Mid-Level WordPress Developer to join our dynamic team. As a member of our development department,"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4086662975/",
    "job_id": "4086662975",
    "source": "linkedin",
    "company_name": "Texon",
    "job_title": "React Native Developer (Project Basis, Remote)",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Texon Md. Ashraful Islam Md. Ashraful Islam Software Development & Outsourcing Partner | Tech Team Augmentation | AI & Robotics | CMO @Texon | Empowered 55+ businesses with custom software… We are looking for a React Native Developer with 3+ years of experience to join our team on a project basis . If you're experienced in mobile app development and familiar with the MERN stack , this could be the perfect role for you! Position : React Native Developer Experience : 3+ years (React Native) Work Type : Remote, project basis Compensation : Salary negotiable Key Responsibilities Develop and maintain high-quality mobile applications using React Native . Collaborate with cross-functional teams to define, design, and deliver new features. Ensure optimal performance, quality, and responsiveness of the application. Debug and resolve technical issues, ensuring the smooth functioning of the app. Integrate with backend services using the MERN stack . Qualifications 3+ years of experience in React Native development. Strong knowledge of JavaScript/TypeScript . Experience with the MERN stack (MongoDB, Express.js, React, Node.js). Familiarity with RESTful APIs, third-party libraries, and frameworks. Excellent problem-solving skills and attention to detail. Fluent in English , with strong communication skills. Ability to work independently in a remote setup. What We Offer Fully remote work environment. Competitive and negotiable salary . Opportunity to work on innovative projects. Interested? Send your CV and portfolio to hr@texonltd.com or apply directly via LinkedIn. Let’s build something amazing together! #ReactNative #RemoteWork #MERNStack #JobOpening #Hiring Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4313736445/",
    "job_id": "4313736445",
    "source": "linkedin",
    "company_name": "Astha.IT",
    "job_title": "Backend Engineer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Backend Engineer We are looking for a mid-level Backend Engineer with experience in any language or framework, passionate about building high-performance & scalable solutions. Experience with .Net is a plus. Role Summary: As a Mid-Level Backend Engineer, you’ll design and build scalable, high-performance backend systems that power real-world applications. You’ll collaborate with cross-functional teams to translate ideas into clean, efficient, and maintainable code while solving challenging problems. Engineers from any backend stack are welcome, and experience with .NET is a plus. This is a chance to grow, innovate, and make an impact with every line of code. Responsibilities: • Collaborate with cross-functional teams to understand business requirements and design scalable backend solutions that meet client needs. • Develop and maintain robust, high-performance backend applications using preferred backend technology stack (.NET experience is a strong plus). • Write clean, maintainable, and secure code following industry best practices and coding standards. • Optimize application performance and troubleshoot issues to ensure seamless functionality and minimal downtime. • Participate in code reviews, share constructive feedback, and uphold high standards of software quality. • Contribute to the continuous improvement of software architecture to enhance maintainability, scalability, and performance. • Mentor and guide junior developers, fostering a culture of learning and technical excellence. • Stay current with emerging backend technologies, frameworks, and tools to propose innovative and efficient solutions. Technical Requirements: • Proven experience in backend development using any modern language or framework (such as .NET, Python, Java, Node.js or Go). • Solid understanding of software architecture principles and experience building distributed, non-monolithic systems using microservices. • Strong knowledge of database concepts and hands-on experience with both relational (MySQL, PostgreSQL) and NoSQL (MongoDB, etc.) databases. • Experience with RESTful API design and development; familiarity with GraphQL is a plus. • Experience with containerization and orchestration tools (Docker, Kubernetes) is highly valued. • Exposure to message brokers or streaming platforms (Kafka, RabbitMQ, etc.) is advantageous. • Familiarity with cloud platforms (AWS, Azure, GCP) and understanding of how to select appropriate compute, storage, and messaging services. • Experience building and managing CI/CD pipelines for backend services. • Strong grasp of software design patterns, modular architecture, and clean code principles. • Experience integrating third-party APIs and managing external service dependencies. • Proficiency in version control systems (Git). • Strong problem-solving and analytical skills with a love for optimization and efficient code. • Excellent communication and collaboration skills to work effectively in team settings. • Bonus: Demonstrated skill in algorithms or competitive programming (ACM, HackerRank, Codeforces, etc.) will be highly appreciated. Academic Requirements: Not much. If you can fulfill the aforementioned skill requirements, we don’t care about the academic backgrounds. Your skills matter. Certificates and CGPA are secondary. But if you have a degree (Bachelors or Masters) in CS / CSC / CSE / Software Engineering, it’s a plus of course. All we need from you is a super-hungry learning habit and a geeky-techie spirit. If you have a strong portfolio of complex applications/software/tools that you worked on, that would be terrific. Experience Requirements: 3 – 5 years. Younger candidates who do not meet the experience requirements but possess good skills may apply as well. Monthly Salary: BDT. 50,000 – 1,00,000 / month, depending on the experience bracket mentioned above. Other Benefits: Please read here: https://ait.inc/career Check out our life at work: https://ait.inc/culture Last Date of Application: 20/10/2025 Application Procedure: Please email your resume to jobs@asthait.com along with a proper subject line, and a well-written cover letter that includes bullet-pointed career highlights. Clearly mention the number of years of your professional career, and your expected monthly salary. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4098439419/",
    "job_id": "4098439419",
    "source": "linkedin",
    "company_name": "Koyama International Academy",
    "job_title": "Senior Backend Engineer – Python (FastAPI)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Koyama International Academy Dipankar Paul Dipankar Paul Supervisor – iMV Cloud & System Integration | DSS Business Division | Innovating Industrial Solutions @ IMV Corporation | Ex-R&D Chief, Showa Co.… Exciting Career Opportunity Awaits! Koyama International Academy (KIA) is here to help you take the next step in your professional journey! 🔍 We Are Hiring: Senior Backend Engineer – Python (FastAPI) Work Type: Remote (Bangladesh applicants only) Position: Full-time 🛠 About the Company: You will be working for a US-based company specializing in fintech and stock market applications. This organization is at the forefront of delivering innovative, scalable solutions for financial markets, leveraging cutting-edge technology to meet global industry demands. They value expertise, clear communication, and a collaborative approach to problem-solving. 🛠 What You'll Work On: Backend Development: Design and develop scalable microservices using Python FastAPI. Database Optimization: Build and optimize PostgreSQL databases for reliability and performance. Fintech Integration: Seamlessly integrate Stripe for payments and Clerk/Auth0 for authentication. System Scalability: Identify and solve performance bottlenecks with Redis and task queues. Collaboration: Work closely with an international team to deliver impactful solutions for fintech and stock market applications. 🚀 What We Are Looking For: Experience: 5+ years in backend development with expertise in Python and FastAPI. Technical Skills: Proficient in PostgreSQL, Redis, Stripe, and authentication platforms like Clerk/Auth0. Fintech Knowledge: Familiarity with stock market or financial APIs and compliance best practices. Soft Skills: Exceptional English communication skills for collaborating with international stakeholders. 🌟 Why Join?: Work on cutting-edge projects in fintech and stock markets. Competitive compensation and professional growth opportunities. Flexible work schedule. 💼 How KIA Can Help You: Simplified job application process. Guidance in aligning your skills with the job requirements. Professional advice to enhance your career prospects. Dedicated support to ensure your success in this exciting opportunity. 📋 KIA Additional Services: Employment & Settlement Support: Assisting students and professionals in finding jobs and settling in Japan, including family relocation support. Business Solutions: Providing regulatory compliance guidance, market entry strategies, e-commerce support, and more for businesses in Japan. Cultural Exchange: Promoting cultural understanding between Bangladesh, India, Japan, and beyond. Remote Work & Corporate Support: Facilitating remote work opportunities and offering professional translation services. Technical Support: Delivering comprehensive IT assistance for individuals and companies. STEM Program: Encouraging early interest in science, technology, engineering, and mathematics in Bangladesh, India, and other regions. 🔗 Commitment to Innovation: At KIA, we empower students, professionals, and businesses to succeed in Japan through innovative education and support. 📞 Contact KIA: Phone (JP): 080-9392-9609 Email: info@koyamaia.com Instagram: [@koyama_ia] 📍 Office Address: Koyama International Academy (KIA), 41 Borobazar (Himel Hawya - 3rd Floor), Mymensingh - 2200, Bangladesh. Take the first step toward your dream career with KIA by contacting us today! 💼✨ Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Education"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3870528421/",
    "job_id": "3870528421",
    "source": "linkedin",
    "company_name": "NexGen Cloud",
    "job_title": "Senior Full Stack Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from NexGen Cloud Noelia Gonzalez Perez Noelia Gonzalez Perez Head of Talent & Culture @NexGen Cloud | Shaping Talent, Culture, Internal Comms & High-Impact Employee Experiences NexGen Cloud is a rapidly growing IaaS company focused on providing innovative cloud solutions and infrastructure services. Our GPU cloud infrastructure solutions accelerate development in industries such as Artificial Intelligence & Machine Learning, VFX & Rendering, Data Science & IoT, and Computer Aided Engineering & MDO. We are dedicated to helping our clients navigate the complexities of the digital world and achieve success through cutting-edge, scalable, secure and affordable solutions. At the company's heart stands a group of very talented, experienced, and motivated individuals who want to make a positive change and a lasting impact on the tech world. Position Summary: We are seeking an experienced Full Stack Engineer to join our talented tech team. You will be responsible for developing and maintaining both the frontend and backend components of our applications. Your expertise will contribute to the creation of exceptional user experiences and the seamless functionality of our platform products. Key Responsibilities: Collaborate with cross-functional teams to define and deliver innovative solutions. Design, develop, and maintain robust and scalable web applications. Implement responsive user interfaces using HTML, CSS, and JavaScript frameworks. Develop backend APIs, integrate with databases, and ensure smooth data flow. Optimize applications for speed, performance, and overall user experience. Troubleshoot, debug, and resolve software defects and issues. Stay up-to-date with industry trends and best practices to drive continuous improvement. Qualifications and Skills: 5+ years of proven experience as a Full Stack Engineer with relevant exposure to Infrastructure (private/public/hybrid cloud services) Solid knowledge of Python and thorough understanding of Flask. Strong proficiency in NextJS. Experience with database management (SQL, NoSQL). Familiarity with version control systems (Git). Bachelor's degree in Computer Science or related field (or equivalent experience Excellent problem-solving and communication skills. Experience with cloud platforms. Familiarity with containerisation and orchestration (Docker, Kubernetes). Ability to work independently and collaboratively in a team environment. What We Offer: Competitive salary Opportunity to work with a diverse team of talented professionals who are passionate about technology and innovation. A collaborative and supportive work environment that encourages professional growth and development. Exposure to cutting-edge technologies and the opportunity to make a significant impact on the future of cloud computing. Join our team and become a part of the NexGen Cloud Team, where innovation, collaboration, and growth are at the heart of everything we do. If you are a passionate, talented, and motivated individual looking to make a difference, apply now! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering Industries Telecommunications and IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4061887789/",
    "job_id": "4061887789",
    "source": "linkedin",
    "company_name": "Digital Bridge",
    "job_title": "JAVA Back-End Engineer (with Cloud ...",
    "location": "",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "About the Role. We're looking for a highly skilled Backend Engineer with a minimum of 3 years of experience working in the backend to design, build,"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4013667117/",
    "job_id": "4013667117",
    "source": "linkedin",
    "company_name": "Devs Core",
    "job_title": "React Frontend Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We are looking for a skilled React JS Front-End Developer to join our team and contribute to the development of our custom software developments."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360484016/",
    "job_id": "4360484016",
    "source": "linkedin",
    "company_name": "Somewhere",
    "job_title": "SU - Front-End Developer",
    "location": "South Asia",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "... Developer at a growing US based…See this and similar jobs on LinkedIn ... Get notified about new Frontend Developer jobs in South Asia."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4016500224/",
    "job_id": "4016500224",
    "source": "linkedin",
    "company_name": "Numrah Group",
    "job_title": "Full Stack Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "About the Role. We are seeking an experienced Full Stack Engineer to play a crucial role in the development of Ai system, our cutting-edge AI-powered agency"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3075074301/",
    "job_id": "3075074301",
    "source": "linkedin",
    "company_name": "INTELLIER LIMITED",
    "job_title": "Full Stack Developer- Python",
    "location": "...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Context: We are looking for a Full Stack Developer to produce scalable software solutions. You'll be part of a cross-functional team that's responsible for"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330029518/",
    "job_id": "4330029518",
    "source": "linkedin",
    "company_name": "ZeuZ",
    "job_title": "Data Engineer (BD-Remote)",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from ZeuZ Abu Sufian Abu Sufian 🚀Deputy Manager, Human Resources @ZeuZ.ai (Automation Solutionz) |Ex- Programming Hero | Culture-First Tech Recruiter | Passionate About People… Role Name: Data Engineer Department: Product Engineering Experience Required: 6+ years of Data Engineering Experience Location: Remote Employment Type: Full-time Work Hours: 8 hours/Day, 5 days/Week Salary : up to 150,000 BDT /month Core Tech Stack We’re Looking For • Python (FastAPI preferred) – For building high-performance backend services, data processing layers, and RESTful APIs. • SQL & NoSQL Databases – For OLTP and OLAP use cases, complex queries, analytics, and large-scale data handling. • RESTful APIs – For client-facing and internal service integrations. • Data Pipelines & Backend Services – For complex calculations, transformations, and algorithm-driven processing. • Git & Agile Practices – For collaborative development, version control, and iterative delivery. • Fluency in English (Speaking & Writing) – Required for cross-team collaboration and documentation. Strong problem solver with a data-driven mindset and focus on performance, scalability, and reliability. Why Work With ZeuZ? At ZeuZ (Automation Solutionz), we solve challenging engineering problems that don’t come with ready-made answers. From designing scalable backend systems and data pipelines to integrating diverse databases, third-party APIs, and AI-driven components, our engineers work at the intersection of data, performance, and real-world impact. You’ll collaborate closely with product and engineering teams to shape ambitious yet sustainable solutions that power a world-class automation platform. Role Summary We’re looking for a Data Engineer with 6+ years of experience who enjoys working on backend systems, data pipelines, and core algorithms. In this role, you’ll build and optimize data-centric services, design robust APIs, and collaborate with product teams to turn complex requirements into scalable, production-ready solutions. Key Responsibilities Develop backend processing services for complex calculations and data transformations. Build integration layers connecting SQL/NoSQL databases and third-party APIs. Design, develop, and maintain RESTful APIs for internal and client-facing services. Own the implementation of core algorithms and backend data pipelines based on project requirements. Collaborate with the product team on roadmap discussions and technical feasibility. Optimize performance using caching strategies and efficient system design. Write clean, maintainable, and well-documented code following best practices. Qualifications We Are Looking For Must-Haves 6 years+ of experience as a data-focused Software Engineer. BSc/MSc in Computer Science, Computer Engineering, or equivalent practical experience. Strong proficiency in Python (FastAPI experience is a plus). Solid experience with SQL and NoSQL databases for transactional and analytical workloads. Experience building and consuming RESTful APIs. Understanding of performance optimization and caching strategies. Comfortable working with Git, code reviews, and Agile development methodologies. Strong command of written and spoken English . Nice-to-Haves Experience with Apache Airflow or similar workflow orchestration tools. Cloud experience (AWS or similar) and infrastructure-as-code tools like Terraform . Experience with containerization ( Docker ) and orchestration ( Kubernetes ). Knowledge of JVM languages ( Scala or Java ) and event streaming platforms like Kafka . Understanding of microservices architecture . Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/1879468625/",
    "job_id": "1879468625",
    "source": "linkedin",
    "company_name": "Evaly",
    "job_title": "Data Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Evaly Osman Goni Nahid Osman Goni Nahid Engineering Leader •  Backend | MLOps | Platform Engineering — Simplifying AI Workload Deployment, Scaling & Management Evaly is looking for a Data Engineer to join our growing B2B B2C platform Engineering team. Evaly is the Number #1 E-commerce marketplace in-country With over 1M Weekly Active Users on our Web and Mobile apps, we are looking for Data Engineer professionals who enjoy continuously exploring and challenging the unknowns that arise throughout the project lifecycle. We want someone who enjoys working with engineering, large scale traffic data, database administration, optimizing database and queries, automation, and scripting — our largest customer base. We are seeking a Data Engineer that is interested in joining a rapidly growing market place. This role will report to and work collaboratively with the Engineering team. The Data Engineer will be implementing critical ETL pipelines and advancing best practices for not only the data engineering team but the rest of the organization. They will be working on delivering actual big data architecture while concentrating on real-world problems such as privacy concerns. Evaly has a positive, diverse, and supportive culture - we look for people who are curious, inventive, and work to be a little better every single day. In our work together we aim to be smart, humble, hardworking, and, above all, collaborative. If this sounds like a good fit for you, why not say hello? Our Culture: Authenticity : Share your genuine thoughts and opinions directly. Courage : Invite and deeply consider challenges and criticism. Empathy : Be empathetic, communitarian, and trustworthy. What We Want You to Do: Work with our Engineering teams to ensure data is flowing accurately through data creation to our presentation layers Become an advocate for the Data Engineering team by developing and championing Data Engineering practices with the team and with the company at large Create foundational ETL processes Improve our Data Engineering stack through containerization, data modeling, developing our ETL pipelines, and more Work with stakeholders and translate their needs and expectations into action items and deliverables Lead infrastructure initiatives; from design to implementation to delivery What We Want to See: Expertise in Python, SQL, shell scripting, and databases 3+ years of professional/industry experience Capability to drive initiatives and articulate their value to Engineering and other stakeholders Experience delivering data products from conception to delivery Good communication skills (written/verbal) Passionate about designing elegant ETL pipelines Used Looker, Redshift, Airflow, Spark Familiar with data vault modeling, Agile methodologies, Kubernetes, Docker, Kafka, and data governance Who You Are: Highly energetic and proactive with strong leadership skills Enjoy making sense of chaos, continuously learning and working with a diverse group of builders, creators and all-around great people Passionate about the latest developments in technology Fast learner and open to constructive criticism Desire to dive in and learn in a fast-paced environment Collaborative team player with the ability to shift gears quickly, efficiently and effectively Dependable and reliable with clear thinking and attention to detail Great sense of humor and outlook on life . . . we laugh a lot! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Information Technology Industries Technology, Information and Internet"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4053566081/",
    "job_id": "4053566081",
    "source": "linkedin",
    "company_name": "Data Crafters",
    "job_title": "Data Engineer/Data Analyst Intern",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Internship",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Data Crafters is a leading business transformation company that is looking for a talented and aspiring Data Engineer/Data Analyst Intern to join our innovative team. Come join us at Datacrafters.io for a life changing opportunity where you will master the art of transferring data into insights as well as telling a compelling story. We seek individuals with a naturally curious mindset, adept critical thinking skills, and a proactive approach to staying ahead of industry shifts before they impact our esteemed clients. If you're eager to contribute to the evolution of next-generation data analytics technologies within a dynamic, high-growth environment, we invite you to apply. Responsibilities Duration: 3 months. Location Dhaka, Bangladesh. Responsibilities ● Understand the concepts of Data Engineering/Data Analytics and how it fits in an organization’s Business Intelligence needs. ● Learn the various tools of the trade in Data Engineering/Data Analytics in a cloud environment and get the idea on the pros and cons of various existing services in the market. ● Collaborate with the Business and Visualization team to understand the client requirements and design tailored solutions based on it. ● Develop and implement data pipelines applying best practices and optimize processes to minimize operational costs. ● Monitor the data pipelines and in case of error, debug the pipeline to find the root cause and fix it in the best way. ● Document technical aspects of undertaken tasks for future reference. What You Will Gain ● Opportunity to work with a talented global team of data professionals and engineers. ● Rigorous training on Data Warehousing & BI technologies to get you ready to take the upcoming challenges. ● Professional growth and the cultivation of essential soft skills for a business environment. ● Networking opportunities with experienced industry professionals to guide your career progression. Required Technical Qualifications ● A computer science degree or equivalent/relevant computer experience, if you can handle the work – we don’t care about the background degree. ● Ability to write code in a programming language, especially Python/Java/Scala. ● Ability to write basic SQL queries to interact with data. Intermediate experience would be a huge plus. ● Have a solid understanding of RDBMS fundamentals. ● Exposure to Version Control System like Git. ● Exposure to: Linux shell scripting, cloud environments (AWS, Azure, GCP), visualization tools like Power BI or Tableau is advantageous. What We Expect Other Than Technical Qualifications ● Accountability - take ownership of the work you do to have it finished on time; we do not want to keep chasing you to get your work done. ● Strong interpersonal and communication skills for effective collaboration with the business team. ● Ability to understand the different business aspects of a project while discussing requirements. ● Exposure to agile development practices. ● Capability to function effectively as part of a collaborative team. ● Enthusiastic problem-solving mindset. ● Adaptability to rapidly changing technological landscapes. Compensation We strive to provide a competitive benefits package that meets the needs of our employees and our business model. Given the significance of English communication skills for success in your global role, our standardized language is English. All external and cross-location communications are conducted in English. Therefore, if needed, you will receive training to enhance your communication skills. How to Apply: The interested candidates are requested to apply through the following link on or before 25 October 2024. Apply online: https://forms.gle/cLLRuozB9sgaQybq8 Show more Show less Seniority level Internship Employment type Full-time Job function Information Technology Industries Information Technology & Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337739709/",
    "job_id": "4337739709",
    "source": "linkedin",
    "company_name": "Information Tech Consultants",
    "job_title": "Big Data Specialist ...",
    "location": "",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Title: Senior Big Data SME (Subject Matter Expert). Location: Onsite (Relocation to UK). Shift : UK Shift timings. Experience: 14-18 years."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4143851460/",
    "job_id": "4143851460",
    "source": "linkedin",
    "company_name": "Rooya",
    "job_title": "DevOps Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "About us: Rooya is an innovative company transforming fleet management and insurance through advanced AI-vision telematics technology. Our platform leverages computer vision to provide optimized decision-making solutions for the insurance and fleet management industries. Job Overview We are looking for a skilled DevOps Engineer to join our team and play a key role in enhancing our software delivery processes, infrastructure automation, and system reliability. The ideal candidate will have a strong background in cloud platforms, CI/CD pipelines, and infrastructure as code, with a passion for automation, security, and performance optimization. Responsibilities: Develop, maintain, and optimize CI/CD pipelines for efficient code deployment. Automate infrastructure provisioning and configuration using Infrastructure as Code (IaC). Monitor system performance, troubleshoot issues, and ensure high availability. Enhance security, compliance, and reliability of cloud-based and on-prem environments. Collaborate with developers to streamline workflows and improve software delivery. Implement logging, monitoring, and alerting solutions for proactive issue resolution. Optimize cloud costs and resource utilization for efficiency. Requirements: Proficiency in cloud platforms (AWS, Azure, or GCP). Hands-on experience with containerization and orchestration (Docker, Kubernetes). Strong knowledge of CI/CD tools (Jenkins, GitHub Actions etc.). Expertise in Infrastructure as Code (Terraform, Ansible etc.). Experience with scripting languages (Python, Bash, etc.). Familiarity with logging, monitoring, and observability tools (Prometheus, Grafana, ELK, etc.). Preferred Qualifications: Experience with microservices and serverless architectures. Knowledge of security frameworks and DevSecOps practices. Familiarity with database management and performance tuning. Salary & Benefits Competitive salary based on experience. Hybrid work opportunities. Professional development and training programs. A collaborative and innovative work environment. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2348405192/",
    "job_id": "2348405192",
    "source": "linkedin",
    "company_name": "Daraz",
    "job_title": "iOS Developer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Description Major Responsibilities: Develop and Maintain iOS apps; Collaborate with team members on the project; Be interested in the latest"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2376332338/",
    "job_id": "2376332338",
    "source": "linkedin",
    "company_name": "Daraz",
    "job_title": "Android Developer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Description Major Responsibilities: Develop and Maintain Android apps Collaborate with team members on the project Be interested in the latest technologies Test Applications for Optimal Performance Responsible for integrating new apps for use on mobile and other devices Need to fix application bugs before final release Maintain the code and atomization of the application Identify potential problems and resolve application bottlenecks Requirements Bachelor's degree in CSE from any reputed University. Language: Kotlin, Java At least 2 years of professional experience in Android development Good problem-solving skills Sound understanding of OOP concepts Natural ability to solve real-life problems & finding efficient solutions Familiar with MVVM architecture, RxJava Worked with ViewModels, DataBinding, Room database & Retrofit Good design-sense & ability to implement them Excellent communication skills & must have profound empathy for the team-mates Knowledge of the following will be considered as an advantage: Consumer Web Development Experience for High-Traffic, Public Facing web applications Experience with cloud technologies also a plus Creating secure RESTful-based web services in XML and JSON, JavaScript, jQuery Continuous integration and version control (Git) Competencies Required Technical, Initiative, Communication, Problem Solving Benefits As per company policy. Application Deadline : 10-Jan-21 About Daraz Daraz is the leading online marketplace in South Asia, empowering tens of thousands of sellers to connect with millions of customers. Daraz provides immediate and easy access to 10 million products in more than 100+ categories and delivers more than 2 million packages every month to all corners of its countries. Daraz is a mall, a marketplace, and a community for its customers. It is also a university for entrepreneurs, and every month it educates more than 5,000 new sellers on e-commerce operations. To overcome the logistics challenge in its markets, Daraz has built its own logistics company specifically designed for e-commerce operations - Daraz Express (known as DEX) - to raise the standards for the industry. Daraz is also helping existing and new logistics providers digitize. In 2018, Daraz was acquired by Alibaba Group, and is proud to carry its part of the mission to 'make it easy to do business anywhere in the era of the digital economy'. As part of the Alibaba ecosystem, Daraz is leveraging Alibaba’s global leadership and experience in technology, online commerce, mobile payments, and logistics to drive growth in its markets. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Advertising Services, IT Services and IT Consulting, and Technology, Information and Internet"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4257362167/",
    "job_id": "4257362167",
    "source": "linkedin",
    "company_name": "Envobyte",
    "job_title": "Android Developer",
    "location": "Khulna ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We are looking for experienced Android Developers to join our mobile development team. The ideal candidate will be responsible for designing, developing,"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3967337717/",
    "job_id": "3967337717",
    "source": "linkedin",
    "company_name": "iTRecruiter",
    "job_title": "Python Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We are actively seeking talented Senior Python developer to join our ambitious team dedicated to pushing the frontiers of AI technology."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4268496475/",
    "job_id": "4268496475",
    "source": "linkedin",
    "company_name": "Highbrow Technology Inc",
    "job_title": "Python Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Contract",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Highbrow Technology Inc Tannu Sharma Tannu Sharma Building HighBrow Technology || Talent Development & Management Expert || Strategic Workforce Planning & Talent Management Professional ||… Experience- 5+ years Required Skills: Strong experience with Python, Proficiency with Git, Docker, and basic software pipeline setup. Ability to understand and navigate complex codebases . Comfortable running, modifying, and testing real-world projects locally. Experience contributing to or evaluating open-source projects is a plus. Nice to Have: Previous participation in LLM research or evaluation projects. Experience building or testing developer tools or automation agents. Show more Show less Seniority level Mid-Senior level Employment type Contract Job function Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3809613230/",
    "job_id": "3809613230",
    "source": "linkedin",
    "company_name": "Suffix IT Limited",
    "job_title": "Java Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Suffix IT Limited Mehenuz Chowdury Mehenuz Chowdury Business Development Executive Suffix IT Ltd. is Hiring! Position: Java Developer Vacancy: 02 Job Responsibilities: 1. Programmer Software Engineer, APIs, Git, Java, Java EE, java spring boot, java spring framework, Tomcat, Microservice. 2. Knowledge about Linux, Basic Networking. 3. Clear knowledge of Problem solving, Data structure, Algorithm. 4. Ability to accomplish the task within the scheduled deadline 5. Eligible to be a good team player, independent, positive attitude, highly motivated & result oriented. Employment Status: Full-time Experience Requirements: At Least 3 years of relevant experience. Job Location: Badda, Dhaka. Salary - Negotiable Compensation & other benefits: ➡️Mobile bill. ➡️Lunch Facilities: Full Subsidize. ➡️Festival Bonus: 2 (Yearly). ➡️Snack and unlimited tea/coffee. ➡️Awesome culture - passionate, driven and fun team. ➡️Wonderful learning environment. ➡️Ability to grow and build a career. ➡️Yearly tour. If you are interested, please send your recent resume to: career@suffixit.com https://www.suffixit.com Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries IT System Custom Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352124800/",
    "job_id": "4352124800",
    "source": "linkedin",
    "company_name": "FUTURISTIC Jobs",
    "job_title": "Java Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Summary: Join our customer's team as an experienced Backend Developer. In this high-impact, remote role, you'll design, implement, and continually improve robust backend APIs while collaborating with cutting-edge AI research. You'll help test and shape the next generation of developer tools alongside a high-caliber engineering group. Key Responsibilities: Design, develop, and optimize REST and GraphQL endpoints for scalable APIs. Drive data validation, error handling, and security best practices within backend services. Plan and execute database migrations, optimizations, and schema changes as needed. Actively test new AI-powered models in Cursor, providing actionable feedback via incident reports, bug traces, and screenshots. Participate in 4-day intensive testing bursts, exploring how AI models impact real coding workflows. Engage thoughtfully with the research team in a dedicated Slack channel to discuss findings and propose improvements. Submit detailed post-burst surveys, delivering insights on model performance and developer experience. Required Skills and Qualifications: 5+ years of professional experience as a backend developer, with strong expertise in Java. Proficient in building and maintaining RESTful and GraphQL APIs. Advanced understanding of backend data validation, error handling, and API security. Hands-on experience with database migrations, performance tuning, and schema design. Extensive use of AI tools for coding; familiarity with Cursor is highly desirable. Outstanding written and verbal communication skills, with a knack for clear incident and bug reporting. Proven ability to thrive in fast-paced, confidential, and collaborative remote environments. Preferred Qualifications: Visible contributions to open source (e.g., GitHub stars or contributions). Experience designing or evaluating experimental tooling and developer workflows. Demonstrated enthusiasm for AI advancements in software development. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Business Consulting and Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4212411428/",
    "job_id": "4212411428",
    "source": "linkedin",
    "company_name": "Wizard Software & Technology Bangladesh Ltd.",
    "job_title": "React Developer Intern",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Internship",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Wizard Software & Technology Bangladesh Ltd. Fahim Shahariar Fahim Shahariar IT Professional || Business Analyst || Digital Marketing Specialist & SEO Expert 🚀 We're Hiring: React Developer Intern Are you passionate about building modern, responsive web applications? Looking to kick-start your career in frontend development with real-world projects? Wizard Software and Technology Ltd. is looking for a React Developer Intern to join our growing team! 🌟 📍 Location: Level-9, 107 F Haque Tower, Bir Uttam C R Datta Road, Dhaka-1205 🕒 Duration: 6 months (with possibility of full-time offer) 🎓 Ideal for: Fresh Graduates What You’ll Do: Work closely with our frontend team to build and enhance user-facing features using React.js Collaborate with backend developers, UI/UX designers, and project managers Write clean, scalable, and reusable code Participate in code reviews and team meetings Gain hands-on experience in real client projects What We’re Looking For: Basic understanding of React.js and modern JavaScript (ES6+) Familiarity with HTML5, CSS3, and REST APIs Eagerness to learn and grow in a fast-paced environment Good problem-solving skills and attention to detail Git knowledge is a plus Why Join Us? ✅ Learn from experienced developers ✅ Work on live projects ✅ Friendly work culture ✅ Certificate and Letter of Recommendation ✅ Opportunity for full-time placement Show more Show less Seniority level Internship Employment type Full-time Job function Engineering and Information Technology Industries IT System Custom Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326545549/",
    "job_id": "4326545549",
    "source": "linkedin",
    "company_name": "Tenbyte",
    "job_title": "Software Engineer (Golang)",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Get notified about new Software Engineer jobs in Dhaka, Bangladesh. Sign in to create job alert. Similar jobs. Software Developer (Dhaka). Software Developer ("
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322543680/",
    "job_id": "4322543680",
    "source": "linkedin",
    "company_name": "PrimeSync",
    "job_title": "Webflow Developer (Night Shift)",
    "location": "...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "... See this and similar jobs on LinkedIn ... Get notified about new Software Engineer jobs in Dhaka, Dhaka, Bangladesh."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3059666646/",
    "job_id": "3059666646",
    "source": "linkedin",
    "company_name": "NEXT Ventures",
    "job_title": "Software Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from NEXT Ventures Tanzim Hasan Fahim Tanzim Hasan Fahim VP | Head of Technology at NEXT Ventures & FundedNext | Driving Innovation in FinTech, AI/ML | PHP, Python, Laravel | Passionate about Startups and… Software Engineer (C++/C#) Recruitment Notice ***Read the whole circular before applying. Company: Next Ventures Location: Green Orlando (7th Floor), Plot# KA 42-4, Pragati Sharani, Dhaka-1229 Position: Software Engineer (C++/C#) Vacancy: 01 Salary Range: 35,000 - 60,000 BDT ​​Determination Factor: Based on Skills (Negotiable) Job Nature: Full Time Office Hours: 9:30 AM – 6 PM (Flexible) Weekend: Sunday Company Overview: NEXT Ventures. is one of the largest digital business groups building Fin-Tech products and solutions for the world from Bangladesh. We build unique products, experiences & services for our clients around the world. Currently, we are serving 20,000+ clients across 100+ different countries globally. Our Mission is to build remarkable experiences and futuristic solutions through world-class expertise that empowers financial market participants globally. We want to achieve our mission by pushing boundaries and setting benchmarks to be the absolute best in creating value for our customers, people & stakeholders. Job Overview: We are looking for a C++/C# developer to manage and scale our current C++/C# based micro-services. You have to be a very quick learner to and need to be a solo performer to perform the task related with this position. Job Responsibilities: -Build new features on our current micro services. Manage, maintain and scale the current code base. -Work with “MT4” platform and its API to build fintech solutions Perform R&D as per business needs. -Identify bottlenecks and bugs, and devise solutions to these problems. Required Qualifications: -Thorough knowledge of the standard library, STL containers, and algorithms. -Strong proficiency in C++/C#, with fair knowledge of the language specification. -Understanding of dynamic polymorphism and C++/C# specific notions, such as friend classes. -Proficient understanding of code versioning tools like git, github etc. -Familiarity with CI/CD & code pipeline. Academic Requirements: B.Sc in CSE, CS, EEE or any equivalent degree. However we might relax this requirement for extra ordinary skilled persons. Experience: Must have (2) years of experience in the relevant field Competencies We Expect: -Good Communication Skill -Familiarity With The Position -Team Player -Having Leadership Skill -Taking Initiatives -Planning & Organizing -Problem Solving Capacity -Willingness To Learn What We Can Offer You: Compensation: –Bi-Annual Salary Increment –Bi-Annual Bonus (After Provision/Eligibility) –2 Times Yearly Festival Bonus Food & Beverage : – Vending Machine (With Delicious Snacks) – Subsidized Lunch – Free Afternoon Snacks – Unlimited Tea & Coffee Entertainment: – Annual Retreats – Honeymoon Package For Newly Weds – Birthday Leave – Celebration of Events & Occasions – Relax & Sports Zone – Game Night – Games We Play: Indoor Games: Billiard, Foosball, Play Station, etc. Outdoor Games: Football, Cricket, Badminton etc. Learning Opportunities: -Quarterly Reviews & Feedback -Training & Development By Organization Assigned Consultants -An Environment That Fosters Accelerated Growth & Training Employee Centric Policies: -Leave Policy -Performance Management System -Car Scheme -Work-Life Benefits Apply now- https://forms.clickup.com/3480971/f/3a7cb-18583/MC85DOFEFNHR75CQBM Deadline: 20th May 2022 All the very best everyone. Looking to catch up with some awesome personalities as always. Take care! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Consumer Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3938089768/",
    "job_id": "3938089768",
    "source": "linkedin",
    "company_name": "STEERWEB",
    "job_title": "Web Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Contract",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from STEERWEB Farhan E. Farhan E. Management Consultant Company Description STEERWEB is a known player in the field of website applications for 15 years. We provide services such as domain registration, web hosting, and web design. Our goal is to assist organizations in enhancing their technological operations in a cost-effective manner. We have presence in Bangladesh and Australia. Role Description This is a remote project based role for a Web Developer. The Web Developer will be responsible for website development using different programming and CMS frameworks. The incumbent will be assigned tasks on a project basis with pre-agreed fee structure. This is not a salaried job. Qualifications Minimum two years experience on WordPress Proficiency in HTML, CSS, reactJs, CustomPhP, and other relevant programming languages. Knowledge on laravel is an advantage Ability to work independently and meet project deadlines Experience with responsive and mobile web design is a plus Bachelor's degree in Computer Science, Web Development, or a related field Show more Show less Seniority level Not Applicable Employment type Contract Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3424743230/",
    "job_id": "3424743230",
    "source": "linkedin",
    "company_name": "WP SEO Geeks",
    "job_title": "Web Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from WP SEO Geeks SM Faysal SM Faysal Learning SEO Since 2021,Helped 50+ Small Business, Agencies & SaaS #hiring #webdeveloper Apply: https://forms.gle/m4pCiffVQwFHvyJFA Title: WordPress Web Developer (Remote) Location: Remote (Work from home) Duration: Part-time (2 hours/day avg) We are seeking a highly skilled WordPress Web Developer to join our team on a part-time basis. The successful candidate will work remotely and will be responsible for designing and developing custom websites using WordPress and various web builders such as Oxygen and Elementor. The ideal candidate should have experience with multi-lingual web design, working with APIs, and a strong understanding of HTML, CSS, JavaScript, JSON, and Python. They should also have a keen eye for UI/UX and be detail-oriented. Responsibilities: * Design and develop custom WordPress websites * Utilize web builders such as Oxygen (mostly) and Elementor * Maintenance of existing websites, including article uploading * Work with APIs and integrate external data sources * Ensure websites are visually appealing and user-friendly * Test and debug website functionality * Meet project deadlines Requirements: * 2+ years experience with WordPress and web builders such as Oxygen (mostly used) and Elementor * Proficiency in HTML, CSS (advanced), JavaScript, JSON, and Python * Experience with multi-lingual web design and working with APIs (specially restAPI) * Strong attention to detail and ability to deliver high-quality work * Should not be plugin dependant for implementing simple tasks * Strong knowledge of cPanel and any SSH client like FileZilla * Write clean and organized code that can be shared, leveraged, and collaborated on with other team members Salary: Feel free to set yourself. We’ll judge based on your skills and experience Onboarding process: If you’re shortlisted, you’ll be given a paid task to redesign some of our existing pages from different websites. Based on your performance, you’ll be qualified for the position. If you are a talented WordPress Web Developer with a passion for creating custom websites, we encourage you to apply for this exciting opportunity. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Advertising Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3783324404/",
    "job_id": "3783324404",
    "source": "linkedin",
    "company_name": "Space Cats",
    "job_title": "Wordpress Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Space Cats rahber isafi rahber isafi HR Manager At Spacecats LLC Company Description Space Cats is an IT firm that specializes in crafting exceptional MVPs and delivering production-grade software tailored to our client's unique needs. We are dedicated to pushing boundaries and exceeding expectations. Our team of tech enthusiasts embraces innovation and leverages technology to shape the future. Role Description This is a full-time remote role for a WordPress Developer. The Wordpress Developer will be responsible for designing, developing, and maintaining Wordpress websites. The day-to-day tasks include utilizing back-end web development and front-end development skills to create responsive web designs. Attention to detail and creating visually appealing sites are essential. Qualifications Back-End Web Development and Web Development skills Strong Experience in DIVI. Front-end development, Responsive Web Design, and Web Design skills Proficiency in WordPress, HTML5, CSS3, JavaScript, and PHP Familiarity with MySQL databases and cPanel Demonstrated ability to collaborate effectively with cross-functional teams Strong problem-solving and analytical skills Bachelor's degree in Computer Science, Information Technology, or a related field is preferred The ability to work independently and prioritize tasks is also essential. Experience with implementing and testing website optimization is a plus.' Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/1561888831/",
    "job_id": "1561888831",
    "source": "linkedin",
    "company_name": "Shuttle",
    "job_title": "Javascript Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Shuttle Shah Sufian Shah Sufian Principal Product Manager @Shikho | Co-founder @Shuttle | Ex CTPO(Chief Technology & Product Officer) @Shuttle | Product - research design build |… We are looking for Rockstar Problem Solver in Node.js Position: Node.js Developer Salary: 40K – 70K Office Hours: 10am-7pm(Sunday-Thursday) Do you want to use your coding skills to improve the lives of millions of people? Are you obsessive about your own professional development and continuous learning-through-doing ? Would you like to be part of a great team who are creating the next generation digital transportation system? And do you think that you are hardworking enough and have the ownership to take challenges? Then read on! Shuttle is a mass-transit startup that provides safe transportation at an affordable price by moving more people with fewer vehicles and caters to both B2B and B2C customers. Our goal is to redefine public transport for mass people in developing countries by making safe and comfortable transportation affordable and accessible for mass people. Website: www.shuttlebd.com https://www.facebook.com/Shuttlebd https://www.facebook.com/Shuttleforbusiness/ Job Context We are looking for developers with 2+ years of professional job experience. Developers from ride sharing, food delivery or renown startups are encouraged to apply. Please do not apply if you are not eligible with the criterias. Requirements: Minimum of 2+ years of verifiable paid job experience of commercial product(ERP, Delivery system, large E-commerce etc) with JavaScript framework (ExpressJS, NestJS etc.). 1+ year commercial proficiency with client-side JavaScript frameworks (VueJS/React/Angular). Proficient in Database technologies like MySQL and MongoDB. Good understanding of object-oriented programming, asynchronous request handling, partial page updates, and AJAX and SPA. Experience on web service integration (SOAP, REST, JSON, XML). Practical experience with REST API development. Experience with git (Gitlab/Bitbucket). Experience with Asana/Slack/ Jira. Experience with cloud services like AWS or GCP. Additional Requirements: Must be looking for a long term position with a personal and professional growth mindset. Ability to manage multiple projects simultaneously and thrive in a fast-paced, deadline driven environment. Proactive and self-motivated. Ability to quickly learn new programming skills when required. Ability to act independently with very little supervision and great work ethic. Ability to handle sensitive information with the highest degree of integrity and confidentiality. Educational Qualification: B.Sc in CSE/Engineering or relevant field. Salary: 40,000 – 70,000 (Based on Capacity and Experience). Drop your CV at career@shuttlebd.com Subject: Nodejs Developer + (no of years Experience) + (Current Company) For further queries: Mobile: 01987700559 Office: 10th floor, 15/1,15/2,15/3,15/4, Bir Uttam Rafiqul Islam Avenue Pragati Sarani, Dhaka 1212. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting and Truck Transportation"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2468026060/",
    "job_id": "2468026060",
    "source": "linkedin",
    "company_name": "ShopUp",
    "job_title": "Frontend Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Roles/Responsibilities Own the coding/design of a UI sub-module Review the requirements and provide simple, workable solutions Design and document the sub-module working with the tech-lead Implement the critical parts of the module Ensure coding standards, proper design patterns, writing test cases and project mgmt processes are followed Mentor the junior programmers Peer and junior programmers code review Work independently and proactively to deliver production-ready code with minimal guidance Jobs Skills required Strong experience in developing frontend systems Frontend Exp: React, React native, Expo, Flutter, Android, iOS Ability to work in a team structure and deliver projects on time Very strong analytical and problem solving skills in super changing environment Understanding of algorithms and data structures Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327989486/",
    "job_id": "4327989486",
    "source": "linkedin",
    "company_name": "Web Rocket Pro",
    "job_title": "Webflow Developer",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Webflow Developer · Seniority level. Entry level · Employment type. Part-time · Job function. Engineering and Information Technology · Industries."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324490586/",
    "job_id": "4324490586",
    "source": "linkedin",
    "company_name": "Web Rocket Pro",
    "job_title": "Webflow Developer",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Webflow Developer. (Part-Time, Remote, Hourly Paid Contractor). Join Web Rocket Pro, a creative digital agency, as a remote Webflow Developer and help build"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345887351/",
    "job_id": "4345887351",
    "source": "linkedin",
    "company_name": "Hire Overseas",
    "job_title": "Web Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We're looking for a Web Developer who specializes in ecommerce builds, CMS platforms, and precise tracking implementation."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3060803411/",
    "job_id": "3060803411",
    "source": "linkedin",
    "company_name": "P. Cube Digital LLC",
    "job_title": "Full-stack Developer",
    "location": "Khulna, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from P. Cube Digital LLC Paul S. Baroi Paul S. Baroi Thought Leader |  Chief Executive Officer (CEO) & Chief Marketing Officer (CMO) | Growth Hacker |  Digital Transformations | Serial Entrepreneur | P… Job Context We are looking for a Full Stack Developer & a Software Engineer to develop scalable software solutions. You’ll be part of a cross-functional team that’s core responsible for the full software development life cycle, from conception to deployment of a RMG ERP product. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. Job Nature: Permanent Job Responsibilities Developing enterprise web applications using C#, ASP.Net Core & MVC 5, Angular JS2 as well as writing complex SQL procedures in database environment; Troubleshoot, debug and upgrade existing RMG ERP software as per user feedback and management requirement; Perform as a team member in an Agile team focused on software development and support; Create automated tests (unit tests and functional tests) to verify that the code works properly R&D and innovation with new tools and technologies. Other duties and responsibilities as assigned by the management to achieve organisational goal Employment Status Full-time Workplace Work at office Educational Requirements B.Sc. (Hons) in CSE / Software Engineering /EEE/ IPE / Mathematics or relevant subject from any reputed University Skills Required: 1. Ability to solve problem 2.Quick learner 3. Work under pressure, End User Support, Hardworking and Passionate. Punctual, Proactive and Positive attitude, Smart and Dedicated, Strong attention to detail Experience Requirements 3 to 5 year(s) The applicants should have experience in the following area(s): AngularJS, ASP.NET Core, ASP.NET Core MVC, ASP.NET WebAPI, HTML5 & CSS3, Javascript JQuery scripting, Node.js, Oracle PLSQL, PostgreSQL, ReactJS The applicants should have experience in the following business area(s): Software Company, Govt./ Semi Govt./ Autonomous body, Consulting Firms, Multinational Companies Freshers are also encouraged to apply. Additional Requirements Age 22 to 40 years Knowledge in Microservice Architecture will be added as an advantage; Knowledge of agile software development practices including test-driven development; Should have knowledge in Object Oriented Programming and Cloud Application Architecture (AWS/Azure/Oracle); Knowledge of Web Services like REST/JSON/XML APIs; Sound knowledge in Crystal and RDLC Reporting; A track record of writing clean, high-quality, high-performing, scalable code; An understanding of CI/CD, Git, and DevOps tooling will be a plus; Knowledge in Mobile Apps Development will add value; Working with Software development in RMG/Textile sector will get preference; Must be able to handle complex problems independently, and evaluate alternative approaches to problem-solving; Must have mentality to drive independently without minimum supervision; Must be capable to work with a team under high pressure and meet the deadline; Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/100/",
    "job_id": "100",
    "source": "linkedin",
    "company_name": "Supercoder",
    "job_title": "Frontend Developer - 100% Remote",
    "location": "...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Frontend Developer - 100% Remote · Seniority level. Mid-Senior level · Employment type. Full-time · Job function. Engineering and Information Technology"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3468014677/",
    "job_id": "3468014677",
    "source": "linkedin",
    "company_name": "ExpansionJS",
    "job_title": "Full Stack Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from ExpansionJS Faizan Siddiqui Faizan Siddiqui Human Resources Manager @ ExpansionJS, @Subcontractorhub We are looking for talented engineers who can handle backend and frontend development, who love to experiment with new and evolving technologies having a keen interest in building web and mobile apps, which not only are creative on the outside but also implements world-class engineering inside. Responsibilities: Build APIs and modern back-end systems to enhance end-user experience. Design and implement components and features of the Mobile App using Angular Framework. Build software solutions according to the best practices. Write clean code. Find the right tools/frameworks/practices to achieve the goal. Have an open-minded engineer approach, do not be afraid of new challenges and technologies. Learn new things constantly. Be a team player on a project and company level. Care about team members, provide reasonable feedback and share knowledge. Be proactive, bring fresh ideas, suggest improvements. Skills & Qualifications: NodeJS, Angular 3-6 year. Strong knowledge of JavaScript (ES6). Understanding how to build applications from an architecture standpoint. Good knowledge of OOP and software design principles. Be open-minded to switch between technologies. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4283600360/",
    "job_id": "4283600360",
    "source": "linkedin",
    "company_name": "BruntWork",
    "job_title": "Full Stack Developer (Next.js + Node.js)",
    "location": "South Asia",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Associate",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Highlights: Contract: Independent Contractor Schedule: Mon-Fri 8am-5pm or 9am - 6pm CST (includes 1hr unpaid break), 40 hours a week Job Summary: We are looking for a highly skilled and detail-oriented Full Stack Developer to join our growing team. This role will focus on building and maintaining scalable, responsive, and secure web applications using modern technologies such as Next.js , React , Node.js , and MongoDB . You’ll also work closely with marketing and operations to implement robust integrations, analytics, and performance optimizations. Key Responsibilities: Develop modern web applications using Next.js (13+ App Router) and React Build reusable and responsive UI components with shadcn/ui and Tailwind CSS Implement server-side functionality with Node.js and Express.js Manage databases and design schemas using MongoDB Develop and consume RESTful APIs (GraphQL is a plus) Implement tracking and analytics: GTM , GA4 , Facebook CAPI Integrate third-party systems: QuickBooks , Wisetack , PayPal , Jobber API Set up and manage email workflows using Google Workspace , SMTP Implement user authentication with NextAuth or similar solutions Ensure strong security practices (OAuth, JWT, CSRF protection, validation) Version control and collaboration via Git , GitHub/GitLab Deploy applications on platforms like Vercel Support CI/CD pipelines, testing, and monitoring systems Collaborate with UI/UX designers and marketers to deliver polished user experiences Optimize code and UI for SEO and performance Requirements: Frontend Development: Proficiency in Next.js 13+ (App Router architecture) Strong React.js skills and component-based development UI component development with shadcn/ui Deep knowledge of HTML5 , CSS3 , Tailwind CSS Familiarity with frontend tooling: Webpack , Vite , Babel Backend Development: Expertise in Node.js and Express.js Strong understanding of MongoDB (schema design, indexing, aggregation) REST API development (GraphQL is a plus) Integrations & Tools: Experience with QuickBooks , Wisetack , PayPal Familiarity with Jobber API and CRM workflows Email systems: SMTP , Google Workspace Tracking & Analytics: Proficient in Google Tag Manager (GTM) , GA4 Experience with Facebook Conversions API (CAPI) Understanding of UTM tracking and lead attribution Authentication & Security: Experience using NextAuth or similar Knowledge of web security standards (JWT, OAuth, CSRF, input validation) Version Control & DevOps: Strong experience with Git , pull requests, and code reviews Deployment via Vercel or similar Understanding of CI/CD pipelines , automated testing, and monitoring SEO & Optimization: Technical SEO knowledge: structured data, sitemaps, schema markup Familiarity with on-page SEO and website performance tuning UI/UX & Design Tools: Ability to translate wireframes into functional UI Experience with Figma or similar design tools Preferred Qualifications: Experience working on service-based or franchise websites Understanding of lead tracking, analytics setup, and marketing automation Familiarity with HubSpot , Mailchimp , Klaviyo Background or interest in the construction or home services industry Soft Skills: Strong verbal and written English communication Excellent problem-solving and debugging abilities Attention to detail and clean coding standards Ability to work independently and prioritize tasks effectively Collaborative attitude, comfortable working cross-functionally with tech, marketing, and ops teams Familiarity with Agile or Kanban methodologies Independent Contractor Perks HMO Coverage for eligible locations Permanent work from home Immediate hiring Steady freelance job Please note that since this is a permanent work-from-home position and an “Independent Contractor” arrangement, the candidates must have their own computer and internet connection. They will handle their own benefits and taxes. The professional fees are on hourly rates and the rate depends on your performance in the application process. ZR_25617_JOB Show more Show less Seniority level Associate Employment type Full-time Job function Engineering, Information Technology, and Business Development Industries Technology, Information and Media, Marketing Services, and Business Consulting and Services"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4061607713/",
    "job_id": "4061607713",
    "source": "linkedin",
    "company_name": "DT Technologies",
    "job_title": "Full Stack Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from DT Technologies Mahamudur B. Mahamudur B. CTO | Full-Stack Engineer | MERN, Python & PHP/Laravel | AWS | Docker | Redis | RDBMS & NoSQL | Cloud, DevOps & RPA Automation, Software Architecture Job description PLEASE ADVISE: We are hiring a Senior Full Stack Developer specializing in Next.js and Nest.js . All of our work is done using Next.js , Nest.js , and Tailwind . If you do not have strong skills in these technologies, DO NOT APPLY . You will only waste your time, as you will not pass the technical interview. Minimum Skills Required Next.JS Minimum 4 Years Nest.JS Minimum 4 Years MongoDB Minimum 2 Year TailwindCSS Minimum 2 Year If you do not have the minimum skills required above do not apply for the job. As you will not pass technical interview . Three Part Interview Process: Initial Interview Technical Interview Final Interview Role Description This is a full-time remote position for a full-stack software engineer with expertise in JS. As a senior software engineer, your primary responsibilities will be to develop and maintain both front-end and back-end web applications. In your day-to-day work, you will design user interactions on websites, develop servers and databases for website functionality, and ensure cross-platform optimization. You will work closely with the development team to ensure that front-end and back-end elements are seamlessly integrated. At times, you may need to develop these elements yourself, so please keep in mind that you will be responsible for both front-end design and development and back-end development. Qualifications Strong knowledge and experience in JavaScript and related frameworks (Next.js, Nest.js) Proficiency in HTML, CSS, and responsive design Ability to develop frontends (nextJs) from Figma design Tailwind CSS Experience with front-end and back-end development and implementation Knowledge of code versioning tools (Git) Experience with database systems (MySQL, MongoDB) Knowledge of software development principles and best practices Strong problem-solving and analytical skills Excellent communication and teamwork skills Mandatory English communication skill Job Type: Full Remote Minimum Experience Required: 5 Years+ (More years of experience will be plus and prioritized) Please apply if you're able to join right away. Job Type: Full-time Pay: 80,000BDT - 140,000BDT per month Benefits: Paid sick time Paid time off Schedule: Day shift Sunday to Thursday Supplemental Pay: Commission pay Overtime pay Performance bonus Quarterly bonus Yearly bonus Application Question(s): Must provide LinkedIn profile here. - If you do not provide your application will be denied. Education: Bachelor's (Preferred) Experience: MongoDB: 1 year (Required) total work: 5+ years (Required) JavaScript: 4 years (Required) Next.JS: 4 years (Required) Nest.JS: 4 years (Required) Language: English (Required) Work Location: Remote Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4307331393/",
    "job_id": "4307331393",
    "source": "linkedin",
    "company_name": "RP International",
    "job_title": "Full Stack Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We are looking for a seasoned Full Stack Developer to strengthen our client's engineering team. This role involves designing and scaling enterprise-grade"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/1394696/",
    "job_id": "1394696",
    "source": "linkedin",
    "company_name": "Andas Oy",
    "job_title": "Kehittämiskonsultti",
    "location": "Finland",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Kehittämiskonsultti Vectia Learning Systems etsii  kokenutta henkilöä kehittämiskonsultiksi työskentelemään erilaisissa asiakasprojekteissamme, jotka vaihtelevat lyhyistä toistuvista valmennuksista pitkäkestoisiin kehittämisohjelmiin. Uudelta kehittämiskonsultiltamme odotamme osaamista edellä mainituista teemoista  sekä kokemusta vaativista asiakasprojekteista. Lisäksi arvostamme aiempaa kokemusta asiantuntijaorganisaatiossa työskentelystä sekä asiantuntijapalvelujen myymisestä. Kehittämiskonsultin työ edellyttää englannin kielellä työskentelyä. Olet joustava ja itsenäinen, mutta sinulla on myös kykyä ja halua toimia tiimin jäsenenä. Arvostamme analyyttistä ajattelua mutta myös ennakkoluulotonta tarttumista uusiin ideoihin. Tarjoamme työpaikan konsultoinnin ja kehittämisen eturivistä – asiakkainamme ovat alansa johtavat  yritykset. Vectia Learning Systemsillä olet osa dynaamista ja yrittäjähenkistä, mutta ihmisläheistä tiimiä joka on aidosti kiinnostunut asiakkaittensa haasteiden selvittämisestä. Osaavan tiimimme jäsenenä sinulla on myös mahdollisuus kehittää oma osaamistasi. Lähetä hakemuksesi Vectian verkkosivujen kautta 4.3.2011 mennessä. Lisätietoja antaa partner Eija Ylisuvanto (+358 (0)10 830 5436, eija.ylisuvanto@vectia.com). Show more Show less Seniority level Not Applicable Employment type Full-time Job function Business Development, Training, Consulting, Management, and Human Resources Industries Professional Training and Coaching, Human Resources Services, Business Consulting and Services, E-Learning Providers, and Education Administration Programs"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4309600515/",
    "job_id": "4309600515",
    "source": "linkedin",
    "company_name": "Hogarth Dhaka",
    "job_title": "Data Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Hogarth is the Global Content Experience Company. Part of WPP, Hogarth partners with one in every two of the world’s top 100 brands including Coca-Cola, Ford, Rolex, Nestlé, Mondelez and Dyson. With a breadth of experience across an extensive range of sectors, Hogarth offers the unrivaled ability to deliver relevant, engaging, and measurable content across all channels and media - both established and emerging. Our global team of over 6,000 craft and technology experts brings together creative, production and innovation to help clients navigate this exciting and ever-changing world of today’s content experience. The Data Engineer is responsible for the successful delivery of business intelligence information to the entire organization and is experienced in BI development and implementations, and data warehousing. WHAT YOU’LL DO: Creating data models, performing ETLs and validating results with business representatives Manage data for BI solutions and automate data collection and management. Builds SQL ETL routines to move, cleanse and prepare data for reporting Create and manage Data pipeline in Azure and GCP environment. Setup data warehouse in Azure or Google cloud Design and develop databases and perform data extraction Analyze existing SQL queries for performance improvements. Develop, implement and optimize stored procedures and functions using SQL Review and interpret ongoing business report requirements Assemble reporting insights and develop executive summaries and trend reports Spot trends and data anomalies Provide insights and suggested ways to improve performance Develop forecasts and suggest testing strategies. Develop and prepare a schedule for a new data warehouse Analyze large databases and recommend appropriate optimization for the same Administer all requirements and design various functional specifications for data Evaluate all codes and ensure the quality of all project deliverables Monitor data warehouse work and provide subject matter expertise Work across various international clients, from different countries, industries, and participate in the entire BI lifecycle, focusing on reporting, data migration and dashboards. Work cross functionally across the project in an Agile methodology to complete user stories within the assigned sprint. WHAT YOU’LL NEED: Technical skills 2+ years of experience with SQL and can write complex queries 1+ years of experience in Azure / GCP or anyother cloud data Technology. Expert knowledge of Relational Database and SQL Language (Data Warehouse modelling) Expert knowledge of Extraction, Transformation and Loading Good knowledge of Dimensional Modelling and development with BI tools Writing stored procedures/function/triggers and optimizing database queries Intermediate or better proficiency in Power Query Experience with any of the various computer languages, programs, and scripting languages such as Python, R, Bash etc would be a plus. Experience working with any database systems such as SQL Server, PostgreSQL, any cloud database etc. Soft skills required for all positions: A master at transferring data into insights as well as telling a compelling story A curious mindset with critical thinking, keep yourself on top of industry changes before they impact our clients Great presentation and delivery of insights through client-servicing, excellent verbal and written communication A self-starter, proactive, who identifies milestones and potential blockers and is able to solve them with minimum supervision Be a data ambassador, foster knowledge sharing across team members regionally as well as locally for more junior / interns A self-starter, proactive, who identifies milestones and potential blockers and is able to solve them with minimum supervision Hogarth Values Heart and Soul: We love what we do. We bring energy and enthusiasm to all our work. We push boundaries, we are never satisfied and always want to find a better way. Hands on: We don’t wait for things to happen; we get on with it. We are pragmatic and don’t have an ego. We do what it takes to get the job done to the highest standards. Honest: We are straightforward; we speak openly and clearly. We operate with integrity and live up to our promises. Happy family: We enjoy working together. We look out for our colleagues. We are an eclectic bunch. We want to work with people from many cultures and demand great things of each other. Even when things get tough, we don’t lose perspective or our sense of humor. Hungry: We are an inquisitive community. We want to create an environment which inspires ourselves and others to be better. It is important to continuously challenge ourselves and our ways of working. We aim to provide staff with the opportunities to develop and learn. Find out more at www.hogarth.com/culture Diversity & Inclusion Hogarth is an equal-opportunity employer. That means we believe in creating a truly inclusive culture that values diversity, equity and inclusion for everyone through o"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4126837815/",
    "job_id": "4126837815",
    "source": "linkedin",
    "company_name": "Walton Hi-Tech Industries PLC.",
    "job_title": "Data Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Walton Hi-Tech Industries PLC. Sazzad Hossen Sazzad Hossen Senior Deputy Assistant Director - Data Engineer at Walton Hi-Tech Industries PLC. Company Description Walton Hi-Tech Industries PLC is the largest multinational brand in electrical, electronics, technology, and Home & Kitchen appliances. Based in Dhaka, Bangladesh, Walton offers a range of job opportunities and a vibrant company culture for potential applicants. Role Description This is a full-time on-site role for a Data Engineer at Walton Hi-Tech Industries PLC in Dhaka, Bangladesh. The Data Engineer will be responsible for tasks related to data engineering, data modeling, ETL processes, data warehousing, and data analytics on a day-to-day basis. Qualifications Data Engineering and Data Modeling skills ETL (Extract Transform Load) processes expertise Data Warehousing and Data Analytics skills Strong analytical and problem-solving abilities Proficiency in relevant programming languages like Python, SQL, etc. Experience with Big Data technologies like Hadoop, Spark, etc. Bachelor's or Master's degree in Computer Science or related field How to Apply: 1. Apply through BDJobs: https://jobs.bdjobs.com/jobdetails.asp?id=1327579&ln=1&JobKeyword=walton%20hi%20tech%20industries 2. Send your CV directly to sazzad01794@gmail.com Important: The CV file name should follow this format: Data_Engineer_.csv Join us and be part of a dynamic and innovative department! Show more Show less Seniority level Entry level Employment type Full-time Job function Information Technology Industries Appliances, Electrical, and Electronics Manufacturing"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3063316738/",
    "job_id": "3063316738",
    "source": "linkedin",
    "company_name": "Upwork",
    "job_title": "Contract: Senior Data Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Work/Project Scope. Perform SaaS vendor evaluation and design scalable and manageable integration; Develop a deep understanding of data sources, granularity"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342722355/",
    "job_id": "4342722355",
    "source": "linkedin",
    "company_name": "atB Jobs Bangladesh",
    "job_title": "DevOps Engineer (Azure & AWS)",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Executive",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Title: DevOps Engineer (Azure & AWS) Company: Pipeline Co., Ltd. Work Model: Hybrid/Remote Location: House: 282/A, Road: 19/C, Mohakhali DOHS, Dhaka, Bangladesh Salary: 50,000 BDT per month (based on experience) Experience: 2 – 4 Years Employment Type: Full-time Education: Bachelor’s Degree Company Overview: Pipeline Co., Ltd. is a Tokyo-based cybersecurity company with offices in Singapore and Dhaka. We build and operate security intelligence platforms such as RiskSensor and ThreatIDR, providing advanced monitoring, threat detection, and automation solutions to customers across Asia-Pacific. Role Description: We are seeking a hands-on DevOps Engineer to manage and support our entire production environment across Azure and AWS. The ideal candidate will take ownership of cloud operations, automate deployments, and ensure system uptime and reliability — including after-hours incident response when required. Key Responsibilities: Maintain and monitor production systems on Azure and AWS. Implement and manage CI/CD pipelines (GitHub Actions, CodePipeline, etc.). Automate infrastructure using Terraform, Ansible, or similar tools. Configure and optimize cloud resources for performance and cost efficiency. Troubleshoot production issues, ensure system uptime, and respond to alerts. Manage backups, scaling, and patching of production environments. Improve observability using CloudWatch, Prometheus, Grafana, etc. Collaborate with developers and security teams to deploy new services. Professional Skills: Communication skills AWS Azure Cloud networking and file sharing Problem-solving Linux Qualifications: Bachelor’s Degree 2–4 years of experience in DevOps or Cloud Engineering Strong knowledge of AWS and Azure infrastructure management Experience with CI/CD, Docker, and Linux server administration Familiarity with security best practices and access control management Strong problem-solving skills and ability to work under pressure Availability for after-hours or weekend support in critical cases Preferred Skills: Experience with Kubernetes, ECS, or container orchestration Scripting in Python, Bash, or PowerShell Familiarity with incident response workflows and system hardening Other Facilities: Salary: 50,000 BDT per month (based on experience) Benefits as per company policy Show more Show less Seniority level Executive Employment type Full-time Job function Engineering, Information Technology, and Design Industries Software Development, IT System Custom Software Development, and Technology, Information and Media"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4304889020/",
    "job_id": "4304889020",
    "source": "linkedin",
    "company_name": "Nymph Solutions Ltd.",
    "job_title": "DevOps Engineer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "🚀 Hiring: DevOps Engineer (3+ Years) 📍 Location: Dhaka 🏢 Company: Nymph Solutions 📌 Vacancy: 01 We are looking for a highly skilled DevOps Engineer to join our team and help bridge the gap between software development and IT operations. You will be responsible for deploying, automating, maintaining, and managing production systems to ensure high availability, performance, and scalability. 🔧 Responsibilities: Manage and scale infrastructure on AWS/Azure/GCP Orchestrate Kubernetes clusters and Dockerized microservices Maintain and optimize SQL/NoSQL databases (RDS, MongoDB) Implement CI/CD pipelines , monitoring, and alerting systems Ensure infrastructure security, compliance , and high availability Use Infrastructure-as-Code (IaC) tools like Terraform or CloudFormation Ensure infrastructure compliance with industry standards and regulations (ISO, SOC, GDPR, etc.) – nice to have ✅ Requirements: Minimum 3 years of experience in DevOps or related roles Hands-on experience with AWS , Kubernetes , Docker Experience managing relational and NoSQL databases in AWS RDS and self-managed environments (PostgreSQL, MySQL, MongoDB, DynamoDB) Strong knowledge of microservice architecture Proficient in monitoring, alerting, and logging tools (Prometheus, Grafana, ELK Stack, etc.) Solid understanding of security principles (network security, secrets management, IAM, firewalls) Strong scripting and automation skills (Bash, Python, or similar) Experience with CI/CD pipelines using tools like GitLab CI, Jenkins, GitHub Actions Excellent verbal and written English communication skills Nice to Have: AWS certifications Experience with compliance standards (ISO 27001, SOC 2, GDPR, etc.) 🎁 What We Offer: 💰 Competitive salary and benefits 🚀 Career growth, team tours, timely salary 🏥 Health insurance, festival bonuses, leave encashment 🍱 Subsidized lunch, unlimited tea/coffee 🧑‍💻 Friendly, collaborative team 📧 Apply Now: Link -  https://forms.gle/fgEfdLsBi6mK4VZZA or email: hr@nymphsolutions.com Subject: DevOps Engineer – [Years of Experience] 📞 Contact Us: 📱 +8801777223622, +8801618938828 📍 H 470, Road 31, Mohakhali DOHS, Dhaka 🌐 nymphsolutions.com Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4119256162/",
    "job_id": "4119256162",
    "source": "linkedin",
    "company_name": "Flagship",
    "job_title": "DevOps Engineer",
    "location": "Gulshan, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Flagship is looking for a world class DevOps engineer to join our growing team. If you are passionate about building and managing software that has an impact on the lives of millions of users, this is for you. Key Responsibilities: Lead the design, implementation, and management of AWS cloud infrastructure Manage Kubernetes clusters (EKS) for container orchestration Oversee the setup and maintenance of DocumentDB, ElastiCache, and other AWS-managed services Manage CI/CD pipelines to streamline deployment processes Implement monitoring and alerting solutions using tools like Grafana, Prometheus, and CloudWatch Manage and optimize load balancing strategies across EC2 and Kubernetes environments Automate infrastructure provisioning and configuration using tools like Terraform or Ansible Ensure security best practices are followed across all systems and deployments Collaborate with development teams to streamline workflows and improve system reliability Troubleshoot and resolve infrastructure and deployment issues in a timely manner Preferred Qualifications: Proven experience as a DevOps Lead or Senior DevOps Engineer Proven experience managing large scale applications Familiarity with micro services and serverless architectures Experience with GitOps workflows Excellent problem-solving skills and a proactive attitude Strong communication skills with the ability to lead and mentor the team We are looking to fill this position immediately. Qualified candidates will be fast tracked through the interview process. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4222032307/",
    "job_id": "4222032307",
    "source": "linkedin",
    "company_name": "Kolpolok Limited",
    "job_title": "DevOps Engineer (Kubernetes Infrastructure)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Kolpolok Limited MD. IQBAL HOSSAIN MD. IQBAL HOSSAIN Sr. Technical HR Professional | Talent Acquisition | Employee Engagement | HRIS | Compensation & Benefit | Performance Management | Odoo ERP |… Overview : We are seeking a skilled Kubernetes Infrastructure Engineer to play a key role in a project to re-architect, modernize, and enhance its existing data center Kubernetes infrastructure. The primary goal is to establish a highly available, scalable, secure, observable, and resilient container orchestration platform based on modern open-source technologies and industry best practices. The Engineer will be responsible for the design, implementation, configuration, and support of the modernized Kubernetes environment, including robust Disaster Recovery (DR) capabilities. Responsibilities : • Design, deploy, and manage highly available Kubernetes clusters in both primary and DR sites. • Standardize the infrastructure on Oracle Linux 8 or 9. • Implement and configure container runtime (containerd or CRI-O) and image registry (Harbor) with DR replication. • Deploy and manage networking components, including CNI (Calico or Cilium) and Istio service mesh. • Set up comprehensive monitoring, logging, and tracing solutions (Zabbix, Prometheus, Alertmanager, Fluent Bit/OpenSearch/Dashboards, Jaeger/Tempo). • Implement security best practices, including RBAC, network policies, policy enforcement (Kyverno/OPA Gatekeeper), secrets management (HashiCorp Vault), and runtime security (Falco). • Configure and manage storage solutions with CSI. • Establish backup and recovery procedures using Velero and implement GitOps for application deployment and configuration management (Argo CD/Flux CD). • Implement resilience testing using chaos engineering tools (LitmusChaos/Chaos Mesh) and resource optimization (Kubecost/Goldilocks). • Develop and maintain detailed documentation, including architecture design, configuration guides, and operational runbooks. • Conduct knowledge transfer sessions with other team members. Qualifications : • Proven experience in designing, deploying, and managing complex, HA Kubernetes clusters in enterprise environments, preferably using kubeadm. • Strong expertise with the specified technology stack: Oracle Linux, Istio, Harbor, Zabbix, Prometheus, Vault, Calico/Cilium, Velero, Argo CD/Flux CD, EFK/OpenSearch, Jaeger/Tempo, Kyverno/OPA, Falco. • In-depth knowledge of Kubernetes security best practices, hardening, and policy enforcement. • Experience in implementing Kubernetes DR solutions. • Excellent troubleshooting and problem-solving skills. • Strong communication and collaboration skills. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329368260/",
    "job_id": "4329368260",
    "source": "linkedin",
    "company_name": "Highbrow Technology Inc",
    "job_title": "Python Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "Contract",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Highbrow Technology Inc Mohammad Naziya Mohammad Naziya Senior Technical Recruiter @ Highbrow Technology Inc || Helping employers connect with the best talents ||M.naziya@highbrowtechnology.com Role - Sr. Python: Service Implementation Location : India, Pakistan, Nigeria, Kenya, Egypt, Ghana, Bangladesh, Turkey, Mexico Duration : Full Time Contract ( 9 months) Skill : Practical, production-grade Python, Designing and Implementing production-ready APIs, TDD Experience : 5+ Years Requirements: 5+ years of experience with practical, production-grade Python development Strong understanding of system design principles Proven ability to design modular, high-performance APIs and manage the complete API lifecycle Hands-on experience with Test Driven Development (TDD) Strong fundamentals in database schema design and data modeling Demonstrated ownership of technical decisions, with the ability to explain and justify trade-offs. Excellent technical communication skills — able to explain design, document APIs and collaborate effectively across teams Able to work at a rapid pace without sacrificing clarity or correctness [Bonus] Familiarity with LLM function calling protocols and paradigms Show more Show less Seniority level Mid-Senior level Employment type Contract Job function Engineering Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366891546/",
    "job_id": "4366891546",
    "source": "linkedin",
    "company_name": "Highbrow Technology Inc",
    "job_title": "Python Developer",
    "location": "EMEA",
    "salary": "",
    "employment_type": "Contract",
    "experience": "Associate",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Highbrow Technology Inc Sujitha Sivalingam Sujitha Sivalingam Account Manager - Sales & Delivery | Building Highbrow Technology | MBA in HR We are looking for highly skilled 4 Years Competitive Programmers and Algorithm Experts to help train and evaluate advanced Large Language Models (LLMs) . You’ll design, refine, and validate high-quality programming problems aligned with Codeforces standards , improving AI reasoning and correctness. Key Responsibilities Review and refine problem statements with strict formatting (LaTeX, deterministic outputs) Validate brute-force and optimal solutions for correctness and efficiency Develop structured reasoning (naive → optimal approaches) Generate robust test cases and validate using Docker environments Maintain technical metadata (complexity, difficulty levels) Requirements Strong knowledge of algorithms & data structures (DP, Graphs, Segment Trees, etc.) 4 Years Proficiency in Python (3.10+) ; Java (21) is a plus Comfortable with GitHub, IDEs, and tooling High attention to detail and analytical thinking Engagement Details ⏱️ 8 hours/day (4 hours PST overlap) 📄 Contract: 6 weeks (Immediate start) 🌍 Location: India, Pakistan, Nigeria, Kenya, Egypt, Ghana, Bangladesh, Turkey, Mexico, Brazil 🌐 Fully remote Show more Show less Seniority level Associate Employment type Contract Job function Engineering Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325295183/",
    "job_id": "4325295183",
    "source": "linkedin",
    "company_name": "ENCORE IT SOLUTIONS",
    "job_title": "Python Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "Contract",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from ENCORE IT SOLUTIONS Nasser Jamal Nasser Jamal Head of Global Recruitment | Helping Companies Hire Top Tech & Non-Tech Talent | Hard-to-Fill & Niche Hiring | Global Talent Partner (USA | Canada |… 🚀 Hiring: Senior Python Developer (Top Coder Track) | 4+ Years | Remote We are looking for a world-class Python Developer — someone who lives and breathes code, optimizes for performance, and has a proven track record on competitive programming or data challenge platforms such as LeetCode, Codeforces, HackerRank, or Kaggle . If you love solving complex engineering problems and want to work with leading AI research teams, this role is for you. Role: Senior Python Developer (Top Coder Track) Experience: 4+ years Duration: 2 months Start Date: Immediate Location: India, Pakistan, Nigeria, Kenya, Egypt, Ghana, Bangladesh, Turkey, Mexico Work Model: Fully Remote (4-hour overlap with PST) What You’ll Do Build, test & optimize high-performance Python systems for large-scale AI/data pipelines Develop modular, clean, production-ready Python codebases Work with data, infra & research teams to deliver reliable backend components Write efficient, maintainable, and testable code Use strong foundations in algorithms & data structures Stay updated with modern Python frameworks & best practices Required Qualifications Bachelor’s/Master’s in Computer Science or related field 4+ years writing Python in production environments Expert-level skill with Pandas, NumPy, AsyncIO, FastAPI , or similar Proven excellence on LeetCode / Codeforces / HackerRank / Kaggle Strong understanding of algorithms, data structures & system design Working-level experience with ML/DS concepts Experience building scalable, optimized backend systems Preferred Qualifications Distributed systems, API design, or large data pipeline experience Cloud knowledge (AWS / GCP / Azure) CI/CD experience Open-source contributions Comfort working in a fast-paced, research-driven environment Evaluation Process (≈75 mins) 1. Technical Interview (60 mins): Deep evaluation of Python problem-solving, algorithms, and system design 2. Onboarding & Culture Fit (15 mins) Show more Show less Seniority level Mid-Senior level Employment type Contract Job function Information Technology and Engineering Industries Software Development and Technology, Information and Media"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4122908333/",
    "job_id": "4122908333",
    "source": "linkedin",
    "company_name": "Optimizely",
    "job_title": "Senior Software Engineer (.Net)",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Get notified about new Senior Software Engineer jobs in Dhaka, Dhaka, Bangladesh. Sign in to create job alert. Similar jobs."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4218300175/",
    "job_id": "4218300175",
    "source": "linkedin",
    "company_name": "Enzo",
    "job_title": "Lead Java Software Engineer",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Access is seeking exceptional software engineers with a fervent dedication to crafting software for the JVM. While our primary focus lies within the"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4090638174/",
    "job_id": "4090638174",
    "source": "linkedin",
    "company_name": "HiredKit",
    "job_title": "React Developer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "About Us: ResumePa is an AI-powered platform helping job seekers create resumes and practice interviews. As Bangladesh's first AI-first company in this space, we're pioneering innovative career development solutions. Experience: 3-5 years of web development Required Technical Skills: React.js and Next.js (app directory) Modern JavaScript (ES6+) Firebase/Firestore Tailwind CSS Real-time data handling Audio processing in web applications AI API integration experience Core Technologies: Frontend: React, Next.js, Tailwind CSS, Framer Motion Backend: Firebase (Auth, Firestore, Functions) Libraries: recharts, lucide-react, shadcn/ui APIs: Web Audio API, MediaRecorder API Main Responsibilities: Maintain and enhance resume builder features Implement real-time interview simulation features Build responsive UI components Integrate AI services Optimize application performance Work with Firebase features and real-time data What We Offer: Direct mentorship from CTO and leadership team Opportunity to work at Bangladesh's pioneering AI-first company Hands-on experience with cutting-edge AI technologies Clear career progression path with technical and leadership tracks Regular training and learning resources Access to latest AI tools and technologies Involvement in key technical decisions Opportunity to shape product architecture Competitive salary and benefits Remote-first work environment Growth Opportunities: AI technology expertise development Technical leadership path Product architecture involvement International market exposure Startup experience in a fast-growing space Skills development across full AI product lifecycle Please include your GitHub profile and relevant code samples with your application. Show more Show less Seniority level Mid-Senior level Employment type Full-time Industries Technology, Information and Internet"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4165284487/",
    "job_id": "4165284487",
    "source": "linkedin",
    "company_name": "RefatTech",
    "job_title": "React Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Part-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Role Description This is a part-time remote role for a React Developer at RefatTech. The React Developer will be responsible for front-end development, back-end web development, software development, JavaScript, and Redux.js. The daily tasks will include coding, debugging, and implementing user interfaces. Qualifications Front-End Development and Back-End Web Development (Basic) skills Software Development skills JavaScript and Redux.js proficiency Experience with React.js framework Ability to work independently and remotely Excellent problem-solving and analytical skills Bachelor's degree in Computer Science or related field Show more Show less Seniority level Entry level Employment type Part-time"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4234686604/",
    "job_id": "4234686604",
    "source": "linkedin",
    "company_name": "Prothom Alo",
    "job_title": "React Developer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Prothom Alo Fahim Mosabbir Fahim Mosabbir Deputy Manager - HR || Talent Acquisition || HRBP || Head Hunting || Organizational Development || Policy Development || Performance Management ||… Job Description Overview: We are looking for React JS developers with 4-5 years of experience to join the Digital Technology team of Prothom Alo. Prothom Alo (www.prothomalo.com) is the Number 1 Bangladeshi and Bengali language website in the world. Prothom Alo is also in the list of top 100 media companies of the world based on the number of followers on Facebook. Number of followers and level of engagement that Prothom Alo enjoys social media platforms that are unrivaled in the country. We build and run the prothomalo.com, mobile apps, editorial tools, revenue products, advertising, and data platforms using some of the latest technology stack. You will get the opportunity to participate in Google and Facebook’s early access features and technologies. There has never been a more exciting time to work in Technology at Prothom Alo. You will be joining some of the best engineers and developers as we navigate supporting the newsroom and our reporters, our millions of digital subscribers and the applications that keep prothomalo.com operating. Responsibilities: ● Design, implement and maintain user-facing features on our platforms ● Contribute to our design system by building reusable components ● Work closely with our product designers to make the best decisions ● Optimize the platform to achieve maximum performance in different locations ● Constantly improve the website’s performance, development experience, and processes ● Think like an architect, you are always aware of what needs to be improved and what is next for our web platforms Skills Required: ● You have at least 2 years of experience building web applications with minimum 2 years experience in React JS is must, and experience in any kind of UI components. ● You have a profound understanding of HTML, CSS and browser capabilities ● You have a deep understanding of Javascript, responsive web development and cross-browser compatibility ● Understanding of component-based design ● You ideally know client-side state management using Redux ● You have a good understanding of CSS preprocessors, building tools such as Webpack or FuseBox, Axios for API and Accessibility ● Experience in Git and Yarn. ● You have worked with UX/UI Designers and know how to work collaboratively in order to create an outstanding user experience ● Experience in PHP and MySQL will be an advantage ● Experience in Firebase will be preferred ● You have good communication skills and fluency in English ● Willingness to work in an agile environment Educational Qualifications: Graduate or Master's in Computer Science or any Engineering Discipline. Experience Required: The candidate must have at least 4-5 years of experience building web applications with a minimum of 2 years of experience in ReactJS is must, and experience in any kind of UI components. Other Details: Location: Karwan Bazar, Dhaka. Deadline: May 31, 2023 (Saturday) Compensation & Other Benefits: Negotiable & Competitive salary package will be offered to the suitable candidate. Salary should not be a constraint for the right candidate. Cautions: We want to make it clear that there is no application fee or any other cost associated with applying for this job. Our hiring process is entirely transparent and free for all candidates Apply Link with Full Job Description: https://forms.gle/7z4w3SKKYJ2qzfe3A Best of Luck! Show more Show less Seniority level Mid-Senior level Employment type Full-time Industries Newspaper Publishing"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3939090125/",
    "job_id": "3939090125",
    "source": "linkedin",
    "company_name": "Canvas Developers",
    "job_title": "ReactJS Developer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "🚀 We're Hiring: Remote Full-Time ReactJS & Express Developer 🚀 Canvas Developers is on the lookout for an experienced and dedicated Remote Full-Time ReactJS & Express Developer to join our dynamic team! We pride ourselves on creating beautiful, custom websites for our clients, and we're searching for someone who shares our passion for design and attention to detail – all while working remotely. Role Description This is a full-time remote role for a ReactJS Developer. The ReactJS Developer will be responsible for designing and developing user interfaces for a variety of web-based applications, using ReactJS and related libraries. Other responsibilities include collaborating with cross-functional teams to identify business requirements, and developing technical solutions that meet those requirements. The ReactJS Developer will also participate in code reviews, troubleshoot issues, and maintain documentation of work. Qualifications Strong proficiency in JavaScript and ReactJS, with a good understanding of related web technologies like HTML and CSS Familiarity with testing frameworks and libraries such as Jest, Enzyme, and React Testing Library Experience with Redux or similar state-management libraries Proficient understanding of Git and version control systems Experience with back-end frameworks such as NodeJS and Express is a plus Ability to collaborate effectively with cross-functional teams, including product managers, designers, and other developers Bachelor's degree or higher in Computer Science, or a related field Strong problem-solving skills and attention to detail Experience Requirements: Minimum 12 months Salary Range: Starting from BDT 30,000+ / month (Based on your good experience) Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  }
]