[
  {
    "url": "https://www.linkedin.com/jobs/view/4352012787/",
    "job_id": "4352012787",
    "source": "linkedin",
    "company_name": "Verdicon Builders",
    "job_title": "Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company OverviewVerdicon Builders is a Southern Ontario-based construction firm that has evolved from a trusted owner’s representative to a full-service builder. With a leadership team bringing over a decade of industry success across residential and mixed-use developments, we leverage our deep client-side insight to deliver projects with uncompromising quality.Verdicon is at the forefront of modern building, championing innovative, high-efficiency construction strategies; from design-assist collaboration to modular and precast building systems that drive superior results. Our commitment to sustainability, cutting-edge technology, and excellence in execution has positioned us as a rising leader in the construction industry.Role OverviewWe are seeking a motivated Accountant to support our finance operations with full-cycle accounting, construction cost tracking, financial reporting, and compliance. You’ll help ensure financial accuracy across projects and corporate operations while working closely with project managers, operations, and leadership.Key ResponsibilitiesCore AccountingPerform full-cycle accounting tasks including accounts payable (AP), accounts receivable (AR), and general ledger maintenance. Prepare and record journal entries, reconcile accounts, and support month-end close processes. Maintain accurate financial records and documentation to support internal reporting and external audits.Project & Cost AccountingTrack and allocate costs to individual construction projects. Generate project-specific financial reports and assist with project budgeting and variance analysis. Monitor labour, materials, subcontractor costs, and overhead to ensure projects remain on budget. Financial Reporting & CompliancePrepare timely financial reports for senior leadership and support audit processes. Assist with tax filings (HST, payroll, etc.) and ensure compliance with accounting standards/regulations. Support cash flow forecasting and help identify financial risks or opportunities.Collaboration & Process ImprovementWork with project managers and operations to clarify financial assumptions, cost allocations, and budget revisions. Contribute to improvements in financial processes, reporting accuracy, and accounting controls.What We're Looking ForEducation & CredentialsBachelor’s degree in Accounting, Finance, or related field.CPA designation (or working toward CPA) is an asset.Experience2–5 years of accounting experience, ideally in construction or project-based industries. Skills & ToolsStrong knowledge of accounting principles and financial reporting.Experience with accounting software (e.g., QuickBooks, Yardi, etc.). Excellent Excel skills (analysis, pivot tables, reporting).Detail-oriented, organized, and able to manage multiple priorities.Why Verdicon BuildersBe part of a dynamic construction team shaping the future of projects across Southern Ontario. Work in a collaborative, growth-minded environment.Competitive compensation and professional development opportunities.Verdicon Builders is a progressive, equal opportunity employer committed to diversity and inclusion. We thank all applicants for their interest; however, only those selected for an interview will be contacted. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369118329/",
    "job_id": "4369118329",
    "source": "linkedin",
    "company_name": "UNICEF Canada",
    "job_title": "Senior Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368108135/",
    "job_id": "4368108135",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "Tax & Legal Services - International Tax/M&A - Director (Qatar)",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366081208/",
    "job_id": "4366081208",
    "source": "linkedin",
    "company_name": "Kimstore",
    "job_title": "Accounting Manager",
    "location": "Quezon City, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369269808/",
    "job_id": "4369269808",
    "source": "linkedin",
    "company_name": "Lussier",
    "job_title": "Conseillère / Conseiller adjoint en actuariat • Régimes de retraite",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345020746/",
    "job_id": "4345020746",
    "source": "linkedin",
    "company_name": "A Hotels and Resorts International",
    "job_title": "Accounting Assistant",
    "location": "Quezon City, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320978787/",
    "job_id": "4320978787",
    "source": "linkedin",
    "company_name": "Bybit",
    "job_title": "Financial Researcher",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357041442/",
    "job_id": "4357041442",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive (Accounts) (For Delta Engineers & Consortium Ltd.) - Job ID - 1455211",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359731292/",
    "job_id": "4359731292",
    "source": "linkedin",
    "company_name": "NES Fircroft",
    "job_title": "Senior Account Manager - Recruitment",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360809004/",
    "job_id": "4360809004",
    "source": "linkedin",
    "company_name": "San Miguel Corporation",
    "job_title": "Finance Associate",
    "location": "Pasig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369104117/",
    "job_id": "4369104117",
    "source": "linkedin",
    "company_name": "MicroSourcing",
    "job_title": "Financial Accountant",
    "location": "Pasay, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359511631/",
    "job_id": "4359511631",
    "source": "linkedin",
    "company_name": "MatchMove",
    "job_title": "Remote - Group Financial Controller",
    "location": "Metro Manila",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369427435/",
    "job_id": "4369427435",
    "source": "linkedin",
    "company_name": "L'ICQ (Institut canadien de Québec)",
    "job_title": "Adjoint administratif/adjointe administrative",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366993717/",
    "job_id": "4366993717",
    "source": "linkedin",
    "company_name": "New York University Abu Dhabi",
    "job_title": "Administrative Assistant (Fixed Term until August 31, 2027)",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Position Summary Applications are welcome from all qualified candidates. In line with UAE regulations, Emirati candidates are encouraged to apply. New York University Abu Dhabi (NYUAD) seeks to appoint an Administrative Assistant reporting to the Head of CGSB Research Management and Outreach.This position provides administrative, technical, and organizational support to the Center for Genomics and Systems Biology (CGSB). The Administrative Assistant supports CGSB leadership, faculty, and research staff by managing day-to-day office operations, coordinating schedules, meetings, travel, procurement, and financial processes, and serving as a liaison with university administrative units in Abu Dhabi and New York. The role contributes to the efficient coordination of Center operations, resources, and reporting activities.Key Responsibilities Provide administrative support to CGSB Directors, center PIs, and affiliated faculty in Abu Dhabi and New York, including calendar management, meeting coordination, travel arrangements, accommodation and ground transport, and agenda and document preparation Maintain electronic and physical records, mailing lists, and shared files. Respond to inquiries and coordinate with university offices as needed Facilitate purchasing and procurement activities by processing requisitions, ensuring required paperwork is completed and signed off, and liaising with Procurement, Finance, and Logistics to support purchasing, service agreements, and vendor payments Assist with tracking expenses across center chart fields, by maintaining records of purchase orders and expenditures Support budget monitoring, and assist with invoice processing, reimbursements and purchase card spending in accordance with university policies Run and review budget and financial reports, identifying discrepancies and supporting the team with budget tracking Support Center reporting and projects, including annual progress reports, SAB and APR materials, by gathering information and maintaining tracking systems Provide logistical support for Center events and outreach activities, including conferences, seminars, workshops, and public engagement events Coordinate room bookings, catering, printing of materials, name tags, and equipment setup in collaboration with relevant NYUAD departments Support communication logistics in events, in coordination with the Marketing and Communications Manager Support onboarding and general office operations by coordinating IT and access requests, maintaining staff records, assisting with recruitment documentation Assist with drafting job descriptions and coordinating recruitment timelines and documentation Track leave requests and space allocations, and maintain up-to-date staff records and contact lists. Perform other related admin duties as required to support CGSB operations Qualifications Required Education: Bachelor’s Degree Required Experience More than two years of administrative support experience, preferably in a university, research, or similarly complex environment Strong organizational and time-management skills, with the ability to handle multiple tasks and deadlines Excellent written and verbal communication skills in English High attention to detail and accuracy in documentation and data entry Proficiency with MS Office/Google Suite; comfort with learning NYUAD enterprise systems (procurement, travel, finance) Ability to work independently with minimal supervision while being a strong team player Discretion and professionalism in handling confidential information Ability to work effectively in a multicultural environment and interface with faculty, staff, students, and external stakeholders Preferred Experience More than one year experience with procurement, budgeting support, or finance processes Experience in event logistics and coordination Knowledge of Arabic is an advantage Additional InformationThe University is an equal opportunity employer committed to equity, diversity and social inclusion. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4344871882/",
    "job_id": "4344871882",
    "source": "linkedin",
    "company_name": "PESO Resources Development Corp.",
    "job_title": "Billing Associate",
    "location": "Quezon City, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionThe Billing Associate is responsible for preparing, reviewing, and issuing accurate Billing to clients in a timely manner. This role ensures that all billing data is complete and accurate, and that all client requirements are met. The Billing Associate works closely with internal teams such as operations HR Timekeeper, Accounting/Finance, and especially to the client, to resolve discrepancies.Key Responsibilities Prepare and issue client billing/invoices based on contract terms and billing schedules. Validates billing data (timekeeping, summary, dtr's attachment, topsheet) to ensure accuracy. Coordinate with internal departments and clients to resolve billing issues or discrepancies. Maintain accurate records of billing activities and documentation. Ensure compliance with company policies and client-specific billing requirements. Support audits and provide documentation as needed. Update billing systems and ensure data integrity. Identify opportunities for process improvements.Qualifications Bachelor's degree in Accounting, Finance, Business Administration, or related field (preferred). At least 1-2 years of billing or accounting experience (BPO/Shared Services experience is a plus). Proficiency in Microsoft Excel and billing/accounting software. Strong attention to detail and organizational skills. Ability to meet deadlines and manage multiple priorities. Excellent communication and interpersonal skills.Preferred Skills Familiarity with billing/invoicing in a service-based or project-based environment. Experience handling client-specific billing formats and portals. Basic understanding of accounting principles. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4335625078/",
    "job_id": "4335625078",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "PwC - Risk - Financial Services Internal Audit Senior Associate - Egypt Hub",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367831273/",
    "job_id": "4367831273",
    "source": "linkedin",
    "company_name": "Ivanhoe Mines",
    "job_title": "Corporate Finance Analyst",
    "location": "Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4270678269/",
    "job_id": "4270678269",
    "source": "linkedin",
    "company_name": "ORO24 Developments",
    "job_title": "Senior Internal Auditor",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367212221/",
    "job_id": "4367212221",
    "source": "linkedin",
    "company_name": "Maybank",
    "job_title": "Technical Project Manager (Finance)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Key Responsibilities of a Technical Project Manager:Project Planning: Defining project scope, objectives, and deliverables.Resource Management: Allocating resources, including personnel, budget, and tools.Progress Tracking: Monitoring project progress against timelines and objectives.Risk Management: Identifying, assessing, and mitigating potential project risks.Stakeholder Communication: Communicating project status and progress to stakeholders.Technical Expertise: Providing technical guidance and support to the project team.Problem-Solving: Addressing technical challenges and issues that arise during the project lifecycle.Team Leadership: Coordinating and leading project teams, ensuring effective collaboration.Quality Assurance: Ensuring the quality of project deliverables and adherence to technical standards.Manage all projects in MSS Finance. This covers all projects relating to General Ledger, Fixed Assets, Accounts Payable, Accounts Receivable and the Financial Accounting Hub, which runs on Oracle EBS R12.2.Manage month end and daily processing which includes reporting to any PSC with respect to batch processing.Manage any other programmer, which includes Review, and optimize EGL batch processing and hollowing out from Core Banking.Job requirement:Level of Education: At least tertiary level and discipline related field: Information Technology (IT).Knowledge and experience in IT application architecture, design and development.Understanding of the IT solution discipline, processes and concepts.Technical aptitude, basic knowledge and experience across application, information technology, and process domains.Basic understanding in project management processes and methodologies including common roles and responsibilities.Project Management: Strong knowledge of project management methodologies, tools, and techniques.Technical Knowledge: Deep understanding of relevant technologies, systems, and processes.Communication Skills: Excellent written and verbal communication skills to effectively communicate with stakeholders.Leadership Skills: Ability to motivate, guide, and lead project teams.Problem-Solving Skills: Ability to identify, analyze, and resolve technical and project challenges.Analytical Skills: Ability to analyze data, track progress, and make informed decisions.Organizational Skills: Ability to organize and manage multiple tasks and projects effectively. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365440613/",
    "job_id": "4365440613",
    "source": "linkedin",
    "company_name": "KEO International Consultants",
    "job_title": "Business Analyst",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363380785/",
    "job_id": "4363380785",
    "source": "linkedin",
    "company_name": "HCLTech",
    "job_title": "Business Analyst",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Bachelor degree or above in IT related disciplines with at least 5 years working experience.Maximum 5 years of experience as a business analyst.Ability to analyze, interpret and communicate business information to both internal and external stakeholders of the project.Familiar with common office applications (PPT, Excel, Word).Proficient in English speaking and can communicate with client.Be familiar with the methodology of testing and requirements change management.Be familiar with insurance knowledge.Nice to be familiar with Agile/Waterfall or other software development process.It’s a plus if the candidate has group insurance knowledge.Job description:Analyzing and developing functional specification documents.Identify and capture/document business goals and provide business solution to clients.Play translator role between users and developers.Perform system integration testing and support users’ acceptance testing.Be responsible for system implementation and provide direct user support.Required proficiency in Mandarin. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4347542442/",
    "job_id": "4347542442",
    "source": "linkedin",
    "company_name": "Koç University",
    "job_title": "Faculty Administrative Assistant",
    "location": "Sarıyer, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Koç University was founded in 1993 by the Vehbi Koç Foundation with the vision of achieving excellence in education, pioneering scientific research, and contributing value to society. Ranked among the top 500 universities globally, our university is one of Turkey’s most prestigious institutions and aims to contribute to scientific, technological, and societal progress with its research-oriented structure. We offer an inspiring and dynamic living environment on our campus, creating a distinctive working atmosphere.At Koç University, our employees advance their careers in a dynamic and supportive work environment as part of a team of experts and innovators. Our workplace fosters continuous learning and offers opportunities for personal and professional development. With our vision and strong values, we invite you to join the Koç University family to achieve new milestones in your career.We are looking for a Faculty Administrative Assistant to join the College of Administrative Sciences and Economics of our university who meets the following criteria:QualificationsBachelor’s degree in Business Administration, Social Sciences or related fields,Preferably, 5 years of professional experience in academic departments of universities or educational institutions,Demonstrable competencies such as communication, planning and organization and agility with professionalism,Self-motivation, positive and proactive attitude with high level of energy,Ability to work effectively with cross-functional teams in a dynamic work-environment,Strong analytical thinking, reporting, continuous improvement, time management and prioritization skills,Excellent written and verbal communication skills in English,Excellent command of MS Office applications.Job Description Administrative Assistant is going to provide support to the academic and administrative processes of the faculty and to the Academic Coordinator by developing innovative methods when necessary.Providing necessary support for the activities of the faculty within the framework of EQUIS and AACSB accreditation standardsOrganizing annual meetings with the International Advisory Board and maintaining the necessary communicationEnsuring continuous communication flow with internal stakeholders and alumniRegulation of faculty web and social media pages and keeping content updated and bi-annual newsletter preparationResponding to the questions of the students / parents at the Dean’s Office, and directing them to the relevant parties when necessarySupporting Dean’s Office administrative responsibilities, such as budget entries to SAP, Dean’s internal and external communications and also accreditation driven reporting.Koç University embraces the principle of equal opportunities. All candidates are evaluated without discrimination based on race, gender, national or social origin, religion, age, disability, sexual orientation, or marital status. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369778159/",
    "job_id": "4369778159",
    "source": "linkedin",
    "company_name": "Billennium",
    "job_title": "Specjalista ds. płac",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356673099/",
    "job_id": "4356673099",
    "source": "linkedin",
    "company_name": "Johnson Controls",
    "job_title": "Sr. Specialist - Payroll Operations, Pacific and SEA",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355592357/",
    "job_id": "4355592357",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Territory Officer - For Swajis-Aspasia Group Company - Job ID: 1452274",
    "location": "Nator, Rajshahi, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355790090/",
    "job_id": "4355790090",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Chief Operating Officer (COO) - Columbia Washing Plant Ltd. - For M & J Group - Job ID: 1452905",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "M & J Group is looking for Chief Operating Officer (COO) - Columbia Washing Plant Ltd.Job Description / ResponsibilityAbout The Company: M&J Group entered into manufacturing activities in 1963 by establishing a flour milling company. The business horizon was expanded in 1989 when the garment manufacturing factory was opened. Now with its 8 sister concerns, M&J Group is a leading manufacturer in Bangladesh. The group is producing a wide range of top-quality denim bottoms including some non-denim products. M&J Group aspires to be the leading supplier in the global fashion business by offering the best expertise and knowledge in producing Ready Made Garments.Educational RequirementsBachelor/HonorsBachelor’s degree in Chemical Engineering or an equivalent discipline.Experience Requirements15 to 20 year(s)Additional RequirementsCandidates must have a minimum of 7 years’ proven experience in a senior leadership role.Job LocationGazipur Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363787670/",
    "job_id": "4363787670",
    "source": "linkedin",
    "company_name": "Poczta Polska S. A.",
    "job_title": "Chief Financial Officer (CFO) Centrum Usług Wspólnych",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4246064631/",
    "job_id": "4246064631",
    "source": "linkedin",
    "company_name": "Mutares SE & Co. KGaA",
    "job_title": "Senior Manager/Associate Director Finance Transformation (m/f/d) - Poland",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Mutares SE & Co. KGaA, Munich ( www.mutares.com) , as a listed private equity holding company, acquires medium-sized companies in special situations, which show significant operational improvement potential and are sold again after undergoing a repositioning and stabilization process. Mutares actively support its portfolio companies with its own investment and operations teams and through strategic add-on acquisitions. The focus is on companies with revenues ranging from EUR 100 million to EUR 750 million, across various industries. The aim is to achieve a clear value increase with a focus on sustainable, long-term growth of the portfolio company.Within our Operations team, we are looking to hire a team member with a successful track record in Finance with a continuous improvement attitude and an entrepreneurial mindset. This role will be located at portfolio companies, on-site across Europe.Your TasksManage the restructuring and improvement processes for our portfolio companies on-site to implement and improve sound cash management processes on-sitePartner closely with the Mutares restructuring team by conducting financial analyses, developing and integrating financial models, and critically evaluating business casesPrepare and execute financing solutions (factoring, asset-based funding, credit lines)Improve financial statement closing and other finance/controlling processes and assist in the preparation of financial statements and auditManage the relationship with external stakeholders (auditors, financial advisers, banks, credit insurers, etc.)Your ProfileSuccessfully completed a Finance degree with outstanding resultsAt least 6 years of experience in a Big4/Management Consulting firm (preferably restructuring focused) or Controlling/Finance department of an industry firm (preferably with exposure to restructuring situation)Strong analytical and problem-solving skills, combined with an entrepreneurial mindset and hands-on approachProficiency in Microsoft Office Suite (Integrated financial modelling and cash forecasts)Business fluency in Polish and English with the ability to communicate in a well-structured and concise mannerWillingness to travel up to 4 days per week (typically Monday – Thursday) and to work in an international environmentWhat Mutares OffersWork in a highly motivated, international, committed, and agile team that enjoys working togetherExciting work environment with varied challenges, strategic influence, and tasks for continuous personal and professional developmentFlat hierarchies, fast decision-making processes, and room for your own ideasRegular team events and offsites Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321404427/",
    "job_id": "4321404427",
    "source": "linkedin",
    "company_name": "SF Express Indonesia",
    "job_title": "Accounts Payable Clerk",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361814312/",
    "job_id": "4361814312",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager (Audit) - For National Development Programme (NDP)- Job ID: 1458253",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339270553/",
    "job_id": "4339270553",
    "source": "linkedin",
    "company_name": "M-KOPA",
    "job_title": "Senior Product Analyst - Credit Eligibility",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355748038/",
    "job_id": "4355748038",
    "source": "linkedin",
    "company_name": "Integra Recruiters",
    "job_title": "Internal Auditor",
    "location": "Scarborough, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359129474/",
    "job_id": "4359129474",
    "source": "linkedin",
    "company_name": "Scorp",
    "job_title": "Payroll & People Operations Specialist",
    "location": "Istanbul, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About UsScorp Inc. is an innovative technology company with offices in Istanbul and San Francisco. Founded in 2014, we initially launched the Scorp app but have since shifted our focus to developing mobile applications centered around social media and live streaming. Our apps are active in 182 countries, with one app reaching 600,000 daily active users and another engaging 400,000. In 2023 alone, we gained over 150 million new registered users, supporting more than 25 languages.We are looking for an experienced Payroll & People Operations Specialist manage end-to-end payroll and people operations processes.QualificationsMinimum 10 years of experience in payroll and people/HR operationsAdvanced proficiency in MS Excel (advanced formulas, pivot tables, reporting, data analysis)Strong knowledge of Turkish Labor Law, Social Security regulations, and payroll legislationHands-on experience with time & attendance, leave management, overtime, benefits, and incentive schemesExperience in managing employee records and personnel files in compliance with legal requirementsStrong analytical mindset with high attention to detailHigh level of confidentiality and ownershipStrong communication and cross-functional collaboration skillsJob DescriptionManaging end-to-end monthly payroll processes accurately and on timeHandling people operations processes including onboarding, offboarding, contracts, and employee documentationManaging and controlling timekeeping, leave, and benefits dataManaging Social Security declarations, incentives, and other statutory payroll processesPreparing payroll and people operations reportsWorking closely with HR and Finance teams to ensure operational excellence Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356555714/",
    "job_id": "4356555714",
    "source": "linkedin",
    "company_name": "nextjobz নিয়োগ",
    "job_title": "Sr. Executive, Treasury",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361819201/",
    "job_id": "4361819201",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Head of Bank Asia Institute for Training & Development - For Bank Asia PLC - Job ID: 1458120",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369062510/",
    "job_id": "4369062510",
    "source": "linkedin",
    "company_name": "365 Core Talent",
    "job_title": "Real Estate Analyst (US Markets) - Internship",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Real Estate Analyst‍QUALIFICATION:Bachelor's degree (Currently in the 4th semester or beyond)Proficiency in Microsoft Office suiteExcellent communication skillsStrong interpersonal and teamwork skillsProven ability to multitask and prioritize effectively.Detail-oriented and highly organized.Excellent time management and ability to meet deadlines.Adaptability and willingness to learn and grow.‍COMPENSATION: We offer an attractive monthly salary during the entire internship period. This compensation package reflects our commitment to providing competitive pay while assessing your performance and suitability for a long-term position within our organization. PERKS (for full-time team members):Health insuranceGym/fitness membership allowancePhone expense allowanceTransportation allowanceFree lunch at the office every daySocial and recreational activitiesGenerous vacation and leave policiesFlexible work arrangementsMaster's degree sponsorship, and moreJOB DESCRIPTION:In addition to the core responsibilities listed below, there may be occasional ad hoc projects that arise, providing opportunities to further diversify your skills and contribute to our organization in new and exciting ways. these projects can vary in scope and nature, offering a chance to explore different areas of the business and collaborate with cross-functional teams, fostering professional growth and broadening your experience.Prepare financial models and feasibility studies to assess the profitability and risk associated with real estate projects, considering factors such as cash flows, return on investment, and sensitivity analysis.Conduct in-depth market research and analysis to evaluate real estate investment opportunities, including property acquisitions, development projects, and leasing strategies.Gather and analyze data on property performance, market trends, demographics, and economic indicators to provide insights and recommendations for investment decision-making.Assist in the due diligence process, including property valuation, lease analysis, and financial document review, to support investment underwriting and transaction execution.Prepare comprehensive reports and presentations summarizing findings, market analysis, and investment recommendations for internal stakeholders, clients, and investors.Monitor and track the performance of real estate assets in the portfolio, including occupancy rates, rental rates, and market trends, and provide regular performance updates to stakeholders.Collaborate with cross-functional teams, including acquisitions, asset management, and development, to support the implementation and execution of real estate investment strategies.Stay updated on industry trends, market dynamics, and regulatory changes related to the real estate market, and provide insights and recommendations based on the analysis of these factors.Utilize real estate data and analytics tools to enhance the efficiency and accuracy of market research and financial analysis processes.Support the preparation of investment proposals, financial presentations, and marketing materials to attract potential investors and clients.Assist in special projects and ad hoc financial analysis as required. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370909655/",
    "job_id": "4370909655",
    "source": "linkedin",
    "company_name": "One Duck Hospitality Group",
    "job_title": "Accounts Payable Administrator",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Are you a detail-oriented accounting professional looking for a dynamic and engaging role in the hospitality industry? One Duck Hospitality is seeking an Accounts Payable Administrator to join our team! As the parent company of Hemingway’s and The Pilot, two iconic Yorkville establishments. One Duck Hospitality is at the heart of Toronto’s vibrant restaurant scene. This role is based on-site and offers the opportunity to work closely with our restaurant and finance teams in a fast-paced, collaborative environment.Information about this job posting and our screening process:This job posting is for a vacant position at One Duck HospitalityOur team uses AI tools to assist with applicant screeningThis is a full-time positionKey Responsibilities:Perform day to day financial transactions, including verifying, obtaining proper approvals, classifying, and recording accounts payable dataReconcile the accounts payable ledger to ensure that all bills and payments are accounted for and properly postedReconcile vendor accounts and monthly vendor statementsPrepare and process expense reports and reconcile with various credit card statements and gather back up documents/invoicesReconcile company credit cards with corresponding purchases and paymentsReceive and update Wisk inventory system and Cogswell with all food and beverage ordersWork on site at our restaurant locationsWhy work with us?Salary - $50,000 per yearRRSP Program to support your financial futureEmployee & Family assistance programFree lunch!Staff discount program across One Duck Hospitality RestaurantsExciting growth & development opportunitiesQualifications:Bachelor's degree in Accounting4+ years of experience in accounts payableExperience in the hospitality industry is an assetStrong understanding of financial reconciliations, Quickbooks Desktop and OnlineWe welcome international experience and transferable skillsIf you’re looking for a challenging and rewarding role in a growing hospitality group, we’d love to hear from you! Apply today and be part of the One Duck Hospitality team!One Duck Hospitality is dedicated to facilitating an accessible and inclusive recruitment and selection process in accordance with the Accessibility for Ontarians with Disabilities Act (AODA). We invite and encourage candidates with disabilities to apply for employment opportunities with us. Please be aware that accommodations during the recruitment process are readily available upon request.Powered by JazzHRkDdcGOSjSW",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371523532/",
    "job_id": "4371523532",
    "source": "linkedin",
    "company_name": "Randstad Canada",
    "job_title": "Senior Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Our client is looking for a sharp up and coming Senior Financial Analyst/ Finance Manager to join our clients team on a contract, with a chance to go permanent.The ideal candidate will be responsible for working with senior management to develop financial strategies for the organization. You are comfortable handling large amounts of data, acting as a business partner, decision maker, and providing regular financial reporting.ResponsibilitiesManage the Accounting Team, including Payroll, according to the organization’s policies including orienting, managing, developing, and evaluating reporting employees· Ensure the integrity of financial information and reporting for the organization· Monitors and controls the assets , ensures that management controls are in place and utilized at all times· Responsible for oversight and approval of journal entries for posting to ledgers, month end reconciliations and preparation of supporting schedules.· Manage month and year-end reporting processes, ensuring that transactions are posted, and reports prepared in a materially correct and timely manner, and are in accordance with Canadian GAAP (and related guidelines)· Oversee and review HST, GST and, ensuring that they are prepared consistently with respective regulations, accurately reflecting the underlying transactions, and filed· Manage reporting and relationship requirements with financial institutions· Lead the year-end audit and coordinate with external auditors at year-end, ensuring that all client assistance schedules, and other special audits are prepared, reviewed and submitted to the auditors as required· Act as the business owner for the finance ERP (e.g., NetSuite): chart of accounts governance, dimensionality for programs/funds, close automation, dashboards, and controls.· Maintain GL integrity.· Identify process improvements, streamline workflows, and support automation of reporting and analytics.· Perform related duties and responsibilities as required.QualificationsBachelor's degree or higher in Finance or related field 5 - 7 years of relevant experienceFluency in Microsoft Office suite (Outlook, Excel, Word, PowerPoint, etc.)Detail-oriented and analyticalCPA preferred but not required.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357439585/",
    "job_id": "4357439585",
    "source": "linkedin",
    "company_name": "Intersnack Bulgaria",
    "job_title": "Deputy Chief Accountant",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Intersnack Bulgaria Ltd. is part of Intersnack Group – a leading European company in the savory snacks sector, founded in Germany more than 60 years ago. Today, the Group operates in over 30 countries across Europe, Australia, New Zealand and beyond.Since 1992, we have been present on the Bulgarian market, where we introduced the legendary brand Chio. Today, we are among the undisputed leaders in the category, with a strong portfolio of brands including Chio, Pombar, Hula Hoops, and Chipi.As we continue to grow, we are looking for a responsible and motivated professional to join our team in the position of: Deputy Chief AccountantMain Purpose of the RoleThe position is responsible for the timely organization and control of accounting operations and the processing of all primary accounting documents. It supervises the work of the accounting team and supports the Chief Accountant and the Finance Director in their activities.Key Responsibilities: • Together with the Chief Accountant, prepares monthly management reports, including budget execution analysis and variance reports, as well as regional performance reports;• Participates in the preparation of the company’s annual financial statements in accordance with local accounting legislation;• Prepares flat files with required information for the parent company on a monthly basis;• Provides periodic and annual reports for external institutions (e.g. statistics, banks);• Assists during tax inspections and audits, including the annual audit by the approved Intersnack Group auditing company;• Prepares periodic and annual tax declarations in compliance with local tax regulations (CIT, VAT, PIT);• Coordinates the work of the accountants in the accounting department;• Posts all accruals and prepares monthly reports for them;• Participates in the implementation of new procedures and processes within the Finance Department, including the deployment, testing and upgrading of the ERP system and external applications used by the company.Requirements:• University degree in Economics, Accounting or Finance;• Minimum 5 years of professional experience in accounting or a related field;• Experience with ERP systems will be considered an advantage;• Very good command of English for professional communication;• Excellent computer literacy;• Strong managerial, organizational and analytical skills with the ability to make prompt decisions;• Problem-solving and delegation abilities;• Ability to work both independently and as part of a team while maintaining excellent working relationships;• Responsibility, loyalty, and integrity in performing professional duties.We Offer:• Employment in an international company with established standards and strong corporate values;• Excellent remuneration and annual performance bonus;• Additional health insurance;• Food vouchers;• Flexible working arrangements, including remote work according to schedule;• Opportunities for professional development through trainings and seminars;• A dynamic and supportive work environment.If you recognize yourself in this role and are ready for a new challenge - we look forward to receiving your application!Data Protection NoticeBy submitting your application, you consent to the processing of your personal data by Intersnack Bulgaria Ltd. for recruitment purposes. Your data will be treated confidentially and used solely for the recruitment process. The data will be stored for a period of 6 months. You have the right to request correction or deletion of your data at any time in accordance with applicable legislation.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370312469/",
    "job_id": "4370312469",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Branch Manager",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "wherewework.bg on behalf of:Employers from SofiaInterested in this role? You’re in the right place.To move forward, simply upload your CV to wherewework, and we’ll help connect you with real job openings from real companies, including the position you’re viewing right now.Here’s how it works: Upload your CV onceYou can do it instantly by clicking the \"Apply\" button in this window. It only takes a moment, and it allows us to match your profile with relevant opportunities. We match you with real roles that fit your experienceWhen companies open positions aligned with your skills, we’ll identify the best opportunities for you. You stay fully in controlBefore your CV is ever shared, we’ll notify you with the exact job title and company name, and ask for your confirmation. Only confirmed applications are sent to employersOnce you approve, the employer will receive your application and may contact you directly to continue the hiring process.While you're here, explore wherewework to discover what it’s really like to work at different companies, through interview experiences, employee reviews, and community feedback.Thanks for being part of wherewework!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370321155/",
    "job_id": "4370321155",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Quality Control Specialist",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "wherewework.bg on behalf of:Employers from SofiaInterested in this role? You’re in the right place.To move forward, simply upload your CV to wherewework, and we’ll help connect you with real job openings from real companies, including the position you’re viewing right now.Here’s how it works: Upload your CV onceYou can do it instantly by clicking the \"Apply\" button in this window. It only takes a moment, and it allows us to match your profile with relevant opportunities. We match you with real roles that fit your experienceWhen companies open positions aligned with your skills, we’ll identify the best opportunities for you. You stay fully in controlBefore your CV is ever shared, we’ll notify you with the exact job title and company name, and ask for your confirmation. Only confirmed applications are sent to employersOnce you approve, the employer will receive your application and may contact you directly to continue the hiring process.While you're here, explore wherewework to discover what it’s really like to work at different companies, through interview experiences, employee reviews, and community feedback.Thanks for being part of wherewework!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373053134/",
    "job_id": "4373053134",
    "source": "linkedin",
    "company_name": "Altis Recruitment",
    "job_title": "Controller",
    "location": "Oshawa, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371178337/",
    "job_id": "4371178337",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Senior Tax Associate/ Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We are looking for a dedicated Senior Tax Associate/Manager to join our dynamic team in Toronto, Ontario. In this role, you will leverage your expertise to manage complex tax compliance tasks, conduct research, and provide strategic guidance to clients. This is a great opportunity for someone with a strong background in tax accounting and software systems who pays close attention to detail.Responsibilities:• Prepare and review tax returns for individuals, corporations, partnerships, and trusts, ensuring accuracy and compliance with regulations.• Conduct comprehensive research on tax-related matters to provide informed recommendations and solutions.• Utilize specialized accounting software, including CaseWare and CCH ProSystem Fx, to streamline tax processes and reporting.• Collaborate with clients to address inquiries and resolve tax-related issues effectively.• Assist with quarterly and annual tax filings, ensuring all deadlines are met.• Stay updated on changes in state and federal tax laws to maintain compliance and deliver informed advice.• Provide mentorship and guidance to less experienced team members, fostering growth within the department.• Analyze financial data and documents to identify tax-saving opportunities and ensure proper reporting.• Support LLP clients with tailored tax services and solutions.Requirements:• Bachelor's degree in Accounting, Finance, or a related field.• Proven experience in tax accounting, with a focus on compliance and research.• Proficiency in accounting software systems such as CaseWare, CCH ProSystem Fx, and CCH IntelliConnect.• Strong knowledge of state and federal tax regulations and filing requirements.• Excellent analytical skills with the ability to interpret complex financial data.• Effective communication skills to liaise with clients and team members.• Detail-oriented approach to ensure accuracy in all tax-related tasks.• Ability to manage multiple projects and meet tight deadlines.Salary range - $100-130K base This job posting is for a current vacancy with our client. Our specialized recruiting professionals apply their expertise and utilize our proprietary AI to find you great job matches faster. Senior Tax Associate Job in Toronto, ON | Robert Half",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373279058/",
    "job_id": "4373279058",
    "source": "linkedin",
    "company_name": "IOM - UN Migration",
    "job_title": "Case Worker - Aleppo",
    "location": "Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionIOM is committed to addressing the needs and promoting and upholding the rights of migrants.IOM’s Protection Division (PXD) aims to reduce protection risks of individuals in vulnerable situations, and in particular those who are exposed to abuse, exploitation, violence, neglect and deliberate deprivation. It does so by addressing protection threats and vulnerabilities while increasing the capacities of individuals, their communities as well as those of their duty bearers.Protection encompasses all activities aimed at obtaining full respect for the rights of the individual in accordance with the letter and spirit of the relevant bodies of law. Specifically, protection involves activities that seek to directly secure, individual or group rights, as well as activities that aim to create a society in which individual and group rights are recognized and upheld.IOM is committed to addressing the needs and promoting and upholding the rights of migrants.IOM’s Protection Division (PXD) aims to reduce protection risks of individuals in vulnerable situations, and in particular those who are exposed to abuse, exploitation, violence, neglect and deliberate deprivation. It does so by addressing protection threats and vulnerabilities while increasing the capacities of individuals, their communities as well as those of their duty bearers.Protection encompasses all activities aimed at obtaining full respect for the rights of the individual in accordance with the letter and spirit of the relevant bodies of law. Specifically, protection involves activities that seek to directly secure, individual or group rights, as well as activities that aim to create a society in which individual and group rights are recognized and upheld.Assistance includes all direct support activities that target individuals and their families, their communities, as well as broader structural level interventions and support to governments as duty bearers. Individual and family assistance can include support to meet immediate, medium or long-term needs including food; shelter and accommodation; healthcare; education and training; employment and/or income generation; family assessments and reunification; counseling; referrals; safe and dignified return and/or sustainable reintegration.IOM’s case management staff are at the frontline of delivery of this assistance. These staff provide case management and assistance services to a wide range of individuals, including separated and unaccompanied children; victims of trafficking; migrants vulnerable to violence, exploitation and abuse; survivors of gender-based violence, and migrants unable or unwilling to remain in host countries.Under the overall supervision of the Head of Programme and the direct supervision of the AVRR Programme Coordinator, the incumbent will be responsible for working together with beneficiaries to assess their needs, identify goals, develop an assistance plan, organize delivery of the plan, and monitor and follow up on the effectiveness of the plan in meeting the identified goalsResponsibilities Participate in efforts to identify beneficiaries eligible for IOM protection and assistance services. This may involve outreach to populations of concern, for example through community-based awareness raising sessions or assisted voluntary return and reintegration counselling sessions; responding to requests from partners to interview persons of concern; screening persons of concern in contact with IOM through protection or other programming, etc. Conduct screening and interviews with potential beneficiaries to identify protection concerns, identify protection and/or assistance needs, and/or to assess eligibility for IOM protection and assistance programmes, in line with IOM rules, standards, procedures, guidelines, forms, and templates. Inform individuals of services available from IOM or other partners, eligibility requirements for services, referral pathways, and options available to them. Maintain familiarity with available ser-vices, pathways and options to ensure accuracy of information shared. Complete intake formalities, using IOM standard intake forms, in instances where individuals are eligible for and want IOM protection and/or assistance services. Refer individuals for external services, when they are available, in instances where needs are identified but the individual is either not eligible or does not want IOM protection and/or assistance services. Conduct assessments, using and in line with relevant IOM rules, standards, procedures, guidelines, forms, and templates, to gather relevant information on individuals’ situations, needs, wishes and preferences. Based on the information gathered, develop – in consultation with the individual – a case plan that specifies the services to be provided and the objectives of the plan. Submit the plan to the case manager for approval. Directly provide – or organize for provision through referrals to other IOM units, external part",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371963144/",
    "job_id": "4371963144",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts & Finance- For Millat Properties Limited- Job ID: 1460013",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Millat Properties Limited is looking for Executive - Accounts & FinanceJob Description / ResponsibilityCompany OverviewMillat Properties Limited is a reputed and growing real estate developer company in Bangladesh. We are looking for a skilled, responsible, and hardworking professional for the position of Accounts Executive to support our accounts and finance operations.Key ResponsibilitiesMaintain daily accounts activities and record transactions properlyPrepare vouchers (Payment, Receipt, Journal) and ledger postingMaintain accounts payable and receivableHandle bank transactions and prepare bank reconciliation statementsAssist in preparing monthly financial reports and statementsEnsure proper documentation and filing of all accounts recordsAssist in audit preparation and provide necessary documentsCoordinate with internal departments for accounts-related supportEducational RequirementsMinimum B.Com / BBA (Accounting/Finance) from any recognized universityM.Com / MBA (Finance/Accounting) will be preferredExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s):Real Estate, DeveloperAdditional RequirementsMinimum 1-2 years of experience in Accounts/FinanceExperience in Real Estate/Developer Company will be highly preferredBasic knowledge of accounting rules and financial reportingProficiency in MS Excel, Word, and accounting software (ERP/Tally)Ability to prepare financial reports and reconciliationStrong analytical skill and attention to detailAbility to work under pressure and meet deadlinesHonest, responsible, and self-motivated",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369623667/",
    "job_id": "4369623667",
    "source": "linkedin",
    "company_name": "CareerWise Recruitment",
    "job_title": "Cash Treasury Operations Leader (EMEA)",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A Cash Treasury Operations Leader (EMEA) is required by CareerWise Recruitment for our Dublin based client. As Head of Treasury Operations, EMEA, you will report to the Assistant Treasurer for the company and will be responsible for ensuring that the Company has efficient and effective controls and processes over cash/ liquidity management, bank connectivity, treasury management systems, intercompany financing and bank account management across the region. You will work closely with key stakeholders within the business, cross functional partners and externally as appropriate to support and provide guidance, as well as identify and implement effective solutions from a cash management and treasury operations perspective. As a key regional leader within our Global Treasury team and a member of the EMEA Finance Leadership Team, you will work with all areas of our Group Treasury, Tax, Legal, Accounting and business partners on the Group’s continued growth and continuous improvement of our operations. Required - at least 5 years of experience within the Finance function of a publicly held global Corporation - This position will be based in Dublin, Ireland at our Global Headquarters.Role of this positionLead a high-performance Treasury team, develop competency and technical skills, inspiring continuous improvement and collaborating as a strategic partner to the business and other functionsRepresent Treasury as a member of the EMEA Finance Leadership team and drive overall engagement of EMEA Treasury OperationsLead EMEA cash management processes, cash positioning, intercompany financing and liquidity management within a continuous improvement environmentLead EMEA M&A due diligence/ closing activities/ business implementation, productivity initiatives and cross functional projects from a treasury operations perspectiveManagement of EMEA bank account structure, fee structure and maximizing operational functionality to effectively support the ongoing and future operational banking needs of the GroupManagement of EMEA loan portfolio working with appropriate stakeholders to identify financing needs, loan reporting, documentation requirements and incorporate effective tax planning considerationsContinuous improvement of KPIs, cash management and cash forecasting analysis to identify trends, opportunities, and mitigate risksIn coordination with the US Regional Treasury Manager and the APAC Treasury Manager, continue the development and management of our global treasury management systems including bank system rationalization, bank connectivity and fraud analytics and BI reportingWorking with our banking partners, SWIFT bureau, businesses and IT resources, manage the ongoing development of SWIFT, bank connectivity and compliance controlsManage and develop treasury cash management policies and procedures including the Treasury Business Operating System to ensure a strong control environmentDevelop strategies and plans to enable more effective treasury functional activities through systems and processes that result in enhanced internal controls and productivity.Provide solutions, guidance and support on treasury operational related matters to other functions and businesses.JOB REQUIREMENTSThe successful candidate must be an experienced and skilled financial executive with at least 5 years of experience within the Finance function of a publicly held global Corporation.This individual should have significant international experience in a variety of finance related issuesYou must have a track record of building trust and operating effectively within a dynamic and growth organization.The successful candidate will have a background in Treasury, Economics or Accounting on a multi- national level with an emphasis on leadership and decision making.Results-oriented leader with demonstrated ability to understand the business and the complex issues in a global Treasury organization.Excellent communicator and negotiator with demonstrated influencing skills and the ability to build and leverage internal and external alliances.This individual will be approachable, influential and capable of building trust and confidence quickly through consensus building.Proactive leader capable of taking charge while organizing and inspiring others.Strong attention to detail yet also able to see overall picture. Strong practical interests and a high level numerical ability.Unquestionable integrity and business judgment.Experience leading teams and cross-border collaboration.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368232664/",
    "job_id": "4368232664",
    "source": "linkedin",
    "company_name": "Omega Financial Management",
    "job_title": "Graduate Financial Services Associate",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Graduate Financial Services AssociateCompany: Omega FinancialLocation: Beacon Complex, SandyfordEmployment Type: Full-time, PermanentLevel: Graduate / Entry-LevelStart Date: Immediate Salary: €35-40,000 About Omega Financial Omega Financial is a specialist financial services intermediary providing tailored advice to medical, dental and other professional clients across Ireland. We focus on income protection, pension planning and long-term wealth management, delivering clear, jargon free advice and ongoing service to help clients achieve financial security and independence. Role Overview We are seeking a Graduate Financial Services Associate to join our advisory team. This is an ideal first role for a recent graduate who wants to build a career in financial planning and wealth management, with structured training, professional qualifications support, and exposure to complex client cases. You will support senior advisers in delivering high-quality advice to professionals (including medical, dental, engineering, surveying, IT, banking and legal clients), assist with research and analysis, and help maintain excellent client relationships. Key Responsibilities Client Support & Advice Preparation Assist advisers in gathering and analysing client information (income, assets, liabilities, pensions, protections and investments). Prepare financial planning reports, suitability letters and recommendation summaries under supervision. Help design and model pension, protection and investment solutions in line with client goals and risk profiles. Support implementation of advice: application forms, documentation, follow-ups with providers and clients. Research & Analysis Conduct product and market research on income protection, pensions, investments and business protection solutions. Compare provider offerings, terms, charges and performance to support suitable recommendations. Monitor regulatory and market developments relevant to our professional client base. IT & CommunicationsSupport the Marketing Manager in the implementation of digital initiatives,Help manage internal systems, ensuring data integrity, accessibility and efficient workflow.Assist in maintaining and improving internal databases and CRM tools.Marketing & Market ResearchConduct detailed market research to identify target audiences and industry trends.Analyse market data and client segments to inform product positioning, service development, and communication strategies.Assist with digital marketing initiatives, including social media planning and performance monitoring. Client Relationship Management & Administration Maintain accurate and up to date client records and files in line with compliance standards. Prepare meeting packs, review documents and follow-up correspondence. Respond to routine client queries in a timely, professional and compliant manner. Compliance & Professional Standards Work within all relevant regulatory requirements and internal policies. Ensure documentation, disclosures and records meet compliance and audit standards. Proactively participate in training, exams and CPD to build technical knowledge and advisory skills. Candidate Profile Education Degree in a relevant discipline such as: Economics, Finance, Business, Accounting, Actuarial Science, or similar. Strong academic record with evidence of analytical and quantitative ability. Skills & Attributes Strong numerical and analytical skills with attention to detail and accuracy. Clear, professional communication skills – able to explain financial concepts in a straightforward, jargon free manner. High level of integrity, discretion and a strong sense of responsibility. Organised and dependable, able to manage multiple tasks and deadlines. Proactive, curious and eager to learn with a genuine interest in pensions, investments and financial planning. Comfortable working in a regulated, process driven environment. Experience Internship, part-time work or project experience in financial services, banking, accounting or similar is an advantage but not essential. Professional Qualifications Strong interest in obtaining relevant professional qualifications (e.g. QFA or equivalent). Study support and mentoring will be provided. What We Offer Comprehensive training and mentoring from highly experienced pension and wealth management professionals. Support professional exams and continuous development. Exposure to a high calibre professional client base (medical, dental and other professionals). Opportunity to build a long-term career in financial planning and wealth management within a specialist intermediary. Competitive salary and benefits, commensurate with experience and qualifications. How to Apply Please send your CV and a brief cover letter outlining your interest in financial planning and why you would like to join Omega Financial to: aideen@omegafinancial.ie",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3968270460/",
    "job_id": "3968270460",
    "source": "linkedin",
    "company_name": "(For Hatim Group)",
    "job_title": "Executive (Cost Accountant)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346069232/",
    "job_id": "4346069232",
    "source": "linkedin",
    "company_name": "Accounts (For GCE International Inc.)-Job ID: 1442677",
    "job_title": "Executive",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4217028856/",
    "job_id": "4217028856",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "T24 Securities & Treasury Business Consultant",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375845110/",
    "job_id": "4375845110",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375825960/",
    "job_id": "4375825960",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4044647912/",
    "job_id": "4044647912",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "MetLife Bangladesh hiring Manager, Tax in Dhaka ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4232258722/",
    "job_id": "4232258722",
    "source": "linkedin",
    "company_name": "Job ID ...",
    "job_title": "Accounts & Finance (For A Reputed Group of Company)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3719930270/",
    "job_id": "3719930270",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ADA নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340069581/",
    "job_id": "4340069581",
    "source": "linkedin",
    "company_name": "Elvaridah",
    "job_title": "Accountant at Elvaridah Limited",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355543208/",
    "job_id": "4355543208",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Cum Admin Officer (Singapore Based) - For BSM Group - Job ID: 1452510",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365917852/",
    "job_id": "4365917852",
    "source": "linkedin",
    "company_name": "Solaso Careers",
    "job_title": "Key Account Executive (Ecommerce)",
    "location": "Ho Chi Minh City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355263202/",
    "job_id": "4355263202",
    "source": "linkedin",
    "company_name": "dubizzle Egypt",
    "job_title": "Senior Sales Account Manager-New Cairo",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4172376267/",
    "job_id": "4172376267",
    "source": "linkedin",
    "company_name": "INQUIRER.net",
    "job_title": "Account Executive",
    "location": "Manila, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366725583/",
    "job_id": "4366725583",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "Tax & Legal Services - ITS/M&A - Deals Tax - Senior Associate (Abu Dhabi)",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367315382/",
    "job_id": "4367315382",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "Tax & Legal Services - International Tax/ M&A - Senior Associate (Qatar)",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368739511/",
    "job_id": "4368739511",
    "source": "linkedin",
    "company_name": "MAK Technologies LLC",
    "job_title": "SAP IAG Consultant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366502472/",
    "job_id": "4366502472",
    "source": "linkedin",
    "company_name": "Confidential Careers",
    "job_title": "Head of Card Operations",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365675774/",
    "job_id": "4365675774",
    "source": "linkedin",
    "company_name": "Groupe Sani-Tech",
    "job_title": "administrative assistant",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365661448/",
    "job_id": "4365661448",
    "source": "linkedin",
    "company_name": "Reliance Health",
    "job_title": "Administrative Officer (RFC PortHarcourt)",
    "location": "Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333709018/",
    "job_id": "4333709018",
    "source": "linkedin",
    "company_name": "SGS",
    "job_title": "Global P2P Finance Business Analyst (Oracle Fusion)",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4291940305/",
    "job_id": "4291940305",
    "source": "linkedin",
    "company_name": "JR286",
    "job_title": "Human Resources Manager",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341590771/",
    "job_id": "4341590771",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "PwC - Risk - Internal Audit Senior Associate - Egypt Hub",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352762960/",
    "job_id": "4352762960",
    "source": "linkedin",
    "company_name": "DP World",
    "job_title": "Assistant Finance Manager (Logistics)",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The Assistant Manager is responsible for managing and overseeing all accounting and finance operations of DPW Vietnam. This role ensures compliance with local regulations and corporate policies, supports strategic decision-making, and collaborates closely with global shared services and internal/external stakeholders to drive financial efficiency and governance.Key Responsibilities:Financial Management & OversightManage and oversee all accounting and finance activities, ensuring accuracy, timeliness, and compliance.Control revenue, costs, accounts receivable/payable, and cash flow to maintain financial health.Team LeadershipLead, allocate tasks, and supervise the accounting team (approximately 4 members).Foster team development and ensure adherence to best practices.Reporting & CompliancePrepare, review, and analyze monthly, quarterly, and annual financial statements and management reports.Ensure compliance with Vietnam Accounting Standards (VAS), tax regulations, and company policies.Handle tax finalization, inspections, and liaise directly with tax authorities.Stakeholder CollaborationWork closely with the Head Office and overseas partners on accounting and financial matters.Collaborate with the Global Shared Services team to streamline processes and align with group standards.Engage with internal and external stakeholders, including auditors, banks, vendors, and regulatory authorities.Governance & Process ImprovementSupport internal control, compliance, and group-level financial reporting requirements.Drive process improvements and contribute to strategic initiatives for operational excellence.Qualifications, Skills, and Experience:Education: Bachelor’s degree in Accounting, Finance, or Auditing.Minimum 8 years of experience in a Finance Manager/Chief Accountant role, ideally within FDI companies. Direct experience in the logistics or forwarding industry is highly preferred.Expert knowledge of Vietnam Accounting Standards (VAS) and local tax regulations, with a proven track record in tax finalization and managing tax inspections.Solid experience coordinating with independent auditors for annual filings.Proficient in ERP/Accounting software and MS Excel; a strong working knowledge of IFRS is a significant advantage.Good command of English for professional communication, including reporting and meetings.Demonstrated leadership, analytical thinking, high integrity, and the resilience to perform under high pressure.Equal Employment Opportunity (EEO)DP World is committed to the principles of Equal Employment Opportunity (EEO). We strongly believe that employing a diverse workforce is central to our success and we make recruiting decisions based on your experience and skills. We welcome applications from all members of society irrespective of age, gender, disability, race, religion or belief.By submitting your resume and application information, you authorize DP World to transmit and store your information in the world-wide recruitment database, and to circulate that information as necessary for the purpose of evaluating your qualification for this or other job vacancies.About DP World DP World is reshaping the future of global trade to improve lives everywhere. Operating across six continents with a team of over 125,000 employees, we combine global infrastructure and local expertise to deliver seamless supply chain solutions. From Ports and Terminals to Marine Services, Logistics and Technology, we leverage innovation to create better ways to trade, minimising disruptions from the factory floor to the customer’s door.In Asia Pacific, DP World employs over 15,000 people across 22 geographies. We operate 17 ports and terminals, complemented by a comprehensive suite of end-to-end supply chain solutions - to connect the region to the rest of the world. WE MAKE TRADE FLOW Disclaimer:There may be fraudulent job offers and recruitment schemes on social media and job boards or communicated by unsolicited emails. DP World will never request any payment or sensitive financial information from job applicants. To explore genuine career opportunities with DP World, please apply only through our official careers page or trusted platforms like LinkedIn, where we are a verified employer. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321407424/",
    "job_id": "4321407424",
    "source": "linkedin",
    "company_name": "Transparency Business Services",
    "job_title": "Management Accountant",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365948043/",
    "job_id": "4365948043",
    "source": "linkedin",
    "company_name": "Morgan Philips Group",
    "job_title": "Finance Manager / Senior Finance Manager - MY874510",
    "location": "Petaling, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363487799/",
    "job_id": "4363487799",
    "source": "linkedin",
    "company_name": "PKF Malaysia",
    "job_title": "Manager - Internal Audit & Governance Advisory",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339394473/",
    "job_id": "4339394473",
    "source": "linkedin",
    "company_name": "PwC Middle East",
    "job_title": "Assurance - Core Assurance - Manager (Non FS) - Dubai, UAE",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355843415/",
    "job_id": "4355843415",
    "source": "linkedin",
    "company_name": "Innovative Services Company",
    "job_title": "Human Resource Manager",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359828819/",
    "job_id": "4359828819",
    "source": "linkedin",
    "company_name": "GetSolar",
    "job_title": "Venture Capital Investment Analyst Internship (Start Q1 2026)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356141397/",
    "job_id": "4356141397",
    "source": "linkedin",
    "company_name": "Travelodge Hotels Asia",
    "job_title": "Finance Manager",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364279809/",
    "job_id": "4364279809",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Accounting Manager - Global Services Company",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The Accounting Manager (Finance & Administration) will oversee all accounting and finance operations, ensuring compliance with financial regulations and accurate reporting. This role is based in Jakarta, Indonesia and requires a detail-oriented individual with expertise in financial managementClient DetailsOur client is reputable global services firm, known for its robust business operations and focus on delivering excellence. They maintain a substantial presence in their market and are committed to fostering professional growth and expertise.DescriptionManaging and overseeing daily accounting operations and financial reporting.Ensuring compliance with local tax regulations and financial policies.Preparing financial statements, budgets, and forecasts.Analysing financial data to identify trends and provide insights for decision-making.Monitoring cash flow and managing financial risks effectively.Collaborating with internal and external auditors as required.Leading and mentoring the accounting team to achieve departmental goals.Implementing and improving financial processes and systems.ProfileAt least a Bachelor's degree in Accounting, Finance, or a related field. Master's degree is a plus.7-10+ years of experience, ideally with prior Big 4 background and experience in a global environment.Professional qualifications such as CPA, CA, or equivalent.Strong knowledge of financial regulations and reporting standards.Proficiency in accounting software and financial tools.Excellent analytical and problem-solving skills.Strong English communication and interpersonal skills.Job OfferCompetitive compensation package based on assessment.Opportunities for career growth and development.This is an excellent opportunity to advance your career within the global services industry. If you are based in Indonesia and ready to take on a new challenge, we encourage you to apply!To apply online please click the 'Apply' button below. For a confidential discussion about this role please contact Stella Chandra on +622129588820. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361478021/",
    "job_id": "4361478021",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant/Deputy Manager, VAT & Taxation - For A Leading Textile & RMG Group at Chattogram - Job ID: 1457397",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357458599/",
    "job_id": "4357458599",
    "source": "linkedin",
    "company_name": "GRAND FOOD DISTRIBUTION SRL",
    "job_title": "Contabil / Operator date – Junior & Medium",
    "location": "Afumaţi, Ilfov, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358530497/",
    "job_id": "4358530497",
    "source": "linkedin",
    "company_name": "Orbiss Inc.",
    "job_title": "Tax Associate - Corporate",
    "location": "Casablanca, Casablanca-Settat, Morocco",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "As a Tax Associate you will be responsible for: Preparation of corporate and partnership tax returns for US businesses under the supervision of senior staff. The portfolio includes companies with revenues ranging from $0-$100M, across a variety of industries including Tech Start-Up, Pharmaceuticals, Marketing, Consumer Products, and our personal favorite, French Wine and Desserts 😊 Preparation of state and local nexus analysis and calculation of apportionment factors. Calculation of federal taxable income, and identification of book-to-tax differencesPreparation of international tax forms, including 5472, 5471, 8865, 8858, 1042-S, 114 (no worries, we will show you the ropes)RequirementsA bachelor degree in accounting. 1-2 years of experience in a mid-sized CPA firm, preferrable with exposure to tax. Excellent organizational and communication skills, with the ability to manage multiple deadlines and collaborate effectively with both clients and team members. Ability to work independently while maintaining a strong team spirit. Ability to meet deadlines and proactively communicate in advance if challenges arise. High level of integrity and confidentiality in handling client and company information. Strong interest in US tax Proficiency in French and English along with eligibility to work in Morocco. Occasional business travel within Morocco may be required during onboarding . BenefitsCompetitive compensation package Strong opportunities for continuous learning and professional growth A collaborative and inspiring team culture that encourages innovation Orbiss is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365375365/",
    "job_id": "4365375365",
    "source": "linkedin",
    "company_name": "RBC",
    "job_title": "Analyst, High Risk Client Management",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363391608/",
    "job_id": "4363391608",
    "source": "linkedin",
    "company_name": "GİZLİ",
    "job_title": "Bordro ve Özlük İşleri Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368102713/",
    "job_id": "4368102713",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "Tax & Legal Services - International Tax/M&A - Director (Qatar)",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365584894/",
    "job_id": "4365584894",
    "source": "linkedin",
    "company_name": "COREcruitment Ltd",
    "job_title": "Payroll Operations Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Payroll Operations ManagerToronto, ONSalary: $100,000 + 10% annual bonusOne of our clients in the beauty and wellness industry is seeking a Payroll Operations Manager to oversee payroll operations across the US and Canada. This role will manage payroll processes using Workday and other systems, ensuring compliance with local regulations while supporting system implementation, testing, and change management. The Payroll Operations Manager will drive process standardization, maintain data integrity, and deliver a seamless employee experience.Responsibilities:Own and oversee the end-to-end payroll process across North America, ensuring accuracy, compliance, and timely delivery for all employees.Manage relationships with external payroll providers, monitoring service quality, , issue resolution, and adherence to processes.Lead the migration from local payroll systems to a global payroll solution, including data migration, testing, parallel runs, and post-go-live stabilization while maintaining local compliance.Ensure compliance with all labor, tax, and social security regulations, oversee statutory filings, audits, and maintain robust payroll controls and documentation.Act as the primary contact for HR Business Partners and key stakeholders, addressing payroll-related questions, escalations, and complex cases.Maintain HRIS and payroll data integrity, oversee system integrations, and drive continuous process improvement, automation, and standardization.Partner with Finance and HR teams on payroll reporting, reconciliations, variance analysis, and data-driven insights to support leadership decision-making.Qualifications:Bachelor’s or Associate degree in Accounting, Finance, Human Resources, or a related field; payroll certifications such as CPP (U.S.) or CIPP/E are a plus.Experience with global payroll or HRIS systems, including Workday (preferred), ADP WorkforceNow, SAP, or similar platforms.Advanced Excel skills and familiarity with reporting or analytics tools such as Power BI or Tableau.Strong knowledge of local labor, tax, and payroll legislation.Proven ability to manage payroll operations across multiple countries, ensuring compliance, accuracy, and process efficiencyIf you are keen to discuss the details further, please apply today or send your cv to Nas at COREcruitment dot com –Sarah@corecruitment.comDue to the volume of application, we may not be able to provide feedback to all applicants. If you haven’t heard from us within 2 weeks, please consider your application unsuccessful. Nevertheless, feel free to reach out",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357415014/",
    "job_id": "4357415014",
    "source": "linkedin",
    "company_name": "Winchesters",
    "job_title": "Senior Investment Associate",
    "location": "North York, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4328944786/",
    "job_id": "4328944786",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Executive - Accounts Receivable & Sales",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company Name: Giant GroupLocation: DhakaJob Type: Full-TimeWorkplace Type: On-SiteJob ID: IJOB202500587Job Summary:﻿The Executive - Accounts Receivable & Sales will be responsible for managing the company’s receivables cycle, ensuring accurate billing, timely collections, dealer account reconciliation, and maintaining proper documentation for agro-related sales, distribution, and credit operations. The role requires strong coordination with sales, distribution hubs, cold storage, and retail channels to maintain healthy cash flow and minimize outstanding dues.Job ResponsibilitiesInvoicing & BillingPrepare and issue accurate invoices for agro products including seeds, potatoes, fertilizers, pesticides, and retail products.Ensure invoices are aligned with delivery challans, dealer orders, and pricing approvals.Maintain invoice tracking logs for all regions and distribution hubs.Payment ProcessingRecord and reconcile customer payments on time (cash, bank transfers, cheques, mobile banking).Post receipts into the accounting system (ERP/QuickBooks/Tally).Collections & Follow-UpFollow up regularly with dealers, distributors, and corporate clients on overdue payments.Send payment reminders and ensure timely collection to minimize outstanding balances.Maintain region-wise collection status reports.Record KeepingMaintain organized and updated accounts receivable ledgers.Record all sales, payments, credit notes, debit notes, and adjustments accurately.Account ReconciliationReconcile customer accounts monthly and verify all transactions.Identify discrepancies such as short payments, unadjusted invoices, or wrong postings and resolve them quickly.Coordinate with the sales team to verify dealer claims and deductions.ReportingPrepare daily, weekly, and monthly AR reports including:-Ageing reportDealer-wise outstanding summaryCollection performanceSales vs. collection analysisGenerate monthly debtor ageing and credit risk reports.Provide ad-hoc reports for management when needed.Credit ManagementAssist in evaluating dealer credit worthiness and recommend credit limits based on payment history.Track credit utilization and highlight high-risk overdue accounts.CoordinationWork closely with:-Sales team (dealer follow-up & dispute resolution)Distribution hubs & warehouse (delivery verification)Retail operations (POS reconciliation & daily sales reports)Cold storage units (storage bills, processing charges)Resolve billing issues and ensure smooth financial coordination among departments.Compliance & DocumentationMaintain proper documentation for VAT challans, delivery challans, discount approvals, and credit note justifications.Support internal and external audit queries related to receivables.Process ImprovementSuggest improvements in AR processes, collection tracking, and documentation systems.Ensure updated AR data in ERP/QuickBooks/Tally systems.About The Job Experience: 1 to 3 years Education: Bachelor of Business Administration (BBA) in Accounting, Master of Business Administration (MBA) in Accounting, CA-CC completed will be given preference. Skills: Accounting Last Date of Application: 31 January 2026",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324662589/",
    "job_id": "4324662589",
    "source": "linkedin",
    "company_name": "ContourGlobal",
    "job_title": "AP Accountant",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Sofia, BG, 1000ContourGlobal, a KKR Company, led by CEO Antonio Cammisecra, is an established Independent Power Producer (IPP) developing, acquiring, and operating electricity generation and storage assets worldwide. The company currently manages 5.3 GW of installed capacity across different power generation technologies and asset categories, with an additional 1 GW of renewables under construction and a further 9.8 GW under development. The operational footprint of the company extends to 18 countries across Europe, Africa, Asia, North and South America. The company has committed to speed up the decarbonization of its portfolio with a sustainable transition of its thermal fleet, the repowering of existing renewable assets and the organic development of new renewable projects. ContourGlobal boasts 20 years of a strong collaboration with communities, institutions, and customers that benefit from its electricity supply through long-term contracts or innovative PPAs, coupled with energy management solutions.We are looking for anAP AccountantSofia, BulgariaJob SummaryAs AP Accountant, you will join our Finance team! In this role, you will report to AP Team Leader and will have the opportunity to work closely with the GL Accountants and Finance Management.. Join us to drive the right power forward and make clean energy the natural choice for all!Key ResponsibilitiesEnsure timely and accurate booking of Accounts Payable invoices in SAPVerify proper coding of AP invoices in accordance with company policiesPrepare and review payment proposals to ensure timely vendor paymentsEnsure vendors are paid accurately and on scheduleReconcile GR/IR accounts and vendor statements to maintain accurate financial recordsManage the AP monthly cut-off process to ensure proper period-end reportingMonitor Accounts Payable aging reports and provide detailed explanations as neededRespond promptly and professionally to vendor inquiriesSupport General Ledger accounting and Finance Management during the monthly close processEnsure compliance with internal controls and assist in preparing required supporting documentationGenerate ad-hoc reports and perform analyses as requested by Corporate, Treasury, or Tax departmentsQualifications And SkillsYour profile is a natural match if you have:A Bachelor’s or Associate’s degree in Accounting or Business1 to 2 years of experience in Accounts Payable (considered an advantage)Fluency in English, with other language skills seen as a plusProven experience using SAP (considered an advantage)A proactive mindset with strong attention to detailProficiency in Microsoft Excel, Word, and general data processing toolsExcellent communication skills, both verbal and writtenStrong time management skills and the ability to handle multiple priorities effectivelyOur Values«We» is our greatest assetWe respect and protect the environmentWe are doers, committed to doing things rightWe act with integrity and transparencyWe think and act like entrepreneursWorking @CG:We offer local benefits and WFH policy.As a globally integrated team, we push boundaries, work collaboratively, and remain agile in the pursuit of excellence. With an entrepreneurial mindset, we encourage initiative and innovation. At ContourGlobal you are an employee, and you are also an owner. Our Employee Ownership Program allows our employee-owners to make a difference and drive the right power forward and make clean energy the natural choice for all!We foster a culture where individuals are empowered to succeed, contribute and shape the future of sustainable energy.Cross-border collaboration shapes our way of working: our diverse workforce reflects the multicultural environment we embrace every day.We offer a competitive compensation package: we believe in meritocracy and rewarding meaningful contributions.We enjoy making the most of our shared spaces to foster teamwork and collaboration. At the same time, our flexible working policy allows us to prioritize results while supporting wellbeing and a healthy work-life balance.Interested in joining our company?We know that skills and experience come in different forms, and we value diverse perspectives.If you’re excited about this role but you think you still need to learn some of the required skills, we’d still love to hear from you. You are much more than your CV, so come as you are and tell us who you aspire to become! The most important skills are collaboration, respect, trustworthiness and execution. So go ahead—apply, and let’s contribute to the new energy transition together!ContourGlobal provides equal employment opportunities and maintains a diverse workforce that reflects the rich environment of the society we live in and markets we operate.About ContourglobalContourGlobal, a KKR Company, led by CEO Antonio Cammisecra, is an established Independent Power Producer (IPP) developing, acquiring, and operating electricity generation and storage assets worldwide. The company currently manages 5.3 GW of",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370326052/",
    "job_id": "4370326052",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Employee Scheduling Specialist with English",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "wherewework.bg on behalf of:Астреа Рикрутмънт ЕООДWe’ve been turning job searches into exciting new beginnings for 18 years! With officesin Bulgaria and Serbia, we connect top talent with leading Bulgarian and internationalcompanies. We believe in helping people grow into their best selves, and our ever-growingnetwork of happy candidates and clients is what drives us forward. Let’s shape the futuretogether!For one of our clients – a leading software development company and award-winning gameprovider in the casino industry, creating immersive and innovative gaming experiences as partof an international tech group, we are on a lookout for confident and energetic people for therole – Employee Scheduling Specialist with English.Essential Duties and Responsibilities:Coordinate and oversee work schedules, table rotations, and attendance in Operations;Partner with HR and Team Leads to manage time-off requests and ensure full staffing;Prepare daily staffing reports and resolve any scheduling conflicts;Plan and update staffing coverage for all departments and organize shift rotations;Track attendance and ensure team compliance with schedules and regulations;Handle admin tasks from management and collaborate with Operations teams for smooth workflow. Requirements:Strong organizational skills with great attention to detail;Degree in Business, HR, Law, or related field is an advantage;Skilled in Microsoft Office and familiar with scheduling software;Able to work independently and juggle multiple tasks;Excellent communication skills in English;At least 6 months’ experience in a similar role is a plus. Our client offers:Competitive salary and additional bonuses;Stable and secure job and paid annual leave days;Private health insurance;Paid training and ongoing learning opportunities for all employees;Opportunities for career growth and development;Work in a friendly environment that values skills and collaboration. If you’re excited and confident that you’re the perfect fit, we’d love to hear from you! Takethe next step by sending us your detailed resume in English at your earliestconvenience. (Don’t forget to include the reference number MA_)We’ll be in touch promptly with candidates whose profiles closely match our requirements.Your privacy is our priority—rest assured that all information is handled in full compliancewith the Commission for the Protection of Personal Data (Астреа Рикрутмънт ЕООД, license No 1809).",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370306968/",
    "job_id": "4370306968",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Business Analyst",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "wherewework.bg on behalf of:Employers from SofiaInterested in this role? You’re in the right place.To move forward, simply upload your CV to wherewework, and we’ll help connect you with real job openings from real companies, including the position you’re viewing right now.Here’s how it works: Upload your CV onceYou can do it instantly by clicking the \"Apply\" button in this window. It only takes a moment, and it allows us to match your profile with relevant opportunities. We match you with real roles that fit your experienceWhen companies open positions aligned with your skills, we’ll identify the best opportunities for you. You stay fully in controlBefore your CV is ever shared, we’ll notify you with the exact job title and company name, and ask for your confirmation. Only confirmed applications are sent to employersOnce you approve, the employer will receive your application and may contact you directly to continue the hiring process.While you're here, explore wherewework to discover what it’s really like to work at different companies, through interview experiences, employee reviews, and community feedback.Thanks for being part of wherewework!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364709266/",
    "job_id": "4364709266",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Finance Controller (For Tiger Battery Co. Ltd.) - Job ID: 1459900",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Tiger Battery Co. Ltd. is looking for Finance ControllerJob Description / ResponsibilityFinancial Reporting & Closing: Preparing monthly, quarterly, and annual financial statements, including balance sheets and profit and loss statements.Accounting Operations: Overseeing daily functions such as accounts payable/receivable, general ledger, and payroll.Compliance & Risk Management: Ensuring adherence to financial laws, tax requirements, and internal policies.Budgeting & Analysis: Developing budgets, forecasting future performance, and analyzing budget variances to improve financial performance.Internal Controls: Designing and implementing controls to ensure data integrity and safeguard company assets.Audit Coordination: Managing internal and external audits to ensure accuracy.Educational RequirementsBachelor of Business Administration (BBA) in Accounting & Information SystemBachelor of Business Administration (BBA)Bachelor’s Degree in Accounting, Finance, or other related field.CPA or CMA is highly preferred.Skills Required: Supervision, Communication, odoo, Team Management and leadership, Good in advance execel, Strong analytical and problemsolving skills.Experience Requirements5 to 7 year(s)The applicants should have experience in the following business area(s): Importer,Technical Infrastructure,PowerAdditional RequirementsFluent in chinses & english languages.Job LocationDhaka (GULSHAN 1)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364797069/",
    "job_id": "4364797069",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Finance and Admin Officer - For Breaking the Silence (BTS) - Job ID: 1460007",
    "location": "Satkhira District, Khulna, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372894747/",
    "job_id": "4372894747",
    "source": "linkedin",
    "company_name": "Unilever",
    "job_title": "Manager - Financial Planning & Analysis",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365333344/",
    "job_id": "4365333344",
    "source": "linkedin",
    "company_name": "Noel Group",
    "job_title": "Commercial Administrator",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Commercial Administrator Location: Dublin 15 Salary: €40,000 to €45,000Noel Group is recruiting a Commercial Administrator to support a busy Commercial Team delivering construction and utilities projects across Ireland. This is an office based role in Dublin 15 with regular interaction across internal project teams and external subcontractors.Key responsibilities • Provide day to day commercial and administrative support across multiple live projects • Manage subcontractor packages, including documentation, trackers, variations, and records • Process high volumes of invoices and payments for subcontractors, suppliers, and consultants • Support monthly reporting, budgets, cost tracking, and reconciliations • Maintain accurate commercial files and project documentation • Prioritise multiple tasks and deadlines while working independentlyIdeal background • 2 plus years experience in a similar commercial admin or accounts payable focused role • Strong experience with payments, invoice processing, and high volume administration • Experience in construction, utilities, civils, or infrastructure is a strong advantage • Highly organised, detail focused, able to manage multiple workstreams with minimal supervisionWhy this opportunity • Strong job security through major long term contracts • Growing environment with a strong pipeline of work • Exposure to multiple projects and stakeholders within a commercial function",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359584003/",
    "job_id": "4359584003",
    "source": "linkedin",
    "company_name": "Currenxie",
    "job_title": "Senior Operations Analyst (Payments)",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "IntroductionCurrenxie is a financial technology company for borderless businesses. Founded in 2014, our Global Account platform offers businesses of all sizes a single finance app for global growth. Features include multi-currency wallets, on-demand virtual bank collection accounts, worldwide payments, currency exchange, and multi-currency Visa cards. We value innovative technology, user experience, and service.We are an ambitious and rapidly growing company led by an entrepreneurial and collaborative team. We offer our people an opportunity to be part of building a new financial services platform for a borderless world, and to learn and progress in a friendly, dynamic and multi-cultural environment.We are currently recruiting for our European headquarters located in Dublin, from which Currenxie is to provide E-Money services across the Extended European Area. The successful candidate will have the exciting opportunity to join the team as we expand our operations across Europe, and contribute to the development of our European presence.Your role & responsibilitiesMonitoring of Intraday inward funds processing streamsPerforming bank reconciliations and resolving discrepanciesProactive trouble shooting in new and existing marketsClarification of client / front office instructionsHandover and receipt of Operations activities within Currenxie groupMonitoring client beneficiary instructions within our validation engineMonitoring and interacting with outward payment processing flows when required within our payments engineSupporting stakeholders in responding to Payment enquiries, Requests for Information, and investigationsExceptions management for all non-standard transactionsAssist the trading team with international treasury managementSupport Operations projects, processes, and initiativesYour skills and experienceMinimum 3 years of working experience in payment operations or settlement roles in Europe, preferably within fintech, financial services, and/or bankingKnowledge of EU, EEA, and global payment systems would be a plusDetail-oriented with a strong delivery mindsetAble to independently complete deliverables with minimal supervisionComfortable with uncertainties and challengesEnjoys working within a multi-jurisdictional and lean team with high flexibilityPrior knowledge and exposure to finance service industry is requiredJoin our team as a Senior Operations Analyst and help us continue our growth and success in the fintech industry. Apply today!Please note that we are unable to provide visa sponsorship for this position.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371950028/",
    "job_id": "4371950028",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Developer Relationship (JO-FAVP): Retail Banking (Home Loan)- For National Credit and Commerce Bank PLC- Job ID: 1459595",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "National Credit and Commerce Bank PLC is looking for Developer Relationship (JO-FAVP): Retail Banking (Home Loan)Job Description / ResponsibilityIdentify, evaluate, onboard and manage real estate developers and housing projects under approved enlistment policies.Develop and execute a developer engagement strategy aligned with NCC Bank’s Home Loan business plan.Achieve annual sourcing targets and budget goals through strategic partnerships, performance tracking and branch coordination.Coordinate with Credit Administration, Legal and Risk units for project appraisal, verification and compliance.Maintain and update a developer and project database, including sourcing history, sales performance and financial strength.Organize developer meets, fairs and joint promotional campaigns to enhance business acquisition.Monitor developer/TPA performance and submit regular MIS and performance reports to Management.Liaise with branches and developer offices for project tie-ups, lead management, documentation and customer support to ensure conversion targets are met.Conduct field visits and basic project verification as part of target-driven sourcing activities.Collect market intelligence on competitor developer tie-ups and recommend growth opportunities.Perform any other duties as assigned by the Supervisor or Bank Management.Educational RequirementsBachelor/HonorsMaster of Business Administration (MBA)Master of Business Management (MBM)MastersMBA / MBM / Master’s / Four-year Bachelor’s degree (preferably in Business) from UGC-approved universities.Minimum 16 years of schooling with no third class in any academic record.Experience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):BanksAdditional RequirementsMinimum 5 years of banking experience, including 3 years in Retail Home Loan or Developer Finance.Minimum 3 years of experience in retail loans, mortgage or real estate marketing.Proficiency in MS Excel, PowerPoint, and data presentation.Strong communication, coordination, and stakeholder management skills.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366478158/",
    "job_id": "4366478158",
    "source": "linkedin",
    "company_name": "MUFG Investor Services",
    "job_title": "Senior Manager, Fund Accounting- Private Equity",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371050126/",
    "job_id": "4371050126",
    "source": "linkedin",
    "company_name": "Hays",
    "job_title": "Senior Property Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role: Senior Property AccountantDuration: Permanent Full-TimeLocation: Toronto, ONWorking Conditions: Hybrid, 4 Days in Office , 1 Days WFHSalary: $85,000–$100,000 + 3 weeks’ vacationYour new companyYou will be joining a well-established, full-service real estate investment firm with a strong presence in Canada’s major metropolitan areas. The organization specializes in real estate private equity investment funds, investment management, and property services, and is known for its collaborative culture and commitment to excellence. With a history spanning over 50 years, the company values experience, innovation, and long-term success.Your new roleAs a Senior Property Accountant, you will be responsible for full-cycle property accounting for a portfolio of commercial and industrial properties. Reporting to the Assistant Controller, you will prepare monthly financial statements, maintain working papers, reconcile accounts, and manage tax remittances. You will also oversee CAM and tax recoveries, assist with annual budgets, liaise with auditors, and review the work of junior accountants. This role involves close collaboration with leasing, acquisitions, and operations teams.What you'll need to succeed2–5 years of experience in commercial property management accounting.Strong organizational, technical, and communication skills.Proficiency in Excel and familiarity with accounting systems; MRI or Yardi experience is an asset.Ability to work effectively with property management and site staff.A proactive attitude and willingness to learn new concepts in the monthly accounting cycle.What you'll get in returnA supportive and respectful work culture that values diversity and professional growth.Opportunities to develop your skillset and advance your career within an internationally minded organization.Competitive compensationWhat you need to do nowIf you meet all the requirements for this role, please apply directly. Thank you in advance for your interest. We regret that we can only respond to candidates chosen for an interview.This posting is for an existing vacancy with the organization.AI may be used in the screening process for this role.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3129378468/",
    "job_id": "3129378468",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Citi hiring Finance Manager in Dhaka, Dhaka, Bangladesh",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4040497969/",
    "job_id": "4040497969",
    "source": "linkedin",
    "company_name": "Netcom trade international নিয়োগ",
    "job_title": "Analyst",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295255949/",
    "job_id": "4295255949",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Sr. Executive- Payroll (For A Largest Group of Companies)-Job ID",
    "location": "Gulshan, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371790713/",
    "job_id": "4371790713",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Ericsson নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3772273618/",
    "job_id": "3772273618",
    "source": "linkedin",
    "company_name": "MN TRADE LIMITED নিয়োগ",
    "job_title": "Accountant",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]