[
  {
    "url": "https://www.linkedin.com/jobs/view/4354232680/",
    "job_id": "4354232680",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Revenue Accounting Manager - Software Industry, IFRS 15, NetSuite",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367080169/",
    "job_id": "4367080169",
    "source": "linkedin",
    "company_name": "Thermo Fisher Scientific",
    "job_title": "Cost Controller - Engineering Planning & Analytics",
    "location": "Whitby, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358881239/",
    "job_id": "4358881239",
    "source": "linkedin",
    "company_name": "AIR (Advanced Inhalation Rituals)",
    "job_title": "Finance Manager, MEAA - Financial Reporting",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366320013/",
    "job_id": "4366320013",
    "source": "linkedin",
    "company_name": "MNRB Group",
    "job_title": "Assistant Vice President Finance",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366687960/",
    "job_id": "4366687960",
    "source": "linkedin",
    "company_name": "Collins Aerospace",
    "job_title": "Accountant",
    "location": "Kelang, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356057457/",
    "job_id": "4356057457",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "A&A - Amplify Program Audit & Assurance",
    "location": "WP. Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368625479/",
    "job_id": "4368625479",
    "source": "linkedin",
    "company_name": "Teknokon Grup",
    "job_title": "Muhasebe Uzmanı",
    "location": "Kartal, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366725725/",
    "job_id": "4366725725",
    "source": "linkedin",
    "company_name": "IFS",
    "job_title": "Record to Report Accountant",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324677083/",
    "job_id": "4324677083",
    "source": "linkedin",
    "company_name": "Morgan Stanley",
    "job_title": "Regulatory Reporting Professional",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356520056/",
    "job_id": "4356520056",
    "source": "linkedin",
    "company_name": "ANDA Present Group",
    "job_title": "Bérszámfejtő és munkaügyi ügyintéző",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "🧮 Ha magabiztosan eligazodsz a bérszámfejtés és a munkaügy területén, precízen és önállóan, felelősségteljesen végzed a napi bér- és munkaügyi feladatokat, valamint szívesen tartasz kapcsolatot kollégákkal, jelentkezz budapesti üzemünkbe BÉRSZÁMFEJTŐ ÉS MUNKAÜGYI ÜGYINTÉZŐ pozíciónkra!Amit nyújtunk neked:Magyar tulajdonú cégünknél stabil, hosszú távú munkalehetőséget, határozatlan idejű munkaviszonnyalKorszerű, igényes irodai munkakörnyezetetTámogató légkört, emberközpontú vezetést és összetartó, jó hangulatú csapatotVersenyképes juttatási csomagot100%-os utazási költségtérítést távolsági tömegközlekedés esetén, valamint 30 Ft/km üzemanyag-támogatást autós munkába járás eseténHome office lehetőséget próbaidőszakot követőenA munka-magánélet egyensúlyátKedvezményes belső vásárlási lehetőséget A pozícióhoz kapcsolódó főbb feladatok: Havi és hóközi bérszámfejtési feladatok ellátása,Munkaügyi feladatok ellátása,Adatszolgáltatási-, bevallási- és jelentési kötelezettségek teljesítése,Munkavállalók be- és kiléptetése,Rendszeres és eseti riportok készítése,Munkaviszonnyal kapcsolatos igazolások kiállítása,Személyügyi és munkaügyi nyilvántartások vezetése,Munkaügyi statisztikák elkészítése és továbbítása,Munkavállalók tájékoztatása napi kérdésekben,Szoros együttműködés, folyamatos egyeztetések külső partnerekkel.A pozícióhoz tartozó elvásárok: Középfokú szakirányú végzettség,Nagyfokú precizitás,Gyors, pontos munkavégzés,Önállóság, terhelhetőség,MS Office felhasználói szintű ismerete,„B” kategóriás vezetői engedély.Előny: Nexon program ismerete,Azonnali munkakezdés. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366499513/",
    "job_id": "4366499513",
    "source": "linkedin",
    "company_name": "Engage People Recruitment",
    "job_title": "FP&A Analyst - Financial Services",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "FP&A AnalystA well-established global trading firm with a sizeable presence in Dublin is looking to hire an FP&A Analyst into its European finance team. This is a newly created role, so it's ideal for someone who likes building things from scratch rather than inheriting messy processes and spreadsheets.The focus of this role is cost analysis, management information and commercial insight. You'll take full ownership of how costs are tracked, allocated and reported across the European business, working closely with senior stakeholders locally and with finance colleagues in the US. It's not a passive reporting role - you'll be expected to challenge, interpret the numbers and help the business make better decisions.You'll be working in a fast-moving trading environment with exposure to front office teams and senior management. This suits someone who's naturally curious, enjoys problem-solving and wants to have a visible impact rather than sitting quietly in the background.What you'll be doingYou'll design and roll out cost reporting and analysis from the ground up, setting clear cost drivers and allocation methodologies across desks, strategies and support functions. You'll build meaningful MI for senior leadership, including cost versus budget analysis, efficiency metrics, trend analysis and forward-looking insights.You'll own the ongoing development of reporting as the business grows, making sure it's scalable, automated where possible and genuinely useful. You'll also lead the annual budgeting process for the European business and act as a key finance partner to senior stakeholders.There's a strong collaborative element to the role. You'll work closely with teams in the US to align methodologies, partner with Technology and Operations to improve data flows, and support strategic initiatives and investment decisions with detailed cost analysis. Ad hoc requests from senior management will come with tight deadlines, so you'll need to be comfortable working at pace.What they're looking forYou'll be a qualified accountant with solid post-qualification experience in FP&A, commercial finance or a similar analytical role, ideally within financial services. You'll have proven experience building MI or cost frameworks from scratch, not just maintaining what already exists.Strong Excel skills are a must, along with experience using tools like Power BI, Tableau or SQL. You'll be highly analytical, detail-focused and confident explaining complex financial information to non-finance stakeholders. A proactive mindset is key - this is a role for someone who takes ownership and isn't afraid to improve how things are done.You will have the full right to work in Ireland with no restrictions (Stamp4/EU/Irish passport).If you want a role where you can shape processes, work closely with senior decision-makers and get real exposure to a trading environment, this one's worth a look.OK, I am interested. What is next?To apply for the role, please share your CV. If you want to explore further, please contact us at Engage People.About Engage PeopleEngage People is a specialist Irish recruitment firm, connecting ambitious career-orientated candidates and clients. We have deep expertise across three niche strands:Accountancy & Financial across Commercial Organisations & Professional ServicesBanking, International Financial Services & Insurance SectorTechnology",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376835198/",
    "job_id": "4376835198",
    "source": "linkedin",
    "company_name": "Kelly",
    "job_title": "Senior Internal Auditor – Regulatory Compliance & Second Line Risk",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Immediate Hiring | Senior Internal Auditor – Regulatory Compliance & Second Line Risk | Toronto, Ontario, Canada (Hybrid) | Apply Now!We are seeking a strong, hands-on Internal Audit professional to execute audits across Regulatory Compliance Management (Second Line), Conduct Risk, Privacy, Legal, and Regulatory Risk Management functions within a complex financial services environment.This role requires an independent and technically strong auditor capable of executing detailed audit testing, evaluating current-state control environments, and assessing the design and operating effectiveness of compliance and conduct risk frameworks.Job Title: Senior Internal Auditor – Regulatory Compliance & Second Line RiskLocation: Toronto, Ontario, Canada (Hybrid)Duration: 6-12 Months (Possible Extension/Conversion)ResponsibilitiesExecute internal audits in accordance with established audit standards, scope, timelines, and budget parametersPerform detailed audit testing of Second Line oversight programs and regulatory compliance frameworksEvaluate the design and operating effectiveness of compliance, conduct risk, privacy, and legal controlsAssess governance structures, policies, monitoring activities, and escalation processesIndependently identify control gaps and emerging risks within evolving regulatory environmentsPresent objective, well-supported audit findings with clear and practical recommendationsCommunicate effectively with Compliance, Risk Management, Legal, and business stakeholdersConduct follow-up reviews on audit findings and regulatory remediation effortsContribute to the evolution of audit coverage, methodology enhancements, and risk-based planning initiativesStay current on regulatory developments and supervisory expectations impacting financial institutionsQualificationsMinimum 3+ years of Internal or External Audit experience (Internal Audit strongly preferred)Hands-on experience performing audit testing and independently executing audit engagementsExperience auditing Second Line Risk Management, Compliance, or Regulatory Risk functions within large financial institutionsStrong understanding of Regulatory Compliance Management frameworksExposure to OSFI regulatory guidance (including E-13) considered an assetStrong analytical skills with the ability to assess complex control environmentsExcellent written and verbal communication skillsStrong stakeholder management and relationship-building capabilitiesAbility to manage multiple priorities in a fast-paced, evolving regulatory landscapeEducation & CertificationsUniversity degree or equivalent experienceCPA, CA, CGA, CIA, or other relevant risk/compliance certifications considered an asset",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367411134/",
    "job_id": "4367411134",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Revenue Accounting Manager - Software Industry, IFRS 15, NetSuite",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356051703/",
    "job_id": "4356051703",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager-Financial/Business Analyst - For A Reputed Group of Companies- Job ID: 1453963",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321312937/",
    "job_id": "4321312937",
    "source": "linkedin",
    "company_name": "Wayfindr",
    "job_title": "General Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366714483/",
    "job_id": "4366714483",
    "source": "linkedin",
    "company_name": "Valkyrie People Consulting",
    "job_title": "Group Financial Controller",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job Title: Group Financial ControllerLocation: Abu Dhabi, United Arab EmiratesIndustry: ManufacturingJob Summary:We are seeking a highly skilled and experienced Group Financial Controller to oversee the financial operations of our manufacturing group in Abu Dhabi. The successful candidate will be responsible for financial planning, reporting, and analysis across multiple entities, ensuring compliance with financial regulations and driving financial performance. This role requires a strategic thinker with strong leadership abilities and deep expertise in financial management within the manufacturing sector.Key Responsibilities:Oversee the financial operations of the group, including budgeting, forecasting, and financial reporting.Ensure accurate and timely preparation of consolidated financial statements.Lead financial planning and analysis to support business growth and decision-making.Manage the annual audit process and liaise with external auditors.Develop and implement internal controls to ensure compliance with financial regulations.Monitor cash flow, working capital, and liquidity management across the group.Provide strategic financial insights to the executive team to support long-term planning.Ensure tax compliance and manage the relationship with tax authorities.Lead, mentor, and develop the finance team to improve overall performance.Manage risk, including currency, credit, and market risks, to protect the company’s financial health.Drive improvements in financial processes and systems to increase efficiency and accuracy.Requirements:Bachelor’s degree in Accounting, Finance, or a related field; a professional qualification (e.g., CPA, ACCA, CMA) is preferred.Proven experience as a Financial Controller or similar role in a group or multi-entity structure, ideally within the manufacturing sector.Strong understanding of financial regulations, accounting principles, and tax laws in the UAE.Excellent analytical and problem-solving skills with a strategic mindset.Experience with financial consolidation and reporting systems.Strong leadership skills with the ability to manage and mentor a team.Ability to work in a fast-paced, dynamic environment with competing priorities.Exceptional communication and interpersonal skills, with the ability to work effectively with cross-functional teams. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366440692/",
    "job_id": "4366440692",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Manager - Cash Management Operations",
    "location": "New Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4311707629/",
    "job_id": "4311707629",
    "source": "linkedin",
    "company_name": "SAS",
    "job_title": "Senior Account Executive, Customer Intelligence",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366715953/",
    "job_id": "4366715953",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Cluster CFO",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368280836/",
    "job_id": "4368280836",
    "source": "linkedin",
    "company_name": "HLC Talent",
    "job_title": "Contrôleur financier (Manufacturier)",
    "location": "Greater Quebec City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366737897/",
    "job_id": "4366737897",
    "source": "linkedin",
    "company_name": "iA Financial Group (Industrial Alliance)",
    "job_title": "Adjoint(e) administratif(ive)",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369130787/",
    "job_id": "4369130787",
    "source": "linkedin",
    "company_name": "Dexian",
    "job_title": "Administrative Assistant",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356350206/",
    "job_id": "4356350206",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - Admin & Compliance (Knit Garments, Dhamrai)- For A Well Reputed Export Oriented Garments Group of Companies- Job ID: 1454615",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366520454/",
    "job_id": "4366520454",
    "source": "linkedin",
    "company_name": "Resource Productivity and Recovery Authority",
    "job_title": "Director, Verification & Inspections",
    "location": "North York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are the Resource Productivity and Recovery Authority (RPRA), Ontario’s circular economy regulator. Our vision is a waste-free and prosperous Ontario. And, our mission is to support waste reduction and resource recovery by enforcing compliance with Ontario’s producer responsibility laws, providing registry services to our regulated community, and reporting publicly on Ontario’s progress towards a circular economy. We are looking for a talented and committed individual to join us as a Director, Verification & Inspections to support the government’s efforts to protect the environment and advance a new economy in which waste is reused, recycled, and reintegrated.Director, Verification & InspectionsThe Director, Verification & Inspections, is accountable for developing a compliance inspection program, specifically related to verification of data (supply and performance data) submitted in the Registry. This includes all data reported by producers, service providers and producer responsibility organizations (PROs) under the Resource Recovery and Circular Economy Act, 2016 (RRCEA) and associated regulations. This inspection program will see the Director leading the development of internal and external procedures, methodologies and guidance to registrants on how to report data into the Registry in a consistent and verifiable manner and how to verify that data. The Director is an integral contributor to strategic leadership, including the development and implementation of RPRA’s strategic plan and annual business plan.Planning and oversight of verification and inspection activities (50%) Develops inspection and verification plans in accordance with department goals, objectives and performance measures.Reviews scope, methodologies, procedures, and quality control mechanisms to support organizational goals.Leads the end-to-end planning, execution and reporting on the effectiveness of data reported to RPRA and identifies noncompliance.Builds processes and oversees timely and effective registrant adjustments and associated enforcement activitiesCollaborates with Directors on development and implementation of strategies and actions to improve communication, build tools and supports for Registrants report accurately, timely and consistently.Collaborates with compliance teams and other departments to integrate inspection and verification processes and procedures with broader compliance and data-related activitiesAccountable for the development, maintenance and implementation of all Registry Procedures related to data reporting, verification and audit, including planning and assessing budget and resource implications.Provides reports to Registrar on results of inspection and verification activities; provide recommendations to Directors and Managers on process and/or changes to improve accuracy and timeliness of data reporting to RPRA.Stakeholder and Registrant Relations (25%) Liaises with other provincial and federal regulatorsUnderstands, develops and focuses on driving the right behaviours that lead to an optimal registrant experience.Responsible for maintaining a relationship of trust, collaboration and accountability with RPRA stakeholders and registrants with respect to RPRA’s compliance mandate.Represents RPRA at speaking engagements (trade shows, speaking engagements, etc.).Acts as the Registrar’s delegate at events and groups, speaking on behalf of and representing the Registrar.Strategic Leadership (25%) Ensures that verification strategies and activities are aligned with organizational strategic goals, regulatory obligations, and RPRA’s compliance risk framework.Ability to train and develop team members to effectively identify and adhere to inspection and verification processes and procedures.As part of RPRA’s leadership team, contributes to the development and implementation of:the strategic vision of the organization, including the corporate objectives for the compliance department and strategic planeffective risk identification and management strategiesdepartment-wide resourcing and planning and across departments, as required for business readiness, operational budgets and key performance indicatorsGuides compliance department managers and leads to align with the strategic plan of the organization.Coordinates with other senior leaders and Compliance Managers to adequately plan and execute on operationalizing the compliance mandateCollaborates with the other leaders in achieving compliance department’s goals as well as other applicable organizational goalsProvides updates to the Board of Directors as requiredChampions an organizational culture of collaboration and continuous improvement within the department as well as across departmentsLeads, engages and develops a high-performing team, ensuring they have the necessary training and resources.Develops strategies to monitor budgets, operating model, performance standards, and leverages analytics to support decision making on strategic direction and alignment w",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366931596/",
    "job_id": "4366931596",
    "source": "linkedin",
    "company_name": "Onex",
    "job_title": "Chief Compliance Officer",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "ABOUT ONEX:Onex is an investor and asset manager that invests capital on behalf of Onex shareholders and clients across the globe. Formed in 1984, we have a long track record of creating value for our clients and shareholders. Onex became a public company in 1987 and is listed on the Toronto Stock Exchange under the symbol ONEX. Onex’ two primary businesses are Private Equity and Credit. In Private Equity, we raise funds from third-party investors and invest them, along with Onex’ own investing capital, through the funds of our private equity platforms: Onex Partners and ONCAP. Similarly, in Credit, we raise and invest capital across several private credit, liquid credit and public equity strategies.Our investors include a broad range of global clients, including public and private pension plans, sovereign wealth funds, insurance companies, family offices and high net worth individuals. Onex has $55.9 billion in assets under management, of which $8.4 billion is Onex’ own investing capital. We generate value for our shareholders through two segments: Investing and Asset Management.The Opportunity:Onex is seeking a Chief Compliance Officer to lead the firm’s compliance program and champion a culture of integrity and regulatory excellence. This role includes setting compliance strategy and ensuring compliance functions meet the regulatory standards across Canadian securities regulators. The CCO will guide a compliance team and partner with leaders across the firm, bring confident leadership, meticulous execution and sound judgement to this role. It is an opportunity to make an immediate impact and shape how the firm delivers compliant performance. The CCO will be reporting to the Managing Director and General Counsel.Key Responsibilities:Develop, implement documented, robust and effective compliance policies and procedures.Ensure adherence to Canadian securities laws and regulatory requirements, including compliance with National Instrument 31-103, 45-106, 81-102, 81-105, 81-106 and 81-107 and compliance with all relevant provincial and national securities regulators.Ensure adherence to client reporting, including CRM2 and Total Cost Reporting obligations.Act as the primary contact for the Independent Review Committee of the public mutual funds and ensure preparation of IRC reporting.Oversee policies related to AML/ATF programs, privacy compliance, code of ethics, marketing review, and other compliance functions.Oversee AML/ATF programs in compliance with applicable Canadian and cross border regulatory requirements.Act as the primary contact for regulatory authorities and manage regulatory interactions and examinations.Implement and maintain the firm’s privacy program and act as the firm’s designated privacy officer.Prepare and coordinate regulatory filings and manage responses to regulatory queries and audits.Monitor and interpret regulatory developments across all Canadian provincial and advise senior leadership on implications.Establish, maintain and continuously improve the firm’s compliance manual, policies and procedures ensuring they meet regulatory requirements and adherence to enterprise-wide policies and procedures.Review marketing and sales communications to ensure adherence to Canadian regulatory requirements.Oversee adherence to compliance related policies and procedures, assess outside activities and manage conflicts of interest disclosures.Design and deliver compliance training for staff and leaders of the firm.Build and execute regular assessments to test control effectiveness, contribute to the firm’s risk program and relevant committees with clear recommendations. Identify and implement compliance frameworks for new initiatives and projects.Provide compliance training and assessments for all staff and leadership.Partner with other areas of the business to integrate compliance into operations and decision-making.Prepare and submit regular compliance reports to senior leadership and the Ultimate Designated Person.Candidate Profile:5+ years in compliance roles in the investment management or financial services industry.Previous registration as a Chief Compliance Officer with Canadian securities authorities or completion of courses/qualification required to register as a CCO with securities authorities (e.g., Canadian Securities Course, Chief Compliance Officer Qualifying Exam, Partners or Directors and Senior Officer courses).Demonstrates accuracy and thoroughness, ensures quality and a strong attention to detail and follow-through; committed to implementing best practices and continuous improvement.Presence and self-confidence to interface with the key constituents of the firm including process owners, senior executives, and other stakeholders.A high standard of integrity and ability to maintain the highest degree of confidentiality.Strong business acumen and work ethic with the desire, ability, and curiosity to think strategically to navigate competing issues and improve current processes.Exte",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366003048/",
    "job_id": "4366003048",
    "source": "linkedin",
    "company_name": "IDLC Finance PLC",
    "job_title": "Disbursement Processing Officer",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366356032/",
    "job_id": "4366356032",
    "source": "linkedin",
    "company_name": "Ariston",
    "job_title": "Accountant",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356049043/",
    "job_id": "4356049043",
    "source": "linkedin",
    "company_name": "Ali & Sons Holding LLC",
    "job_title": "Financial Analyst",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366429094/",
    "job_id": "4366429094",
    "source": "linkedin",
    "company_name": "Shopee",
    "job_title": "Financial Planning & Analysis",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368169248/",
    "job_id": "4368169248",
    "source": "linkedin",
    "company_name": "Sun Group",
    "job_title": "Senior Business Analyst",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356370555/",
    "job_id": "4356370555",
    "source": "linkedin",
    "company_name": "Genpact",
    "job_title": "Auto Finance – Agent Customer Service – English – On site Johannesburg",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366687639/",
    "job_id": "4366687639",
    "source": "linkedin",
    "company_name": "Dubai Investments PJSC",
    "job_title": "Compliance Officer - UAE National",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366417627/",
    "job_id": "4366417627",
    "source": "linkedin",
    "company_name": "Tomei Consolidated Bhd",
    "job_title": "Customer Support Executive",
    "location": "WP. Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366442612/",
    "job_id": "4366442612",
    "source": "linkedin",
    "company_name": "WWF-Malaysia",
    "job_title": "Executive, Account Receivable",
    "location": "Petaling Jaya, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362177970/",
    "job_id": "4362177970",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coord-Office",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362605419/",
    "job_id": "4362605419",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coord-Office",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362652053/",
    "job_id": "4362652053",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coord-Office",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Additional InformationJob Number 26007104Job Category AdministrativeLocation Sheraton Istanbul City Center, Haci Ahmet Mah, Istanbul, Türkiye, Türkiye, 34440VIEW ON MAPSchedule Full TimeLocated Remotely? NPosition Type Non-ManagementMarriott International olarak, kapısı herkese açık ve fırsata erişim imkânı sunan bir eşit fırsat işvereni olmaya kararlıyız. Çalışma arkadaşlarımızın, özgün arka planlarına değer verilen ve geçmişleriyle birlikte kabul gördükleri bir iş ortamını etkin bir şekilde teşvik ediyoruz. En güçlü yanımız, çalışma arkadaşlarımızın beraberlerinde getirdikleri zengin kültür, yetenek ve deneyimlerdir. Kişinin engellilik durumuna, askerlik durumuna veya yürürlükteki yasalarla korunan diğer durumlara dayalı ayrımcılık da dâhil olmak üzere, her türlü ayrımcılığa karşıyız.Sheraton ailesine katıldığınızda, küresel topluluğumuzun da bir üyesi haline gelirsiniz. 1937'den beri insanların bir araya gelmek ve bağlantı kurmak için seçtiği bir mekan olduk. Sheraton çalışanları dünya genelinde 400'ü aşkın topluluklarıyla bir aidiyet duygusu yaratır. İlgi çekici deneyimler ve düşünceli hizmet anlayışıyla misafirleri bizimle konaklamaya davet ediyor, onları en iyi şekilde ağırlıyor ve birbirleriyle bağlantı kurmaya teşvik ediyoruz. Anlamlı bir misafir deneyimi sunmaktan heyecan duyan bir takım oyuncusuysanız, bir sonraki kariyer fırsatınızı Sheraton'da keşfetmenizi tavsiye ediyoruz. 'Dünyanın Buluşma Yeri' olma misyonumuzda bize katılın. Sheraton Hotels & Resorts'a katılarak, Marriott International çatısı altındaki bir markalar portföyünün parçası olursunuz . İşinizi en iyi şekilde yapabileceğiniz yeri tercih edin , amacınızı gerçekleştirmeye başlayın , mükemmel bir küresel ekibin üyesi olun ve hayallerinize ulaşmayı başarın . Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362670713/",
    "job_id": "4362670713",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coord-Office",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362506251/",
    "job_id": "4362506251",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coord-Office",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366571615/",
    "job_id": "4366571615",
    "source": "linkedin",
    "company_name": "Etiqa Insurance and Takaful",
    "job_title": "Protege, Regional Compliance",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366420247/",
    "job_id": "4366420247",
    "source": "linkedin",
    "company_name": "Golden Gate Restaurant Group",
    "job_title": "Junior / Senior FOOD R&D specialists",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366708499/",
    "job_id": "4366708499",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Accounts Payable Executive",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346559380/",
    "job_id": "4346559380",
    "source": "linkedin",
    "company_name": "SIX",
    "job_title": "Financial Data Analyst with French",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4288344231/",
    "job_id": "4288344231",
    "source": "linkedin",
    "company_name": "Speechify",
    "job_title": "Software Engineer, Data Infrastructure & Acquisition - Asia",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359381374/",
    "job_id": "4359381374",
    "source": "linkedin",
    "company_name": "Hogarth",
    "job_title": "Software Engineer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Hogarth is the Global Content Production Company. Part of WPP, Hogarth partners with one in every two of the world’s top 100 brands including Coca-Cola, Ford, Rolex, Nestlé, Mondelez and Dyson. With a breadth of experience across an extensive range of sectors, Hogarth offers the unrivaled ability to deliver relevant, engaging, and measurable content across all channels and media - both established and emerging. The number of channels at our fingertips; the need for speed; and the drive for mass personalisation, all mean that brands need different solutions. Our global team of over 7,500 craft and technology experts brings together creative, production and innovation to help clients navigate this exciting and ever-changing world of today’s content experience.WPP is the creative transformation company. We use the power of creativity to build better futures for our people, planet, clients and communities. Working at WPP means being part of a global network of more than 100,000 talented people dedicated to doing extraordinary work for our clients. We operate in over 100 countries, with corporate headquarters in New York, London and Singapore. WPP is a world leader in marketing services, with deep AI, data and technology capabilities, global presence and unrivalled creative talent. Our clients include many of the biggest companies and advertisers in the world, including approximately 300 of the Fortune Global 500. Our people are the key to our success. We're committed to fostering a culture of creativity, belonging and continuous learning, attracting and developing the brightest talent, and providing exciting career opportunities that help our people grow. What you’ll do: Design and build applications and systems with .NET & its ecosystem.Develop modern front‑ends with React + JavaScript and back‑end services with Node.js.Apply SOLID, clean architecture, and proven design patterns to create maintainable, extensible systems.Model data and write efficient queries for SQL and NoSQLConsider UX and accessibility from the start; collaborate with design and use modern UI frameworks such as Tailwind, Material UI, shadcn/ui, Ant Design, or Chakra.Troubleshoot, profile, and optimize performance for mission‑critical applications.Leverage AI coding tools (e.g., GitHub Copilot, Cursor, Claude, or equivalent agentic code‑gen tools) to accelerate scaffolding, tests, refactoring, and documentation—always with rigorous human review.Prompt, critique, and refine generated code; enforce standards and ensure correctness, security, and performance before merging.Integrate LLM capabilities when they add clear value: function/tool calling, RAG, embeddings, and vector stores, using providers such as OpenAI, Anthropic, Google, or vetted open‑source models.Evaluate models for quality, latency, cost, and safety; run lightweight A/B prompt tests and maintain prompt/version governance.Build AI‑augmented workflows (AI code review, test generation, structured migrations/refactors) that improve delivery speed without compromising quality.Apply AI safety best practices, including prompt‑injection defenses, data minimization/PII protection, and observability for AI features.Collaboration and qualityWrite unit, integration, and end‑to‑end tests both in .NET & JavaScript.Participate in code reviews and pair/mob sessions; mentor teammates and encourage knowledge sharing.Partner with QA from the outset (shift‑left) to define acceptance criteria and ensure the right thing is built right.Maintain clear documentation for code, APIs, and architecture decisions, with AI‑assisted docs where useful.Use Git and modern CI/CD (e.g., GitHub Actions, Jenkins) to build, test, and deploy reliably.Qualifications: requiredBachelor's degree in computer science, Software Engineering, or related field; 3+ years of professional software development.Strong in C#, .NET, ASP.NET & Relevant SystemsProficient with React + JavaScript and Node.js, plus HTML/CSS.Solid grasp of OOP, SOLID, clean architecture, and common design patterns.Hands‑on with Git, CI/CD, and automated testing; able to critically assess and safely use AI‑generated code.Experience with any of the cloud service providers (AWS, Azure, GCP etc.)Excellent communication, problem‑solving skills, and attention to detail.Qualifications: nice to haveRAG and vector databases (e.g., OpenSearch, pgvector, Pinecone) and function/tool calling patterns.Familiarity with multiple LLM families and behaviors (e.g., GPT, Claude, Gemini, Llama, Mistral etc) and when to choose each.Security and privacy fundamentals (OWASP Top 10, secrets management, PII handling).Observability: Serilog, Application Insights, OpenTelemetry.Python for scripting, data tooling, or simple ML pipelines.Our Hogarth Values:Hands onNo egos here. Just a shared drive to roll up our sleeves and make great things happen. Every project--big or small, gets our full energy because we believe in doing things right. Every single time. It's how we deliver real res",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367471038/",
    "job_id": "4367471038",
    "source": "linkedin",
    "company_name": "Luxoft",
    "job_title": "Data Modeler",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355766671/",
    "job_id": "4355766671",
    "source": "linkedin",
    "company_name": "IGT1",
    "job_title": "Senior SaaS Operations Engineer (IGT1)",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366723276/",
    "job_id": "4366723276",
    "source": "linkedin",
    "company_name": "ALSAYER Group",
    "job_title": "Sr. Supervisor, Vehicle Sales",
    "location": "Shuwaikh, Al Asimah, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342540766/",
    "job_id": "4342540766",
    "source": "linkedin",
    "company_name": "Nestlé",
    "job_title": "Tax Specialist",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365176993/",
    "job_id": "4365176993",
    "source": "linkedin",
    "company_name": "Suzuki Finance Indonesia",
    "job_title": "BUSINESS RELATIONSHIP OFFICER - Tangerang Selatan",
    "location": "Kota Tangerang Selatan, Banten, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366460134/",
    "job_id": "4366460134",
    "source": "linkedin",
    "company_name": "Fore Coffee",
    "job_title": "Finance Treasury Manager",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346826150/",
    "job_id": "4346826150",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Travel Operations Specialist",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366723283/",
    "job_id": "4366723283",
    "source": "linkedin",
    "company_name": "Lesieur Cristal",
    "job_title": "Key Account Manager - Moderne Trade",
    "location": "Casablanca Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339103351/",
    "job_id": "4339103351",
    "source": "linkedin",
    "company_name": "Kassen Recruitment",
    "job_title": "Senior Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366185222/",
    "job_id": "4366185222",
    "source": "linkedin",
    "company_name": "Kassen Recruitment",
    "job_title": "Manager of Finance",
    "location": "North York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366743778/",
    "job_id": "4366743778",
    "source": "linkedin",
    "company_name": "iA Financial Group (Industrial Alliance)",
    "job_title": "Administrateur(trice) - Nouvelles affaires",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368740694/",
    "job_id": "4368740694",
    "source": "linkedin",
    "company_name": "Morgan McKinley",
    "job_title": "Financial Planning and Analysis Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352013277/",
    "job_id": "4352013277",
    "source": "linkedin",
    "company_name": "Votorantim Cimentos North America (VCNA)",
    "job_title": "Internal Auditor",
    "location": "East York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357545724/",
    "job_id": "4357545724",
    "source": "linkedin",
    "company_name": "Vancity",
    "job_title": "Third-Party Risk Management (TPRM) Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Our Story & Purpose:We’re Vancity, a member-owned credit union built on the principles of inclusion and social justice. Since 1946, our relentless commitment to these values has helped us challenge the status quo and break down barriers. We’ve made bold commitments to become net-zero by 2040 across all mortgages and loans, and we’re actively pursuing strategies in Indigenous banking and financial resilience for our members.As the largest private sector Living Wage Employer in Canada, we’re proud to be consistently recognized as one of the country’s Top Employers. If you’re ready to join our team of 2,700 diverse individuals, access competitive rewards and benefits, and be part of a greater movement - apply today!Your Role in Supporting Our Members:Join our IT Governance, Risk, and Compliance (IT-GRC) team as a Third-Party Risk Management (TPRM) Analyst. In this role, you shall perform TPRM and vendor risk assessments, and will work closely with internal stakeholders and vendors to ensure that security and compliance risks are identified, assessed, and managed effectively in line with internal policies, regulatory requirements, and industry best practices.This is a Full-time, Permanent role based at Vancity head office. This role will enjoy hybrid working arrangements which can be fulfilled primarily from the Vancity head office location and your Lower Mainland based home office. Periodically, you’ll be required to attend in-person activities or events. This role reports to the Senior Manager of IT GRC.How You’ll Make an Impact:Conducting third-party risk assessments to evaluate vendor security and compliance controls by reviewing vendor documentation, engaging with internal stakeholders to understand business requirements, and identifying security and compliance gapsReviewing vendor security documentation, including SOC reports, web application penetration test results, and security risk assessmentsReviewing and providing opinion on vendor provided SoWs, contracts, and MSAsMaintaining and improving third-party risk management processes, tools, and workflows to streamline risk assessments, audit procedures, and reportingWorking with procurement, vendor management, legal, and other business teams to perform due diligence on new vendors and ensure security and compliance requirements are met before onboardingEvaluating third-party security incidents or breaches, or vulnerabilities, and coordinating investigation efforts with internal teams and vendorsPerforming other tasks and responsibilities as assignedWhat You’ll Bring to the Team:Bachelor’s in Information Technology, Risk Management, Business, or a related field2-5 years of related experience in IT Governance, Risk, and Compliance (GRC), Third-Party Risk Management, or Information SecurityA solid understanding of relevant cyber security standards and frameworks such as NIST, ISO 27001, AICPA SOC reports, PCI-DSS, OSFI, PIPEDAPrior working knowledge in reviewing SOC1, SOC2, PCI (AoC), and ISO 27001 reports and attestationsExperience reviewing vendor security controls, evaluating compliance artifacts, and analyzing security risksStrong attention to detail and analytical thinking to identify vendor security risks and assist in remediation trackingExcellent communication and stakeholder management skills to engage with vendors and internal teamsA proactive mindset with the ability to work independently and manage multiple priorities in a fast-paced environmentExtra Skills That Set You Apart: Experience in IT, Audit, Risk Management, Information Security, or a combination of theseInformation Security related certifications and training such as CISA, CRISC, and CISMAn undergraduate degree (preferably in Cyber Security, Computer Science, Engineering, or highly related field)You’ll Thrive Here If You Are:Detail-Oriented: You have a sharp eye for identifying security gaps and areas of improvement in vendor security practicesAnalytical: You can balance business needs with risk considerations and provide pragmatic recommendationsProactive & Adaptable: You anticipate challenges and take action to address them before they escalateCollaborative: You work effectively with cross-functional teams, including Procurement, Legal, and IT SecurityA Clear Communicator: You can translate technical risk concepts into business-friendly language for stakeholdersDriven by Continuous Improvement: You are always looking for ways to refine processes and enhance risk management effectivenessWe value lived experience, so if you are interested in this role, we encourage you to apply even if you feel your skills don't perfectly align with those listed.Why You’ll Love Working Here:A career at Vancity is more than just a job, you’re joining a tradition of change-makers who are creating lasting change for our communities. Beyond base pay, we offer a comprehensive total rewards package to ensure our employees are empowered to thrive:Living Wage Employer: We’re the largest private-sector Living ",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362652052/",
    "job_id": "4362652052",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Clerk-Accounts Payable",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362515917/",
    "job_id": "4362515917",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Clerk-Accounts Payable",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362525793/",
    "job_id": "4362525793",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Clerk-Accounts Payable",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362187353/",
    "job_id": "4362187353",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Clerk-Accounts Payable",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362670718/",
    "job_id": "4362670718",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Clerk-Accounts Payable",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362680155/",
    "job_id": "4362680155",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Clerk-Accounts Payable",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372015309/",
    "job_id": "4372015309",
    "source": "linkedin",
    "company_name": "Agentis Capital",
    "job_title": "Analyst - Principal Investments",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Our FirmAgentis Capital Partners (\"ACP\") operates as the family office of the founding partners of Agentis, a diversified platform with businesses spanning principal investments, financial advisory, capital markets, and asset management services. Since its founding in 2009, the Agentis platform has advised on more than $30bn of transactions across infrastructure, mining, and energy, while ACP has built and managed a long-standing portfolio of principal investments across technology, industrial, and mixed industrial-technology businesses.ACP actively pursues both active and passive principal investments and currently manages a portfolio of more than 20 businesses. The firm has consistently made principal investments over the past decade, recycling capital into high-value opportunities and working closely with management teams and boards to create long-term value.Your ContributionAs an integral member of the principal investments team, you will work directly with the founding partners of Agentis on principal activities and will work with members of the advisory team where Agentis is making an investment in or alongside a client. You will work directly with C-suite executives and board members of Agentis portfolio companies and potential investments.Your role will include:Researching potential investment opportunities; providing research on target companies, sectors, industries, and geographiesEvaluating investment opportunities and participating in the execution of principal investments- Developing financial models with a range of complexity for principal transactions- Assisting in the management of due diligence processes, including managing third-party advisorsAssisting in developing the strategy, business plan, and objectives of portfolio investmentsManaging and aggregating asset-level reporting for portfolio investmentsAs a member of a high-performing team working in a fast-paced environment, you will be required to work beyond a normal workday or workweek to fulfill your responsibilities.Our DifferentiatorsBreadth of experience and level of responsibilityExceptional level of responsibility on complex transactions and assetsDirect engagement with founding partners, C-suite executives of portfolio investments, and board members of portfolio investmentsWide breadth of work across industriesTrainingContinuous internal training programInternal leadership development programCulture and approachEntrepreneurial culture with a flat organization structureDefined path to achieving Partner, with all individuals joining a Partner-track role receiving the opportunity to become a full Partner in the businessCompensation and employee ownershipExceptional compensation versus the market for those who deliver exceptional performance, with uncapped performance-based bonusesEmployee ownership program that commences for all individuals from the end of their first full fiscal year of employmentOther benefitsImmediate access to principal investment opportunities alongside PartnersPaid sabbatical every two years of employmentAbility to work temporarily out of our Vancouver or Toronto officeYour Background and SkillsAn undergraduate degree in accounting, finance, commerce, business, statistics, computer science or other related fieldsExceptional academic results (minimum cGPA of 80% or 3.7/4.0)Ability to concisely communicate complex concepts and ideas verbally and in writingAbility to take initiative and work independently with minimal supervisionDesire to assume increasing levels of responsibility and seek solutions to complex problemsCommitted to producing accurate and thorough work product under tight deadlinesAbility to learn quickly and adapt in a fast-paced work environmentResilient mindset in the face of adversityAbility to work effectively in a team environmentPosition TypePermanent Full-TimeDesired start date: ImmediateLocation: Vancouver or Toronto",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325849301/",
    "job_id": "4325849301",
    "source": "linkedin",
    "company_name": "dentsu",
    "job_title": "Commercial & Finance Analyst",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361027944/",
    "job_id": "4361027944",
    "source": "linkedin",
    "company_name": "Kozloduy NPP - New Build EAD",
    "job_title": "Cost control Expert",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About the job “Kozloduy NPP-New Builds” EAD is a project based company, owned by „Kozloduy NPP“ EAD. Our mission is to implement and complete a project for the commissioning of two new nuclear power units to produce electricity and heat on the site of the existing nuclear power plant in Kozloduy. “Kozloduy NPP-New Builds” EAD is managing the entire process of feasibility study, design, construction and commissioning of the latest generation (III or III+) AP1000 light water pressurized water reactor (PWR) technology. Concerning the active phase of the project, we are looking for a highly qualified and motivated Cost control Expert for our Project Planning, Reporting and Infrastructure Permits Department for Sofia office (onsite).By joining our team, you will become an integral part of a dynamic and continually growing organization. Our employees are not only strong professionals and effective team players but also passionate contributors to an essential project that plays a crucial role in Bulgaria's energy future. This initiative is pivotal for advancing clean energy production in our country, ensuring energy independence, and adhering to international safety and environmental standards. Together, we are committed to building a sustainable energy landscape that benefits both our nation and the broader region. Main responsibilities: Gathering, processing, and analyzing financial and non-financial information related to costs and commitments. Ensuring proper, accurate, and compliant maintenance of documentation. Preparation of payment requests to third parties, ensuring completeness and accuracy of all supporting financial and contractual documentation. Reviewing and verifying invoices and supporting expense documentation for accuracy, completeness, and compliance. Performing ongoing cost control to ensure compliance with the approved business programme, concluded contracts, assumed project commitments, applicable legislation, and internal policies. Monitoring compliance with the approved contractual budgets and analyzing budget variances. Preparation of periodic cost reports and analyses covering expenses incurred and commitments to third parties. Participation in audits, financial reviews, and inspections related to expenditures. Coordination of reports with the Finance Department and financial controller. Ensuring effective communication through the exchange of accurate and up-to-date information and the use of feedback mechanisms. Working collaboratively within a team and demonstrating initiative in the performance of duties. Performing additional tasks assigned by the immediate supervisor and management, within the scope of the position’s responsibilities and competencies. We are looking for someone who has: A bachelor’s degree in Finance, Economics or Accounting or a related field. Experience - a minimum of 3 years. Previous experience in cost control, financial management, project finance, or a similar role is considered an advantage. Experience from Big Four Company, a Bank or other Multinational Company is a plus. Knowledge of cost control, budgeting, and financial reporting principles. Ability to interpret contracts and financial clauses related to expenditures. High attention to detail and accuracy. Strong organizational and documentation management skills. Proactive attitude and ability to work independently within assigned responsibilities. Excellent Excel skills or experience in similar spreadsheets software. Excellent command of English – both written and spoken. Analytical thinking and a results-oriented approach. Experience in the energy sector is a plus but is not compulsory. Proactive approach and teamworking player. What We Offer: Professional Growth: Join a leading project in Bulgaria's energy sector, contributing to the development of new nuclear power units and advancing clean energy initiatives. Excellent Working Conditions: Enjoy a supportive and collaborative environment in our Sofia office, equipped with modern facilities and resources. Attractive Remuneration Package: Receive a competitive salary along with a comprehensive benefits package, tailored to your experience and contributions. Career Development: Benefit from opportunities for personal and professional growth through training programs and engagement in significant project. Work-Life Balance: We prioritize your well-being by promoting a healthy work-life balance, ensuring you have time for both professional responsibilities and personal interests. How to Apply: If you are interested in joining our team, please submit your CV for consideration: newbuild@npp-nb.bg We appreciate your interest in our company; however, only shortlisted candidates will be contacted for an interview. Please note that any personal data collected during the application process will be handled in accordance with our recruitment procedures and privacy policies.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356565420/",
    "job_id": "4356565420",
    "source": "linkedin",
    "company_name": "Manpower Bulgaria",
    "job_title": "Personal assistant to CEO",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364533600/",
    "job_id": "4364533600",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Zonal Accountant - (For Palli Mongal Karmosuchi (PMK)) - Job ID - 1458381",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Palli Mongal Karmosuchi (PMK) is looking for Zonal AccountantJob Description / Responsibilityপল্লী মঙ্গল কর্মসূচী (পিএমকে) মাইক্রোক্রেডিট রেগুলেটরী অথরিটি (এমআরএ) এর সনদপ্রাপ্ত জাতীয় পর্যায়ের সুপ্রতিষ্ঠিত বেসরকারি সংস্থা, যার এমআরএ সনদ নম্বর-০০৮৬২-০০৩৮৭-০০৩১২। সংস্থাটি ১৯৮৮ সালে প্রতিষ্ঠিত হয়ে বর্তমানে দেশের ৩৬টি জেলায় ৩৬১টি শাখার মাধ্যমে ক্ষুদ্র অর্থায়ন কার্যক্রম বাস্তবায়ন করছে এবং কর্মসূচির সম্প্রসারণ চলমান রয়েছে। বর্তমানে সংস্থার সুবিধাভোগী সদস্য সংখ্যা প্রায় ৩.৫০ লক্ষ এবং এ পর্যন্ত প্রায় ১৮ হাজার কোটি টাকা ঋণ বিতরণ করা হয়েছে। বাংলাদেশে কর্মরত ৬৭৮টি এনজিও/এমএফআই এর মধ্যে সংস্থার অবস্থান ১২তম। সংস্থাটি ক্ষুদ্র অর্থায়ন ছাড়াও শিক্ষা, কমিউনিটি বেইজড স্বাস্থ্য সেবা, সাংস্কৃতিক ও ক্রীড়া এবং বিভিন্ন উন্নয়ন কর্মসূচি বাস্তবায়ন করছে। সংস্থা কর্তৃক প্রতিষ্ঠিত “পিএমকে নার্সিং কলেজ” এবং ৫০ শয্যা বিশিষ্ট “পিএমকে হাসপাতাল এ্যান্ড ডায়াগণষ্টিক সেন্টার” স্বাস্থ্য শিক্ষা ও স্বাস্থ্য সেবায় অন্যতম স্বনামধন্য প্রতিষ্ঠান।উক্ত সংস্থায় আর্থিক অন্তর্ভুক্তি (Financial inclusion) কর্মসূচিতে কাজ করার জন্য লোক নিয়োগ করা হবে।Educational RequirementsMaster of Commerce (MCom)বাণিজ্যে স্নাতকোত্তর এবং সিএ (সিসি) থাকতে হবেExperience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s): NGO,Hospital,ResortAdditional Requirementsঅভিজ্ঞতা ও অন্যান্য শর্ত:জাতীয় পর্যায়ে ক্ষুদ্রঅর্থায়ন কার্যক্রম বাস্তবায়নকারী সংস্থায় সমপর্যায়ের পদে কমপক্ষে ০৩ (তিন) বছর এবং ক্ষুদ্রঅর্থায়ন কার্যক্রমে ০৭ বছরের বাস্তব অভিজ্ঞতাসম্পন্ন এবং Computer পরিচালনার বেসিক ধারণা থাকতে হবে।মোটর সাইকেল চালনায় পারদর্শী এবং বৈধ ড্রাইভিং লাইসেন্স থাকতে হবে।Job LocationAnywhere in BangladeshSalaryTk. 42000 - 50850 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371955602/",
    "job_id": "4371955602",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Front Desk Executive - For ODC Imaging LTD And Healthcare - Job ID: 1460167",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333747855/",
    "job_id": "4333747855",
    "source": "linkedin",
    "company_name": "Metergy Solutions",
    "job_title": "Senior Vice President, Sales",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366496121/",
    "job_id": "4366496121",
    "source": "linkedin",
    "company_name": "CIBC",
    "job_title": "Executive Director, Diversified Industries, Corporate Banking",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373899516/",
    "job_id": "4373899516",
    "source": "linkedin",
    "company_name": "Lacroix Médecine Privée",
    "job_title": "Administrative Services Manager - Private Biomedical Laboratory",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Who are we?For over 15 years, Lacroix Private Medicine has been a leader in private healthcare in Quebec. With a network of 17 clinics (including one in Florida), two operating rooms, a medical biochemistry laboratory, more than 150 physicians, and over 350 dedicated employees, we passionately pursue our mission every day: to provide compassionate, accessible, and high-quality care.Our rapidly growing team is driven by innovation, compassion, and a constant commitment to excellence.Our MissionTo be the benchmark in private healthcare.Our ValuesPassion | Respect | Integrity | Commitment | InnovationWhy Choose Lacroix Private Medicine?✔️ Over 350 professionals have already chosen us✔️ Modern and state-of-the-art clinics✔️ Stable and continuously growing organization✔️ Same-day lab results available✔️ Access to a full range of care: family medicine, specialized medicine, and surgery✔️ Network of 17 clinics across Quebec (and one in Florida)Job SummaryReporting directly to the Laboratory Director, the Services Manager administrative ensures the coordination and supervision of the administrative, logistical and support aspects of daily operations. They ensure the proper management of human, financial, and material resources, while guaranteeing regulatory compliance and providing organizational support to the teams. They also play an active role in sales and marketing development, supporting management in promoting services, managing customer relationships, and enhancing the laboratory's market positioning.Main ResponsibilitiesAdministrative Services Management Supervise the reception, medical secretarial, appointment scheduling, and patient file management teams Optimize and standardize administrative processes (admissions, consents, files, results) Ensure efficient management of schedules, volumes, and peak periods Ensure a professional, seamless, and compliant patient and client experience Approve orders and invoices, and manage inventoryBilling and Management of Revenue Ensure rigorous and efficient invoicing Validate the compliance and eligibility of billed services Monitor accounts receivable and optimize payment deadlines Collaborate closely with the accounting and finance departmentsSales and Marketing Participate in the planning and monitoring of marketing initiatives (website, promotional materials, campaigns) Support the director in sales growth and development strategies Support and coach sales representatives as needed Contribute to the management and maintenance of customer relationships (agreements, satisfaction, follow-ups)Logistics and Operations Supervise the transportation department Plan and monitor fleet maintenance Coordinate maintenance and technical services (air conditioning, generators, etc.)Human Resources Management Supervise, motivate, and evaluate staff under their responsibility Participate in the recruitment, onboarding, and training of employees Plan replacements and manage absences Ensure the application of HR policies and a structured work environment Ensure employees' professional compliance (licenses, insurance, orders)Quality, Compliance, and Regulations Ensure compliance with confidentiality and personal information protection regulations Supervise the maintenance and integrity of files Participate in audits and quality assurance processes Implement and monitor administrative performance indicators Ensure compliance with regulatory licenses and permits (LSPQ, ASPC, CFIA)Information Systems and Continuous Improvement Optimize information flows between different sectors Analyze performance indicators and propose improvements Participate in process automation and optimization projectsInternal and External Relations Act as an administrative resource person for partners and clients Support business development activities Collaborate closely with the director on various strategic mandatesDesired ProfileEducationBachelor's degree in administration or equivalent.No scientific or medical training required. An understanding of the healthcare sector is an asset.Experience Minimum of 5 to 8 years of experience in administrative management Experience in a healthcare setting, private clinic, or laboratory (major asset) Relevant experience in team management Proficiency with computerized systems (LIS, ERP, financial tools)Key Skills Excellent organizational skills and attention to detail Sense of responsibility and confidentiality Inspiring leadership and a hands-on approach Analytical and operational management skills Excellent communication skills in French (functional English: an asset)Schedule40 hours/week – Monday to Friday, daytime hours.Occasional flexibility required according to operational needs (evenings and weekends).Mobility Occasional travel within the Montreal area.Compensation$90,000 to $130,000, depending on experience and qualifications.Our Benefits Cell phone allowance, $60/month $500/year Lacroix gift card with expedited access to a doctor $1,100 annual health account F",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372446582/",
    "job_id": "4372446582",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Personal Secretary (PS) to Managing Director BGL Overseas Ltd. - Job ID: 1459942",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BGL Overseas Ltd. is looking for Personal Secretary (PS) to Managing DirectorJob Description / Responsibilityব্যবস্থাপনা পরিচালকের সার্বিক সেক্রেটারিয়াল ও প্রশাসনিক কাজে সহায়তা প্রদান।এমডির দৈনন্দিন সময়সূচি সংরক্ষণ, অ্যাপয়েন্টমেন্ট, মিটিং ও ভ্রমণ পরিকল্পনা সমন্বয় করা (দেশীয় ও বিদেশী)।অফিসিয়াল চিঠিপত্র, ইমেইল ও গুরুত্বপূর্ণ নথিপত্র খসড়া, পর্যালোচনা ও ব্যবস্থাপনা করা।মিটিং মিনিটস, প্রতিবেদন, প্রেজেন্টেশন প্রস্তুত করা এবং সিদ্ধান্ত বাস্তবায়নে ফলো-আপ করা।এমডি ও অভ্যন্তরীণ/বহিরাগত সংশ্লিষ্ট ব্যক্তিবর্গের মধ্যে যোগাযোগ সমন্বয় করা।চলমান প্রকল্পসমূহ পর্যবেক্ষণ এবং নির্ধারিত সময়সীমা অনুসরণ নিশ্চিত করা।এমডির নির্দেশনা, সিদ্ধান্ত ও বার্তা সংশ্লিষ্টদের কাছে পৌঁছে দেওয়া।দৈনন্দিন কার্যক্রমে প্রয়োজন অনুযায়ী সহায়তা প্রদান।সামনাসামনি যোগাযোগের ক্ষেত্রে স্মার্ট, মার্জিত ও উপস্থাপনযোগ্য ব্যক্তিত্ব বজায় রাখা।Educational RequirementsBachelor of Business Administration (BBA)Master of Business Administration (MBA)Skills Required: Personal Secretary, Office AdministrationExperience Requirements5 to 6 year(s)The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service, Manpower Recruitment, Group of CompaniesAdditional Requirementsবাংলা ও ইংরেজি ভাষায় চমৎকার দক্ষতা (লিখিত ও মৌখিক)।কম্পিউটার ব্যবহারে দক্ষতা (MS Word, Excel, PowerPoint, ইমেইল ব্যবস্থাপনা)।উন্নত যোগাযোগ, আন্তঃব্যক্তিক ও সাংগঠনিক দক্ষতা।একাধিক কাজ একসাথে পরিচালনা ও গোপনীয়তা রক্ষা করার সক্ষমতা।স্মার্ট, উদ্যমী, শৃঙ্খলাবদ্ধ, শারীরিকভাবে সুস্থ ও পরিপাটি উপস্থাপনযোগ্য ব্যক্তিত্ব।Job LocationDhaka (Banani)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370846349/",
    "job_id": "4370846349",
    "source": "linkedin",
    "company_name": "Broadway Support Services",
    "job_title": "CS Operations Analyst",
    "location": "Santo Domingo, Distrito Nacional, Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About UsBroadway Support Services is an affiliate company of one of the US's largest and most reputable debt settlement companies. We’re all about helping our customers through a tough financial time in their lives with education and individual customer service. We become our clients' number one advocate to help them reestablish financial stability as quickly as possible.OverviewThe CS Operations Analyst supports the Client Success department by maintaining operational workflows, improving processes, and managing small‑to‑medium‑scale automations that help the team work more efficiently. This role combines operational coordination, documentation, problem‑solving, and practical technical skills to support day‑to‑day needs and long‑term department initiatives.A successful candidate is highly organized, comfortable learning new systems, and able to apply basic technical skills (such as Power Automate, Python, JavaScript, or Salesforce configuration) to streamline work and reduce manual effort across the team.ResponsibilitiesOperational Support & Workflow Management Support the Operations Manager with tracking timelines, deliverables, and communication for ongoing departmental projects. Monitor workflow processes and ensure tasks are being completed accurately and on schedule. Maintain organized documentation for procedures, process updates, automations, and standard operating materials. Develop and maintain issue-tracking lists/logs to support visibility into open items and recurring problems. Process Improvement & Day-to-Day Problem Solving Identify gaps, bottlenecks, and inefficiencies in current workflows. Propose and implement improvements that increase accuracy, efficiency, and consistency across team operations. Conduct routine audits to ensure data accuracy, compliance, and correct handling of operational tasks. Assist with account verifications, documentation reviews, and general operational updates as needed. Automation Support (Applied, Not Engineering-Heavy) Build, maintain, and troubleshoot Power Automate (Cloud & Desktop) workflows that support Client Success processes. Use Python, Excel VBA, and basic JavaScript where appropriate to automate repetitive tasks or enhance existing tools. Maintain automation-related files and scripts using a Git repository for version tracking and safe change management. Develop or update simple HTML/JavaScript forms used to collect or validate data for internal workflows or Salesforce. Work with leadership to identify manual tasks that can be automated and help design practical solutions. Reporting & Light Analysis Build and maintain simple operational dashboards, trackers, or summaries to support leadership visibility. Track KPIs related to workflow performance, automation stability, and operational throughput. Identify small trends or issues in operational data to support decision-making (not advanced analytics). Cross-Functional Collaboration & Team Support Work with leadership, analysts, and operational staff to understand needs and translate them into practical workflow or automation updates. Apply basic Agile project organization: task breakdown, prioritization, progress tracking in managing projects. Provide guidance to junior analysts or team members on automation usage, documentation standards, or workflow logic. Communicate updates, issues, and improvements clearly across the department. Documentation & Knowledge Management Maintain clear and current documentation for workflows, scripts, dependencies, and known edge cases. Create and update documentation outlining: triggers, inputs, outputs, common failure scenarios, and remediation steps. Qualifications Bachelor’s degree in Business, Information Systems, Computer Science, or a related field — or equivalent practical experience. 1–2 years of experience in operations, workflow support, business process coordination, or similar roles. Strong organizational, communication, and time management skills. Ability to manage multiple projects and adapt in a fast-paced environment. Experience or familiarity with: Microsoft Power Automate (Cloud & Desktop) Python or Excel VBA JavaScript Salesforce data objects Git or version control workflows Analytical mindset with a focus on reliability, root-cause analysis, and continuous improvement Clear written and verbal communication skills Experience supporting operational processes, automation, or business analysis in a production environment BenefitsBroadway Support Services is a team-oriented environment full of rewards and growth opportunities for our employees. We are dedicated to our employee's success and growth within the company, through our employee mentorship and leadership programs.Our extensive benefits package includes: Law Benefits Private insurance Meal Subsidy Referral Program Transportation (Starting at 4:00 PM) Massive Growth Opportunities Continuous development Privileged location (City Center) Great Work Environment",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372239757/",
    "job_id": "4372239757",
    "source": "linkedin",
    "company_name": "Barden",
    "job_title": "Global Accounts Payable Manager",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Barden is proud to be partnering with the Senior Accounting Director global organisation headquartered in Ireland, to appoint a Global Accounts Payable Manager as part of an important phase of finance transformation.“As our business continues to evolve and grow globally, we recognise the need to strengthen ownership and strategic leadership within Accounts Payable. While we have a strong outsourced model in place, this role will bring clarity, structure and forward‑thinking direction to AP, ensuring it plays a critical role in our wider finance transformation journey.” - Chief Accounting Officer. Working in close partnership with senior finance leadership, this role will act as the global AP subject matter expert, overseeing an outsourced delivery model and driving continuous improvement across invoice‑to‑payment processes. This is a strategic individual‑contributor position, requiring strong stakeholder engagement, influence across Finance, and the ability to operate effectively in a complex, global environment undergoing systems and regulatory change.If you are an experienced AP Manager with strong exposure to outsourced operating models and finance transformation, then we should talk. If you have experience operating strategically within Accounts Payable, influencing stakeholders and improving processes in a global setting, then we should talk. If you are motivated by the opportunity to shape and elevate the AP function within a growing, internationally focused organisation, then we should definitely talk.Curious? You should be. Hit apply or contact Cole Carroll (cole.carroll@barden.ie) and Cole and her team will take things from there. Simple.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358867865/",
    "job_id": "4358867865",
    "source": "linkedin",
    "company_name": "Echelon Data Centres",
    "job_title": "Accounts Payable Specialist",
    "location": "Sandyford, Dún Laoghaire-Rathdown, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Echelon Data Centres was established in 2017 by the main principal of Aldgate Developments, a leading commercial property developer and owner of major commercial office buildings in Central London and Dublin. The objective was developing, operating, and owning a network of large-scale, responsibly designed, sustainably powered data centre campuses across the world to meet the rapidly expanding global demand for hyperscale data processing and storage solutions. Since then, the Echelon Group has expanded to ownership of six sites across Ireland and the United Kingdom, with further interests in Europe, and has secured >€1bn of funding to develop sites, giving the Group an enterprise value of c€2.5bn. The Group’s second campus will go live imminently.Located in Sandyford, Dublin, Echelon Data Centres is seeking an Accounts Payable Specialist to join the team and help to drive best-in-class vendor controls. The predominantly office-based role provides an excellent opportunity to further professional development in a dynamic, rapidly growing Irish company.ResponsibilitiesProcessing invoices and employee expense reports.Reconcile supplier statements and resolve discrepancies.Prepare and process vendor payments.Manage the group’s banking facilities.Work closely with the Project Management Team to ensure spend approval process is correctly implemented.Assist with monthly reporting to investors to maintain cash flow.Coordinating with members of the finance team to maintain reliable and accurate underlying financial information.Assisting with production of monthly management accounts, including balance sheet reconciliations.Supporting the team for annual audit.Implementing and suggesting improvements the Group’s internal controls.Providing ad-hoc finance support to members of the management team as required.Competencies, Behaviours and QualificationsAt least 2 years in a similar role.A strong attention to detail.IT literate with proficiency in MS Suite with Excel to intermediate level.Self-management skills with an ability to manage changing priorities.Highly organised.Flexible, positive, and innovative approach to work.Strong communication skills, both written and oral.Good team player.Proven ability to work independently and meet deadlines.Experience of NetSuite is desired but not essential.Echelon-DC is an inclusive organisation and we actively promote equality of opportunity for all with the right mix of talent, skills and potential. We welcome all applications from a wide range of candidates. Selection for roles will be based on individual merit alone. If you require reasonable accommodations to participate in the employee selection process, please contact our Careers team (careers@echelon-dc.com) directly.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370447674/",
    "job_id": "4370447674",
    "source": "linkedin",
    "company_name": "Urban Strategies Inc.",
    "job_title": "Senior Project Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Position Description Position Title: Senior Project AccountantUrban Strategies® is an urban design, planning and engagement consultancy with studios in Toronto, Ontario, Hamilton, Ontario, and Vancouver, BC. We lead complex projects in cities all over the world and have an active practice across Canada and in the US, the Caribbean, Europe, and Asia. We are problem solvers who can help achieve successful outcomes for the full range of urban opportunities. Urban Strategies is a group of 80+ Planners, Urban Designers and specialized staff. The firm is led by our 16 Partners and 7 Principals and supported by a complement of skilled professionals. We have diverse backgrounds, including architecture, landscape architecture, planning, public administration, engagement, geospatial analysis, graphic design and the visual arts. We combine our diverse perspectives to plan and design welcoming, thriving places – and have fun in the process.Position SummaryReporting to the CFO, the Senior Project Accountant partners closely with project managers and leadership to ensure accurate financial reporting, strong project controls, and timely billing across our portfolio of clients. The ideal candidate is detail-oriented, proactive, and experienced in project-based accounting environments.This is a full-time role.Location: Hybrid. Currently, a minimum of three days a week in office is required.Salary band: 90K-105K, depending on experienceResponsibilitiesProject AccountingSet up new projects based on client contracts and supporting spreadsheets, entering consultant and labour budgets and billing termsBill clients monthly, liaising with PMs to (including but not limited to); prepare and distribute draft invoices, revise invoices, finalize invoices, prepare backup and client reconciliations and custom invoice templates where needed, distribute invoices to clientsMaintain and update project budgets in Ajera as necessaryManage financial oversight for multiple client projects from setup through close-outWork with project managers to resolve issues with consultant invoices, including budget mismatchesCode, file, enter and post consultant and disbursement invoices, as backup to the General AccountantTimesheets – send out reminders to staff, follow up on outstanding timesheets, review timesheets and move hours as appropriateAccounts receivable – act as lead on accounts receivable follow up with clientsSend out WIP and AR statements to project leads, partners, and principalsComplete project profitability analysis for principals and PMs upon requestRespond to other project-related queries from the teams and the CFOAd hoc report and widget design in Ajera as neededWork with the CFO to improve processes and systems relating to project accountingOther project accounting duties as requiredCorporate AccountingPull month end reporting from Ajera, in support of financial package preparationAccounts payable support, as backup to the General AccountantCredit card reconciliation reviewHST preparationAssist with year-end preparation, and the year-end external reviewAd hoc report design in Ajera as neededOther duties as requiredSkills/Experience3-5+ years of experience in a Project Accounting capacityExperience with Deltek Ajera strong asset, experience with any Deltek system preferredProficient in MS office, with an advanced level of ExcelGood communication skills and ability to work with non-financial staffWork independently and exercise judgement on specific tasksStrong time management to meet deadlines and produce high-quality deliverablesAdapt and respond to a dynamic and fast-paced work environmentOpen-minded attitude and willingness to learnExcellent attention to detailGood analytical skillsWillingness to work in the office, minimum three days per weekUniversity-level accounting qualificationsUrban Strategies is proud to be an equal opportunity employer. We believe that success happens where new ideas can flourish – in an environment that values diversity, a place where people from various backgrounds and experiences can work productively together. Our studios are designed for maximum interaction, across all disciplines and levels of seniority. We cultivate an integrated, collegial workplace both in person and working remotely, with numerous staff committees, social events, and professional development programs. These opportunities to celebrate, learn and have fun together are essential to our philosophy as an organization. We strive to build up each other and the profession. We make space for everyone at the firm to grow, lead, teach and have an impact. We share what we learn and expand opportunities for people to participate in planning and design. Please visit our website to learn more about our firm. Note: This position description is intended to describe the general nature and level of work being performed. It is not an exhaustive list of all responsibilities, duties or skills required, and the employee may be required to perform other d",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375730932/",
    "job_id": "4375730932",
    "source": "linkedin",
    "company_name": "Winchesters",
    "job_title": "Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374612432/",
    "job_id": "4374612432",
    "source": "linkedin",
    "company_name": "HCR Permanent Search",
    "job_title": "Cost Accountant",
    "location": "Newmarket, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Our client in the Newmarket area needs to hire a Cost Accountant to join their team.Work Setting: On SiteLocation Details: Newmarket areaThis role manages comprehensive financial data reporting for a large-scale manufacturing facility. You will act as a critical link between plant operations and corporate leadership, ensuring the accuracy of production costs, variances, and financial forecasts. This position requires seamless collaboration with departments ranging from Engineering to Supply Chain to maintain data integrity within the ERP system.Key Responsibilities:Cost Analysis & Reporting: Oversee frozen and current cost reporting. Manage the month-end close process, including variance analysis, contribution margins, and inventory reconciliations.Budgeting & Forecasting: Lead the preparation of weekly sales/labor estimates, quarterly forecasts, and annual budgets. Track commodity fluctuations and tariff impacts.Operational Oversight: Maintain accurate Bills of Materials (BOM) and manage supplier rebates, surcharges, and accruals.Inventory & Audit: Serve as the lead auditor for physical inventories. Prepare working papers for internal/external audits and ensure compliance with global quality and safety standards.Continuous Improvement: Track cost-saving initiatives (CI), analyze scrap trends, and develop profitability models by part number and program.Compliance: Ensure all activities adhere to industry-standard quality management systems and regional regulatory requirements.Skills & Qualifications:Education: Post-secondary degree in Finance or Accounting; CPA designation (in progress or equivalent) is required.Experience: 5+ years of accounting experience in a manufacturing environment Technical Skills: Minimum 2 years of dedicated costing experience within an SAP/ERP environment is essential.Advanced Excel: Must be proficient in complex data modeling and spreadsheet management.Communication: Proven ability to translate complex financial data for non-finance stakeholders.Why Join?:-Join a dynamic and successful organization that truly values its employees.-Enjoy a competitive, comprehensive benefits package designed to support your well-being.-Be part of a supportive workplace culture that fosters professional development and offers clear pathways for long-term career advancement.Apply Now!If you believe you are an outstanding candidate for this opportunity, we invite you to submit your resume and all relevant information to HCR Permanent Search in confidence to:Matthew Snidermsnider@hcr.caPlease indicate the name of the position you are applying for in the subject heading. Only those selected to move forward in the consideration process will be contacted. Thank you for your interest!HCR Permanent Search is recruiting on behalf of our client for an existing vacancy within their organization.HCR Personnel Solutions Inc. welcomes applications from people with disabilities. Accommodation is available upon request for candidates taking part in all aspects of the recruitment and selection process.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366508491/",
    "job_id": "4366508491",
    "source": "linkedin",
    "company_name": "Astra-North Infoteck Inc. ~ Conquering today’s challenges, achieving tomorrow’s vision!",
    "job_title": "Business Analyst - BFSI Domain",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374885194/",
    "job_id": "4374885194",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Tax & Bookkeeping Intern (Remote) - For SNF Accounting Canada - Job ID: 1462773",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "SNF Accounting Canada is looking for Tax & Bookkeeping Intern (Remote)Job Description / ResponsibilityAbout the Role:We are a growing Canadian accounting firm seeking a motivated accounting professional to join our team. This is an excellent opportunity to build your career while gaining valuable Canadian corporate experience that will strengthen your profile for future immigration to Canada.Responsibilities:Prepare personal and corporate tax returns for Canadian clientsPerform bookkeeping, account reconciliation, and bank reconciliationsCompile and prepare financial statements for various Canadian-based clientsSupport ongoing client accounting needs throughout the yearAssist with month-end and year-end financial processesEmployment StatusInternWorkplaceWork from homeEducational RequirementsBachelor of Commerce (BCom) in AccountingBachelor of Business Administration (BBA) in AccountingACCA, CMA, CPASkills Required: VAT, Income Tax, Bookkeeping, Quickbook OnlineExperience Requirements1 to 5 year(s)The applicants should have experience in the following business area(s):Consulting Firms,Audit Firms /Tax ConsultantFreshers are also encouraged to apply.Additional RequirementsMinimum 3–6 months of experience in accounting, bookkeeping, or taxAccounting degree completed or in progressCandidates pursuing ACCA, ACA, CMA or similar professional qualifications preferredStrong attention to detail and willingness to learnComfortable using cloud-based accounting tools (QuickBooks experience is an asset)Own computer and reliable internet connection requiredJob LocationAnywhere in BangladeshSalaryTk. 5000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4214555135/",
    "job_id": "4214555135",
    "source": "linkedin",
    "company_name": "Sabrina-Dream Properties Ltd.",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4253120721/",
    "job_id": "4253120721",
    "source": "linkedin",
    "company_name": "Wärtsilä নিয়োগ",
    "job_title": "Senior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355805937/",
    "job_id": "4355805937",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Junior Accounts Officer (Canteen) (For Pro-Active Medical College ...",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374662060/",
    "job_id": "4374662060",
    "source": "linkedin",
    "company_name": "Brainhunter Systems Ltd",
    "job_title": "Senior Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Brainhunter is currently seeking the services of a “ Senior Financial Analyst” for a contract role with one of our Valued Clients.Client Location: TorontoVacancy Status: Open/ExistingWorking Environment: HybridEmployment Type: ContractHourly Compensation: Open to Negotiation. Final compensation will be negotiated between the contractor and recruiter based on experience and engagement terms.Skills Required:Reconciliation experience – preferably in financial services – could be any form of recons as the skills can be transferable but preferably in AR , AP , Interco and Bank recsMonth end process experience including creating journal entries , supporting working papersGood communication skills both verbal and written – as will include communication with external vendors and service providersStrong ability to translate business transactions into journal entries and financial impact and clearly communicate this in summary format without being lost in the detailsStrong ability to ask questions without hesitation when not able to understandStrong Excel skills (vlookup, SumIf, pivot tables)SAP ECC experience would be nice to haveActuals to budget and actuals to prior mth variance analysis – nice to haveUnderstanding or experience with the telecom industry – nice to haveHow to Apply:Online: To apply for this and other suitable exciting opportunities with Brainhunter Systems Ltd., you can apply online through the button on the top right. AI tools may be used for initial screening of applicants.E-mail: Please email Reema at reema.kaur@brainhunter.com with an attached copy of your CV.Brainhunter is an equal opportunity employer and is committed to providing a workplace free from harassment and discrimination. Brainhunter encourages applications from women, Indigenous peoples, veterans, persons with disabilities, members of visible minorities and persons of all races, ethnic origins, religions, abilities, sexual orientations, and gender identities and expressions. We provide accommodation upon request during the recruitment process; please let the job poster know.We thank all applicants for their interest, however only those candidates selected for Interviews will be contacted.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4179316501/",
    "job_id": "4179316501",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ECHOTEX LIMITED নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374871937/",
    "job_id": "4374871937",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Research Analyst (For National Credit and Commerce Bank PLC)- Job ID - 1462378",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4223524747/",
    "job_id": "4223524747",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts & Payroll Officer (For Mates Global)-Job ID: 1364184",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3988512611/",
    "job_id": "3988512611",
    "source": "linkedin",
    "company_name": "A Concern of Purbani Group)",
    "job_title": "For Karim Textiles Limited",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4117108937/",
    "job_id": "4117108937",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "HR Admin Officer (For Tech Rajshahi Ltd.)-Job ID: 1325208",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323441553/",
    "job_id": "4323441553",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Payroll & Bookkeeping Coordinator (LATAM)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4086079260/",
    "job_id": "4086079260",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "Accounts and Finance Officer (For Shataphool Bangladesh)",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353874122/",
    "job_id": "4353874122",
    "source": "linkedin",
    "company_name": "Job ID: 1451309",
    "job_title": "Executive- Accounts (Plant)- For Delta Pharma Ltd.",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]