[
  {
    "url": "https://www.linkedin.com/jobs/view/4303822628/",
    "job_id": "4303822628",
    "source": "linkedin",
    "company_name": "Corsair",
    "job_title": "Accountant",
    "location": "Taoyuan City, Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "General Purpose JOB DESCRIPTION Provide accounting and cost analysis support for the factory, including general accounting, GL reconciliation, cost analysis, and inventory accounting, to ensure accurate and timely financial reporting. The role works closely with Operations and requires good English communication skills, strong attention to detail, and a willingness to learn.ResponsibilitiesPosition Summary, Responsibilities and Expectations:Perform daily general accounting tasks and support month-end close.Prepare and review GL entries and perform account reconciliations.Assist with manufacturing cost analysis, including materials, labor, and overhead.Maintain accurate inventory accounting and support periodic inventory counts.Prepare basic cost and variance reports for manufacturing operations.Work with Operations and Plant teams to gather data and validate information.Support budgeting, forecasting, and financial reporting activities.Provide information for internal and external audits.Maintain Accurate Documentation And Follow Company Accounting Policies.as RequiredExpectationsDeliver accurate and timely financial information.Maintain strong attention to detail and good record-keeping habits.Communicate clearly with Operations and Finance teams (English required).Work proactively to identify issues and assist in problem-solving.Demonstrate teamwork, responsibility, and willingness to learn.Follow internal controls, company policies, and accounting standards.Essential Skills And ExperienceBachelor’s degree, preferably in Accounting.2–3 years of experience in the accounting field; experience in an accounting firm is a plus.Background in GL accounting; experience in general accounting or cost/manufacturing accounting preferred.Understanding of accounting processes, procedures, and internal controls.Strong Excel skills and basic financial analysis capability.Good PC skills, including MS Office; ERP experience desirable (Oracle preferred).Effective written and verbal communication skills; English proficiency required.Detail-oriented, organized, and able to handle daily tasks accurately.Ability to adapt quickly, learn independently, and manage multiple priorities and deadlines.Able to work under pressure and in a team environment; proactive and self-motivated.Manufacturing environment experience is a plus.daily jobs.daily jobs.About UsCORSAIR (NASDAQ:CRSR), founded in 1994, is a leading global developer and manufacturer of high-performance gaming and streaming gear. With 21 different product lines, CORSAIR offers a complete range of products that help digital athletes perform at their peak and enable streaming creators to produce studio-quality content for their fans. CORSAIR has built a passionate base of loyal customers due to its gamer- and creator-centric design philosophy, commitment to high performance, and professional quality.The company has received more than 4,000 product awards and has a footprint that reaches customers in more than 75 countries. CORSAIR also includes subsidiary brands Elgato, which provides premium studio equipment and accessories for content creators, SCUF Gaming, which builds custom-designed controllers for competitive gamers, ORIGIN PC, a builder of custom gaming and workstation desktop PCs and laptops, Drop, a community-driven company that designs and curates enthusiast keyboards and peripherals, and Fanatec, a leading manufacturer of high-end sim racing hardware.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376031900/",
    "job_id": "4376031900",
    "source": "linkedin",
    "company_name": "Pierre Fabre Laboratories",
    "job_title": "Finance Controller/Specialist",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Main responsibilities / job expectations:Work closely with external accountant for daily activity and month end closing.Manage the end-to-end expense control process, including the collection, verification, and validation of supplier invoices and employee expense claims, and coordinate with the external accounting firm to ensure accurate booking in the ERP system.Elaborate rolling forecasts, budget, estimates and long-term plan for the entrusted scope of activities and in accordance with the company’s standards & procedures.Provide management with timely and insightful financial and business analysis, monitor KPIs and performance versus budget and forecast, and proactively identify risks, opportunities, and action plans to achieve targets.Monitor sales (Sell in /Sell out/inventory), prices and commercial policy application.Contribute on improving processes, tools, automation (including but not limited to forecasting/budgeting process, management reporting process and any other business needs).Develop financial models and build business cases to evaluate new business opportunities / Support mid-term and long-term strategic topics.Prepare and assist with required information for internal and external audits.Credit Management for all Export area and assist on cash collection.Ensure compliance with management rules and ensure the proper functioning of the financial processes in force within the company.Experience & Key Technical Competencies Required:Bachelor or Master degree level (in accounting/finance)At least 3 years of working experience in the controlling or audit field and in a cross-cultural environment, across various geographic areas would be a plus.Commercial Acumen, impeccable ethics, proactivity and resourcefulStrong statistical, reporting and analytical skillsAbility to be both concise and detail-orientedExcellent communication & interpersonal skills, speak up mindsetNaturally willing to go extra mile in delivering quality work standardsProficient with Office suite and Excel especiallyERP experience is a must (Dynamix preferred) as well as BI and reporting tools (HFM, Tableau, Essbase)Fluent written and spoken English & MandarinPierre Fabre is committed to equality of opportunity for all staff and applications. Individuals are encouraged to apply regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion, or belief.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378312302/",
    "job_id": "4378312302",
    "source": "linkedin",
    "company_name": "USANA Health Sciences",
    "job_title": "Accountant",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "DescriptionWho We Are Looking ForWe are looking for a detail-oriented and results-driven individual to join USANA’s Taiwan finance team as an Accountant. In this position, you will assist the Finance Manager in the accounting cycle while exhibiting a sound working knowledge of Generally Accepted Accounting Principles (GAAP).EssentialWhat You Will Do as USANA’s AccountantReconcile daily cash and credit card sales, and follow discrepancy if any.Follow on pending sales payment and BOA account discrepancy.Process sales returns / exchange and review manual SVP adjustment requests by CS team.Responsible for Treasury management on account liquidity.Maintain petty cash on hand for coin change per CS’s request.Prepare AP wire payments via online banking.Responsible for the weekly commission payments and company account commission invoice check.Prepare commission reject re-send and court order payment requests.Process sales returns / exchange and review manual volume adjustment requests by CS team.Responsible for commission relate withholding tax and supplementary national health insurance filing.Responsible for month-end closing on commission process.Responsible for the bi-monthly VAT filing and reconciliation.Responsible for the annual product purchase and retirement report filing with the tax office.Responsible for fixed asset management and in charge on annual stock take and asset physical count.Assist Financial Audit and Income audit process, and responsible for commission and revenue reconciliation for income auditing propose.Perform other duties as assigned or needed.AdditionalParticipate as a team player in team and cross functions. Perform other duties or ad hoc projects as assigned or needed. Background And Skills You Will NeedMust have a Bachelor’s degree in Accounting, Finance or relevant discipline. At least 4 years’ experience in Finance and Accounting. Multinational accounting firm experience is preferred, and with direct selling industry experience is plus.Able to be flexible and assist in daily accounting as required.Effective communication skills.Must be detail-oriented and results-oriented, have an ability to work autonomously, set and achieve aggressive goals and deadlines.Proficient in written English, spoken English is an advantage.Experience in a CPA firm is an advantage.Familiar with Oracle system is plus.Position is located in TaiwanAbout USANASince 1992, USANA has provided the world with the highest-quality products focused on nutritional supplements, skincare, and a healthy lifestyle. But our commitment to excellence goes far beyond our products. USANA is dedicated to share our vision of health by empowering a global family of incredible employees based in more than 20 different markets around the world.Community is at our core. It is our commitment to always strive to be open-minded listeners, hold ourselves and others accountable, be respectful, and celebrate the strength that comes from collaboration. Through initiatives like our Diversity, Equity, and Inclusion Council, we create a company culture where all members of the USANA Family feel cared for, included, and valued.USANA employees do more than work for our company––we embody the culture, and we live our company values: Excellence, Integrity, Health, and Community. We are committed to doing whatever it takes to ensure USANA’s direct-selling Associates are supplied with whatever they need to become successful.USANA Health Sciences, Inc. will only collect personally identifiable information through direct contact from official HR personnel using an official business email address. If you receive a request to provide information via an unsecure or unofficial source, please disregard the email and contact USANA directly.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4231037984/",
    "job_id": "4231037984",
    "source": "linkedin",
    "company_name": "Hyatt Regency",
    "job_title": "Accountant - Payables",
    "location": "Taoyuan City, Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Organization- Hyatt Regency Taoyuan International AirportSummaryYou will be responsible to assist with the efficient running of the department in line with Hyatt International's Corporate Strategies and brand standards, whilst meeting employee, guest and owner expectations. Ensures the smooth and efficient running of the accounting functions within the Accounting Department.QualificationsIdeally with a relevant degree or diploma in Finance, Commerce or Hospitality/Tourism management. Minimum 2 years of work experience as Accountant or Accounting Clerk in hotel operation. Good problem solving, administrative and interpersonal skills are a must.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368513632/",
    "job_id": "4368513632",
    "source": "linkedin",
    "company_name": "Kering",
    "job_title": "KERING - Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Responsibilities• Audit sales figures in the system to ensure accuracy. Verify the sales data with financial record. • Monitor and record stock transactions in system and conduct regular physical inventory counts. Identify and investigate the discrepancies or issues with inventory. • Prepare monthly closing related entries. • Ensure the accuracy and completeness of monthly accrual information per group entities instruction, so that provides the essential information for strategic decision-making. • Ensure IC transactions and reconciliation match with group entities and consistently reports are correct. • Manage fixed assets, depreciation and/or amortization calculation accuracy and update in due course continuously. • Ensure VAT information is complete and correct. Declare VAT data online bimonthly. • Collect and input lease information in the system (IFRS16). • Support external / internal audit and provide the responsible PBC. Ensure the accuracy of Tax filing and statutory report. • Delivery of effective communication with the brands to collect feedback and build up professional service. • As part of team backup program, fully support the team to ensure the normal operation of the team smoothly. • Participate in Ad hoc projects as assigned. Qualifications• BA degree in accounting or related field. • 3 years+ work experience in accounting field, retail experience is a plus. • Good reading and writing English skills. • Strong communication, coordination skills and passion for learning. • Ability to work under pressure and meet tight deadlines with accuracy. • Sufficient MS Excel skill.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369097601/",
    "job_id": "4369097601",
    "source": "linkedin",
    "company_name": "Synera Renewable Energy",
    "job_title": "Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role OverviewIn the role as the Accountant, you will be responsible for all the accounting matters for all the assigned entities under the SRE group. The role will be based in Taipei, Taiwan.Key ResponsibilitiesTo support Project related accounting and tax activities.Manage periodic closing of management accounts, ensuring the integrity of accounting information.Assist in the preparation of financial statements and other internal and external financial reports.Aid in evaluating short-term cash flow forecasts.Facilitate annual audits, statutory accounting, and tax filings.Contribute to the development and enhancement of accounting systems and procedures.Address ad-hoc requests related to accounting and tax matters.Skills For SuccessTechnically competent in commonly used concepts, practices, and procedures within the accounting fieldAbility to problem-solve and think independently.Attention to detail and good organizational skills.Ability to take full responsibility for quality of work.Ability to work with little supervision and under tight deadlines.Proficient with Microsoft Excel and Word Ability to present information clearly orally and in written format and respond to questions from Senior Management, auditors, and other internal or external customers.Ability to prioritize tasks and manage them simultaneously.Experience solving issues as they arise and dealing with multiple variables in situations where only limited standardization exists.RequirementsBachelor’s degree in accounting, CPA is preferred.Minimum of 5 years of experience in financial accounting, of which 3 years in house mandatory.Good presentation and interpersonal skills with a good command of verbal and written English mandatory.Competency with ERP system (SAP or Oracle) is required. Familiar with IFRS and Taiwan general accounting as well as corporate finance principles and processesPrior experience in closing and reporting for multi-location companies on a consolidated basis is preferred.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377478794/",
    "job_id": "4377478794",
    "source": "linkedin",
    "company_name": "NVIDIA",
    "job_title": "Manager, Accounting",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "NVIDIA has transformed modern computer graphics, high‑performance computing, and artificial intelligence. As the AI computing company, our technologies are the brains powering Deep Learning, accelerated analytics, modern data centers, smart cities, autonomous vehicles, and more. We are seeking an Accounting Manager to join our finance organization on-site in Taipei, Taiwan. This role offers an outstanding opportunity to be part of a dynamic group that is instrumental in crafting the future of AI and computing. It is ideal for a forward‑thinking, hands‑on leader who thrives in a fast‑paced, constantly evolving environment. You will manage day‑to‑day accounting operations, ensure high‑quality financial reporting, and drive process improvements while partnering with cross‑functional teams across the region.What You'll Be DoingLead, coach, and develop the accounting team, setting clear expectations and driving strong engagement and execution.Own month-end and quarter-end close processes to ensure timely, accurate, and well-controlled financial reporting aligned with corporate and group requirements.Oversee general ledger integrity, including journal approvals, account reconciliations, fluctuation analysis, and compliance with IFRS, US GAAP, and local standards.Manage statutory reporting and external audits, coordinating with auditors to deliver statutory financial statements and resolve audit issues proactively.Drive compliance activities including VAT, withholding tax, and corporate income tax filings, partnering with the regional tax team and supporting transfer pricing documentation.Maintain fixed asset accounting processes, ensuring accurate capitalization, asset completeness, and alignment between local and group ledgers.Support cash management activities such as cash flow forecasting, bank reconciliations, and collaboration with Treasury on banking matters.Drive process improvement and automation initiatives, strengthening internal controls and partnering with FP&A/business stakeholders to provide insights and support key projects.What We Need To SeeBachelor’s degree or above in Accounting, Finance, or a related discipline.10+ overall years of progressive accounting/finance experience, preferably in a multinational or fast-paced environment.3+ years of proven leadership/people management experience.Strong hands-on experience in general ledger accounting, month-end close, statutory reporting, and audits.Solid technical accounting expertise with working knowledge of IFRS and US GAAP, including ability to interpret complex standards.Working knowledge of local tax and regulatory compliance (e.g., VAT, WHT, corporate income tax, statutory filings) and experience coordinating with tax teams/advisors.Demonstrated ability to build and maintain strong internal controls and documentation to meet corporate and audit requirements.Strong analytical and problem-solving skills, with experience driving process improvements in complex environments.Excellent communication and stakeholder management skills across cross-functional and global teams, including the ability to explain accounting topics to non-finance partners.Proficient in ERP systems (preferably SAP) and advanced Excel skills; fluent in English (additional regional languages are a plus).Ways To Stand Out From The CrowdProfessional qualification such as CPA, CA, or equivalent.Prior experience managing various APAC entities and exposure to multi‑jurisdictional statutory reporting and tax.Hands‑on experience with SAP and finance process automation tools or analytics platforms.Demonstrated success in leading transformation or standardization projects, such as process re‑engineering, system rollouts, or control framework enhancements.Experience in the technology, semiconductor, or high‑growth environments where scalability and continuous improvement are critical.We are looking for a driven, curious, and collaborative Accounting Manager who is eager to grow with NVIDIA and help us build the financial foundation for the next era of AI and accelerated computing.With competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the most desirable employers in the world. We have some of the most brilliant and talented people in the world working for us. If you are creative, autonomous and love a challenge, we want to hear from you. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status., , JR2012992",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4289805607/",
    "job_id": "4289805607",
    "source": "linkedin",
    "company_name": "Chubb",
    "job_title": "【安達產險】Accountant, FIN Dept.(IFRS17)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369310839/",
    "job_id": "4369310839",
    "source": "linkedin",
    "company_name": "Thermo Fisher Scientific",
    "job_title": "Accountant I",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321726490/",
    "job_id": "4321726490",
    "source": "linkedin",
    "company_name": "CHANEL",
    "job_title": "Financial Controller",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374875353/",
    "job_id": "4374875353",
    "source": "linkedin",
    "company_name": "CRIF",
    "job_title": "Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "COMPANY DESCRIPTIONAbout CRIFCRIF is a global leader in credit bureau, business information, and credit risk solutions. We elevate businesses to the next level with an expert blend of data and analytics. Through data-driven insights, we empower businesses to make confident, sustainable decisions across the credit lifecycle, while mitigating risk and fuelling growth.Headquartered in Itay with more than 6,000 professionals worldwide, we operate in 39 countries across four continents. We have a strong presence in Asia with regional headquarters in Hong Kong SAR and Singapore, as well as offices in key cities including, Dushanbe, Hanoi, Ho Chi Minh City, Jakarta, Kaohsiung, Kuala Lumpur, Manila, Shanghai, Shenzhen, Taipei, Taichung, Tashkent, Tokyo and Zhongli.Job Description:1. Daily accounting tasks and inventory cost calculation. 2. Business tax, various income adjustment schedules, and withholding tax. 3. Providing relevant reports for overseas companies. 4. Tasks assigned by supervisors. 5. Periodic job rotation as needed.Requirements:1. Over 5 years of work experience. 2. Educational background: General Business, Accounting, or related fields. 3. Experience working in an accounting firm is a plus.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372968501/",
    "job_id": "4372968501",
    "source": "linkedin",
    "company_name": "Thermo Fisher Scientific",
    "job_title": "GL Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Work ScheduleStandard (Mon-Fri)Environmental ConditionsOfficeAt Thermo Fisher Scientific, our Finance teams are important to our business and functional teams to make educated, sound decisions that drive our Mission and make us a stable and trusted industry leader. From Financial Planning & Analysis, Tax, Treasury, Financial Reporting, Audit, Investor Relations, Strategy & Corporate Development to Accounting, our Finance functions have a diverse and global presence, providing significant opportunities to develop outstanding career experiences and perspectives. Perform monthly closing activities including journal entries, accruals, reporting and analysis Ensure compliance with U.S. GAAP, Sarbanes-Oxley requirements, company policy, approval authority matrix and standard operating procedure; recommends changes to strengthen control environment Carry out sophisticated accounting treatment and prepares financial documents and supplementary reporting Support internal and external audit requirements Drive continuous improvement and uses systems to increase controls and efficiencies. Handle ad-hoc accounting and finance projects assigned by managementRequirements Bachelor's Degree in Accounting. 8 years of experience in accounting or finance , MNC experience preferred.Knowledge, Skills, Abilities Excellent understanding of financial accounting standards and internal controls Challenges the status quo; introduces and proactively seeks out new insights and solutions to strengthen our performanceGood communication skills in both Chinese and English.Strong analytical, problem-solving, and attention-to-detail skills.Ability to work independently and meet tight closing deadlines",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4298988139/",
    "job_id": "4298988139",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Specialist－Transfer Pricing－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 592Job Function: TaxJob Location: TaipeiAbout The BusinessDue to the rapidly changing business environment faced by multinational companies, the increase in related-party transactions, growing complexity of deals, and differing transfer pricing regulations across countries, transfer pricing has become a critical issue in tax planning for multinational companies. A company’s transfer pricing policies are closely linked to income tax, business tax, customs duties, and other taxes, directly affecting overall profitability. Without proper transfer pricing planning, companies may face excessive tax burdens and increased risks of adjustments, penalties, and double taxation.With years of experience in transfer pricing, a strong global network, deep understanding of international regulations, and a team of tax and economic professionals, Deloitte provides comprehensive transfer pricing tax consulting services to help multinational companies comply with local requirements, reduce tax burdens, and minimize the risk of double taxation.Work You'll doAssist Taiwanese businesses with investment structures, tax, and process planning related to overseas investments. Assist foreign companies in applying for various tax incentives and reducing withholding tax rates (e.g., applying tax treaties, profit margins, Article 25 of the Income Tax Act), as well as providing tax consultation for investments in Taiwan. Assist foreign companies with tax health checks for their subsidiaries/branches in Taiwan (including income tax, business tax, customs duties, and stamp duties). Provide tax consulting on investment structures and transaction processes for foreign companies investing in Taiwan. Provide tax compliance and investment structure tax analysis for cross-border mergers and acquisitions. Assist foreign and Taiwanese companies in preparing transfer pricing reports and handling transfer pricing project reviews. Assist foreign and Taiwanese companies in preparing master file submissions, country-by-country reports, and reviewing tax risks in transaction processes and investment structures. Assist foreign companies with their subsidiaries/branches in Taiwan in applying for unilateral or bilateral advance pricing agreements and reviewing profit allocation and tax risk. RequirementsA degree or higher in Accounting, Finance, Economics, or other business-related fields. Strong proficiency in both Chinese and English communication and writing, with a TOEIC score of 750 or higher preferred. Proficient in Microsoft Office: Word, Excel, PowerPoint, Outlook. Strong system thinking, communication, coordination, teamwork, sales and persuasion skills, high self-management, and high standards. Detail-oriented, patient, with excellent organizational skills. No experience required; relevant work experience is a plus.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368080913/",
    "job_id": "4368080913",
    "source": "linkedin",
    "company_name": "Synera Renewable Energy",
    "job_title": "Accountant",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4152294692/",
    "job_id": "4152294692",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "A.審計類(台北)-審計員",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362732170/",
    "job_id": "4362732170",
    "source": "linkedin",
    "company_name": "SGS",
    "job_title": "Accountant(約聘一年，有續約/轉正機會)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359232136/",
    "job_id": "4359232136",
    "source": "linkedin",
    "company_name": "Warner Music Group",
    "job_title": "Accounting Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4296875605/",
    "job_id": "4296875605",
    "source": "linkedin",
    "company_name": "The Shanghai Commercial & Savings Bank",
    "job_title": "會計人員",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "求才內容： [ 職務內容 ] 總行會計處帳務費用處理、稅務管理，及提供分行帳務諮詢、內部管理報表。 [ 部 門 ] 會計處 [ 職務性質 ] 正式人員 [ 上班地點 ] 台北市中山區 [ 到職日期 ] 不限 [ 薪資待遇 ] 台幣 41800 - 44200 [ 需求人數 ] 1 [ 休假制度 ] 週休二日 [ 上班時段 ] 08 : 45 ~ 17 : 30 工作條件要求： [ 學歷要求 ] 學士 [ 科系要求 ] 會統類 [ 工作經驗 ] [ 專業認證 ] [ 語文條件 ] [ 電腦專長 ] [ 所需駕照 ] [ 其他條件 ] 1.會計本科系畢業尤佳。具四大會計師事務所審計或稅務一年以上經驗尤佳。※薪資學士：每月薪資(含膳費)NT$41,800碩士：每月薪資(含膳費)NT$44,200應徵資訊： [ 聯 絡 人 ] 許小姐 [ 聯絡信箱 ] hr@scsb.com.tw [ 應徵方式 ] 1. 採網路報名，恕不接受實體文件。 請務必詳細填寫個人履歷、中英文自傳、上傳個人照片，並留下正確聯絡E-mail，資料不全者恕不受理。",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370650433/",
    "job_id": "4370650433",
    "source": "linkedin",
    "company_name": "dentsu",
    "job_title": "Accountant",
    "location": "Xinyi District, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330444272/",
    "job_id": "4330444272",
    "source": "linkedin",
    "company_name": "Morrison Express",
    "job_title": "(HQ) Accounting & Reporting Supervisor/Assistant Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4278025880/",
    "job_id": "4278025880",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Consultant - Internal Control and Assurance Consulting－Assurance－A&A",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 573Job Function: AssuranceJob Location: Taipei, Kaohsiung, HsinchuAbout The BusinessWork You'll do Assist in the reasonable assurance program review for internal control projects (including internal control system reviews for pre-IPO/listed/over-the-counter companies and post-listing internal control project reviews for the first listing/over-the-counter (KY)). Provide internal control system consulting services and execute agreed-upon procedures. Execute various assurance projects (such as ESG). Assist in promoting assurance services. Certifications required: Certified Internal Auditor (CIA), and Certified Public Accountant (CPA).RequirementsEducational Requirements: A bachelor's degree or higher in a related field.Preferred Qualifications Practical experience in executing internal control reviews for IPO projects is highly preferred. Interest in business operations and internal control-related work. Interest in ESG assurance-related work. Strong communication skills and the ability to maintain good relationships with clients. Self-motivated with the ability to work independently and under pressure. Ability to produce high-quality work under time pressure, with strong report writing skills. Ability to work as part of a team, with an open learning attitude and spirit of teamwork. Proficiency in Office software (Word, Excel, PowerPoint, etc.).",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295932554/",
    "job_id": "4295932554",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Intern－Transfer Pricing－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 764Job Function: TaxJob Location: TaipeiAbout The BusinessDue to the rapidly changing business environment faced by multinational companies, the increase in related-party transactions, growing complexity of deals, and differing transfer pricing regulations across countries, transfer pricing has become a critical issue in tax planning for multinational companies. A company’s transfer pricing policies are closely linked to income tax, business tax, customs duties, and other taxes, directly affecting overall profitability. Without proper transfer pricing planning, companies may face excessive tax burdens and increased risks of adjustments, penalties, and double taxation.With years of experience in transfer pricing, a strong global network, deep understanding of international regulations, and a team of tax and economic professionals, Deloitte provides comprehensive transfer pricing tax consulting services to help multinational companies comply with local requirements, reduce tax burdens, and minimize the risk of double taxation.Work You'll do Engagement preparation: risk management checks, client and case setup, contract preparation. Transfer pricing support: preparation of interview presentations, meeting minutes, database identification, comparable company search, drafting/updating reports. Others: case filing, legal research, and assisting with tasks assigned by supervisors.Requirements Currently studying in Accounting, Taxation, Economics, or Business-related majors. TOEIC score of 700 or above is a plus.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4301113908/",
    "job_id": "4301113908",
    "source": "linkedin",
    "company_name": "Advanced Energy",
    "job_title": "Senior Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361344836/",
    "job_id": "4361344836",
    "source": "linkedin",
    "company_name": "SiTime",
    "job_title": "Sr. Accountant",
    "location": "Taoyuan District, Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About SiTimeSiTime Corporation is the precision timing company. Our semiconductor MEMS programmable solutions offer a rich feature set that enables customers to differentiate their products with higher performance, smaller size, lower power and better reliability. With more than 3 billion devices shipped, SiTime is changing the timing industry. For more information, visit www.sitime.com .Job SummaryThe Sr. Accountant – Accounts Payable will be a key member of a dynamic and fast-growing Accounting team reporting to the Ukraine-based AP Manager. The Senior Accountant – AP is responsible for overseeing domestic and international accounts payable activities with a focus on production-related expenses (e.g., project costs, operations, events, or manufacturing). This role manages complex invoice processing, vendor relationships, and compliance across multiple countries, currencies, and project-based workflows. The position ensures accurate and timely payments while improving AP systems, controls, and processes to support global production and operational efficiency.ResponsibilitiesOversee the full cycle of Production/Inventory invoices from purchase requisition to paymentExcellent understanding of three-way match for production invoices through the B2B processVerify and investigate discrepancies, if any, by reconciling vendor accounts and monthly vendor statementsResponsible for the Month-End close process to post Accrual entries and do reconciliation of AP production clearing accountAbility to understand the mismatch of Invoices with Goods Receipts and work on resolutions to complete processing Invoices on timeProvide timely responses to all requests regarding account payables or general inquiriesMaintain tight coordination with the production team to resolve discrepancies, ensure budget alignment, and support financial trackingOversee AP processes for international entities, including high-volume, multi-currency invoices and payments.Ensure compliance with local tax laws, including VAT/GST, withholding tax, and country-specific invoicing requirements.Collaborate with international offices, production teams, and regional finance partners to streamline cross-border AP workflows.Assist with SOX compliance documentationQualifications & Requirements University degree in Accounting/Finance/Economics. At least 5+ years of accounting experience Strong experience with international AP operations and multi-currency payments. Advanced knowledge of invoicing, POs, three-way matching, contract reviews, and production cost structures. Knowledge of the English language (intermediate and above); verbal and written communication skills Costing experience is a plus Experience with Excel, Word, and Outlook Experience with Accounting/ERP systems/Oracle Fusion Desired Characteristics & AttributesAbility to quickly grasp new business and transactional processes and work rapidly and accurately under pressure A “can do” attitude Ability to meet tight deadlines with the highest quality of work Strong analytical and problem-solving ability High attention to detail and accuracy Flexible timing to work with US team and the Manager Work independently with minimal supervision Excellent oral and written communication skills At SiTime, we believe great work deserves great rewards. We offer a comprehensive and highly competitive compensation package designed to attract top talent. In addition to base salary, this role is eligible for a quarterly bonus tied to the achievement of innovation goals—reflecting our commitment to recognizing meaningful impact. We also offer equity grants, providing a meaningful opportunity to share in the company’s future growth and success.SiTime is an Equal Opportunity Employer . We treat each person fairly and we do not tolerate discrimination or harassment against anyone on the basis of any protected characteristics, including race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, pregnancy, political affiliation, protected veteran status, protected genetic information, or marital status or other characteristics protected by law. SiTime participates in the E-Verify program. Learn More about SiTime: Review the Get to Know SiTime section of our career page to explore our culture, values, and what makes us unique. Innovation on Top – Philosophies of Innovation with Rajesh Vashist Fabrication Knowledge – An Interview with Rajesh Vashist SiTime Corporation – YouTube",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265224093/",
    "job_id": "4265224093",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Intern－International Tax－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4152295627/",
    "job_id": "4152295627",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "A.審計類(台北)-資深審計員",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4260290524/",
    "job_id": "4260290524",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "審計類(台北)-審計服務中心初級專員(有工作經驗者)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346822393/",
    "job_id": "4346822393",
    "source": "linkedin",
    "company_name": "WT Microelectronics 文曄科技(股)公司",
    "job_title": "Accounting Manager(G/L Team)",
    "location": "Zhonghe District, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "WT Group, a Taiwan-headquartered multinational company with 150+ global sites. This role offers broad exposure to cross-border operations, international collaboration, and diverse financial challenges. Join us to shape global finance in WT Group.【Responsibilities】▶Lead the month-end closing process and review financial statements for Taiwan entities to ensure accuracy, timeliness, and high-quality financial reporting.主導台灣各公司月結作業與財務報表覆核，確保帳務精準、資訊即時。▶Oversee tax filing and compliance management, proactively identifying and mitigating potential tax risks.負責稅務申報與合規管理，提前識別並降低潛在稅務風險。▶Conduct in-depth research on accounting and tax matters, providing practical and forward-looking professional advice.研究會計與稅務議題，提出具實務性與前瞻性的專業建議。▶Drive continuous improvement in accounting systems and workflows by introducing automation and data-driven practices to enhance efficiency and transparency.推動會計制度與流程創新，導入自動化與數據化思維，提升作業效率與透明度。▶Collaborate closely with cross-functional teams, offering professional accounting insights to support business operations and decision-making.與跨部門團隊協作，提供專業會計建議，支持營運與決策。【Qualifications】】•Minimum of 10 years of accounting experience, including at least 5 years in a supervisory or managerial role.•Strong knowledge of IFRS, Taiwan GAAP, and local tax regulations.•Certified Public Accountant (CPA) qualification is plus.•Familiarity with SAP, or experience in system implementation and process improvement is plus.•Proficiency in VBA, Python, and BI tools (e.g., Power BI or Tableau) for data analysis and process automation is plus.•Strong written and verbal communication skills in English .",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355951743/",
    "job_id": "4355951743",
    "source": "linkedin",
    "company_name": "Vishay Siliconix Itzehoe GmbH",
    "job_title": "Chief Accountant, Finance",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377143201/",
    "job_id": "4377143201",
    "source": "linkedin",
    "company_name": "Monolithic Power Systems, Inc.",
    "job_title": "Sr. Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366065485/",
    "job_id": "4366065485",
    "source": "linkedin",
    "company_name": "BizLink Group",
    "job_title": "會計人員",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366140359/",
    "job_id": "4366140359",
    "source": "linkedin",
    "company_name": "Vishay Intertechnology, Inc.",
    "job_title": "Chief Accountant, Finance",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325648047/",
    "job_id": "4325648047",
    "source": "linkedin",
    "company_name": "YAGEO Group",
    "job_title": "(Taipei) 會計經理 / Accounting Manager",
    "location": "New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "台灣區各廠之總帳/AP/AR之會計主管, 包含審核帳務,各項費用類及AR/信用控管/稅務相關事宜 審核台灣各子公司各季度財簽資料及年度稅簽資料。 其他主管交辦之專案事項。",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360399499/",
    "job_id": "4360399499",
    "source": "linkedin",
    "company_name": "PharmaEssentia Corp.",
    "job_title": "Finance & Accounting Manager _Taipei",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376023558/",
    "job_id": "4376023558",
    "source": "linkedin",
    "company_name": "Michael Page",
    "job_title": "Finance & Accounting Manager / Financial Services MNC",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376389800/",
    "job_id": "4376389800",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Specialist－International Tax－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 567Job Function: TaxJob Location: TaipeiAbout The BusinessWith the liberalization, internationalization, and globalization of trade and investment, cross-border transactions and investments have become issues that businesses must address. Deloitte, with years of experience in providing tax consulting services to multinational clients, close cooperation with member firms in 150 countries, and professionals from diverse international backgrounds, is able to effectively align with clients' business strategies to provide tax consulting services. This helps reduce the risks and tax burdens of cross-border investment transactions, thereby enhancing the competitiveness of enterprises.Work You'll doDomestic and International Investment Structure and Tax Consulting and PlanningInvestment Structure Planning and Various Tax Incentive Applications for Foreign Enterprises Investing in TaiwanCross-Border Transaction Processes and Tax Planning for Financial ProductsTax Treaty Utilization PlanningInvestment Structure Planning for Enterprises Listing OverseasTax Due Diligence and Investment Structure Tax Planning for Cross-Border M&A TransactionsBEPS and Transfer Pricing ServicesFINI (Foreign Investment Institution Investor) Tax Agent ServicesEstablishment, Maintenance, and Consulting of Offshore CompaniesRequirementsProficient in English listening, speaking, reading, and writing, with a TOEIC score of at least 800Proficient in Microsoft Office - Excel/Word/PowerPoint/OutlookStrong system thinking and communication coordination skillsDetail-oriented, patient, and excellent organizational skills",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374273780/",
    "job_id": "4374273780",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【策略與交易諮詢服務】精算服務 - 經理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355511868/",
    "job_id": "4355511868",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【稅務服務】全球貿易及供應鏈稅務諮詢 - 經理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3967805750/",
    "job_id": "3967805750",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】財務會計諮詢服務 - 副組長/組長/副理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355347634/",
    "job_id": "4355347634",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】資深經理/協理- Senior Manager Level (台北)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265216855/",
    "job_id": "4265216855",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Specialist－Quality Risk Management－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 642Job Function: TaxJob Location: TaipeiAbout The BusinessWork You'll doUnderstand internal risk management regulations and assist in risk control.Assist with internal case reviews.Execute tax-related project tasks.Other duties assigned by supervisors.RequirementsGraduated with a degree in Business, Arts, or related fields (Bachelor's degree or higher).Proficient in English (listening, speaking, reading, and writing).Skilled in Microsoft Office (Word, Excel, PowerPoint, Outlook).Strong communication and coordination skills, team collaboration, high self-management ability, proactive and motivated.No experience required; experience is a plus.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355375140/",
    "job_id": "4355375140",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【稅務服務】全球貿易及供應鏈稅務諮詢 - 副組長/組長/副理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339173624/",
    "job_id": "4339173624",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Specialist－Business Tax－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 719Job Function: TaxJob Location: TaipeiAbout The BusinessDomestic tax laws are constantly evolving and becoming increasingly complex. At the same time, the internationalization of businesses is rapidly advancing. In response to the ever-changing business environment, transaction models are continuously adjusted, leading to various uncertainties regarding the application of tax laws. In this process, Deloitte will assist clients in understanding the potential impact of each tax issue on their business and how to respond in a timely and appropriate manner. This ensures that tax disputes do not become obstacles to business growth and operations, while also helping companies stay on top of key tax concerns.Work You'll do Tax attestation services for subsidiaries and branches of foreign companies in Taiwan, as well as large listed Taiwanese companies, including VAT input tax audit attestation. Tax advisory services for foreign and local enterprises, including transfer pricing project review. Tax advisory for M&A transactions and tax due diligence. Applications for tax incentives and reduced withholding tax rates (e.g., royalty exemptions, contribution-based reductions, Article 25 of the Income Tax Act, deferral of compensation tax). Assisting foreign and large listed Taiwanese companies in preparing transfer pricing documentation, country-by-country reports, and master files. Investment and equity structure planning for SMEs and Taiwanese companies preparing for IPO. Individual and family succession tax planning and advisory. Estate and gift tax consulting and filing. Tax advisory and compliance related to Controlled Foreign Company (CFC) regulations. Tax administrative remedy services.Requirements A degree or higher in Accounting, Finance, or related business fields. Proficient in English listening, speaking, reading, and writing. No experience required; experience in auditing or tax-related work is a plus. Proficient in Microsoft Office: Word, Excel, PowerPoint, Outlook. Optimistic, proactive, creative, with strong communication skills and a high level of interest in learning.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370941093/",
    "job_id": "4370941093",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Specialist－Transfer Pricing & Investment Structures－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375322565/",
    "job_id": "4375322565",
    "source": "linkedin",
    "company_name": "Accurate愛客獵 - 1111Headhunt",
    "job_title": "會計主管 (3009977)",
    "location": "New Taipei City, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284434290/",
    "job_id": "4284434290",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Staff－Business Process Solutions－Business Process Solutions－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3967808464/",
    "job_id": "3967808464",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】財務報表審計 - 副組長/組長/副理 (台北)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363988205/",
    "job_id": "4363988205",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【稅務服務】移轉訂價 - 副組長/組長/副理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378606818/",
    "job_id": "4378606818",
    "source": "linkedin",
    "company_name": "Everest Clinical Research",
    "job_title": "Manager, Human Resources",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Everest Clinical Research (“Everest”) is a full-service contract research organization (CRO) providing a broad range of expertise-based clinical research services to worldwide pharmaceutical, biotechnology, and medical device companies. We serve some of the best-known companies and work with many of the most advanced drugs, biologics, diagnostics, and medical devices in development today.Founded in 2004, Everest has grown from a small biometrics consultancy into a leading full-service CRO with more than 700 employees and over 100 active clients worldwide. Our continued success is driven by high-quality deliverables, exceptional client service, and a culture of flexibility and innovation.Quality is our backbone, customer-focus is our tradition, flexibility is our strength…that’s us…that’s Everest.Everest’s headquarters is located in Markham (Greater Toronto Area), Ontario, Canada. We have additional offices around the world including the United States, Taiwan, Bulgaria, Poland, Romania, Croatia and China. We also have remote employees across the globe.To drive continued success in this exciting clinical research field, we are seeking committed, skilled, and customer-focused individuals to join our winning team as a Human Resources Manager or Senior Human Resources Manager for our Taipei, Taiwan on-site location which can be a hybrid role in accordance with our Work from Home policy.Summary:The incumbent will support the Executive Director, Human Resources and local Site Management in providing Human Resources (HR) services for the Taipei, Taiwan based employees. This will include Employee Relations, Recruitment, Training, Benefits, Compensation, Health and Safety, Employee Communications, developing HR polices, and maintaining a HR Information System. The incumbent may also act as a Site Manager and Taiwan Management Representative for local contracts and agreements and be responsible to ensure compliance with Taiwanese laws and regulations. The individual will be a main point of contact locally for employees and will provide management support to the office.Responsibilities Include:Lead and direct the development and implementation of new HR standards and procedures. Lead regional recruitment activities which will include creating job postings, advertising open positions on various web sites and interacting with recruitment agencies, pre-screening resumes with department managers, conducting candidate screening procedures, assisting the department management team with technical interviews, administrating skill-based tests, conducting reference checks, background checks, and preparing offer letters. Provide onboarding training and facilitate the gathering of new employee paperwork such as personal information, and confidentiality agreements. Provide employee payroll changes to payroll administrator on a monthly basis, which may include updating employee information including address changes and salary information. File all employee changes in the employee HR file. Assist Site Management and may act as a site management representative for local contracts and agreements. Ensure compliance with Taiwan laws and regulations. Act as Office Manager for Taipei, Taiwan office. Manage consultant contracts. Perform Benefit administration duties (setting up new hires, ending enrollment for terminated employees, making changes to benefit plans, provide employee education and be the point of contact for employee inquiries). Manage any Disability/Leave of Absences. Maintain employee files and ensure accurate employee records are kept up to date. Maintain an annual review schedule and notify the respective manager of upcoming review dates. Assist employees with any company timesheet system issues. Assist with semi-monthly checks on employee timesheet reports and follow up with employees on any discrepancies. Manage employee attendance records and perform reconciliations between attendance records and timesheet reports semi-monthly. Complete vacation and other absence tracking and record keeping for site as needed. Enter employee information in the Human Resources Information System (HRIS). Conduct “check-in” discussion with new employees following three months of service and conduct exit interviews when someone is leaving the company. Receive any employee concerns and resolve where possible. Where such concern cannot be resolved then will be responsible to communicate any employee concerns to senior management and be a management advocate of any managerial decisions and implementation of any such communications. Participate in the planning and execution of company staff social and celebratory events per Company guidelines. . Assign administrative tasks to other designated personnel. Manage designated staff regarding purchase of office supplies, cleanliness of office, plant maintenance, and well maintained office environment etc. Approve any office purchases and invoices to be provided to the accountant. . Act as a primary l",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363215163/",
    "job_id": "4363215163",
    "source": "linkedin",
    "company_name": "TalentPlus Consultants",
    "job_title": "[Taoyuan] 財務經理 Finance & Accounting Manager",
    "location": "Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329046473/",
    "job_id": "4329046473",
    "source": "linkedin",
    "company_name": "BTSE",
    "job_title": "[Web3] 財務會計專員 Accountant (Mandarin-speaking)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329145680/",
    "job_id": "4329145680",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Senior Manager, Global Lead for Tax Controversy (Bangkok/Singapore Based, Relocation Provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About AgodaAt Agoda, we bridge the world through travel. Our story began in 2005, when two lifelong friends and entrepreneurs, driven by their passion for travel, launched Agoda to make it easier for everyone to explore the world.Today, we are part of Booking Holdings [NASDAQ: BKNG], with a diverse team of over 7,000 people from 90 countries, working together in offices around the globe. Every day, we connect people to destinations and experiences, with our great deals across our millions of hotels and holiday properties, flights, and experiences worldwide.No two days are the same at Agoda. Data and technology are at the heart of our culture, fueling our curiosity and innovation. If you’re ready to begin your best journey and help build travel for the world, join us.Job Summary:As a Senior Manager, Global Lead for Tax Controversy you will be responsible for leading the company’s global tax controversy and audit strategy end-to-end. You will report directly to the Head of International Tax. This role will own and coordinate all phases of tax audits and disputes, from initial information requests through resolution, while building best-practice frameworks and partnering with Government Affairs, Legal and Commercial teams to support and influence tax policy in key markets.The ideal candidate is a senior tax professional with strong technical expertise in tax law, significant experience managing complex crossborder controversies and regional tax disputes, proven negotiation skills, and a track record of preparing robust audit defenses and acting as a trusted advisor to senior leadership; legal training or experience as a tax lawyer is required for this position.Key Responsibilities:Lead Tax Controversy & AuditsLead and manage all tax controversy matters, including audits, notices, refund claims, appeals, and litigation. Act as the global lead for all cases, setting strategy and overseeing end to end management from initial inquiry to resolution. Serve as the primary point of contact with tax authorities, external advisors, and internal stakeholders on all controversy matters. Strategy, Technical Analysis & DefenseDevelop and implement effective strategies for resolving tax disputes and managing tax risk across jurisdictions. Analyze and interpret complex tax laws, regulations, treaties, and case law to support and defend the company’s positions. Prepare, review, and quality-control responses to tax authority inquiries, RFIs, and audit findings, ensuring technical accuracy and consistency. Draft persuasive arguments, legal memoranda, position papers, and documentation for dispute resolution, appeals, and litigation. Frameworks, Processes & DocumentationDesign and maintain best-practice frameworks, playbooks, templates, and documentation standards for managing tax audits and controversy globally. Maintain comprehensive and well-organized documentation and records of all controversy-related activities in the region and globally. Support the company’s global tax strategy and ensure consistency in controversy management and messaging across jurisdictions. Cross-Functional Collaboration & Policy InputCollaborate closely with internal Tax, Legal, Government Affairs, PR, Finance, and business teams to ensure aligned positions and coordinated responses. Monitor tax and policy developments globally and assess the potential impact on ongoing and future controversies. Provide technical input to policy and advocacy initiatives, working with Government Affairs and industry groups where relevant. Risk Management, Training & LeadershipContribute to the identification, assessment, and communication of controversy-related tax risks to senior management. Promote tax controversy awareness and best practices within the Agoda Group and in collaboration with other BHI brands, including training and guidance for junior team members and other departments. Drive continuous improvement in controversy processes, incorporating learnings from past audits and disputes into future risk mitigation. Qualifications:Bachelor’s degree in Accounting, Finance, Law, or related field; advanced degree (JD, LLM, MST, or equivalent) preferred. Legal training (law degree or experience as a tax lawyer)Professional certification (CPA, Chartered Accountant, or equivalent) is a plus. Minimum 8-10 years of relevant experience in tax controversy, audit defense, or tax litigation, in law firms, accounting firms or MNCs with significant experience in the Asia Pacific region (e.g., China, Japan, Korea, Southeast Asia, Australia, India). Prior experiences in the US and Europe would be an added advantage. In-depth knowledge of tax laws, regulations, and dispute resolution processes. Demonstrated experience leading complex, multi-jurisdictional tax audits or disputes, including direct interaction with tax authorities. Proven ability to draft and review high-quality technical documentation (position papers, memos, correspondence with authorities). Excellent analytical",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354592881/",
    "job_id": "4354592881",
    "source": "linkedin",
    "company_name": "PwC",
    "job_title": "顧問類-顧問/資深顧問(精算服務)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341571332/",
    "job_id": "4341571332",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Specialist－Business Tax Certification Services－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369315464/",
    "job_id": "4369315464",
    "source": "linkedin",
    "company_name": "Delta Electronics",
    "job_title": "Business Operations & Financial Analyst_Global Service Operations(Taipei)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265222164/",
    "job_id": "4265222164",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Analyst / Consultant / Senior Consultant－Deloitte Forensic & Financial Crime－Consulting Businesses",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329006682/",
    "job_id": "4329006682",
    "source": "linkedin",
    "company_name": "BTSE",
    "job_title": "[Fintech] Senior Financial Analyst (Mandarin-speaking)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378756118/",
    "job_id": "4378756118",
    "source": "linkedin",
    "company_name": "Arup",
    "job_title": "Assistant Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Joining ArupArup’s purpose, shared values and collaborative approach has set us apart for over 75 years, guiding how we shape a better world.This is an opportunity to undertake a varied and challenging role in the East Asia Finance Business Partnering team.The Assistant Finance Manager will have a key leadership position across finance and operational teams in the Geographical region.You will support the leadership in the performance of their groups, providing high quality and timely financial advice, driving profitability and growth, leading on the budgeting and forecasting and supporting in new bids and projects and commercial decision making.The Assistant Finance Manager will also have a key oversight of the group financial policies and procedures and work collaboratively with the other Finance Business Partners to raise standards, ensuring consistency in approach to achieving best practice delivery from the finance teams and timely reporting to support commercial decision making.The OpportunityPartner closely with senior leaders and operational teams to provide clear financial insight, challenge assumptions, and support strategic and commercial decision‑makingSupports project performance management and delivery of business objectives across multiple jurisdictionsDeliver high‑quality financial analysis, project reviews, and cost control insights to drive profitability, efficiency, and sustainable growth across portfolios and projectsSupport new bids by providing financial inputBuild strong, trusted relationships with stakeholders while improving finance processes, data quality, and reporting to enable better business outcomesPerform end‑to‑end accounting operations including, intercompany transactions, account reconciliations, and month‑end closingEnsure compliance with local statutory and tax requirements, including VAT (GUI), withholding tax (WHT), second‑generation NHI, and corporate income tax filingsChallenge the status quo. Promote a culture of continuous improvement, standardization and simplification. Work in partnership with Shared Services Centre (SSC), Regional and Global FinanceSupport budgeting, forecasting (ABP) ,and variance analysis in line with group planning cyclesEnsure adherence to internal controls, group policies, and applicable accounting standards (e.g. IFRS or group GAAP)CompetenciesAccountable for delivery of planned project outcomes and quality standardsConnects detailed work to broader operational and strategic objectivesCommunicates effectively with diverse stakeholders and audiencesPromotes collaboration and builds strong internal and external relationshipsAdapts positively to change and seeks innovative solutionsSupports and develops team members; may supervise junior staffManages performance, provides feedback, and plans ongoing professional developmentDemonstrates and applies Arup values in daily workAt Arup, you belong to an extraordinary collective – in which we encourage individuality to thrive. Our strength comes from how we respect, share and connect our diverse experiences, perspectives and ideas.You will have the opportunity do socially useful work that has meaning – to Arup, to your career, to our members and to the clients and communities we serve.Is this role right for you?Minimum 7 years of relevant accounting and finance experience, preferably within a sizable corporation or multinational companyBachelor’s degree in Accounting, Finance, or Business AdministrationBig 4 experience and hands‑on exposure to APAC markets are an advantageCPA or equivalent professional qualification (e.g. CPA, ACCA) preferredStrong knowledge of Taiwan tax regulations, including VAT/GUI, WHT, 2nd NHI, and corporate income taxFluent in both Mandarin and English, with the ability to communicate effectively in a multinational working environmentStrong communication skills with the ability to work effectively with peers, and managementTeam‑oriented, proactive, and solution‑focused with a positive “can‑do” attitudeAble to adapt to change and work in a fast‑paced, multinational environmentWilling to challenge existing processes and support continuous improvement initiativesSolid technical knowledge of accounting, internal controls, tax, audit, and governanceProficient in Microsoft Office and finance/accounting systems; Power BI or data analytics experience is a plusNote: Candidates with less experience will be considered for the position of AccountantWhat We Offer YouAt Arup, we care about each member’s success, so we can grow together.Guided by our values, we provide an attractive total reward package that recognizes the contribution of each of our members to our shared success. As well as competitive, fair and equitable pay, we offer a career in which all of our members can belong, grow and thrive – through benefits that support health and wellbeing, a wide range of learning opportunities and many possibilities to have an impact through the work they do.We are owned in trust on behalf of ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4281622792/",
    "job_id": "4281622792",
    "source": "linkedin",
    "company_name": "Chubb",
    "job_title": "【安達產險】 Assistant Manager, Finance Dept.",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374551880/",
    "job_id": "4374551880",
    "source": "linkedin",
    "company_name": "YFYJUPITER",
    "job_title": "Finance Manager / Assistant Manager 財務經理／副理",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372837737/",
    "job_id": "4372837737",
    "source": "linkedin",
    "company_name": "IDP Education Ltd",
    "job_title": "Manager/Senior Finance Manager",
    "location": "Taipei City, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About IDPIDP is the global leader in international education services, delivering global success to students, test takers and our partners, through trusted human relationships, digital technology and customer research. An Australian-listed company, we operate in more than 50 countries around the world.Our team is comprised of over 7,000 people of various nationalities, ages and cultural backgrounds. Proudly customer-first, our expert people are powered by global technology. Together, we offer unmatched services, helping local dreams become realities, all over the world.Learn more at www.careers.idp.comRole purposeThe Manager/Senior Finance Manager is responsible for the overall Finance and Administration function in Taiwan and is primarily responsible for working with the IDP Taiwan country leader to track and drive performance and highlight business performance opportunities.Key responsibilitiesPerformance including Budget & Forecast· Lead country financial planning (budgeting, forecasting and reporting) – providing reports and analysis and insights on business performance to Regional Finance Director, Country Director , Taiwan management team proactively or on request.· Providing commentary around variance to prior forecast, budget or last year.· Monitor budgets and overall financial performance. Initiate corrective action with CD where required.· Closely track forecast accuracy and build culture of proactivity and continuous forecast improvement amongst local operational teams.Routine Financial Management · Lead efficient and effective day to day operational finance activities (AR, AP, GL, income and bank reconciliation, cash management, payroll) and routine financial activities (financial accounting, month end/year-end closing, audits, tax and company secretary work).· Oversight of the month and year end process including ensuring the completion of the General Ledger and Balance Sheet reconciliations.· Cashflow forecasting and management.· Effective financial control and risk assessments.· Managing the company’s financial systems.Compliance · Ensuring all financial accounting obligations and statutory requirements (including licenses and company secretarial) are met for all Taiwan legal entities for IDP and in line with local laws and accounting / tax standards· Preparation and submission of profits tax return.· Embed compliance with all regulatory and legal requirements in all offices in operational policies, procedures and systems.People & Leadership· Review finance team activity and deliverables, agreeing on priorities with direct managers.· Mentor and motivate team to uplift performance.· Significant interaction with global finance stakeholders (Region Finance, FSS, FPA).· Develop a dynamic, inclusive workplace, building the culture while recognizing and celebrating innovation, success and achievement.Projects· Support global finance transformation implementation.· Locally lead projects to synergise IDP Taiwan’s entity structures.· Lead or participate in other projects as they arise.Administration & Procurement· Lead local offices lease negotiation/office renovation & consolidation and administration procurement with set policies and procedures.· Handling contractual and legal matters.· Ensuring Taiwan business operates within global & regional procurement and spend policies.Required experience· Bachelor’s degree in Accounting, Finance, Business or Commerce.· 10+ years of finance work experience and Minimum 3+ years’ experience in a managerial level.· Holder of post graduate finance qualifications e.g. CPA or equivalent.· Good understanding of local compliances and requirements.· Capability to effectively handle multiple priorities.· “Fire in the belly” – motivated to learn swiftly and add value.· Experience using AI would be beneficial.· Ability to connect across levels including senior leadership members.· Demonstrated ability to manage internal and external relationships.· Demonstrated experience in mentoring and motivating team members to higher achievement.· The ability to manage critical deadlines and competing priorities.· Strong communication skills in Chinese and English (verbal, written and timely) to operate effectively with global colleagues.· Transparency in communication internally and externally.· Makes and keeps business commitments.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369506857/",
    "job_id": "4369506857",
    "source": "linkedin",
    "company_name": "Edwards Lifesciences",
    "job_title": "Senior Analyst, Finance",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364125383/",
    "job_id": "4364125383",
    "source": "linkedin",
    "company_name": "IDP Education Ltd",
    "job_title": "Senior Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363907526/",
    "job_id": "4363907526",
    "source": "linkedin",
    "company_name": "hermeneutic Investments",
    "job_title": "Finance Manager - Asian Timezones",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330629185/",
    "job_id": "4330629185",
    "source": "linkedin",
    "company_name": "Trip.com Group",
    "job_title": "Finance Manager - Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About UsFounded in 1999 and listed on NASDAQ in 2003 and HKEX in 2021, Trip.com Group is a leading global travel service provider comprising of Trip.com, Ctrip, Skyscanner, and Qunar.Across its platforms, Trip.com Group integrates travel resources from industry partners and helps travellers worldwide pursue the perfect trip with exceptional travel products and services.We have four Customer Service Centres for Trip.com established in Japan, Korea, the UK, and the Philippines, providing 24/7 customer service in 19 different languages.We have more than 30,000 employees scattered across 30 countries in Asia, Europe, the Americas, and Oceania, striving to expand our global markets and aiming to be the world’s leading and most trusted family of online travel brands that aspire to deliver the perfect trip at the best price for every traveller.In this Role, you’ll get toBookkeeping & and tax complianceMaintain full sets of accounts and ensure all accounting transactions are recorded in general ledger accuratelyEnsure accuracy and timeliness of monthly closing of accountsEnsure accuracy and timeliness of all tax filing and payment (VAT, WHT, CIT etc)Statutory & tax auditsComplete audit for all local entities on time as per statutory requirementsLiaise with tax authorities, auditors, tax agents and company secretariesInvoice policy and OA trainingsAdvise and assist local staff for travel and business expenses reimbursement application process in OA systemOrganize regular employee OA reimbursement trainingEnsure compliance with company policy and internal controlsOthersSupport for the company's business, such as support for the renewal of business licenses, etcAssist in ad-hoc duties as and when assignedWhat you'll Need to SucceedBachelor's degree in finance or other related disciplines.At least 5 years of relevant experience in general accounting and taxation.Strong analytical and problem-solving skills.Familiarity with International Financial Reporting Standards (IFRS) and local financial regulations.In-depth knowledge of Taiwan tax rules and regulations.Strong understanding of internal controls and corporate governance.Proficiency in MS Office and accounting software (Oracle preferred).Excellent communication skills in English.Why Trip.com GroupWe offer a stage to unleash your full potential and drive global impact. As an international team, we embrace an open and inclusive culture that supports and respect team members in and out of the workplace. Everyone is on a trip, whether it's a career trip or a life trip. At Trip.com Group, you can define your own trip by setting a goal and celebrate your success by recognizing the progress you have made.What’s more?Our rapid business growth in global offers abundant career opportunities at various levels and in multiple functionsInternal transfer is encouraged, and global job rotation program enable you to pursue a global career path and make global impactWe provide learning opportunities to further your career in areas of leadership capability, soft skill and professional expertise.We encourage flexible work arrangementHave fun with company-sponsored greetings and activities at holidays, birthdays, and colorful team events.Find out more job opportunities at https://careers.trip.comHave a good trip, and see you soon!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374276117/",
    "job_id": "4374276117",
    "source": "linkedin",
    "company_name": "CASETiFY",
    "job_title": "Assistant Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4328506919/",
    "job_id": "4328506919",
    "source": "linkedin",
    "company_name": "Delta Electronics",
    "job_title": "Industry Key Account Manager – Finance & Healthcare_Taiwan Region(Taipei)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377608120/",
    "job_id": "4377608120",
    "source": "linkedin",
    "company_name": "Celestica",
    "job_title": "Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375260197/",
    "job_id": "4375260197",
    "source": "linkedin",
    "company_name": "Novo Nordisk",
    "job_title": "Sr Manager, Business Finance & Analytics",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Novo Nordisk TaiwanDepartment: Finance & OperationsLocation: Taipei, TaiwanThe Position Manage Anchor Budget (AB) and Rolling Estimates (RE) processes: Oversee the planning, execution, and monitoring of AB and RE cycles to ensure accurate and timely financial forecasting. Coordinate with relevant stakeholders to align financial plans with strategic objectives. Provide financial analysis and management reporting: Deliver detailed financial insights and reports to support decision-making at local and global levels. Identify trends, variances, and opportunities to optimise financial performance. Ensure transparency in organisational performance against targets: Monitor and evaluate performance metrics to ensure alignment with short- and long-term goals. Communicate findings effectively to stakeholders to maintain clarity and accountability. Partner with local and global management to drive value creation: Collaborate with management teams to identify and implement initiatives that enhance financial outcomes. Leverage data and business acumen to provide actionable recommendations. Perform financial controlling to ensure budget and compliance adherence: Ensuring the right allocation of resources to growth opportunities and securing a positive return on investment (RoI). Conduct thorough reviews of budgets and expenditures to ensure compliance with financial policies and regulations. Support project controlling activities to maintain financial integrity and accountability. Responsible for ensuring adherence to compliance requirements, internal controls, and standard operating procedures (SOPs). Leadership and People Management: Provide coaching and guidance to team members to enhance performance and capability. Foster professional development through mentoring and continuous learning opportunities. Implement succession planning to build a strong and sustainable talent pipeline.QualificationsBachelor's and above degree in Finance, Economics, Business Administration, or a related field. Professional certification (e.g. CPA or equivalent) is a plus.6-8 years of experience in Business Finance & Analytics or related field. Experience in pharmaceutical, FMCG or similar industry is a plus.Deep understanding of local dynamics in Taiwan market.Proven expertise in managing complex financial processes such as Anchor Budget and Rolling Estimates.Strong understanding strategic financial management.Experience in mentoring and collaborating with senior colleagues.Proficient in both written & speaking English and Chinese.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants.At Novo Nordisk, we're not chasing quick fixes – we're creating lasting change for long-term health. For over 100 years, we've been driven by a single purpose: to defeat serious chronic diseases and help millions of people live healthier lives. This dedication fuels our constant curiosity and inspires us to push the boundaries of what's possible in healthcare. We embrace diverse perspectives, seek out bold ideas, and build partnerships rooted in shared purpose. Together, we're making healthcare more accessible, treating and preventing diseases, and pioneering solutions that create change spanning generations. When you join us, you become part of something bigger – a legacy of impact that reaches far beyond today.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375662983/",
    "job_id": "4375662983",
    "source": "linkedin",
    "company_name": "Alchemy Global Talent Solutions",
    "job_title": "Finance Administration Manager",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We are seeking an experienced and hands-on Finance & Administration Manager to oversee financial operations and administrative functions in Taiwan. This role will take full responsibility for accounting, reporting, payroll, taxation, cash flow management, and internal controls, while supporting operational activities within the Moving and Relocation Division.The successful candidate will act as a key business partner to senior management, providing accurate financial insight, ensuring statutory compliance, and maintaining smooth day-to-day office and HR administration.Key ResponsibilitiesManage full set of accounts, month-end closing, and quarterly financial statementsPrepare management reports, budgets, forecasts, and cash flow projectionsOversee statutory reporting, VAT and corporate tax filings, and audit coordinationManage accounts receivable/payable and monitor DSOAdminister monthly payroll and statutory submissionsSupervise accounting processes for relocation operations, including sales cut-off, accruals, and tonnage reportingMaintain fixed asset register and capital expenditure trackingOversee general office administration and support HR-related mattersIdentify and strengthen internal controlsRequirements10+ years’ finance experience, including 3+ years in a managerial roleStrong knowledge of full-cycle accounting, tax compliance, and statutory reportingExperience in multinational or service-based industries preferredAdvanced Excel skillsFluent in English and ChineseProactive, detail-oriented, and able to work independently in a fast-paced environment",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361819836/",
    "job_id": "4361819836",
    "source": "linkedin",
    "company_name": "KKCompany",
    "job_title": "[Corporate] Senior Financial Analyst",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369472146/",
    "job_id": "4369472146",
    "source": "linkedin",
    "company_name": "BizLink Group",
    "job_title": "Digital Transformation manager(Finance)",
    "location": "New Taipei City, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role Summary:We are seeking a highly driven and experienced professional to manage and lead strategic digital transformation initiatives specifically within the Finance function. The ideal candidate will possess a strategic mindset, deep understanding of both financial business processes, and knowledge of emerging technologies. This role is crucial for driving organizational change, optimizing operations, and delivering impactful digital solutions that enhance both employee and customer experiences. Success in this position requires a proven track record in comprehensive project management and effective stakeholder collaboration.Core Responsibilities:Strategic Planning & Alignment: Collaborate closely with Finance leadership to pinpoint challenges, identify opportunities for digital optimization, and ensure all digital initiatives are fully aligned with the broader business strategy and objectives.Process Innovation & Design: Conduct in-depth analysis of current Finance processes to identify inefficiencies. Design and implement optimized, future-state processes by strategically leveraging digital technologies (e.g., RPA, AI/ML, cloud-based solutions, advanced analytics).Project Leadership & Delivery: Oversee the entire lifecycle of digital transformation projects within Finance, from initial concept to successful implementation and post-launch support. This includes clearly defining project scope, objectives, deliverables, timelines, and required resources.Technology Assessment: Research, evaluate, and recommend suitable digital technologies and solutions to meet specific business needs, working in partnership with the IT department and external technology vendors.Stakeholder & Vendor Management: Cultivate strong working relationships with key stakeholders across Finance, HR, IT, and other relevant departments. Effectively manage expectations, communicate progress, secure crucial buy-in, and manage external vendors and consultants to ensure timely delivery and quality standards.Change Management & Adoption: Develop and execute robust change management strategies, including comprehensive communication plans and training programs, to ensure the smooth transition and successful adoption of new systems and processes by end-users.Performance & Risk Oversight: Establish clear Key Performance Indicators (KPIs) to monitor the effectiveness of deployed digital solutions, ensuring desired business outcomes are achieved. Proactively identify potential risks and challenges associated with transformation projects and develop effective mitigation plans.Team Collaboration: Work actively with colleagues within the Digital Transformation Office to share best practices, pool expertise, and maintain consistency across all enterprise transformation efforts.Qualifications:Education: Bachelor's degree in Business Administration, Information Technology, Finance, Human Resources, or a related discipline. A Master's degree is highly preferred.Experience: Minimum of 10 years of experience in project management, business analysis, or consulting, with a strong focus on leading complex digital transformation initiatives.Domain Expertise: Demonstrated experience managing projects specifically within the Finance domain (e.g., ERP systems, financial planning & analysis tools, procure-to-pay automation, financial consolidation).Technical Knowledge: Solid understanding of digital transformation principles, methodologies, and core technologies (e.g., RPA, AI/ML, cloud computing, data analytics, low-code/no-code platforms).Leadership Skills: Proven ability to lead and inspire cross-functional teams, influence decision-makers, and consistently deliver measurable results in a complex organizational environment.Core Competencies: Exceptional analytical, problem-solving, and decision-making capabilities. Excellent verbal communication, presentation, and interpersonal skills are essential.Preferred Assets: Project management certification (PMP, PRINCE2, Agile) and prior experience in the manufacturing or technology industry are advantageous.Language: Fluency in both English and Mandarin Chinese is required.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368962612/",
    "job_id": "4368962612",
    "source": "linkedin",
    "company_name": "UnicornFintech",
    "job_title": "Senior Data Analyst (Finance Department)",
    "location": "Taipei–Keelung Metropolitan area",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About the RoleAs a key driver of our group's data strategy, you will work closely with the IT team to facilitate the transition of financial data to a modern AWS cloud platform. You will serve as the vital bridge between the Finance Department and technical teams, conducting in-depth interviews to grasp business logic and analytical needs. By leveraging statistical methods and analytical models, you will build data-driven frameworks to deliver forward-looking financial insights.What You'll Do:Requirements Analysis & Communication: Collaborate with PMs, SAs, and business units to conduct stakeholder interviews, clarifying current business scenarios and data analysis requirements.Master Financial Business Logic: Deeply understanding domain know-how related to Financial Accounting, CFDs (Contracts for Difference), and financial trading through internal training and daily operations.Data Integration & Cleansing: Utilize ETL pipelines built by the Data Engineering (DE) team (Databricks) to connect, cleanse, and pre-process data for in-depth analysis.Financial Analysis & Modeling: Apply statistical methods and machine learning models (e.g., regression, time series) to perform diagnostic and predictive analysis, providing high-value business insights and decision-making recommendations.Automation & Visualization: Develop automated reports and interactive dashboards using SQL, Python, and Power BI to enhance data visibility based on business needs.Cross-Functional Collaboration: Act as a bridge between technical and business teams, translating complex data concepts into clear business language to drive projects forward.Documentation: Create high-quality documentation (Design Documents, ERDs, User Manuals) to ensure effective knowledge transfer.What We're Looking For:Statistics & Machine Learning: Deep understanding of statistical hypothesis testing and practical experience with machine learning models (e.g., correlation analysis, regression, predictive modeling).Strong Financial Analysis Background: Practical experience in FP&A, P&L analysis, or quantitative trading analysis; familiarity with financial audit or compliance processes is a plus.SQL & Database Expertise: Proficiency in CRUD operations for large-scale databases, with hands-on experience in performance tuning and data cleansing (ETL/ELT).Data Visualization Mastery: Expertise in data visualization tools (Power BI is preferred; Tableau, Looker Studio, or QlikView are acceptable) with the ability to design intuitive decision-support dashboards.Business Acumen: Excellent ability to translate non-technical stakeholder requirements into specific technical specifications.Communication: Ability to quickly grasp abstract concepts, systematize them, and proactively solve problems.Bonus Points For:Domain knowledge in FinTech, specifically CFD (Contracts for Difference) or Web 3.0.Experience in Project Management (PM) or System Analysis (SA).Experience in automation using Python, with proficiency in data processing libraries like pandas, numpy, and pyspark.Why Join Us?At Hytech, we prioritize our people. We offer:Competitive Salary and performance-based bonuses.Generous Paid Time Off: Including 6 days of paid sick leave and a dedicated Birthday Leave!Parental Support: Attractive childcare subsidies for parents of young children.Professional Development: Subsidies for international financial certifications and continuous learning.Work-Life Balance: Flexible working hours and a supportive team environment.Vibrant Culture: Regular team building events, social clubs (e.g., Table Tennis, Coffee Club), and fully stocked pantries with premium snacks and coffee.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374879078/",
    "job_id": "4374879078",
    "source": "linkedin",
    "company_name": "Thermo Fisher Scientific",
    "job_title": "Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Work ScheduleStandard (Mon-Fri)Environmental ConditionsOfficeThermo Fisher Scientific Inc. is the world leader in serving science, with annual revenue of more than $40 billion. Our Mission is to enable our customers to make the world healthier, cleaner and safer. Whether our customers are accelerating life sciences research, solving complex analytical challenges, increasing productivity in their laboratories, improving patient health through diagnostics or the development and manufacture of life-changing therapies, we are here to support them. Our global team delivers an unrivaled combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD.Job ResponsibilitiesWork with customers to reach revenue and profit objectives and control operational expenses.Fulfill standard FP&A tasks, such as monthly closure, commercial prediction, monthly and quarterly business evaluations, annual operating blueprint, and long-term strategic strategy.Support Taiwan financial reporting and analysis for multiple business groups, ensuring key deliverables and timelines are met.Track and analyze monthly forecasts vs actuals, explaining movements and identifying key drivers.Run regular performance tracking reports, highlight risks/opportunities, and analyze growth trends.Regularly review channel performance, evaluate risks and opportunities, and support go-to-market strategy improvements.Consolidate and report commercial P&L by divisions and at the group level.Arrange financial reports for punctual submission within Strategic Plan and Annual Operating Plan timelines.Apply financial reporting systems for data extraction and dashboard creation, and perform uploads as needed.Assist in supply chain management by planning and benchmark analysis.Manage working capital metrics involving receivables and inventories.Assist with special projects and ad-hoc financial analysis, proactively finding opportunities for improvements in execution and cost savings.Collaboration Across the Matrix StructurePossess strong communication skills to work in and influence a complex matrix structure across divisions, functions, and countries.Work independently in a fast-paced setting, managing uncertainty and addressing critical issues or following up as necessary.Uphold compliance and ensure commercial teams adhere to company and accounting guidelines.Actively participate and collaborate with commercial leaders and Finance teams.Job RequirementsBachelor’s degree in Accountancy, Finance, or equivalent experience.At least 7 years of progressive experience in MNC commercial Finance or FP&A.Strong quantitative and analytical capabilities with advanced Excel skills.Strong background in consolidation highly preferred for this role.Candidates with finance business partnering experience with the ability to transition effectively into consolidation responsibilities will be considered.Good commercial sense and the ability to learn on the fly.Applied knowledge of business systems such as Hyperion Financial Management, SmartView, and Workday is an advantage.Proficient in Mandarin and English, with strong verbal and written communication skills.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358061080/",
    "job_id": "4358061080",
    "source": "linkedin",
    "company_name": "CRIF",
    "job_title": "Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "COMPANY DESCRIPTIONCRIF is a global leader in credit bureau, business information, and credit risk management solutions. We elevate businesses to the next level with an expert blend of data and analytics. Through data-driven insights, we empower businesses to make confident, sustainable decisions across the credit lifecycle, while mitigating risk and fueling growth.Headquartered in Italy with more than 6,000 professionals worldwide, we operate in 37 countries across four continents. We have a strong presence in Asia with regional headquarters in Singapore, as well as offices in key cities including, Dushanbe, Hanoi, Ho Chi Minh City, Jakarta, Kaohsiung, Kuala Lumpur, Manila, Mumbai, Pune, Taipei, Taichung, Tashkent, Tokyo and Zhongli.Job Requirements – Finance Manager:1. Review all accounting operations and manage accounts receivable and payable.2. Prepare monthly financial statements and provide related group reports.3. Coordinate with the group’s year-end schedule and prepare annual financial statements.4. Manage and file company tax matters.5. Oversee cash flow planning and fund management.6. Prepare the annual budget, track performance, and control costs.7. Support cross-functional coordination, communication, and decision-making.8. Organize Board of Directors and Shareholders’ Meetings, including preparing meeting materials and minutes.9. Handle company registration changes.10. Oversee payments and accounting for affiliated companies in Mainland China and Hong Kong.Requirements:1. Over 10 years of finance and accounting experience, including at least 5 years in a managerial role.2. At least 2 years of experience in a mid- to large-sized international accounting firm.3. Strong knowledge of accounting, tax planning, and related regulations.4. Proactive, highly logical, strong risk awareness, with solid problem-solving and decision-making skills.5. Strong sense of responsibility and excellent cross-department communication and coordination skills.6. Fluent in written and speaking in English.7. Familiar with accounting software and ERP systems.8. Experience in SAP system implementation is a plus.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4299014255/",
    "job_id": "4299014255",
    "source": "linkedin",
    "company_name": "BSOS",
    "job_title": "Supply Chain Finance Account Manager",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "EcosystemSupply Chain Finance Account ManagerTaipei City, TaiwanLocation: TaiwanResponsibilitiesIdentify and establish a sales pipeline.Cold calling to engage supply chain clientsProactively work with customers to identify barriers to successful adoption and work to put in place plans to improve adoption.Be an escalation point for customer issues, and coordinate with internal teams to resolve quickly. Proactively communicate with customers in a timely manner on issue status and resolution.Serve as the voice of the customer to inform the product and customer-facing business processes.Provide regular assessments of the health of the customer portfolio.Requirements3+ years of work experience managing relationships with big companies.Have good connections with supply chain corporations.Experienced in Corporate Financing or Business Development.Impressive executive presence and communication abilities.Flexibility and ability to thrive in a fast-paced, ever-changing, and growing environment.Job type: Full TimeApply: talent@bsos.co",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368978667/",
    "job_id": "4368978667",
    "source": "linkedin",
    "company_name": "BizLink Group",
    "job_title": "Digital Transformation Manager (Finance)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365278310/",
    "job_id": "4365278310",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Senior Finance Project Manager – New Business Initiative (Bangkok Based, Relocation Provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About AgodaAt Agoda, we bridge the world through travel. Our story began in 2005, when two lifelong friends and entrepreneurs, driven by their passion for travel, launched Agoda to make it easier for everyone to explore the world.Today, we are part of Booking Holdings [NASDAQ: BKNG], with a diverse team of over 7,000 people from 90 countries, working together in offices around the globe. Every day, we connect people to destinations and experiences, with our great deals across our millions of hotels and holiday properties, flights, and experiences worldwide.No two days are the same at Agoda. Data and technology are at the heart of our culture, fueling our curiosity and innovation. If you’re ready to begin your best journey and help build travel for the world, join us.Get to Know our Team: The New Business Initiatives team of project managers is a critical driver of Agoda and Finance department’s success, balancing innovation, and growth with smart risk management. It’s a team that provides strategic insights to Agoda’s business leaders in the pursuit of launching new initiatives in a sustainable and scalable manner, aims to provide world class execution for projects and serves as a vibrant learning ground for people, providing a pulse check on every strategic initiative Agoda pursues.The Opportunity:We are looking for a talented, results-oriented Finance Manager to join the Agoda finance team. You will have:A front row seat on key Agoda strategic initiativesOpportunity to drive implementation of those key initiatives with a Finance lensPartner with possibly the most diverse set of stakeholders of any department (IT, Product, Legal, Business teams, Marketing, Customer Services and more)Leverage your organizational skills combined with subject matter expertise to make an impactDrive Process Integration and automation: Lead initiatives to streamline and integrate financial processes across teams, ensuring efficiency, scalability, and alignment with organizational goals.Successful candidates tend to have strong presence, possess some sort of Finance expertise, are articulate, self-starters who are comfortable working in environments defined by volatility, uncertainty, complexity and ambiguity. In addition, good performers in this role are organized, possess effective interpersonal skills and can successfully partner with cross functional teams in a result oriented manner.In this Role, you’ll get to: Project manage and implement various company-wide strategic initiatives.Think through and investigate implications of new initiatives to various finance functions (accounting, tax, operations, treasury, commercial, financial systems, risk & control etc.) and systems.Coordinate with stakeholders to gather key requirements, provide a critical lens to optimize suggested processes and workflows, and make key trade off decisions with shifting priorities and feature change requests.Ensure constant communication and calibration between project teams and other stakeholders at regular intervalsRepresent finance on cross-functional forums with the ability to influence key stakeholders to incorporate Finance requirements into the product and business roadmaps.Ensure timely progress and achievement of project milestones and goals by coordinating different workstreams, identifying risks, troubleshooting, and proposing mitigation plans. Assist with UAT testingEnsure that the projects go live smoothly, and any post-launch issues will be resolved promptlyWhat you’ll Need to Succeed:5+ years of project management experience, preferrable Finance Project relatedIdeally with some tech industry / e-commerce background, some finance operations and business analysis experience.Extensive stakeholder management experience and ability to influence peopleProcess Integration Expertise: Demonstrated experience leading process integration, reorganization, or transformation initiatives in a fast-paced, dynamic environment.Undergraduate Degree (ideally in Business Administration, Finance, Accounting but others + professional accounting qualifications also acceptable)Ability to thrive in a fast-paced, dynamic, multicultural, and high intensity environment.Comfortable working with uncertainty and experimentation in a high-velocity environmentHighly numerate with strong analytical and problem solving, influencing and change management skills. Ability to think out of the box and make judgement calls.Attention to details, self-motivating with continuous improvement mindset. High learning agility. Ability to ask the right questions to ensure speed and accuracy.Excellent written and verbal communication, organizational and planning skills with solid interpersonal skillsHigh level of dependability with a strong sense of urgency and results-orientation. Strong business acumen.It’s Great if you have: Experience with finance tools and processes with some accounting and reporting knowhowExperience working closely with Product and ITExperience working in financ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368633894/",
    "job_id": "4368633894",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Manager, Finance Process and Transformation (Bangkok Based, Relocation Provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About AgodaAt Agoda, we bridge the world through travel. Our story began in 2005, when two lifelong friends and entrepreneurs, driven by their passion for travel, launched Agoda to make it easier for everyone to explore the world.Today, we are part of Booking Holdings [NASDAQ: BKNG], with a diverse team of over 7,000 people from 90 countries, working together in offices around the globe. Every day, we connect people to destinations and experiences, with our great deals across our millions of hotels and holiday properties, flights, and experiences worldwide.No two days are the same at Agoda. Data and technology are at the heart of our culture, fueling our curiosity and innovation. If you’re ready to begin your best journey and help build travel for the world, join us.Get to know our team Are you passionate about driving change, optimizing processes, and building something impactful from the ground up? The Finance Operations Excellence Team is a new team in Agoda Finance that plays a pivotal role in transforming our finance operations by:Partnering with finance and accounting teams to identify and unlock process improvement opportunities Leading and executing process improvement initiatives across the organization Fostering a culture of continuous improvement and operational excellence Championing Lean Six Sigma and other best-in-class methodologies to solve problems and streamline workflows Establishing robust business process management frameworks to ensure sustainable, high-quality outcomes The Opportunity The Finance Process and Transformation Manager will create and lead process transformation initiatives across Finance Operations, with a strong focus on R2R, O2C, and P2P. This role is responsible for establishing process management discipline, performance metrics, continuous improvement frameworks, and leveraging Lean Six Sigma and digital tools (AI, RPA, BI) to drive sustainable efficiency, scalability, and quality improvements.In This Role, You Will: Lead end to end improvement and transformation initiatives across Finance processes (R2R, O2C, P2P), partnering closely with Finance process owners and leadership Conduct process assessments, value stream mapping, and deep dive diagnostics to identify transformation opportunities Apply Lean Six Sigma methodologies to drive continuous improvement and measurable benefits. Develop and present business cases for transformation initiatives, including quantified benefits and implementation roadmaps. Explore and pilot new technologies and tools (e.g., task mining, process mining, AI enablers) to support process improvement. Collaborate with FinTech / system teams on the design and implementation of digital solutions. Ensure new processes are fully deployed, adopted, and embedded into BAU operations. Design and implement Business Process Management (BPM) standards, including: Process inventories Process documentation (L3/L4) Ownership and governance models Establish process performance metrics for Finance Operations, including: Identifying relevant efficiency, quality, and control KPIs Designing measurement approaches where data is not readily available Working with stakeholders to enable data collection and monitoring Build internal capability and foster continuous improvement culture in the organization by: Conducting Lean Six Sigma training Coaching teams on structured problem-solving and CI tools What You’ll Need to Succeed:Bachelor’s degree in Finance, Accounting, Business, Engineering, or a related discipline. 5–8+ years of experience in Finance transformation, process improvement consulting, or inhouse Finance Operations Excellence. Strong hands on experience driving transformation across R2R, O2C, and P2P.on experience driving transformation across Experience defining and operationalizing process performance metrics and measurement frameworks. Experience in driving continuous improvement culture in an organization. Lean Six Sigma Green Belt (minimum); Black Belt strongly preferred. Comfortable delivering White Belt and Yellow Belt training. Familiarity with process mining, task mining, or similar productivity / analytics tools. Proven knowledge of Business Process Management, including building process inventories from scratch Strong stakeholder management and communication skills with senior management across organization (not limited to just Finance). Analytical, data driven, and structured problem solver Experience in ecommerce, travel, or technology driven industries is highly preferred. commerce, travel, or technology driven industries #Taipei #Hongkong #Singapore #Kualalumpur #Shanghai #Beijing #Tokyo #Seoul #Hanoi #Bangkok #Phuket #Pakistan #Bangladesh #Manila #HoChiMinh #Nigeria #SriLanka #Jakarta #Prague #Berlin #Madrid #Sofia #Budapest #Rome #Columbia #Atlanta #GreaterSaoPaulo #India #Mumbai #Bangalore #Kaizen #LeanSixSigma #Lean#CPA#Accounting #Finance#FinanceOperation #FinanceOptimization #Processimprovement #Financeandaccounting #PTP #RTR #GL",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360536237/",
    "job_id": "4360536237",
    "source": "linkedin",
    "company_name": "Suntory Beverage & Food Health Enrichment",
    "job_title": "Assistant Commercial Finance Manager,",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265216856/",
    "job_id": "4265216856",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Manager－Finance Transformation－Enterprise Technology & Performance－Consulting Businesses",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req Id: 747Job Function: Technology & TransformationJob Location: TaipeiAbout The Business協助企業創新、蛻變、領先！因應快速成長發展與轉型過程中的各項挑戰。我們以「為企業提升價值」為服務目標，提供的解決方案涵蓋企業的全價值鏈；以「與客戶共同成長」為服務理念，與客戶建立長期且深入的合作關係。Work You'll do 聯繫與維護客戶關係，挖掘潛在合作機會。 依據客戶需求提出數位轉型計畫與流程改善解決方案。 規劃、執行並管控專案進度、品質、時程，確保專案成果符合預期。 進行跨部門跨單位溝通協調，以利專案之執行。 研究產業數位轉型趨勢與新興科技應用案例分析。 協助主管完成臨時性交辦事項。Requirements 流程分析能力：營運管理與流程分析、商業模式規劃 研究企劃能力：企業客戶需求挖掘、產業市場調查資料分析與報告撰寫、提案企劃與簡報製作技巧 專案管理能力：專案整合管理與跨部門溝通、專案管理架構及專案說明、異業合作規劃與執行 專案經驗或專業證照（加分項）。例：數據分析、雲端系統、PMP等 公部門專標案執行經驗(加分項)。",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368625940/",
    "job_id": "4368625940",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Manager, Finance Operations Excellence (Bangkok Based, Relocation Provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376252678/",
    "job_id": "4376252678",
    "source": "linkedin",
    "company_name": "Marvell Technology",
    "job_title": "Principal Financial / Market Intelligence Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377286694/",
    "job_id": "4377286694",
    "source": "linkedin",
    "company_name": "BAT",
    "job_title": "Commercial Finance Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377801354/",
    "job_id": "4377801354",
    "source": "linkedin",
    "company_name": "Jardine Restaurant Group",
    "job_title": "Finance Business Partnership Manager (FP&A)",
    "location": "Taipei–Keelung Metropolitan area",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358242051/",
    "job_id": "4358242051",
    "source": "linkedin",
    "company_name": "Moxa",
    "job_title": "Manager, Finance (MCN)",
    "location": "New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4263100125/",
    "job_id": "4263100125",
    "source": "linkedin",
    "company_name": "TUMI",
    "job_title": "Senior Finance Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Description Prepare annual budgeting, monthly forecasts, and weekly outlook. Collaborate with business teams to identify areas for cost optimization and revenue enhancement. Perform monthly financial reports and assist with month-end closing tasks. Enhance and build new reports to meet business requirements Conduct financial analysis and variance analysis to identify trends, risks, and opportunities. Provide insightful analysis and commentaries to the management to support business decisions. Evaluate financial projections of Capex investment and store renewal. Develop and maintain effective financial controls, policies, and procedures. Assist ad-hoc projects, duties or new job responsibilities as assigned to maximize efficiency of the team. At least 3 years of Financial Planning and Analysis experience preferred Degree in Finance, Accounting, or related field. Advanced Excel and PowerPoint proficiency Knowledge in HFM, Hyperion (Essbase) and SAP an added advantage Fluency in English written and spoken skills Strong problem-solving and analytical skills with the ability to gather, organize, analyze and interpretate large amounts of information with attention to detail and accuracy. Ability to work independently and collaboratively in a fast-paced environment.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341270031/",
    "job_id": "4341270031",
    "source": "linkedin",
    "company_name": "Chubb",
    "job_title": "【TW Life】Manager, PMO (Finance Automation)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Key Responsibilities JOB DESCRIPTION Develop and maintain project management frameworks, methodologies, and best practices.Monitor project progress and performance metrics, reporting updates to senior management.Facilitate meetings, prepare agendas, and document action items.Identify and manage project risks and issues proactively.Collaborate with IT and finance teams to ensure alignment on project objectives.Collaborate with IT and finance teams to ensure alignment on project objectives.QualificationsBachelor ’ s degree in Business Administration, Finance, or a related field.Proven experience in project management, preferably in finance or IT transformation projects.Strong analytical and problem-solving skills.Excellent communication and interpersonal skills.Experience with project management tools (e.g., Microsoft Project, JIRA, etc.).Familiarity with Agile methodologies is a plus.★ Recruitment Process Notice Please note that interview coordination for the next stage will be handled by our offshore Service Hub based in Malaysia. All interview-related communications — including availability confirmation and interview invitations — will be conducted via email only. As phone contact is not available at this stage, kindly check your email regularly (including spam or junk folders) to avoid missing important updates.★ Learn more about Chubb Life Taiwan's culture and workplace [ 開箱影片 ] 走進我們的辦公室，認識工作環境、福利與文化 [Podcast] 探索我們如何打造支持成長與創新的職場",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359601301/",
    "job_id": "4359601301",
    "source": "linkedin",
    "company_name": "Taiwan Tech Arena (TTA)",
    "job_title": "【Unlock Venture Partners】Financial Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "🔑 Financial Analyst – Unlock Venture Partners | TaipeiUnlock Venture Partners is an early-stage VC firm investing in world-changing technology startups in Seattle & Los Angeles, with a focus on AI and data-driven innovation. Since 2017, we’ve raised $100M+ and backed 50+ companies (with several successful exits).We’re expanding to Taipei and looking for a Financial Analyst to join as one of our first team members in Asia. This is a rare opportunity to combine venture capital experience + entrepreneurial growth in a global role.What you’ll doAnalyze startups: build models, valuations & market researchSupport investment due diligence & write investment memosTrack portfolio performance & support reportingAssist with fund operations, audits, and complianceWork directly with GPs on strategy, research & investor relationsWhat we’re looking for1–3 years in VC, investment banking, consulting, or accountingBachelor’s degree in Finance, Economics, Business, or related fieldStrong financial modeling, Excel & presentation skillsExcellent English communicationPassion for startups & innovation | Entrepreneurial mindset | Team playerWhy Unlock🌍 Build our Asia operations from the ground up🚀 Accelerated growth with increasing responsibility🤝 Direct exposure to General Partners & portfolio founders🌐 Bridge North America & Asia in the global VC ecosystem💡 Entrepreneurial, dynamic culture with real impact",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370655953/",
    "job_id": "4370655953",
    "source": "linkedin",
    "company_name": "Inspire Brands Asia",
    "job_title": "Junior Accountant / AP & AR Specialist | Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4331594561/",
    "job_id": "4331594561",
    "source": "linkedin",
    "company_name": "Qualcomm",
    "job_title": "Financial Analyst, up to Sr. (Taipei)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363770114/",
    "job_id": "4363770114",
    "source": "linkedin",
    "company_name": "Merck Electronics",
    "job_title": "Financial Analyst Taiwan (Equipment)",
    "location": "New Taipei City, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "與我們攜手施展你的超能力！準備好接受挑戰，探索更多可能性嗎? 我們跟你一樣希望精益求精，持續突破! 我們全球的夥伴熱衷於科技創新，透過我們醫藥保健、生命科學和電子科技業務的解決方案豐富人們的生活。讓我們一起環抱著熱情和夢想關懷我們的員工、客戶、病患和這個世界。這就是我們不斷尋找具備好奇心的新血加入的原因，與我們一起大膽想像各種可能。我們在電子科技領域裡所做的一切，都是為了能成為眾多企業身後推動數位化生活的推手。我們致力於成為值得信賴的供應商，為電子、汽車和化妝品行業提供高科技材料、服務和特種化學品。我們培養了一個全球協作的組織，每位員工都擁有取勝的熱情、秉持客戶至上的態度、充滿好奇心且行事果決。我們齊心努力突破科學的極限，為客戶創造更多的可能性。Financial Analyst – EL Manufacturing Cluster – EquipmentLocation: Taiwan (Taipei or Kaohsiung preferrable)As a Financial Analyst for the Equipment manufacturing cluster, you will closely collaborate with local site controllers and the Head of Cluster Finance to provide valuable financial insights to enhance operational efficiency and profitability for our manufacturing network. This role includes analyzing production costs, preparing financial (ad-hoc) reports and collaborating with cross-functional teams to drive strategic and short-term decision-making. Furthermore your focus will be to enhance financial transparency to achieve greater efficiency and agility in a cyclical market.Your RolePerformance Management and Steering: Conduct comprehensive financial analysis related to manufacturing operations, including cost analysis, budgeting, and forecasting.Support local standard-price calculations with related processes (either global support or clearly defined local responsibilities e.g. for Asia sites)Identify trends and variances to assist in decision-making.Collaborate with local controllers & production managers to develop and implement cost control measures aimed at improving operational efficiency.Support savings review to ensure profitability goals will be achievedPrepare monthly and quarterly performance reviews and support Head of Cluster Finance to consolidate global Cluster financialsAssist in the development of annual budgets and forecasts for manufacturing operations, ensuring alignment with corporate goals.Digital Transformation: Support the development of digital routines and automated reporting and bring in new ideas of how to further improve and increase productivityAssist the implementation of new processes to streamline reporting and enhance data accuracyWho You AreBachelor’s degree in Finance, Accounting, Business Administration, or a related field; Master’s degree or professional certification is a plus. Minimum of 5 years of experience in controlling or related finance field, with a background in manufacturing or production finance.Strong understanding of manufacturing processes, cost accounting, and financial reporting.Proficiency in financial modeling and analysis tools, including Excel and ERP systemsExcellent analytical and problem-solving skills, with a keen attention to detail.Strong analytical thinking, concept development, and stakeholder management skills.Fluent English skills, both written and verbal, are essential for effective communication with stakeholders and the team我們來自不同背景、視角與生活經歷，因對世界的好奇心而聚集在一起。我們深信，多元能夠催生卓越與創新，並持續強化我們在科學與技術領域的領導地位。我們致力於為每一個人創造機會，讓大家能依自己的節奏發展與成長。加入我們，一同打造一個充滿包容與歸屬感的文化，影響數百萬人的生活，攜手推動人類的進步！立即申請，成為這個致力於激發探索精神、提升人類未來的團隊一員！",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365298964/",
    "job_id": "4365298964",
    "source": "linkedin",
    "company_name": "BD Nogales Norte",
    "job_title": "Financial Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365313765/",
    "job_id": "4365313765",
    "source": "linkedin",
    "company_name": "BD",
    "job_title": "Financial Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4299089935/",
    "job_id": "4299089935",
    "source": "linkedin",
    "company_name": "Supermicro",
    "job_title": "Financial Analyst",
    "location": "Zhonghe District, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370369678/",
    "job_id": "4370369678",
    "source": "linkedin",
    "company_name": "Supermicro",
    "job_title": "Financial Analyst",
    "location": "New Taipei City, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371729661/",
    "job_id": "4371729661",
    "source": "linkedin",
    "company_name": "GE Evergreen",
    "job_title": "Financial Analyst",
    "location": "Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356234164/",
    "job_id": "4356234164",
    "source": "linkedin",
    "company_name": "Coface",
    "job_title": "Assistant Accountant",
    "location": "Songshan District, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265221195/",
    "job_id": "4265221195",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Assistant－Investment Structures－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340122398/",
    "job_id": "4340122398",
    "source": "linkedin",
    "company_name": "IDP Education Ltd",
    "job_title": "Finance Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363780087/",
    "job_id": "4363780087",
    "source": "linkedin",
    "company_name": "Merck Electronics",
    "job_title": "Financial Analyst Taiwan (Supply Chain Strategy and Realization)",
    "location": "New Taipei City, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3971891954/",
    "job_id": "3971891954",
    "source": "linkedin",
    "company_name": "SGS",
    "job_title": "行政人員(台北)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265223110/",
    "job_id": "4265223110",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Logistics Assistant－International Tax－Tax－T&L",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376711261/",
    "job_id": "4376711261",
    "source": "linkedin",
    "company_name": "Flexii",
    "job_title": "Accounting and admin officer",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372887989/",
    "job_id": "4372887989",
    "source": "linkedin",
    "company_name": "DEME Group",
    "job_title": "Project Finance Accountant Taiwan",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363263184/",
    "job_id": "4363263184",
    "source": "linkedin",
    "company_name": "BTCC",
    "job_title": "Financial Accountant",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377405440/",
    "job_id": "4377405440",
    "source": "linkedin",
    "company_name": "ABB",
    "job_title": "Accounting & Reporting Analyst - General Accounting",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "At ABB, we help industries run leaner and cleaner—and every person here makes that happen. You’ll be empowered to lead, supported to grow, and proud of the impact we create together. Join us and help run what runs the world.This position reports to:Finance Manager__Job Profile SummaryResponsible for performing credit management activities and assure effective implementation of credit policies, procedures, monitor customer credit status and accounts receivable aging, and report to manager.Responsible for performing purchase to payment related function for operation and manage accounts payable functions transactions and ensure accurate financial results and compliance with the relevant accounting standards and internal policy and procedures.Roles & ResponsibilitiesCORE RESPONSIBILITIESPerform credit management activities including credit assessment and assigned the key parameters such as the Internal Credit Rating and Credit Limit, as well as the credit check rule for Local Division.Take responsible in performing customer Annual credit reviewManage customer collateral and contact with sales team and external agency.Support credit information queries to Local DivisionOversees, reviews, and supports the month-end closing process, including AR aging and overdue template preparing, for the Accounts Receivables area.Process accounts payable transactions to ensure correctness of accounting records with required supporting documents including PO process ,PO Withholding tax book , Intercompany transaction booking, expense accrual and checking input VAT.Co-work with CN FAO team to P2P related issues and follow up actions.Provides support during internal and external audits, ensuring all documentation is accurate and readily accessibleDrives effective communication and collaboration with all internal team.Perform other duties as assigned or business requiredEducation, Knowledge, Skills, Experience:Bachelor Degree or higher in accounting or related fieldFair English writing and speaking competenceWorking experience for 3 years or above . Related experience (e.g., at least 2 years CPA firm experience and working experience of global company is a plus, etc.) Able to communicate effectivelyAble to be flexible and work in a team environmentThinking and acting systematically Work under pressureBuilding a cleaner, smarter future takes all kinds of minds: the curious, the courageous, and the creative. That's why we welcome people from all backgrounds and experiences.Ready to make an impact?Apply today or visit https://www.abb.com to learn more about the impact of our solutions across the globe.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365937232/",
    "job_id": "4365937232",
    "source": "linkedin",
    "company_name": "Corning Incorporated (Asia Region)",
    "job_title": "SAP S/4 HANA cFin/Central Finance/FICO Analyst/Consultant (TP/TC/TN)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Position Description: In this role you will work as an operation support specialist in Global S4 HANA team created in strategic ERP Transformation Organization. You will work in international company with great history having many divisions and subsidiaries all over the world. You can become part of great journey together with us to company optimized and growing with benefits of SAP S/4 HANA application working in private cloud. You will work with colleagues from different regions, lead meetings, and take responsibility for the SAP cFin(Central Finance) and FI/CO workstream. Experience in the following is highly desirable: CFin/FICO stream - Ability to demonstrate processes in Central Finance for S/4 HANA Experience in cFin and FI/CO implementation, customizing and operations with FI/CO background.Good understanding of Finance of cFin and FI/CO Integrations and Architecture Strong analytical thinking skills Able to perform under pressure during times like a system down situation. Ability to work across multiple teams to troubleshoot and resolve issuesConduct working sessions with business users as required.Able to work with Basis team during troubleshooting providing guidance when required. Will need to become proficient in working within our ticketing system – ServiceNow. Must be a self-starter with ability to manage work with minimal supervision able to work independently following Corning established coding guidelines. Will work with operations team in support break/fix activities as well as assignment. Will be in an on-call rotation supporting team / organization expected to meet SLA commitments defined by IT and agreed upon by the organization. Analyze software requirements to determine design feasibility. Develop software systems, including configuration documentation and testing procedures.Education & Experience: 3+ years in SAP Central Finance and FICO Proficient in Business Analysis, Business Knowledge, Architecture Knowledge and Technical Solution Design Excellent communication and written skills to aid in RICEF creation and design document creation. In-depth knowledge of SAP best practices Required Skills:cFin (Central Finance) Ability to demonstrate S/4 HANA Processes for Central Finance 1-2 Central Finance implementation preferably for manufacturing industry Initial Load of data Expertise on Real time replication, SLT and its troubleshooting Application Interface Framework (AIF) Expertise on S4 Accounting Model Understanding of necessary landscape design including integration via Magnitude SourceConnectFI module components including: General Ledger, Accounts Payable, Accounts Receivable, Fixed Assets, Banks (including integration), and Treasury CO module components including Cost Centers, Internal Orders, Product Costing including: Central Payments and Central Cash Application SAP Group Reporting (Consolidations) SAP Treasury Management, Cash Management and Bank Account Management, Profitability Analysis (COPA), Manufacturing Variances and Settlements, and Profit Centers Master Data components including COA, Profit Centers, Cost Centers, Material Master, Vendor Master, Customer Master, Bank Master, BOMs and Routings Experience in Reporting and Analytics with S/4 HANA and Central Finance including configuring document splitting for full balance sheet reporting by different lines of businesses within a company codeExperienced SAP S4 HANA cFin Lead Consultant to work on Identify and resolve complex technical issues within our customer service-level agreements. Desired Skills:Experience in other SAP modulesDevelopment experience (ABAP is strong plus) Fiori, Adobe Forms Proficiency in debugging complex programs ServiceNow experience",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371410376/",
    "job_id": "4371410376",
    "source": "linkedin",
    "company_name": "TÜV SÜD",
    "job_title": "Assistant 助理 (BA)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358290719/",
    "job_id": "4358290719",
    "source": "linkedin",
    "company_name": "Moxa",
    "job_title": "Lead Accountant 會計經理 (Finance Process & Systems)",
    "location": "Xinzhuang District, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374690166/",
    "job_id": "4374690166",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Consultant - ESG Sustainability Information Management Consulting－Assurance－A&A",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job description: About the Business Work You'll do 1. Assist companies in different industries in implementing internal control systems for sustainability information management. 2. Assist companies in different industries in developing internal audit plans for sustainability information management. Requirements 1. A bachelor's degree or higher from a university, domestic or international. 2. One of the following work experiences: a. 1 year of work experience in an accounting firm. b. 1 year of work experience in the financial industry. c. 2 years of work experience in a publicly listed company. d. Recent graduates are also welcome to discuss opportunities. 3. Interest in studying standards, regulations, or ESG sustainability issues. 4. Strong communication skills, able to express ideas clearly and logically, and maintain good relationships with clients. 5. Ability to produce high-quality work under time pressure, with strong report writing skills. 6. High resilience to stress, self-motivation, ability to work independently, and also a team player. 7. Eagerness to explore the essence of things, willingness to learn, and possess analytical and execution capabilities. 8. Proficient in English (listening, speaking, reading, and writing).",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371762375/",
    "job_id": "4371762375",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Research Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3967803647/",
    "job_id": "3967803647",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】財務報表審計 - 經理 (台北)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320278974/",
    "job_id": "4320278974",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】財務報表審計 - 組員 (台北)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3967813242/",
    "job_id": "3967813242",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】財務會計諮詢服務 - 經理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375347031/",
    "job_id": "4375347031",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【策略與交易諮詢服務】估值、模型和經濟諮詢 - 顧問/資深顧問",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374266939/",
    "job_id": "4374266939",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【策略與交易諮詢服務】估值、模型和經濟諮詢 - 經理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.Job Description Conduct equity research, industry research, management interviews, and site visits; and support managers by analyzing information obtained from various channels for use in the preparation of valuation reports. Appraise company or asset values using the income approach, market approach, or asset-based approach for the transaction, financial reporting or tax purposes. Work closely and communicate with clients, targets, and other professionals in the financial due diligence, legal, tax, and valuation.Job Conditions University graduates with a minimum of 5 years; relevant experience for Staff Accountants(Audit experience is a plus) Strong Excel knowledge. Competent research skills and ability to analyze financial statements and forecasts. Ability to assist with proposals. Good command of spoken and written English and Chinese. BOT and GreenField experience is a plus (not required).EY | Building a better working worldEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355332801/",
    "job_id": "4355332801",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "【審計服務】數位鑑識會計_副組長/組長/副理",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376530399/",
    "job_id": "4376530399",
    "source": "linkedin",
    "company_name": "Inventec",
    "job_title": "經營管理分析(桃園)",
    "location": "Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4203788648/",
    "job_id": "4203788648",
    "source": "linkedin",
    "company_name": "Kronos Research",
    "job_title": "Machine Learning Researcher",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373770835/",
    "job_id": "4373770835",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Customer Service Executive - Contact Center - (For ONE Bank PLC) - Job ID - 1460281",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374560198/",
    "job_id": "4374560198",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Account Manager - (For M/S HOWLADER ENTERPRISE) - Job ID - 1461948",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342640788/",
    "job_id": "4342640788",
    "source": "linkedin",
    "company_name": "Uber",
    "job_title": "Mid-Market Account Executive, Uber for Business, Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361426327/",
    "job_id": "4361426327",
    "source": "linkedin",
    "company_name": "Workday",
    "job_title": "Account Executive, Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377591061/",
    "job_id": "4377591061",
    "source": "linkedin",
    "company_name": "Hewlett Packard Enterprise",
    "job_title": "Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4328879280/",
    "job_id": "4328879280",
    "source": "linkedin",
    "company_name": "Cisco",
    "job_title": "Account Executive - Portfolio",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355194363/",
    "job_id": "4355194363",
    "source": "linkedin",
    "company_name": "Tag",
    "job_title": "Sourcing Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367205560/",
    "job_id": "4367205560",
    "source": "linkedin",
    "company_name": "Moët Hennessy",
    "job_title": "Account Sales Supervisor",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367136095/",
    "job_id": "4367136095",
    "source": "linkedin",
    "company_name": "Jamf",
    "job_title": "Account Executive, GCH",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329653716/",
    "job_id": "4329653716",
    "source": "linkedin",
    "company_name": "Sandisk",
    "job_title": "Sales Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376555179/",
    "job_id": "4376555179",
    "source": "linkedin",
    "company_name": "Edelman",
    "job_title": "Account Executive",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366291350/",
    "job_id": "4366291350",
    "source": "linkedin",
    "company_name": "Salesforce",
    "job_title": "Named Account Executive (MMGB)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.Job CategorySalesJob DetailsAbout SalesforceSalesforce is the #1 AI CRM, where humans with agents drive customer success together. Here, ambition meets action. Tech meets trust. And innovation isn’t a buzzword — it’s a way of life. The world of work as we know it is changing and we're looking for Trailblazers who are passionate about bettering business and the world through AI, driving innovation, and keeping Salesforce's core values at the heart of it all.Ready to level-up your career at the company leading workforce transformation in the agentic era? You’re in the right place! Agentforce is the future of AI, and you are the future of Salesforce.About SalesforceWe’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good– you’ve come to the right place.Overview Of The Role:Salesforce is looking for a curious and energetic Mid-Market / General Business Account Executive with knowledge of technology and value-based solution selling. This Business Unit sells the entire Salesforce platform into set of named accounts. Think of yourself as the \"General Manager\" in this role - mapping account strategies, aligning resources and acting as the extension of your customer. You will drive the overall account strategy and revenue growth by working closely with other product specialists. You will have technical support from solutions architects and sales engineers. This role will be responsible for the Taiwan territory.Required Skills And Qualifications:Revenue: Proven success in quota-carrying, technology solution-based direct salesAccount Planning and Strategy: Develops and executes plans to meet sales objectives by identifying and qualifying opportunities in the Singapore marketResearch and Discovery: Analyzes prospects’ current processes, identifies business challenges, and aligns with strategic goals based on customer use cases and value hypothesesSolutioning: Crafts compelling value propositions by aligning technology solutions with customer needsCustomer Communication: Engages customers clearly, concisely, and promptly through writing, speaking, presenting, and using tools such as whiteboarding, Google Slides, and ZoomResource Utilization: Drives results by leveraging all available tools and resources effectivelyTeam Selling: Collaborates with account teams and partners to support deal execution and ensure customer successBenefits & PerksCheck out our benefits site which explains our various benefits, including well-being reimbursement, generous parental leave, adoption assistance, fertility benefits, and moreNote: By applying to the Mid Market Account Executive posting, recruiters and hiring managers who support multiple cloud offerings and verticals across the organization hiring General Commercial Account Executives will review your resume. Our goal is for you to apply once and have your resume reviewed by multiple hiring teams.AccommodationsIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.Posting StatementAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.Salesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce.Salesforce welcomes all.Unleash Your PotentialWhen you join Salesforce, you’ll be limitless in all areas of your life. Our benefits and resources support you to find balance and be your best, and our AI agents accelerate your impact so you can do your best. Together, we’ll bring the power of Agentforce to organizations of all sizes and deliver amazing experiences that customers love. Apply today to not only shape the future — but to redefine what’s possib",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376572494/",
    "job_id": "4376572494",
    "source": "linkedin",
    "company_name": "Ogilvy Taiwan",
    "job_title": "Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "業務執行就是創意產業的超級製作人。我們整合資源、分析數據、尋找渠道、激發創意、開發產品、媒合機會、甚至挖掘人才；在客戶、創意、策略、市場、消費者之間，用創意找到生意的撬動點、平衡點、爆發點。在消費者與品牌間、商業目標與解題傳播方案間、客戶期待與團隊挑戰間進行聯繫、釐清與提供解決方式 。全方位策劃與管理專案，依照專案需求進行跨領域、跨傳播管道與資源的溝通整合，讓專案得以執行實現 。傳播數位平台的串連與管理。透過消費者研究、數據分析與趨勢觀察，規劃並擬定品牌數位及社群傳播內容，為品牌獲得社群關注、內容創造、粉絲深化。進一步透過Martech實現線上行銷線下購買、社群商務或消費者體驗設計。 協助、啟發、參與團隊產出解決商業課題、具備數位創新、製造品牌與消費者對話、產生影響力的傳播解決方案。 調度奧美國際網絡資源，轉化全球區域總部的知識與情報，靈活應用於在地市場與客戶服務。我們期待您： 1. 持續對事物抱持好奇、掌握趨勢、享受生活、擁抱數位，並沉浸創意 2. 不怕挫折、堅信越挫越勇，以正面態度迎向每一天的挑戰 3. 謹慎細心、具責任感，能在步調快速的工作環境中順利完成任務 4. 擅長溝通、敢於發言，在專案進行時不吝分享想法，與本土及跨國團隊共同完成目標 5. 邏輯佳、反應快速，能有效率的解決迎面而來的問題",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350121562/",
    "job_id": "4350121562",
    "source": "linkedin",
    "company_name": "Pure Storage",
    "job_title": "Account Executive, Taiwan",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We’re in an unbelievably exciting area of tech and are fundamentally reshaping the data storage industry. Here, you lead with innovative thinking, grow along with us, and join the smartest team in the industry.This type of work—work that changes the world—is what the tech industry was founded on. So, if you're ready to seize the endless opportunities and leave your mark, come join us.THE ROLEEverPure Taiwan is seeking a dynamic and driven Sales Hunter to join our Enterprise team in Taiwan. In this role, you’ll be at the forefront of developing new business, working with our channel resellers and key customer accounts. Collaborate with Sales, Pre-sales, Partner sales, and Field Marketing teams to drive success in the Enterprise private sector.What You'll DoAs an Account Executive, you will:Promote Innovative Solutions: Advocate for our all-flash enterprise storage technology.Build Relationships: Foster strong connections with customers, ensuring high satisfaction.Lead and Strategize: Direct pursuit teams and develop account plans to secure new customers.Manage Sales Pipeline: Drive activities to meet and exceed sales quotas.Collaborate with Partners: Work with Channel, GSI, and Ecosystem Partners to position Pure Storage.Execute Account Strategies: Develop and implement strategies to close deals consistently.Deliver Results: Surpass quotas, maintain a strong pipeline, and drive referenceable business.Communicate Effectively: Present proposals highlighting Pure Storage’s benefits.What You BringTo excel in this role, you should have:Sales Passion: A strong drive for sales and relationship building.Enterprise Experience: Experience with direct/indirect sales on Enterprise accounts.Partner Collaboration: Experience working with Channel, GSI, and Ecosystem Partners.Prospecting Skills: Advanced skills in engaging new customers required.Ambition and Drive: A goal-oriented attitude and desire to drive change.Proven Success: A track record of exceeding quotas and maintaining a robust pipeline.Adaptability: Ability to thrive in a fast-paced environment.Industry Knowledge: Understanding of cloud computing and Data Centre Architecture.Communication Skills: Excellent time management and communication abilities.Experience: 8+ years of field sales experience.Language Skills: Native/Bilingual Mandarin and professional English proficiency.Join EverPure Taiwan and be part of a team that's redefining data storage. Apply now and unleash your potential!What You Can Expect From UsInnovation: We celebrate those who think critically, like a challenge, and aspire to be trailblazers.Growth: We give you the space and support to grow along with us and to contribute to something meaningful. We have been named Fortune's Best Workplaces in Technology™, Fortune's Best Workplaces in the Bay Area™, and certified as a Great Place to Work®!Team: We build each other up and set aside ego for the greater good.And because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events. Check out purebenefits.com for more information.Accommodations And AccessibilityCandidates with disabilities may request accommodations for all aspects of our hiring process. For more on this, contact us at TA-Ops@purestorage.com if you’re invited to an interview.Our Commitment To a Strong And Inclusive TeamWe’re forging a future where everyone finds their rightful place and where every voice matters. Where uniqueness isn’t just accepted but embraced. That’s why we are committed to fostering the growth and development of every person, cultivating a sense of community through our Employee Resource Groups and advocating for inclusive leadership.Everpure is proud to be an equal opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire.Join us and bring your best.Bring your bold.Pure and simple.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358311529/",
    "job_id": "4358311529",
    "source": "linkedin",
    "company_name": "NXP Semiconductors",
    "job_title": "Sales Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company:** NXP Semiconductors Taiwan LtdJob SummaryAs a Sales Account Manager at NXP Semiconductors Taiwan Ltd, you will be responsible for driving revenue growth and market share within a defined territory or set of key accounts. You will develop and execute strategic sales plans, build strong customer relationships, and leverage NXP's comprehensive portfolio of semiconductor solutions to meet customer needs and achieve sales targets.Job Responsibilities Develop and execute comprehensive sales strategies and account plans to achieve and exceed assigned sales quotas and business objectives. Proactively identify, qualify, and secure new business opportunities within the assigned territory or key accounts. Cultivate and maintain strong, long-lasting relationships with key decision-makers, engineering teams, and purchasing departments at customer organizations. Understand customer design cycles, technical requirements, and business challenges to effectively position NXP's products and solutions. Collaborate closely with internal teams, including Field Application Engineers (FAEs), product marketing, and customer service, to provide comprehensive support and solutions to customers. Prepare and deliver compelling sales presentations, product demonstrations, and technical proposals. Negotiate contracts, pricing, and terms to ensure mutually beneficial agreements. Provide accurate sales forecasts, pipeline management, and regular reports on sales activities and market trends. Stay up-to-date with industry trends, competitive landscape, and NXP's product roadmap to effectively articulate value propositions. Represent NXP at industry events, trade shows, and customer meetings.Job Qualifications Bachelor's degree in Electrical Engineering, Electronics Engineering, Business Administration, or a related technical field. 5+ years of proven experience in sales or account management within the semiconductor industry, preferably with a focus on embedded systems, microcontrollers, or power management. Strong understanding of the electronics industry, market dynamics, and customer needs in Taiwan. Demonstrated track record of achieving and exceeding sales targets. Excellent communication, presentation, and negotiation skills in both Mandarin and English (both written and spoken). Ability to build rapport and establish trust quickly with diverse stakeholders. Proactive, self-motivated, and results-oriented with a strong sense of ownership. Strong analytical and problem-solving abilities. Proficiency in CRM software (e.g., Salesforce) and Microsoft Office Suite. Ability to travel frequently within Taiwan and occasionally internationally as required.More information about NXP in Greater China...",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360543310/",
    "job_id": "4360543310",
    "source": "linkedin",
    "company_name": "BettingJobs",
    "job_title": "B2B Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BettingJobs is thrilled to collaborate with our client, a prominent online bookmaker known for transforming the sports betting and gaming industry, in their search for a B2B Account Executive to join their team based remotely in Taiwan.Responsibilities:Answer, support and follow up on external facing communication to ensure service is provided to the highest standards.Research solutions to issuesInteract with various department to resolve issues in a timely mannerUse available tools and information resources to resolve problemsUse a comprehensive knowledge of the website and the back-office systems to investigate and resolve issuesAdminister transactions as requiredReview and follow up with deposit / withdrawal transactions in accordance with established standards and procedures.Escalate unresolved problems in accordance with establish policy procedures and protocols.Perform account administration according to established protocolsResearch transaction discrepancies and take appropriate actionMonitoring of activity, including assisting in the identification of fraudulent activity or abuseMaintain professionalism and adhere to company standards during all interactions.Responsible for coordinating and executing User Acceptance Testing (UAT) to ensure system quality and readiness before launchAssistance with special projectsOther tasks and duties as assigned.Requirements:Ability to think critically and draw from experience to make decisionsComputer literacyCare in dealing with sensitive informationAbility to understand both written and oral instructions in English and the additional required languageThe ability to organize and manage multiple prioritiesAbility to independently solve problemsStrong customer orientationExcellent interpersonal and communication skillsGoal OrientedPerformance driven and a strong team playerFluent and advanced skills both oral and in specialized languages would be an assetMinimum of 3 years in a position with relevant experience would be an assetKnowledge of Sportsbook industry would be an assetBasic office skills including knowledge of Microsoft Word and ExcelHigh school diploma required",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376511189/",
    "job_id": "4376511189",
    "source": "linkedin",
    "company_name": "MSD Taiwan",
    "job_title": "Sr. Key Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionThe OpportunityManaging Major Strategic Accounts involves developing effective strategies to maximize business outcomes within the responsible territories. To achieve this, leadership within the organization is crucial.As a business hub to collaborate with BUs to Drive profitable growth to maximize Major Strategic Accounts /other accounts business opportunity.Primary Responsibilities To create cross-BUs (i.e., MKT, MR, DMs, medical) engagement platform and understanding the needs and partnership opportunities within prioritize strategic key accounts. Through this to make sure agile decision-making process to overcome external environment dynamics and achieve company objectives. Field works will be assigned to selected accounts. Understand assigned accounts Start to thoroughly understand the KAs responsible for. Including analyzing account’s needs, business objective for individual account and key challenges. Gather relevant information about the account to gain insights. Also need to align cross-BUs’ resources within assigned KAs to maximize business opportunities. Build holistic analytical tools to co-create win-win solution for internal stakeholders to deliver long-term value of company portfolios and build internal account management competences. Became company account management hub to help BU building solid capability of account management hence efficient execution of duties and overall performance at all levels of the department. Regularly monitor and measure the performance of key strategic accounts against set targets and key performance indicators (KPIs). Use data analytics and reporting tools to track progress, identify areas of improvement, and make data-driven decisions. By doing so, you can continuously optimize your strategies and demonstrate effective leadership.Education Minimum RequirementCollege or university degreeRequired Experience And Skills4-6 years of relevant working experienceLeadership BehaviorsDemonstrate ownership of the outcomes.Self-starter, high level of personal motivation and results-orientedA team player with high leadership qualities and ability to work effectively cross-functionallyFunctional KnowledgeProven track record in delivering business-impact project in a complex, cross functional environment and execution capability in a leadership position with established track record of successesFunctional SkillStrong background & experience in strategic planning.Strong organizational, interpersonal and communication skills.Required SkillsAccount Management, Account Management, Business Management, Business Opportunities, Business Planning, Commercial Account Management, Communication, Contract Management, Customer Experience Management, Customer Needs Analysis, Data Analytics, Financial Acumen, Healthcare Trends, Identifying Sales Opportunities, Interpersonal Relationships, Key Account Planning, Key Performance Indicators (KPI), Managed Care Marketing, Market Research, Motivation Management, National Accounts Management, Profitable Growth, Profit Planning, Revenue Growth, Sales Operations {+ 5 more}Preferred SkillsCurrent Employees apply HERECurrent Contingent Workers apply HERESearch Firm Representatives Please Read Carefully Merck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.Employee Status RegularRelocation VISA Sponsorship Travel RequirementsFlexible Work Arrangements Not ApplicableShift Valid Driving License Hazardous Material(s) Job Posting End Date 03/31/2026A job posting is effective until 11 59 59PM on the day BEFORE the listed job posting end date. Please ensure you apply to a job posting no later than the day BEFORE the job posting end date. Requisition ID R382245",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4305077172/",
    "job_id": "4305077172",
    "source": "linkedin",
    "company_name": "Gartner",
    "job_title": "Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4178489346/",
    "job_id": "4178489346",
    "source": "linkedin",
    "company_name": "MongoDB",
    "job_title": "Enterprise Account Executive, Growth",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4328779841/",
    "job_id": "4328779841",
    "source": "linkedin",
    "company_name": "JFrog",
    "job_title": "Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361070990/",
    "job_id": "4361070990",
    "source": "linkedin",
    "company_name": "Dun & Bradstreet",
    "job_title": "SMB Key Account Manager (R-18423)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368300003/",
    "job_id": "4368300003",
    "source": "linkedin",
    "company_name": "Uber",
    "job_title": "Senior Sales Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368179513/",
    "job_id": "4368179513",
    "source": "linkedin",
    "company_name": "Salesforce",
    "job_title": "Account Executive, Data360",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326791809/",
    "job_id": "4326791809",
    "source": "linkedin",
    "company_name": "Hellmann Worldwide Logistics",
    "job_title": "Key Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377806326/",
    "job_id": "4377806326",
    "source": "linkedin",
    "company_name": "SS&C Intralinks",
    "job_title": "Account Executive - Taiwan Market",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370452678/",
    "job_id": "4370452678",
    "source": "linkedin",
    "company_name": "Red Hat",
    "job_title": "Sales Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357411582/",
    "job_id": "4357411582",
    "source": "linkedin",
    "company_name": "Palo Alto Networks",
    "job_title": "Major Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377692679/",
    "job_id": "4377692679",
    "source": "linkedin",
    "company_name": "OakMega",
    "job_title": "Sr. Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318768367/",
    "job_id": "4318768367",
    "source": "linkedin",
    "company_name": "Fusion Worldwide",
    "job_title": "Sales Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371713890/",
    "job_id": "4371713890",
    "source": "linkedin",
    "company_name": "CyberArk",
    "job_title": "Senior Account Executive - Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320978823/",
    "job_id": "4320978823",
    "source": "linkedin",
    "company_name": "UBS",
    "job_title": "Client Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370982400/",
    "job_id": "4370982400",
    "source": "linkedin",
    "company_name": "Bausch + Lomb",
    "job_title": "Key Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371285499/",
    "job_id": "4371285499",
    "source": "linkedin",
    "company_name": "The Hoffman Agency",
    "job_title": "Account Executive 客戶主任",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337099093/",
    "job_id": "4337099093",
    "source": "linkedin",
    "company_name": "Jamf",
    "job_title": "Senior Account Executive, GCH",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330407953/",
    "job_id": "4330407953",
    "source": "linkedin",
    "company_name": "Gartner",
    "job_title": "Account Executive - High Tech",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370665606/",
    "job_id": "4370665606",
    "source": "linkedin",
    "company_name": "UPS",
    "job_title": "Major Account Executive",
    "location": "Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4378084970/",
    "job_id": "4378084970",
    "source": "linkedin",
    "company_name": "Gene Solutions",
    "job_title": "Key Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370330359/",
    "job_id": "4370330359",
    "source": "linkedin",
    "company_name": "Cisco",
    "job_title": "Account Executive - Splunk",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330260007/",
    "job_id": "4330260007",
    "source": "linkedin",
    "company_name": "BeOne Medicines",
    "job_title": "Key Account Manager - Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About UsBeOne is a global oncology company that is discovering and developing innovative treatments that are more affordable and accessible to cancer patients worldwide. With a broad portfolio, we are expediting development of our diverse pipeline of novel therapeutics through our internal capabilities and collaborations. We are committed to radically improving access to medicines for far more patients who need them. Our growing global team of more than 10,000 colleagues spans five continents, with administrative offices in Basel, Beijing, and Cambridge, U.S. To learn more about BeOne, please visit www.beonemedicines.com and follow us on LinkedIn and X (formerly known as Twitter).BeOne continues to grow at a rapid pace with challenging and exciting opportunities for experienced professionals. When considering candidates, we look for scientific and business professionals who are highly motivated, collaborative, and most importantly, share our passionate interest in fighting cancer.Job DescriptionEssential Functions:Develop and execute strong local territory plans with cross-functional support. The objective is to build customized engagement plans that drive sales of our approved medicines.Develop a deep understanding of customer needs through interactions and establish superior working relationships with the HCPs in assigned territory.Promote BeOne’s products through value-add interactions with targeted HCPs in assigned territory.Promotion of an Oncology drug within the assigned territory.Achieve territory-specific business and sales goals.Implement sales plans in line with marketing strategy.Work in partnership with the Market Access team to collect relevant information and build the commercial strategy to ensure that commercial proposals are aligned with customer needs and patient access.Responsible to update the CRM internal system, ensure the excellence of the database, registration through evaluation and periodic updates of information in the formal BeOne system, enabling greater efficiency in the construction and implementation of Projects and Tactical Plans.Organize and conduct scientific events for HCPs in accordance with the product/therapeutic class strategy and interest of the medical community, and in line with company policies and local codes of conduct; direct the MSL to any matters off label indications and/or questions that cannot be answered with the available approved materials.Utilize data and analytics to prioritize engagements and interactions.Understand customer channel preference, focus and behaviors and adjust style, to deliver meaningful engagements with HCPs.Perform all administrative functions required of the position, including capturing customer engagements and co-designing cross-functional customer plans, in an online CRM system.Consistently ensure operation in accordance with BeOne’s standards of conduct and all applicable local laws and regulations.Embrace innovative and transformational ways of doing things to accomplish things that others thought were impossible.Working in total synergy with internal stakeholders, developing a culture.Qualification RequiredMore than 5 years of experience in relevant and similar roles and responsibilities.More than 3–5 years of Oncology specific sales experience.Passion for sales in the pharma industry.Dedicated to making customer experience a priority and passionate about the patient journey with a patient centricity approach.Is comfortable in dealing with ambiguity, and demonstrates a curious and open mindset.Ability to analyze data and communicate it clearly and concisely to HCPs.Results oriented and strategic.Highly motivated, solution-oriented and a positive attitude.Makes things happen and is a self-starter; has the right level of implementation skills, shows persistent innovation and willingness to challenge the status quo.Superior teamwork skills through open, authentic communication and respect for individual differences.Proven track record of resilience in the face of challenges.Scientific Selling Approach: Ability to comprehend and explain complex clinical studies.Ability to work with minimal guidance on complex issues.Ability to comprehend, utilize and communicate technical information.Adapt quickly to changing marketplace and environmentWhat We Offer To Our Valued EmployeesMarket competitive compensation package including performance-based annual bonus schemeCompany shares (generous welcome grant and performance-based annual equity plan!)In-house and external learning and development opportunitiesFantastic benefits program and keep improving!Plus you get to work with a dynamic team of collaborative, supportive, inclusive, and fun professionals whose mission is clear: Cancer has no borders and neither do we.Join us and Make momentum in your career!BeOne Global CompetenciesWhen we exhibit our values of Patients First, Collaborative Spirit, Bold Ingenuity and Driving Excellence, through our twelve global competencies below, we help ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326548924/",
    "job_id": "4326548924",
    "source": "linkedin",
    "company_name": "foodpanda",
    "job_title": "Lead, Strategic Account Management",
    "location": "Xinyi District, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354510569/",
    "job_id": "4354510569",
    "source": "linkedin",
    "company_name": "Kingfa Sci.&Tech. Co., Ltd.",
    "job_title": "Key Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356544279/",
    "job_id": "4356544279",
    "source": "linkedin",
    "company_name": "Hilti Asia Pacific",
    "job_title": "Inside Sales Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353070089/",
    "job_id": "4353070089",
    "source": "linkedin",
    "company_name": "Baxter International Inc.",
    "job_title": "Sr Account Executive (Pharmaceutical)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "This is where your work makes a difference.At Baxter, we believe every person—regardless of who they are or where they are from—deserves a chance to live a healthy life. It was our founding belief in 1931 and continues to be our guiding principle. We are redefining healthcare delivery to make a greater impact today, tomorrow, and beyond.Our Baxter colleagues are united by our Mission to Save and Sustain Lives. Together, our community is driven by a culture of courage, trust, and collaboration. Every individual is empowered to take ownership and make a meaningful impact. We strive for efficient and effective operations, and we hold each other accountable for delivering exceptional results.Here, you will find more than just a job—you will find purpose and pride. Essential Duties and Responsibilities:1) Responsible for achieving sales quotas through the direct sale of the company's products or services. Implement sales strategies to attain sales volume, product mix and profit objectives.2) Calls on prospective customers, delivers effective sales presentations, provides technical and administrative product information and/or demonstrations, and quotes appropriate customer prices.3) Monitors sales against forecasts and participates in the determination of market potential for the territory.4) Works closely with clinical specialist/manager, customer service and operations to ensure high levels of customer satisfaction.5) Actively listen to customer ideas and needs, and provide timely feedback under minimum supervision.Qualifications:Able to seek and probe sales opportunities according to the needs of customersCandidate must possess strong interpersonal and communication skills, both written and oral, as well as negotiation and presentation skills.Position requires ability to analyze and interpret data for effective sales strategies.Must have good organization and time management skills. Ability to understand and adapt to customers' changing needs. Demonstrates business knowledge.Education and/or Experience:Bachelor's degree with 3+ years of working experiences in sales function.Healthcare/pharmaceutical/Medical Devices industry experience is preferable.Equal Employment OpportunityBaxter is an equal opportunity employer. Baxter evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status or any other legally protected characteristic.Reasonable AccommodationsBaxter is committed to working with and providing reasonable accommodations to individuals with disabilities globally. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application or interview process, please click on the link here and let us know the nature of your request along with your contact information.Recruitment Fraud NoticeBaxter has discovered incidents of employment scams, where fraudulent parties pose as Baxter employees, recruiters, or other agents, and engage with online job seekers in an attempt to steal personal and/or financial information. To learn how you can protect yourself, review our Recruitment Fraud Notice.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372623557/",
    "job_id": "4372623557",
    "source": "linkedin",
    "company_name": "IBM",
    "job_title": "Strategic Account Manager, HashiCorp",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327191013/",
    "job_id": "4327191013",
    "source": "linkedin",
    "company_name": "Oracle",
    "job_title": "Regional Sales Account Manager, Construction & Engineering Global Industry Unit/ 區域應用方案銷售客戶經理 - 建築與工程全球事業部",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346099384/",
    "job_id": "4346099384",
    "source": "linkedin",
    "company_name": "Baxter International Inc.",
    "job_title": "Sr Account Executive (Surgical)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "This is where your work makes a difference.At Baxter, we believe every person—regardless of who they are or where they are from—deserves a chance to live a healthy life. It was our founding belief in 1931 and continues to be our guiding principle. We are redefining healthcare delivery to make a greater impact today, tomorrow, and beyond.Our Baxter colleagues are united by our Mission to Save and Sustain Lives. Together, our community is driven by a culture of courage, trust, and collaboration. Every individual is empowered to take ownership and make a meaningful impact. We strive for efficient and effective operations, and we hold each other accountable for delivering exceptional results.Here, you will find more than just a job—you will find purpose and pride. Sr. Account Executive, Advanced Surgery> Work closely with sales manager and representatives to implement multi-source product sales and marketing strategy.> Make field visits and establish strong relationships with key decision-makers and commiftees within the buying organization.> Proactively develop indications of sealant and antiadhesion products, build user application experiences, and assist in reducing the product application learning curve in the CVS / CRS /GS / Obstetrics & Gynecology surgical field.> Support direct team Hands-on product practice to surgeons in the Operating room, build user application experiences, and assist in reducing the product application learning curve in the CVS / CRS /GS / Obstetrics & Gynecology surgical field.> Must be able to work autonomously to achieve established goals while proactively communicating with management.Qualifications:> Proven sales performance - Bachelor’s Degree - 3 years OR and/or hospital medical sales experience> Collaboration and Teamwork> Defines success in terms of the whole organization; can develop vertical and horizontal team effectiveness; demonstrates support for other people and team; willing to share resources; willing to participate & contribute to efforts beyond own scope of responsibilities; seeks and gives feedback and input.> Business Acumen - knowledgeable about products and processes; aware of how sales strategies and tactics work in the marketplace; knows the competition.> Communication - Speaks and writes clearly and effectively; promotes a free flow of information through the organization; proactively shares information within and across the organization; listens actively.> Customer Focus - maintains effective relationships with customers and gains their trust and respect; Is dedicated to meeting the expectations and requirements of internal and external customers.Equal Employment OpportunityBaxter is an equal opportunity employer. Baxter evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status or any other legally protected characteristic.Reasonable AccommodationsBaxter is committed to working with and providing reasonable accommodations to individuals with disabilities globally. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application or interview process, please click on the link here and let us know the nature of your request along with your contact information.Recruitment Fraud NoticeBaxter has discovered incidents of employment scams, where fraudulent parties pose as Baxter employees, recruiters, or other agents, and engage with online job seekers in an attempt to steal personal and/or financial information. To learn how you can protect yourself, review our Recruitment Fraud Notice.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377158161/",
    "job_id": "4377158161",
    "source": "linkedin",
    "company_name": "IN Search Management Consultants Co., Ltd 卓恩管理顧問有限公司",
    "job_title": "【國際品牌 | 穩定發展 | 市場第一】Key Account Manager(Modern trade, Costco)",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325117090/",
    "job_id": "4325117090",
    "source": "linkedin",
    "company_name": "Schneider Electric",
    "job_title": "Direct Sales Account Executive",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377203794/",
    "job_id": "4377203794",
    "source": "linkedin",
    "company_name": "ERSG Ltd",
    "job_title": "Associate Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Set up in 2008, ersg is an award winning, international leader in staffing services to the global energy and built environment markets. We work with major international companies through to smaller independent businesses to enable their projects to be facilitated effectively throughout the entire project life cycle. Whilst headquartered in London, our global business has over 200 staff with offices across Europe, North America and Asia.As an Account Manager you will:• Maintain relationships with your key Account Client(s)• Visit Account Client(s) to build and develop positive relationships with them• Advertise vacancies and use social media, LinkedIn, database etc to find candidates• Receive and review applications, manage interviews and create a shortlist of candidates for the client• Negotiate pay and salary rates• Working towards exceeding targets relating to the number of candidates placed, the value to be billed to clients and business leads generatedAbout you:• Previous recruitment/sales experience (desirable)• Motivated and driven to prove yourself as a key player and provide the best service for candidates and clients• Excellent organisational skills• Tenacious and resilient, not easily phased by setbacks and comfortable in high pressure situations• Strong communication skills• Degree qualified (desirable)• Proven fluency in Mandarin and English; additional languages are a bonus• Sales and reward motivated• Proficient in Microsoft office• Outgoing and friendly personality “ersg are an equal opportunities employer; we are committed to promoting equality of opportunity for all staff job applicants. We do not discriminate against staff or applicants on the basis of age, sex, race, disability, pregnancy, marital status, sexual orientation, gender reassignment or religious background; all decisions are based on merit.\"",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4349651590/",
    "job_id": "4349651590",
    "source": "linkedin",
    "company_name": "foodpanda",
    "job_title": "Senior Manager, Strategic Account Management",
    "location": "Xinyi District, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360790817/",
    "job_id": "4360790817",
    "source": "linkedin",
    "company_name": "Appier",
    "job_title": "Account Manager, Advertising Solution - Taiwan",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About AppierAppier is a software-as-a-service (SaaS) company that uses artificial intelligence (AI) to power business decision-making. Founded in 2012 with a vision of democratizing AI, Appier’s mission is turning AI into ROI by making software intelligent. Appier now has 17 offices across APAC, Europe and U.S., and is listed on the Tokyo Stock Exchange (Ticker number: 4180). Visit www.appier.com for more information.About The RoleWe are seeking for an Account Manager for our Sales team in Taipei Headquarter. He/She will cultivate strong relationships with our new and existing clients and assist them in strategizing and plan digital marketing campaigns to meet their goals.ResponsibilitiesIdentify key account growth opportunities with key stakeholders.Strategizing and plan digital marketing campaigns to meet clients goals.Manage campaign launch and ongoing operations, including market research, troubleshooting, budget management and reporting.Cultivate strong relationships with clients.About You[Essential]At least 2 years of relevant working experience in digital marketing.Performance marketing or App optimization experience is a plusGood at problem solving and cross-functional collaborationLogically thinking and possess good time management abilities.Requires a combination of strong analytical and communication skills, with some technical understanding.Detail-oriented with good organization.Able to work independently in a fast-paced environment.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4344119182/",
    "job_id": "4344119182",
    "source": "linkedin",
    "company_name": "Analog Devices",
    "job_title": "Senior Account Manager, Field Sales",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369522347/",
    "job_id": "4369522347",
    "source": "linkedin",
    "company_name": "Jamf",
    "job_title": "Channel Account Executive, GCH",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355061595/",
    "job_id": "4355061595",
    "source": "linkedin",
    "company_name": "Lattice Semiconductor",
    "job_title": "Senior Sales Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372249463/",
    "job_id": "4372249463",
    "source": "linkedin",
    "company_name": "Rockwell Automation",
    "job_title": "Strategic Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350300454/",
    "job_id": "4350300454",
    "source": "linkedin",
    "company_name": "Markforged",
    "job_title": "Strategic Account Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356181911/",
    "job_id": "4356181911",
    "source": "linkedin",
    "company_name": "ShopBack",
    "job_title": "Contract Account Management Executive (6 Months, Fresh Graduate)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376000049/",
    "job_id": "4376000049",
    "source": "linkedin",
    "company_name": "SUPACAZ",
    "job_title": "International Account Manager for California Sports Sunglass Brand (Cycling, Baseball, Racquet)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "***Please DM our company Linkedin page or mark as top choice with a message as to why you are the ideal candidate for the job and include your connection to sport, whether it be as a fan or as a participant. ***Company DescriptionSUPACAZ is a leader in high-performance cycling, merging cutting-edge technology, innovative design, and distinct style into its premium products. Specializing in accessories, apparel, tools, and shoes, SUPACAZ is a trendsetter in the cycling industry. Since its inception in 2012, the company has consistently shown exponential growth, doubling or tripling revenue annually. With offices in California, Taipei, and Tokyo, SUPACAZ offers opportunities for self-motivated, passionate individuals who take pride in their work and share a love for cycling.Role DescriptionThe International Account Manager will be responsible for managing relationships with global accounts, developing sales strategies, expanding market share, and ensuring the highest level of customer satisfaction. This role includes identifying and developing potential new business relationships while maintaining and growing existing ones. The candidate will work closely with marketing and distribution teams to execute initiatives and drive business growth. This is a full-time, on-site role based in Taipei.QualificationsExperience in sales, client management, and maintaining long-term business relationshipsStrong communication, negotiation, and interpersonal skillsProficient in market research and analysis to identify opportunities for growthAbility to develop strategies and execute marketing campaigns aimed at expanding market reachOrganizational, time management, and critical thinking skillsFluency in English, with proficiency in Mandarin or Japanese being a plusPassion for cycling and familiarity with the cycling industryBachelor’s degree in Business, Marketing, or a related field",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4332926913/",
    "job_id": "4332926913",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Strategic Account Manager – Taipei",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4299001462/",
    "job_id": "4299001462",
    "source": "linkedin",
    "company_name": "BSOS",
    "job_title": "DeFi Researcher",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "ResearcherDeFi ResearcherTaipei City, TaiwanLocation: TaiwanResponsibilitiesConduct protocol analysis from a financial and token engineering perspective.Evaluate the underlying mathematical design behind each DeFi protocols.Develop deep knowledge of Web3/DeFi industry trends.Ability to read Web3/DeFi market conditions and translate that into a value of BSOS.Source, assess, and track new investment opportunities.Assist the investment team in the investment of projects in the ecosystem.RequirementsPassion towards Web3/DeFi industry.Deep knowledge and strong interest in digital assets and ecosystem (digital-native currencies, DeFi, tokenization, trading and analytics).Proficient in written and verbal communication skills in English.Preferred Qualifications: madarian is a plusJob type: Full TimeApply: talent@bsos.co",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4303947471/",
    "job_id": "4303947471",
    "source": "linkedin",
    "company_name": "Supermicro",
    "job_title": "Sr. Cost Analyst",
    "location": "New Taipei City, New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375726782/",
    "job_id": "4375726782",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Associate Director, Credit Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371752196/",
    "job_id": "4371752196",
    "source": "linkedin",
    "company_name": "UBS",
    "job_title": "Research Associate for Taiwan Tech coverage",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369787459/",
    "job_id": "4369787459",
    "source": "linkedin",
    "company_name": "BlackRock",
    "job_title": "Associate, APAC Wealth COO Team",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4291254703/",
    "job_id": "4291254703",
    "source": "linkedin",
    "company_name": "AllianceBernstein",
    "job_title": "Compliance Analyst",
    "location": "Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321092420/",
    "job_id": "4321092420",
    "source": "linkedin",
    "company_name": "Binance",
    "job_title": "Project Research & Due Diligence",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367259866/",
    "job_id": "4367259866",
    "source": "linkedin",
    "company_name": "Cushman & Wakefield",
    "job_title": "Finance Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job TitleFinance AnalystJob Description SummaryJob DescriptionINCO: “Cushman & Wakefield”",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3958003537/",
    "job_id": "3958003537",
    "source": "linkedin",
    "company_name": "Kronos Research",
    "job_title": "Senior Risk Analyst (Quant Trading)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionKronos Research is a technology and science-driven trading firm. We risk firm capital, trading a broad range of financial instruments and strategies on global markets. The firm is willing to pursue new ideas and markets with conviction and as such, we have been at the forefront of technology and markets, quickly dominating newer markets such as applying HFT to cryptocurrency trading.As a Senior Risk Analyst at Kronos Research, you will gain rewarding experience from all aspects of world-leading quantitative trading operations, including risk management, portfolio asset allocation as well as trading performance assessment. You will work closely with our Quantitative Researchers and Software Engineers to expand our global trading presence efficiently and profitably.ResponsibilitiesDevelop and maintain internal fund financial reporting systemConnect crypto exchange APIs for risk monitoring and financial reportingReconcile books and trading records for the trading deskAnalyze capital usage and attribute the cost of capitalAssisting in the execution of the day-to-day workflow, tracking/monitoring of all fund financial reportingSupport ad hoc requests from the management team, internal support teams, and external regulatory authoritiesRequirementsProficient in both Python and SQL.Strong analytical skills including the ability to swiftly identify issues, deliver appropriate challenges, and recommend fit-for-purpose solutions.Senior Bachelor/Master students in Economics, Finance, Accounting, Math, Engineering, Science, or Business as well as any other related field of expertiseAble to build effective working relationships with internal stakeholders.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343653979/",
    "job_id": "4343653979",
    "source": "linkedin",
    "company_name": "DBS Bank",
    "job_title": "Analyst, Client Due Diligence Checker, Institutional Banking Group COO",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Business FunctionDBS GlobeSend (“GS”) is a segment-agnostic low value cross border payments business line within Global Transaction Services product group of DBS Institutional Banking Group. At GlobeSend, our vision is to revolutionize cross-border payments by seamlessly connecting individuals and SMEs globally. We envision a world where sending and receiving money internationally is effortless, transparent and reliable. By combining cutting-edge technology with unparalleled customer service, we strive to empower our clients, simplify their financial interactions, and foster economic growth across borders. Our commitment to customer-centricity, innovation and compliance drives us to redefine the standards of cross-border payments, making it accessible, affordable, and secure for everyone, everywhere. We're on a mission to revolutionize cross-border payments, and we're searching for ambitious team members who share our passion for innovation and excellence.Key AccountabilitiesReview GS’ customers’AML risks and industry sector, client information and other risk relevant factors, including disposing of name screening hits, in timely mannerBe competent and familiar with all AML KYC/CDD policies and guidelines and manage CDD in compliance with the guidelines, policies and regulationsWork with stakeholders and ensure customer Due Diligence on New-to-Bank, Periodic/ Trigger Reviews duly captured in bank system, analysis of accounts and review client informationValidate the information within KYC records to ensure timely completion and accuracyAppropriately assess customer risk rating to facilitate business decisions, demonstrating consideration for the Bank's reputation and safeguard the Bank’s AML frameworkAssist team in carrying out projects & tasksAssist Team Head to manage the team on achieving the productivity GoalsCollaborate with other stakeholders and ensure that all issues identified are appropriately escalated to managementKnowledge /SkillsStrong English written and oral communication skills and problem-solving skills, able to work under pressureRelevant experience with similar responsibilities in a high volume, fast-paced environment and industry systems and platformsRelevant five years (above) work experience and understanding of AML KYC regulationsUnderstanding of the inter-dependencies of roles within a CDD process & requirements for KYC Record successful completion across relevant client typesBasic knowledge of Banking, Trade, Cash, Loan Products and TransactionsProficient Microsoft Office user (i.e. Excel, PowerPoint) and project skill, and ability to perform moderately complex queriesenPrimary LocationTaiwanJobComplianceScheduleRegularJob TypeFull-timeJob PostingDec 15, 2025, 10:03:59 AM",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340822118/",
    "job_id": "4340822118",
    "source": "linkedin",
    "company_name": "Eaton",
    "job_title": "Senior FP&A Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "What You’ll DoThe FP&A will serve as a strategic business partner, working closely with internal stakeholders to drive financial performance and support data-driven decision-making. This role takes full ownership of the actuals and forecasting processes, ensuring accuracy, timeliness, and alignment with business goals. By delivering insightful financial reports and applying strong analytical and communication skills, the Analyst will enhance data integrity, promote financial stewardship, and contribute to sustainable business growth.\"1. Strategic Business Partnering : Act as a trusted financial advisor to business leaders. Proactively engage with stakeholders to understand business needs, provide financial insights, and influence strategic decisions. Ownership of Actuals & Forecasting : Take full responsibility for preparing monthly actuals and forecast packages for consolidation. Lead the monthly forecasting process, ensuring accuracy, timeliness, and alignment with business objectives. Analyze trends and variances to support business reviews and planning cycles. Financial Communication & Reporting : Compile and deliver comprehensive financial reports, ensuring clarity and actionable insights. Facilitate effective communication of financial results and forecasts across teams and leadership. Data Quality & Process Improvement : Lead initiatives to enhance data quality in financial systems, enabling accurate invoicing and efficient cash collection. Identify process gaps, implement improvements, and monitor outcomes. Financial Reporting & Standardization : Prepare end-to-end monthly financial reports for the division and drive standardization of reporting formats. Conduct meaningful variance analysis to support performance management. Profitability Analysis & Profit Plan Preparation : Support site/division controllers with monthly profitability reviews. Lead the preparation of the annual profit plan, including timeline coordination, template creation, data collection, consolidation, and in-depth analysis to guide strategic planning. Financial Governance : Promote strong financial stewardship by controlling costs, improving forecast accuracy, maintaining balance sheet integrity, and ensuring robust internal controls. Ad Hoc Financial Support : Coordinate and respond to ad hoc financial requests across the region, delivering timely and relevant analysis. Additional Analysis : Perform other financial analyses as assigned to support business initiatives and continuous improvement.\"QualificationsBS/BA in Finance or Accounting 6+ years of FP&A and accounting experienceSkills Experience with SAP and Oracle planning preferred\" Strong analytical skills for interpreting financial data, identifying trends, and generating insights. Clear and effective communication, both written and verbal, to support cross-functional collaboration. Relevant experience in the manufacturing industry is preferred. Advanced Excel skills for financial modeling and data analysis; proficient in PowerPoint for executive-level presentations. Hands-on experience with financial systems and BI tools, such as SAP, Oracle, or Power BI Proactive and self-driven, with a strong sense of ownership and accountability. Demonstrated problem-solving and critical thinking abilities, with a mindset for continuous improvement. Ability to work independently and lead cross-functional initiatives, showing readiness for future leadership roles. Strong business acumen, with the ability to connect financial insights to operational strategies.\"",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343713884/",
    "job_id": "4343713884",
    "source": "linkedin",
    "company_name": "DBS Bank",
    "job_title": "Analyst, Client Due Diligence Maker, Institutional Banking Group COO",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Business FunctionCorporate and Investment Banking provides corporate customers with a full range of commercial banking products and services, including cash management services, current accounts, time deposits, trade finance, working capital finance, term loans and foreign exchange. Through our continued commitment, DBS has cultivated long-standing relationships with its customers in the region that are based on account relationship management, service differentiation, product development and rigorous credit standards.Key AccountabilitiesAssist the bank in carrying out AML policy through performance of client due diligence on clients during on-boarding, periodic review, and trigger reviewWork with RM/CSO to understand the client, correctly assess the client’s AML risk, gather documentation from clients/publicly available sources, liaise with RM/CSO/other departments (wherever required) and produce high quality and timely CDDsProvide RM with insights into clients’ AML risk and develop an understanding of Industry sector, client information and other relevant factors that could impact the Bank’s AML riskBe competent and familiar with all CDD policies and guidelines and complete all CDDs in compliance with the guidelines and policies as well as regulationsEnsure that all CDDs submission / responses are completed and accurate in timely manner and the related forms are completed properly, handled with efficiency and duly authorizedEnsure there are no overdue CDDs and also ensure fast TAT in executing the CDDs and complete all CDD-related exercises within the deadlinesWork as team to backup each other and provide professional service level to the daily BAU jobs and ad hoc project assignedKnowledge /SkillsEducation: Bachelor's certificate and abovePreferred major/experience in AML industry, law-related department, finance, taxation and finance-related business and managementHigh stress resistance, proactive, careful and responsible, clear logic, and risk awareness, and solution-end mind setLanguage ability: English reading and writing ability - Business levelTOEIC with 850 and above will be a plus-enPrimary LocationTaiwanJobComplianceScheduleRegularJob TypeFull-timeJob PostingDec 15, 2025, 10:24:00 AM",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4280953490/",
    "job_id": "4280953490",
    "source": "linkedin",
    "company_name": "Appier",
    "job_title": "Investment Analyst",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About AppierAppier is a software-as-a-service (SaaS) company that uses artificial intelligence (AI) to power business decision-making. Founded in 2012 with a vision of democratizing AI, Appier’s mission is turning AI into ROI by making software intelligent. Appier now has 17 offices across APAC, Europe and U.S., and is listed on the Tokyo Stock Exchange (Ticker number: 4180). Visit www.appier.com for more information.About The RoleWe are seeking a highly motivated and Investment Analyst to join our growing Corp Dev team. In this role, you will support the execution of investments, M&A transactions, and strategic partnerships. You will work closely with internal stakeholders, external advisors, and senior leadership to identify opportunities, evaluate targets, and drive strategic initiatives aligned with the company’s growth strategy.Key ResponsibilitiesDeal Sourcing & ResearchConduct market research, competitive analysis, and industry mapping to identify investment and M&A opportunities.Track sector trends and provide regular strategic insights.Financial Modeling & ValuationBuild and maintain financial models for investment targets and M&A opportunities.Perform valuation analyses using DCF, precedent transactions, trading comps, and other methodologies.Due Diligence & Deal ExecutionSupport due diligence processes across financial, commercial, legal, and technical areas.Assist in preparing internal investment memos, presentations, and board materials.Liaise with external advisors (e.g., bankers, lawyers, consultants) during deal execution.Strategic Planning & IntegrationWork cross-functionally with product, finance, legal, and operations teams on strategic initiatives.Support integration planning and tracking post-close KPIs for acquired companies.Pipeline & Process ManagementMaintain the M&A and investment opportunity pipeline.Support internal reporting and tracking of strategic initiatives.Qualifications2+ years of experience in investment banking, private equity, management consulting, corporate development, or a related field.Strong financial modeling and valuation skills.Proficient in Excel, PowerPoint, and data analysis tools; familiarity with CapIQ, PitchBook, or similar platforms a plus.Excellent written and verbal communication skills, with the ability to synthesize and present complex information clearly.Highly analytical, detail-oriented, and capable of managing multiple workstreams in a fast-paced environment.Passion for technology, M&A, and strategic growth.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4375320419/",
    "job_id": "4375320419",
    "source": "linkedin",
    "company_name": "ASUS",
    "job_title": "Senior Finance & Tax Specialist (Netherlands)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Position OverviewThe position might be able to apply for work-from-home (WFH) policy and is subject to change by following global policy and by evaluating individual situation.ASUS is looking for a Senior Finance & Tax Specialist, located at Amsterdam Netherlands, who is passionate about financial management and has extensive knowledge of European indirect tax regulations. The key to success is building and maintaining strong internal and external tax compliance relationships. For the right candidate, ASUS offers numerous opportunities for development and growth.Detail-oriented with a strong focus on accuracy.Ability to work independently and as part of a team.Proficiency in English and Dutch (preferred).Strong organizational skills with the ability to manage multiple tasks.A strong start-up mindset is crucial to the success.Job ResponsibilitiesMonthly and Annual Financial Closing: Responsible for the monthly and annual financial closing processes, including the preparation of financial statements. Prepare and submit the required financial and accounting information for the Headquarters on a monthly basis. Generate internal analysis reports for management reviewVAT Filing: Review all related documents for monthly and annual VAT(NL OSS and other EU countries) filings. Coordinate with external consultants to ensure compliance and accuracy.Annual Income Tax Audit and Filing: Manage the annual income tax audit and filing processes. Act as the primary contact point with the Dutch Tax Authorities, addressing and resolving any disputes or issues.Reconciliation: Reconcile EBS (Oracle) reports with Magento sales reports to ensure data accuracy.Tax Compliance: Ensure compliance with all relevant tax regulations and requirementsQualifications and backgroundBachelor’s degree in Finance, Accounting, or related fieldProven experience in financial reporting, VAT filing, and tax complianceStrong analytical and problem-solving skillsExcellent communication in English and coordination abilities4 or more years of experience in accounting and tax is highly preferred*Disclaimer: When you submit your information to LinkedIn, your information will be collected, processed, and used by LinkedIn. LinkedIn will share your information to ASUS for job recruitment purpose.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368155565/",
    "job_id": "4368155565",
    "source": "linkedin",
    "company_name": "DBS Bank",
    "job_title": "Analyst, Treasures Relationship Manager, Taichung Branch, T&D, CBG",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4301628929/",
    "job_id": "4301628929",
    "source": "linkedin",
    "company_name": "Micron Technology",
    "job_title": "Analyst-Internal Trust and Protection",
    "location": "Taoyuan District, Taoyuan City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4244455777/",
    "job_id": "4244455777",
    "source": "linkedin",
    "company_name": "DBS Bank",
    "job_title": "Analyst, Treasures Relationship Manager, ShiangYang Branch, CBG",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4260225738/",
    "job_id": "4260225738",
    "source": "linkedin",
    "company_name": "DBS Bank",
    "job_title": "Analyst, Treasures Relationship Manager, Yongfu Branch, Treasures & Distribution, CBG",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4301292590/",
    "job_id": "4301292590",
    "source": "linkedin",
    "company_name": "DBS Bank",
    "job_title": "Analyst, Treasures Relationship Manager_North Kaohsiung Branch",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368549406/",
    "job_id": "4368549406",
    "source": "linkedin",
    "company_name": "Morrison Express",
    "job_title": "(HQ) Tax Senior Analyst / Supervisor / Assistant Manager",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370571208/",
    "job_id": "4370571208",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Manager, Indirect Tax Advisor – Fintech & Payments (Singapore-Based, Relocation support provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325890352/",
    "job_id": "4325890352",
    "source": "linkedin",
    "company_name": "YAGEO Group",
    "job_title": "(Taipei) Tax Manager",
    "location": "New Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370571211/",
    "job_id": "4370571211",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Manager, Indirect Tax Advisor – Fintech & Payments (Bangkok-Based, Relocation support provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362363748/",
    "job_id": "4362363748",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Indirect Tax Manager – Advisory (Bangkok-Based Position, Relocation Support Provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346554456/",
    "job_id": "4346554456",
    "source": "linkedin",
    "company_name": "Agoda",
    "job_title": "Indirect Tax Compliance Lead (Bangkok Based, Relocation Provided)",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353785621/",
    "job_id": "4353785621",
    "source": "linkedin",
    "company_name": "WPP Media",
    "job_title": "Financial Controller",
    "location": "Taipei, Taipei City, Taiwan",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3364420947/",
    "job_id": "3364420947",
    "source": "linkedin",
    "company_name": "CSM Bangladesh Ltd.",
    "job_title": "Sr. Accounting Officer",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354121838/",
    "job_id": "4354121838",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4117100980/",
    "job_id": "4117100980",
    "source": "linkedin",
    "company_name": "(For Express One)-Job ID",
    "job_title": "Accounts Officer (Payroll & Tally Expert)",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4262132366/",
    "job_id": "4262132366",
    "source": "linkedin",
    "company_name": "Talent Centric নিয়োগ",
    "job_title": "Executive Accounts & Finance",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4030550770/",
    "job_id": "4030550770",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Finance & Accounts (For Novatek Pharmaceuticals Ltd.)-Job ID ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4200346564/",
    "job_id": "4200346564",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Manager (For DHANMONDI GENERAL AND KIDNEY ...",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4256289312/",
    "job_id": "4256289312",
    "source": "linkedin",
    "company_name": "Accounting/Finance – For Madina Group – Job ID ...",
    "job_title": "Internship",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351741678/",
    "job_id": "4351741678",
    "source": "linkedin",
    "company_name": "For Daffodil International School Dhanmondi",
    "job_title": "Officer, Accounts",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3080005302/",
    "job_id": "3080005302",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Mridul Real Estate Ltd. নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355194071/",
    "job_id": "4355194071",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "Manager / Sr. Manager-Finance & Accounts",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4250335375/",
    "job_id": "4250335375",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3946213547/",
    "job_id": "3946213547",
    "source": "linkedin",
    "company_name": "LCBS Dhaka",
    "job_title": "Senior Executive, Accountants & Finance",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4277095779/",
    "job_id": "4277095779",
    "source": "linkedin",
    "company_name": "Job ID : 1390644 Dhaka, Bangladesh ...",
    "job_title": "For Ark Accounting Pty Ltd",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366486050/",
    "job_id": "4366486050",
    "source": "linkedin",
    "company_name": "United Commercial Bank PLC নিয়োগ",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4214555135/",
    "job_id": "4214555135",
    "source": "linkedin",
    "company_name": "Sabrina-Dream Properties Ltd.",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4074227426/",
    "job_id": "4074227426",
    "source": "linkedin",
    "company_name": "RM Group Limited/ RM Systems নিয়োগ",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4298914443/",
    "job_id": "4298914443",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accountants Near Me Inc hiring Accounting Associate – Bangladesh ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295381309/",
    "job_id": "4295381309",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "Junior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4299957054/",
    "job_id": "4299957054",
    "source": "linkedin",
    "company_name": "(For Mugnee Multiple Limited ...",
    "job_title": "Junior Accountant (Probationary)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4080188610/",
    "job_id": "4080188610",
    "source": "linkedin",
    "company_name": "REPLIQ নিয়োগ",
    "job_title": "Junior Accounts Executive",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4189157156/",
    "job_id": "4189157156",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Officer- For Prime Bank Foundation- Job ID : 1351305",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4090891426/",
    "job_id": "4090891426",
    "source": "linkedin",
    "company_name": "(For Scholars' School & College)-Job ID",
    "job_title": "Junior Accounts Officer",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4114603229/",
    "job_id": "4114603229",
    "source": "linkedin",
    "company_name": "(For Karupannya Group)- Job ID",
    "job_title": "Junior Account Officer",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4120324129/",
    "job_id": "4120324129",
    "source": "linkedin",
    "company_name": "For A Repuated Company (Job ID :1326305)",
    "job_title": "Junior Accounts Officer",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4121003498/",
    "job_id": "4121003498",
    "source": "linkedin",
    "company_name": "Finance & Accounts (For SP Trading House.)-Job ...",
    "job_title": "Deputy Manager",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3294470709/",
    "job_id": "3294470709",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Rahman Mostafa Alam & Co. (Chartered Accountants)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4151741723/",
    "job_id": "4151741723",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Key Account Executive/Manager-Akij Blue Pill Limited(For ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3922949467/",
    "job_id": "3922949467",
    "source": "linkedin",
    "company_name": "For Rtemis Limited",
    "job_title": "Accounts Executive/ Sr. Executive",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/1165322435/",
    "job_id": "1165322435",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Sr. Executive, Accounts & Admin Dhaka, Bangladesh LinkedIn",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3938073221/",
    "job_id": "3938073221",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Ticket Lagbe Ltd. নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4060967944/",
    "job_id": "4060967944",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "TripNest Limited নিয়োগ",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4292247159/",
    "job_id": "4292247159",
    "source": "linkedin",
    "company_name": "(For Surely Savvy)",
    "job_title": "Accountant",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4103677699/",
    "job_id": "4103677699",
    "source": "linkedin",
    "company_name": "Costing (For Dekko Accessories Ltd.)",
    "job_title": "Asst. Manager",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350180422/",
    "job_id": "4350180422",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4129868745/",
    "job_id": "4129868745",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Senior Manager, VAT and Tax (For Labaid Cancer Hospital)-Job ID",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4298912859/",
    "job_id": "4298912859",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Accounting Associate – Tax & Accounting Firm",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4223518503/",
    "job_id": "4223518503",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Tax and VAT Consultant- For LIBERTY CHAMBERS- Job ID : 1364387",
    "location": "Dhanmondi, Dhaka",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326791803/",
    "job_id": "4326791803",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Madina Group hiring Cost Manager in New Market Thana, Dhaka ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]