[
  {
    "url": "https://www.linkedin.com/jobs/view/4359892342/",
    "job_id": "4359892342",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Legal Officer (For Islamic Finance and Investment PLC.)-Job ID: 1456569",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Islamic Finance and Investment PLC. is looking for Legal OfficerJob Description / ResponsibilityIslamic Finance and Investment PLC., the first Islamic Shariah-based Financial Institution of the country is looking for Legal Officer (Preferably SO-PO).Educational RequirementsBachelor of Law (LLB)Must be L.L.B. from any recognized University/Institute having no third division/class in the academic background.Experience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):Investment/Merchant BankingAdditional RequirementsMinimum 3 years’ experience in related field of any Bank/Financial Institution.Advocate in any district level court (Preferably Bangladesh Supreme Court).Knowledge on Artha Rin Adalat Ain, Banking Company Laws, Finance Company Act, 2023.Practicing experience will be preferred.Excellence computer skills especially MS Word, Excel, Power Point.Job LocationDhaka Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371725849/",
    "job_id": "4371725849",
    "source": "linkedin",
    "company_name": "ASB Associates",
    "job_title": "Finance Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description We suggest you enter details here. Role Description This is a full-time, on-site role based in Kathmandu for a Finance Officer. The Finance Officer will be responsible for managing day-to-day financial operations, preparing financial reports, analyzing data to identify opportunities for cost management, ensuring compliance with financial regulations, and supporting budget preparation and forecasting. The role will also involve assisting with audits, ensuring accurate record-keeping, and providing financial insights to support strategic decision-making. Qualifications Strong knowledge of accounting principles, financial management, and budget developmentProficiency in financial forecasting, data analysis, and reportingExperience with accounting software and tools, as well as advanced Excel skillsExcellent organizational skills, attention to detail, and ability to manage multiple financial tasks effectivelyStrong communication and interpersonal skills to collaborate with team members and stakeholdersAbility to work independently and ensure compliance with financial regulations and standardsBachelor's degree in Accounting, Finance, Business Administration, or relevant field (Master's degree or professional certifications such as CPA or ACCA are a plus)Previous experience in a finance or similar role is highly desirable Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363062006/",
    "job_id": "4363062006",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Costing - For GPH Ispat Limited - Job ID: 1458277",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "GPH Ispat Limited is looking for Officer - CostingJob Description / ResponsibilityJob PurposeTo support plant financial operations by preparing accurate costing, production reconciliation, budgeting, and analytical reports, ensuring effective cost control and timely financial information for management decision-making.Prepare daily log sheets and breakdown reports for cost analysis purposes.Prepare and circulate daily cost analysis reports for the plant to management.Prepare daily production, delivery, and closing stock reports and share with respective HODs.Prepare daily reconciliation reports (Actual vs SAP) for production and consumption data.Prepare monthly product-wise cost-benefit analysis reports.Prepare daily and monthly power consumption reports for monitoring and analysis.Prepare investment feasibility reports as required by management.Assist in preparation of departmental budgets and cost optimization plans.Prepare post-budget variance reports with detailed root cause analysis for any deficit or surplus.During plant shutdowns, coordinate with Production and Store departments to take floor stock.Prepare and submit shutdown-related reports as per management requirements.Maintain regular communication with Production teams to ensure timely and accurate production and consumption entries in SAP.Support data accuracy and compliance in SAP-related costing and reporting activities.Perform any other duties assigned by the line manager from time to time in line with organizational needs.Educational RequirementsBachelor of Business Administration (BBA) in Accounting & Information SystemBachelor in Finance, Accounting or a related discipline.Professional qualifications (CACC/ICMA-800/1000 marks completed) will be an added advantage.Skills Required: SAP, Financial Analysis, Costing, Planning and budget, Budgeting and ForecastingExperience Requirements1 to 3 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Manufacturing (Light Engineering and Heavy Industry),Paint,Cement,SteelAdditional RequirementsStrong knowledge of cost accounting and industrial costing concepts.Practical experience in SAP (production, consumption, costing modules preferred).Proficiency in MS Excel and financial analysis tools.Strong analytical, reconciliation, and reporting skills.Ability to work closely with cross-functional teams (Production, Store, Engineering).Good communication and coordination skills.Job LocationChattogram (Sitakunda) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367740968/",
    "job_id": "4367740968",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Assistant Finance Manager-CA Freshers",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DesccriptionRoles Under Finance, Banking & Working Capital Management Dollar Hedging Analysis of All companies of reputed Group of company. Inventory Analysis of all companies of Goenka Group. Prepare MIS report for presentation to Director sir on Monthly basis. Present Agenda for consortium meetings to be attended at different banks. Management of working capital facilities (renewal, enhancement & new limits) for assigned companies. Providing information required by Banks such as provisional/projected financials, stock reports and sales data. Co-ordination with the external auditor for timely completion of audits and banking processes. Analyzing the volatility of USD/INR and deciding/booking forward contracts in a manner beneficial to the company. Tracking forex movement and preparing daily/weekly forex impact reports. Handling and managing personal loans, repayment schedules and all related documentation. Supervising the procedure related to black-listing and BG claims. Negotiating interest rates with Bankers for cost-effective banking operations. Supervising staff of Trade Operations from L/C establishment up to document retirement. Administering Bank Advices and verifying their accuracy. Supervising Local L/C operations and reviewing terms and conditions in case of Quotations/Proforma Invoices. Managing the Budget and Cash Flow of both companies. Administering loan settlements to minimize interest cost. Maintaining relationship with Bankers through periodic visits. Interpreting financial information and recommending further courses of action. Providing strategies to enhance/improve sales and overall financial performance. Maintaining the Financial Health of the organization. Analyzing costs, pricing, contribution margins, sales results, and comparing actual performance with business plans. Developing trends and projections for financial planning. Reviewing and implementing cost-reduction initiatives. Overseeing Finance Department operations and designing goal achievement frameworks. Coordinating with Departments on plans and future business pathways. Coordinating with Sales Team for policy implementation. Monitoring day-to-day banking operations with a focus on cost-cutting. Reporting to the Director frequently; when Director is out of station, reporting twice daily via phone/WhatsApp. Making full plan of all companies of Goenka Group to minimize the financing cost of all companies. Roles Under Internal Audit Planning the internal audit process for assigned companies and getting approval from the Director. Implementing audit plans focusing on internal control checks. Performing vouching, verification and audit procedures. Coordinating with department heads and reporting responses to Finance Manager, Directors and Chairman. Conducting inventory audits (valuation, existence, costing, cutoff). Carrying out procurement audits including independent price verification. Reviewing HR planning, employee payout systems, incentive structures and reporting accordingly. Ensuring strong internal control over documentation such as invoices, LC papers and BG documents. Roles Under Strategic Management and Decision Making Drafting annual policies for assigned companies. Studying market scenarios and evaluating strategy impact. Preparing policies for dealer discounts, annual bonuses, festival schemes and incentives. Reviewing previous year’s policies and identifying operational issues. Coordinating frequently with Directors for policy formulation and review. Monitoring policy implementation and reporting deviations on time. Jobs And Responsibilities Under FP&AEvaluating use of working capital and comparing ROI against alternatives. Assessing financial health through key financial ratios. Identifying high-profit product lines and margin analysis. Encouraging/promoting high-margin items. Evaluating departmental cost efficiency. Preparing budgets with departments and consolidating into an overall corporate budget. Preparing internal reports for top management. Maintaining financial models and forecasts. Performing variance analysis against budgets. Evaluating expansion/growth opportunities and capital investment planning. Insurance Correspondence Obtaining insurance rates, preparing comparisons and negotiating with insurance companies. Preparing risk analysis and insurance necessity reports. Coordinating with surveyors for claims and documentation. Verifying plant & machinery for breakdown risk and reporting to Directors. Following up for claim settlements with proper justification. Reporting claim details to the Director. Interest Reconciliation and Bank Advices Ensuring all bank advices are checked daily. Establishing control mechanisms for bank advices and interest calculations. Performing year-end interest reconciliation for both companies. Ensuring timely documentation submission to Accounts Department. Letter of Credit (LC) Correspondence Assisting in LC opening and daily LC monitoring. Coordinating HS Code and SA",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357011649/",
    "job_id": "4357011649",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Business Development Officer - Personal Loan (Third Party Employment) (For IPDC Finance PLC) - Job ID : 1455258",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "IPDC Finance PLC is looking for Business Development Officer - Personal Loan (Third Party Employment)Key PointsResponsible to achieve set target in terms of new business acquisition, portfolio growth and NPL management of the personal loan. The incumbent will be recruited through outsource company.Job Description / ResponsibilityAchieve set target in terms of new business acquisition for personal loan.Solicit potential customers by visiting multinational, local large companies, doctors’ segment and other valued potential customers.Increase the clients base and build strong relationships with the employees of different corporates, doctor segment and other professionals.Manage NPL of personal loan within the budgetary threshold.Capitalize on cross sell opportunities and organize sales promotion in different corporate organizations mainly multinational and local large companies.Educational RequirementsBachelor/HonorsExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): Banks,LeasingJob LocationDhaka, Khulna, Chattogram (Chattogram Sadar) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371394404/",
    "job_id": "4371394404",
    "source": "linkedin",
    "company_name": "United Nations Volunteers - Asia & the Pacific",
    "job_title": "Monitoring and Reporting Officer",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355862755/",
    "job_id": "4355862755",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Field Officer- For Shiropa Development Society- Job ID: 1452256",
    "location": "Chuadanga, Khulna, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363014219/",
    "job_id": "4363014219",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer/Senior Officer - VAT- For Samuda Chemical Complex Ltd.- Job ID: 1458289",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362200797/",
    "job_id": "4362200797",
    "source": "linkedin",
    "company_name": "IHG Hotels & Resorts",
    "job_title": "Finance Officer-Receivable| Holiday Inn Resort| kathmandu| Budhanilkantha|",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355853045/",
    "job_id": "4355853045",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Store Keeper/ Store Officer (For Rupayan Group) - Job ID : 1453266",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371760530/",
    "job_id": "4371760530",
    "source": "linkedin",
    "company_name": "Innovate Nepal Group",
    "job_title": "Senior Finance Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About the jobJob Title: Senior Finance OfficerNo. of Vacancy: 3Location: Kathmandu, NepalDepartment: FinanceAbout the RoleWe are looking for a few qualified and proactive candidates to join our team as a Senior Finance Officer at our units in Kathmandu. This role is vital for managing the company’s financial operations, ensuring smooth cash flow and providing leadership with actionable financial insights to support strategic decision-making.Key Responsibilities Maintain and oversee the company’s account books and financial records. Plan and monitor cash flow to ensure business continuity and growth. Take ownership of revenue collection and ensure timely inflows. Manage daily cash operations, including receipts, payments, and reconciliations. Provide clear financial insights and reports to the supervisor to support decision-making. Handle other finance operations including budgeting, compliance, and audits. Support Request for Proposal (RFP) processes with financial inputs and compliance requirements.Qualification and Skills Master's degree in Finance, Accounting, or related field. 3+ years of experience in financial planning, accounting, and cash operations. Strong understanding of revenue management, compliance, and financial controls. Excellent analytical, organizational, and communication skills. High level of integrity, accountability, and professionalism. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367824651/",
    "job_id": "4367824651",
    "source": "linkedin",
    "company_name": "Code Mantra",
    "job_title": "Finance Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job Title: Finance OfficerPosition: Full TimeLocation: Remote (Nepal)Experience: 3-5 yearsAbout Code Mantra:Code Mantra is a fast-growing online education technology company under NextGen Genius LLC, teaching coding, STEM, entrepreneurship, and public speaking to kids aged 5–18. We aim to empower the next generation to become creators, builders, and problem solvers.As Finance Officer, you will be a strategic partner to the CEO, driving financial strategy, operational excellence, and scalable processes to support rapid growth and student acquisition targets.Key Responsibilities:Strategic Finance & LeadershipDevelop, implement, and oversee financial strategy to support growth targets.Partner with CEO and leadership team to provide financial insight for business decisions.Build, mentor, and lead a high-performing finance team (accounting, analysts, bookkeeping).Establish KPIs, dashboards, and reporting structures to monitor business health.Accounting & ReportingOversee full-cycle accounting: P&L, balance sheet, cash flow, and monthly/quarterly close.Ensure compliance with U.S. GAAP, state, and federal tax laws.Manage audits, financial statements, and regulatory filings.Financial Planning & Analysis (FP&A)Prepare annual budgets, quarterly forecasts, and rolling cash flow models.Monitor actual performance vs. budget and provide actionable recommendations.Analyze student acquisition cost (CAC), lifetime value (LTV), and pricing models.Cash Flow & Risk ManagementMonitor tuition inflows, payment gateways, and refunds.Ensure liquidity, plan for growth investments, and manage burn rate.Implement internal controls, compliance policies, and risk mitigation strategies.Fundraising & Investment (if applicable)Support fundraising efforts: grants, loans, or investor relations.Provide financial due diligence and projections for investors or partners.Legal Advisory & ComplianceOversee corporate governance, entity structuring, and legal documentation.Draft, review, and negotiate contracts with vendors, partners, and stakeholders.Ensure compliance with employment laws, international regulations, and data privacy standards (COPPA, GDPR, FERPA).Advise leadership on legal risks, liabilities, and dispute resolution.Manage intellectual property (IP) protection, trademarks, and licensing.Coordinate with external counsel for complex litigation or cross-border legal issues.Required Qualifications:3 to 5 years of finance experience, with at least 1 years in a leadership role.Strong background in accounting, FP&A, and financial reporting.Experience in EdTech, SaaS, or subscription-based business models preferred.Expertise in cash flow management, budgeting, forecasting, and financial modeling.Familiarity with U.S. tax regulations and compliance.Hands-on with QuickBooks, Xero, or NetSuite, Google Sheets/Excel, and BI tools (Google Data Studio, Tableau, Power BI).Key Traits:Strategic thinker and problem solver.Detail-oriented with high integrity and confidentiality.Strong leadership and communication skills.Ability to work in a fast-growing startup environment.KPIs / Success MetricsAccurate and timely monthly/quarterly financial reporting.Student acquisition cost (CAC) tracked and optimized.Cash flow stability: runway, burn rate, and collections.Revenue forecasting accuracy (variance ≤ 5%).Compliance: zero regulatory or tax violations.Timely onboarding and performance management of finance team.Why Join Code MantraLead finance strategy for a mission-driven, fast-growing EdTech startup.Opportunity to build scalable processes and a high-impact finance team.Work with a passionate team shaping the next generation of innovators. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367960718/",
    "job_id": "4367960718",
    "source": "linkedin",
    "company_name": "Dynamic Technosoft",
    "job_title": "Accountant-Mid Level",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job SummaryWe are looking for a detail-oriented Mid-Level Accountant to manage accounts receivable, client billing, and payment tracking. The role requires close coordination with internal teams and clients to ensure timely invoicing, collections, and accurate financial records in company.Roles & Responsibilities Manage client invoicing as per contracts, milestones, and service agreements Track payments, follow up on outstanding receivables, and maintain ageing reports Reconcile client accounts and bank statements on a regular basis Ensure accurate recording of receipts in the accounting system Coordinate with sales and project teams to resolve billing and payment issues Support monthly closing, audits, and financial reporting related to receivables process monthly payroll, including salary calculations, deductions, and payouts Maintain payroll records, employee reimbursements, and statutory deductions Coordinate with HR, sales, and project teams to resolve payroll and billing issues Support monthly closing, audits, and compliance with statutory requirementsRequired Skills & QualificationsBachelorâ€™s degree in Accounting, Finance, or Commerce3–5 years of experience in accounting, preferably in an IT or service-based companyStrong knowledge of accounts receivable, invoicing, and reconciliationsProficiency in accounting software (Tally, Zoho, QuickBooks, or ERP systems)Good knowledge of Excel and financial reportingStrong follow-up, communication, and analytical skills Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371750444/",
    "job_id": "4371750444",
    "source": "linkedin",
    "company_name": "jobsanjal.com",
    "job_title": "Accountant",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Description: Accountant (Mid Level)Employment Type: Full-TimeLocation: Kathmandu Salary: NegotiableKey Responsibilities:-Prepare and maintain accurate financial records, ledgers, and statements.-Assist in preparing monthly, quarterly, and annual financial reports.-Reconcile accounts, process invoices, and manage accounts payable/receivable.-Ensure compliance with accounting standards, tax regulations, and internal policies.-Support audits and coordinate with external auditors as required.-Conduct field visits for financial verification, collections, and reporting.-Monitor budgets, track expenses, and provide financial insights for decision-making.-Collaborate with cross-functional teams to support financial operations.Required Qualifications:-Bachelor’s degree in Accounting, Finance, or a related field (mandatory).-1–2 years of proven work experience in an accounting role.-Strong knowledge of accounting principles, taxation, and reporting standards.-Proficiency in accounting software and MS Excel.-Excellent numerical, analytical, and organizational skills.-Strong communication and interpersonal skills. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370676859/",
    "job_id": "4370676859",
    "source": "linkedin",
    "company_name": "INVESTOR FRIENDLY CPA®",
    "job_title": "Accountant",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "ABOUT INVESTOR FRIENDLY CPA® INVESTOR FRIENDLY CPA® is a purpose-driven organization committed to excellence in strategic tax consulting, operational effectiveness, and talent solutions. With a focus on delivering impactful results for clients across the real estate industries, we support businesses with innovative tax planning strategies and people-centered practices. Our team operates with a shared vision—to be a trusted partner in driving sustainable relationships and organizational success.Can you relate to the values we stand for?At IFC, our culture is built on teamwork, accountability, professionalism, continuous improvement, self-improvement, and a genuine desire to make a difference. We believe in taking ownership of our work, collaborating to achieve shared goals, and striving to grow every day, both as individuals and as an organization. If these values align with your own, we’d love to hear from you.Why Join INVESTOR FRIENDLY CPA®?At IFC, we’re not just building careers; we’re building futures. As a purpose-driven organization, we believe in empowering individuals to grow, lead, and make an impact. This is more than just a job, it’s an opportunity to be part of a company where your ideas matter and your growth is a priority. As a member of the IFC team, you’ll:Be Part of a Visionary Team: Join a forward-thinking, impact-driven company that partners with organizations to solve complex business and people challenges.Collaborate Globally: Work with high-performing teams and dynamic professionals across departments and regions in a culture that values knowledge-sharing and innovation.Grow with Purpose: Advance your career through continuous learning, internal mobility, and leadership development initiatives designed to help you reach your full potential.Thrive in a People-First Culture: Be part of a workplace that values well-being, inclusion, and recognition. We believe that when people feel valued, great things happen.A Vision for the Future: Join a company that's evolving. As we scale, we remain committed to sustainability, innovation, and long-term value - for our clients, our people, and the communities we serve.About the JobLocation: Jhamsikel, LalitpurJob Type: Full-timeJob Title: AccountantJob Summary:IMPORTANT: Need more at least 5 year experience in QBO!We are seeking a detail-oriented and experienced Accountant to manage our financial records, ensure compliance with regulations, and provide accurate financial reporting. The ideal candidate will have strong analytical skills, knowledge of accounting principles, and proficiency in accounting software.Key Responsibilities:Prepare and examine financial records, statements, and reports.Ensure accuracy and compliance with applicable laws and regulations.Manage accounts payable and receivable.Reconcile bank statements and general ledger accounts.Assist in budgeting and forecasting activities.Prepare tax returns and ensure timely tax payments.Maintain and update fixed asset records.Assist in internal and external audits.Implement and maintain accounting procedures and controls.Support month-end and year-end close processes.Qualifications:Bachelor’s degree in accounting, Finance, or a related field.5+ years of accounting experience in tax or audit firm.Strong knowledge of GAAP and financial regulations.Proficiency in accounting software like QuickBooks.Advanced MS Excel skills (VLOOKUP, PivotTables, etc.).Excellent attention to detail and organizational skills.Strong analytical and problem-solving skills.Why Choose Us? At INVESTOR FRIENDLY CPA®, we believe in investing in the well-being, professional growth, and success of our employees. Our workplace culture fosters mutual respect, collaboration, and open communication. When our employees thrive, our company thrives. Join us and experience a workplace designed for your growth and happiness! Comprehensive Employee Benefits Our benefits package is crafted to ensure our employees feel valued, supported, and empowered from day one. Core Benefits Five-Day Workweek: Enjoy weekends off, fostering work-life harmony compared to the standard six-day workweek in Nepal. Flexible Working Hours: Customize your schedule to balance productivity and personal commitments. Office Perks Nutritious Office Meals: Daily chef-prepared, wholesome meals. Unlimited Snacks and Coffee: Stay energized throughout the day. Leave Policies: Thirteen Days of Exclusive Leave: Generous leave options to recharge and stay productive. Birthday Celebrations and Gifts: Celebrate your special day with personalized gifts and vouchers. Additional Benefits for Full-Time Employees Provident Fund: Retirement fund contributions to secure your future. Insurance Coverage: Accidental Insurance: Coverage up to Rs. 1,500,000 for accidental incidents. In-Hospitalization Coverage: Coverage up to Rs. 200,000. Family floater option for either parents or spouses and two children. Anniversary Bonuses: Celebrate your work anniversaries with special bonuses.",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371741680/",
    "job_id": "4371741680",
    "source": "linkedin",
    "company_name": "Reputed company",
    "job_title": "SENIOR XERO ACCOUNTANT",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are seeking a highly skilled and experienced Senior Xero Accountant to manage accounting operations and coordinate with international management.This role requires strong expertise in Xero, attention to detail, and the ability to work in a structured, professional environment.🕒 Working Hours• Nepal Time: 7:45 AM – 4:45 PM• China Standard Time: 10:00 AM – 7:00 PM• 1 Hour Lunch Break📅 Leave & Benefits✔️ Two weekends off (Fortnightly – 6 days per month)✔️ Major Nepal Festivals (Dashain, Tihar, etc.)✔️ All Official China Public Holidays💰 SalaryStarting from NPR 50,000+ (Negotiable based on experience and expertise)🎯 Candidate Requirements• Strong hands-on experience with Xero Accounting Software• Senior-level accounting and financial reporting experience• Ability to coordinate with international reporting office• High level of accuracy and professionalism📩 How to ApplySend your updated CV to:📧 ashish.manandhar90@gmail.comSubject Line: Apply Position – Xero(Only applications with the correct subject line will be considered.)🔎 Immediate Hiring | Serious Candidates Only📢 Feel free to share with qualified professionals.#Hiring #SeniorAccountant #XeroAccountant #JobsInKathmandu #JobsInNepal #FinanceJobs #AccountingCareer #ImmediateHiring #ProfessionalOpportunity #ApplyNow Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330866541/",
    "job_id": "4330866541",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Assistant Manager – Corporate Finance",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "A reputed group of companies is hiring an Assistant Manager - Corporate Finance. An individual with good experience and a qualified CA/ ACCA is an ideal candidate for the role.Responsibilities Support for Group Finance Operations: Assist Finance Officers of group companies in making accurate accounting entries and finalizing financial statements. Provide training and support on bookkeeping and financial processes. LC (Letter of Credit) and TT (Telegraphic Transfer) Operations: Manage and oversee LC and TT processes, ensuring timely and accurate execution. Group-Level Financial Reporting: Prepare and finalize group-level financial reports and present them to the CFO. Consolidate monthly fund utilization reports and forecast fund requirements for the CFO. Statutory Compliance: Oversee statutory audits, ensuring compliance with local regulations. Manage TDS, VAT filings, and other regulatory obligations. Banking and Financial Institution Liaison: Build and maintain relationships with banks and financial institutions. Ensure compliance with terms of financial agreements, including validating charges against approved offers. Asset Insurance Coverage: Ensure adequate and cost-effective insurance coverage for all group assets. Strategic Investment Analysis: Conduct feasibility studies and financial due diligence for mergers, acquisitions, and partnerships. Financial Planning & Budgeting: Prepare annual budgets and provisional financial statements. Address other financial planning and reporting needs as required.QualificationsCA is preferred.Prior Experience is required.Skills: finance,financial planning,compliance,operations,reporting,annual budgets,corporate finance,financial statements Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371767115/",
    "job_id": "4371767115",
    "source": "linkedin",
    "company_name": "Sharma and Company Pvt. Ltd.",
    "job_title": "Accountant",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371391139/",
    "job_id": "4371391139",
    "source": "linkedin",
    "company_name": "Sasto Tickets",
    "job_title": "Finance Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366307523/",
    "job_id": "4366307523",
    "source": "linkedin",
    "company_name": "East West Concern",
    "job_title": "Assistant Manager: Account and Finance",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Major Duties & ResponsibilitiesPrepare monthly, quarterly, and annual financial statements in accordance with applicable accounting standards.Manage day-to-day accounting operations, including bank and cash management.Review and ensure accuracy of monthly bank reconciliations.Oversee the preparation and timely filing of VAT, TDS, and Income Tax returns.Assist in annual budgeting, forecasting, and variance analysis.Coordinate with internal and external auditors and support audit processes.Ensure strong internal controls and compliance with accounting standards and tax laws.Conduct ageing analysis of accounts payables and receivables and follow up as required.Perform any other finance- or accounts-related tasks assigned by the Reporting Manager.RequirementsEducationSemi-qualified Chartered Accountant (CA) will be highly preferred.ExperienceMinimum 3–5 years of relevant experience in finance and accounting.Prior experience in a trading company will be preferred.Experience working with Microsoft Dynamics 365 Business Central will be an added advantage. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369749588/",
    "job_id": "4369749588",
    "source": "linkedin",
    "company_name": "Asian Development Bank (ADB)",
    "job_title": "Finance and Administration Assistant",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369341063/",
    "job_id": "4369341063",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Junior Accountant cum Runner (Freshers)",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370333192/",
    "job_id": "4370333192",
    "source": "linkedin",
    "company_name": "Tigg - Nepal’s #1 Cloud Accounting Platform",
    "job_title": "Partnership Manager",
    "location": "Lalitpur, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371526868/",
    "job_id": "4371526868",
    "source": "linkedin",
    "company_name": "Leverage",
    "job_title": "Key Account Manager",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370240086/",
    "job_id": "4370240086",
    "source": "linkedin",
    "company_name": "MetLife Nepal",
    "job_title": "Customer Support Associate",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Requirements Description and Requirements Customer Support Associate Job Description Main Responsibilities The role requires management of premium collection, resolve customer inquiries, and exceed customer expectations.Ensure daily collections are deposited in the company’s bank account.Report the daily cash/cheque collection to Head Office.As the AML representative, report threshold transaction limits daily.Review and accept new business application,verify documents received against the original during both customer onboarding and post-sales service.Ensure documents are received & dispatched with proper transmittal records with proper verification as required by the policy.Ensure proper use, storage, and recording of money/premium receipts, application receipts, and postage stamps. Maintain a stock of customer forms to avoid unnecessary customer service delays. Oversee office properties and escalate any concerns promptly.Ensure customer queries and service requests are managed efficiently and in a timely manner. Identify, document and escalate service gaps or inefficiencies as and when required. Act as the coordinator for the business segment.Undertake other assignments as required. Job Specification Should possess excellent verbal and written communication skills in Nepali and English.Proficient in Microsoft Office package.Must be capable of handling assignments independently and with good learning aptitude. Experience Required: Work experience in Life Insurance or finance industry will be an advantage. Educational Description: Bachelor’s degree (completed), preferably in business studies.Job Level: Entry level. Reports To : Manager – Customer service & conservation.Compensation: As per company rule.About MetLifeRecognized on Fortune magazine's list of the \"World's Most Admired Companies\" and Fortune World’s 25 Best Workplaces™, MetLife, through its subsidiaries and affiliates, is one of the world’s leading financial services companies; providing insurance, annuities, employee benefits and asset management to individual and institutional customers. With operations in more than 40 markets, we hold leading positions in the United States, Latin America, Asia, Europe, and the Middle East.Our purpose is simple - to help our colleagues, customers, communities, and the world at large create a more confident future. United by purpose and guided by our core values - Win Together, Do the Right Thing, Deliver Impact Over Activity, and Think Ahead - we’re inspired to transform the next century in financial services. At MetLife, it’s #AllTogetherPossible . Join us! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371129201/",
    "job_id": "4371129201",
    "source": "linkedin",
    "company_name": "Ever Green Energy & Investment Pvt. Ltd.",
    "job_title": "Sales Manager",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionEver Green Energy & Investment Pvt. Ltd. is a rapidly growing company specializing in vehicle distribution and smart mobility solutions. As the official distributor of leading Chinese automotive brands, the company offers products such as Wuling 14-seater vans and Feidi 6-ton trucks. Additionally, Ever Green Energy & Investment is expanding into the electric vehicle (EV) sector, providing cutting-edge smart charging infrastructure through Hardhitter EV chargers. With a focus on sustainable and innovative solutions, the company aims to drive the future of mobility in the region.Job Title: Sales Manager – Automobile IndustryJob SummaryThe Sales Manager is responsible for leading and driving the performance of the automobile sales team to achieve revenue, profitability, and customer satisfaction targets. This role involves managing daily sales operations, developing sales strategies, coaching sales executives, and ensuring an exceptional buying experience for customers.Key ResponsibilitiesLead, motivate, and manage the sales team to meet and exceed monthly and annual sales targetsDevelop and implement effective sales strategies, promotions, and pricing plansMonitor sales performance, forecasts, and market trendsEnsure high levels of customer satisfaction throughout the sales processManage key customer relationships and handle escalations or complex negotiationsCoordinate with marketing, finance, and after-sales teams to optimize sales outcomesMaintain accurate sales reports, CRM data, and inventory levelsTrain, coach, and evaluate sales staff; conduct regular performance reviewsEnsure compliance with company policies, legal requirements, and industry standardsRequired QualificationsBachelor’s degree in Business Administration, Marketing, or a related fieldProven experience as a Sales Manager or Senior Sales Executive in the automobile industryStrong leadership, negotiation, and communication skillsIn-depth knowledge of automotive products, financing, and market dynamicsAbility to analyze sales data and make strategic decisionsProficiency in CRM systems and MS Office toolsInterested candidates are encouraged to apply via LinkedIn or can send their resume at hrevergreenwuling@gmail.com Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366326968/",
    "job_id": "4366326968",
    "source": "linkedin",
    "company_name": "East West Concern",
    "job_title": "International Procurement and Sales Administrator",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Essential Duties And ResponsibilitiesMaintain daily administrative operations of the Sales Department. Follow office workflow procedures to ensure maximum efficiency. Coordinate with the Sales Divisions Heads, Service Manager and Heads, Store Manager and Finance/Account Manager and Finance/Account Coordinators, regarding proper/timely processing, handing-over of goods and receivables. Review and control the Agreements brought forward by the sales team and make sure to follow them, and keep proper documentation of them. Ensure the adequacy of sales-related equipment or material Respond to complaints from customers and give after-sales support when requested Store and sort financial and non-financial data in electronic form and present reports Handle the processing of all orders with accuracy and timeliness Inform clients of unforeseen delays or problems Monitor the teamâ€™s progress, identify shortcomings and proposeâ€¯improvements Ensure adherence to laws and policies Utilize company resources to develop a filing system that keeps all active sales files regularly, properly & systematically. Ensure the inventory of custom sales presentation materials such as brochures and presentation folders is always up to date Help on creating sales presentations when needed Perform all the tender related transactions Check and record the inventory on timely basis and submit the inventory record to the concerned person Support other teams with various administrative tasks. Conduct other admin related works as assigned Maintain files and records with effective filing systems. Coordinating with the team and managing all necessary documents while bidding and submitting it timely within the deadline of respective tender. Monitor the teamâ€™s progress, identify shortcomings and propose improvements. Inform other departments and clients of unforeseen delays or problems. Ensure proper handing-over of projects taken up by the company, to have good customer relations and avoid losses for the company. Resolve administrative problems by analyzing, identifying and communicating. Overseeing promotional expenses, preparing needed documentation. Assist in the preparation and organizing of promotional material or events in a timely manner. Coordinate and convey customer complaints to the right place for quick solutions and to retain good customer relations. Other works when and as assigned by office. Job RequirementBachelorâ€™s degreeMinimum 2-3 yearsâ€™ experience in relevant field Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366439964/",
    "job_id": "4366439964",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Procurement Officer – Semi CA",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371764363/",
    "job_id": "4371764363",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Financial Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372704858/",
    "job_id": "4372704858",
    "source": "linkedin",
    "company_name": "UNDP Careers",
    "job_title": "Project Analyst (Operations)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371758408/",
    "job_id": "4371758408",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Business Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "SummaryVacancy: 2Salary: NegotiableAge: 22-35Experience: At Least One YearLocation: DhakaPublished: 06/11/2025ResponsibilitiesAssist in conducting financial consultancy projects including feasibility studies, financial modeling, and strategic planning.Contribute to market research, industry analysis, and economic forecasting.Support the development of reports, presentations, and data-driven insights for clients.Participate in management consultancy and business advisory projects.Assist in preparing proposals, pitches, and marketing materials for prospective clients.Identify potential leads and contribute to client outreach under the guidance of senior team members.Qualifications / Key AttributesMaster’s degree in Finance and/or Economics from a reputed UniversityPreference for candidates holding both Finance and Economics degrees.0–3 years of relevant experience.Freshers with strong academic backgrounds and a confident, can-do attitude are highly encouraged to apply.Participate in management consultancy and business advisory projects.Stay updated on industry trends, financial markets, and client needsCompensation & Other Benefits: Two festival bonuses (Yearly), Weekly two days holiday, Provident & Gratuity fund.Salary Review: AnnuallySend your CV at hr@emergingrating.com (Mention Business Analyst) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371762375/",
    "job_id": "4371762375",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Research Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330493984/",
    "job_id": "4330493984",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Financial Planning & Analysis",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job SummaryResponsible for financial planning, budgeting, forecasting, and performance analysis to drive business growth. Acts as a strategic finance partner with strong focus on working capital, cash flow, cost control, and margin optimization within an FMCG environment.Key ResponsibilitiesLead budgeting, forecasting, and variance analysis Manage working capital and cash flow forecasting Drive cost control and margin improvement initiatives Analyze business, product, and channel profitability Partner with sales and operations for decision support Prepare management reports and financial dashboards Lead and develop FP&A team RequirementsBachelor’s degree in Finance/Accounting (MBA/CA/CMA preferred) 5–8 years FP&A or commercial finance experience Mandatory FMCG background Strong knowledge of working capital, cash flow, cost control Advanced Excel; ERP/BI tools preferred Strong analytical and leadership skills Skills: sql,financial modeling,power bi,fmcg,budgeting & forecasting,erp systems,variance analysis Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339374376/",
    "job_id": "4339374376",
    "source": "linkedin",
    "company_name": "Field Nation",
    "job_title": "Senior Business Intelligence Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Why is this role important to Field Nation?The Senior BI Analyst role on the Data Team is a senior position, critical to driving success of partner teams by providing analysis, reporting, and dashboards that provide insights and enable decision-making. This position is based in BD and reports to the Director of Data Analytics and Engineering.What You’ll Do:Work on large, complex data problems with a focus on delivering value to internal customers. Define path forward, remove ambiguity and roadblocks, and drive to completion. Act as an owner, ensuring success despite obstacles.Write SQL queries and create insightful and engaging Tableau dashboards to provide visibility into results and insights into opportunities.Work with other BI Analysts and Data Engineers to solve problems collaboratively. As a senior member of the team, strong collaboration and deep technical expertise is required. What You'll Need:Background: 3+ years of experience working as a senior analyst, analyst, data engineer, or other data-centric position. Must include experience partnering directly with stakeholders to define data problems, determine strategy, define metrics, create necessary data structures, and build engaging dashboards.Technical Experience:Minimum 1 year of Tableau experience requiredStrong SQL skills (proficient with all joins, CTEs, window and aggregate functions, etc.).Experience applying quant and statistical techniques to business analysisExperience building machine learning and data science models to drive business results in a professional setting is strongly preferred.Soft Skills:Strong business acumen and ability to contribute to business objective achievement through data-driven insights. Experience working in field services is a plus.Highly curious nature. Must be driven to solve problems and dig deep to find solutions and ensure understanding.Strong accountability skills, including responsibility for completing work independently, raising blockers with urgency, persisting despite obstacles, and learning from past mistakes.Strong written and verbal communication skills. Location and Work Schedule: Working Days: Hybrid Monday to Friday (3 days from Home + 2 days from the Office)Working Hours: 1:00 PM to 10:00 PMLocation: Uttara 12, Dhaka, Bangladesh Salary Range:BDT 135,000 - 180,000 (Monthly)Other Benefits:Competitive salary based on experience and qualification.Mobile BillFestival BonusLeave EncashmentMedical InsuranceGratuity BenefitLunch/Dinner - Fully SubsidizedTransportation Service - Drop OffGym MembershipCareer Development BudgetAnnual performance evaluation and increment.Profit Sharing - Field Nation LLC Performance Reward.Sound work-life balance - Regular working hours: 8 Hours/Day, 5 Days/Week.Flexible leave/vacation policy.Friendly work environment.Opportunity to work with cross-cultural teams in the US. Why Field Nation?At Field Nation, we are breaking the barriers to work and enabling the gig economy. We’re a tech company that offers a web-based marketplace solution for buyers and sellers of contract services to simply connect, work, and manage their business. We look for collaborators, innovators, and problem solvers to join us in our common purpose of changing the way work gets done. We were named a Top Workplace by the Star Tribune in 2017, 2018, 2019, and a Top 150 Workplace in 2020. We look to hire extraordinary people and provide them extraordinary benefits.We may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369062510/",
    "job_id": "4369062510",
    "source": "linkedin",
    "company_name": "365 Core Talent",
    "job_title": "Real Estate Analyst (US Markets) - Internship",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Real Estate Analyst‍QUALIFICATION:Bachelor's degree (Currently in the 4th semester or beyond)Proficiency in Microsoft Office suiteExcellent communication skillsStrong interpersonal and teamwork skillsProven ability to multitask and prioritize effectively.Detail-oriented and highly organized.Excellent time management and ability to meet deadlines.Adaptability and willingness to learn and grow.‍COMPENSATION: We offer an attractive monthly salary during the entire internship period. This compensation package reflects our commitment to providing competitive pay while assessing your performance and suitability for a long-term position within our organization. PERKS (for full-time team members):Health insuranceGym/fitness membership allowancePhone expense allowanceTransportation allowanceFree lunch at the office every daySocial and recreational activitiesGenerous vacation and leave policiesFlexible work arrangementsMaster's degree sponsorship, and moreJOB DESCRIPTION:In addition to the core responsibilities listed below, there may be occasional ad hoc projects that arise, providing opportunities to further diversify your skills and contribute to our organization in new and exciting ways. these projects can vary in scope and nature, offering a chance to explore different areas of the business and collaborate with cross-functional teams, fostering professional growth and broadening your experience.Prepare financial models and feasibility studies to assess the profitability and risk associated with real estate projects, considering factors such as cash flows, return on investment, and sensitivity analysis.Conduct in-depth market research and analysis to evaluate real estate investment opportunities, including property acquisitions, development projects, and leasing strategies.Gather and analyze data on property performance, market trends, demographics, and economic indicators to provide insights and recommendations for investment decision-making.Assist in the due diligence process, including property valuation, lease analysis, and financial document review, to support investment underwriting and transaction execution.Prepare comprehensive reports and presentations summarizing findings, market analysis, and investment recommendations for internal stakeholders, clients, and investors.Monitor and track the performance of real estate assets in the portfolio, including occupancy rates, rental rates, and market trends, and provide regular performance updates to stakeholders.Collaborate with cross-functional teams, including acquisitions, asset management, and development, to support the implementation and execution of real estate investment strategies.Stay updated on industry trends, market dynamics, and regulatory changes related to the real estate market, and provide insights and recommendations based on the analysis of these factors.Utilize real estate data and analytics tools to enhance the efficiency and accuracy of market research and financial analysis processes.Support the preparation of investment proposals, financial presentations, and marketing materials to attract potential investors and clients.Assist in special projects and ad hoc financial analysis as required. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365754341/",
    "job_id": "4365754341",
    "source": "linkedin",
    "company_name": "AKIJ iBOS",
    "job_title": "Senior Business Analyst",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371759542/",
    "job_id": "4371759542",
    "source": "linkedin",
    "company_name": "RECRUITSAGE",
    "job_title": "Office Executive",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionRECRUITSAGE is committed to assisting individuals who aim to work or study abroad, particularly in European countries such as Malta, Albania, Croatia, and Romania. As an authorized recruitment agency, we facilitate legal employment opportunities for foreign talent within European companies. Our services are designed for individuals seeking lawful work permits or education opportunities in Europe and beyond, including countries such as Malaysia, the Philippines, Singapore, and several Middle Eastern nations. We are dedicated to helping candidates build a better future through transparent, compliant, and ethical recruitment processes.Role DescriptionThis is a full-time, on-site Office Executive position based in Dhaka, Bangladesh. The Office Executive will be responsible for managing daily administrative operations, maintaining office workflows, handling customer inquiries professionally, and supporting basic accounting activities. The role requires regular communication with clients, document management, process coordination, and administrative support to ensure efficient office operations.QualificationsStrong communication and customer service skills to manage client and stakeholder interactions effectivelyProven experience in administrative assistance and office administrationBasic understanding of accounting principles to manage routine financial tasksExcellent organizational and multitasking abilitiesAbility to work collaboratively in a fast-paced, on-site environmentPrior experience in a similar role or relevant professional training is an advantageBachelor’s degree in Business Administration, Management, or a related field is preferred Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361823066/",
    "job_id": "4361823066",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Computer Operator - For Sakura Language School - Job ID: 1457940",
    "location": "Comilla, Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371767263/",
    "job_id": "4371767263",
    "source": "linkedin",
    "company_name": "Rewa Soft Pvt. Ltd.",
    "job_title": "Operations & Administration Associate (Trainee)",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Rewa Soft Pvt. Ltd. is seeking a highly organized, detail-oriented, and proactive Operations & Administration Associate (Trainee) to support client coordination, operational workflows, and internal processes.This role is ideal for someone who enjoys managing communication, streamlining operations, and ensuring smooth execution across teams, and who is motivated to grow into a leadership role in operations over time.Key ResponsibilitiesClient CoordinationManage client communication through WhatsApp, calls, and email professionally and timelySend updates, invoices, receipts, and payment-related communicationsEnsure records of client interactions are properly maintainedOperational SupportConduct, coordinate, and document daily stand-up meetingsMaintain organized document management systems for easy retrieval and trackingAssist teams in executing projects efficiently by providing structured operational supportAdministrative & Financial SupportMaintain records of day-to-day transactions, receivables, and payablesCoordinate internal and external documentation for smooth workflowSupport HR and administrative activities as requiredWho We’re Looking ForGraduate in Commerce, IT, or related fieldStrong written and verbal communication skillsHighly organized, detail-oriented, and punctualProactive, fast learner, and able to manage multiple tasks effectivelyProfessional, calm, and reliable in client and team interactionsWhat You’ll GainHands-on experience in operations management and client coordinationExposure to professional workflows, documentation standards, and project processesOpportunity to grow into an Operations Coordinator / Operations Manager role based on performanceWhy Rewa SoftStructured, process-driven work cultureOpportunity to contribute to real projects and client engagementsMentorship and growth pathway for high-performing team membersCollaborative environment with clarity and professional standards﻿Interested?Send your CV and a brief note highlighting why operations and professional coordination excites you to hr@rewasoft.com.np.#OperationsAssociate,#AdministrationJobs, #OperationsJobs, #ProfessionalGrowth, #ClientCoordination, #TeamOperations, #NepalJobs, #GraduateJobsNepal, #TraineePosition, #RewaSoft, #ITandOperationsCareers Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321226100/",
    "job_id": "4321226100",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Office Secretary - Political Staff",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362467324/",
    "job_id": "4362467324",
    "source": "linkedin",
    "company_name": "CloudFactory",
    "job_title": "Senior Data Analyst",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "At CloudFactory, we are a mission-driven team passionate about unlocking the potential of AI to transform the world. By combining advanced technology with a global network of talented people, we make unusable data usable, driving real-world impact at scale.More than just a workplace, we're a global community founded on strong relationships and the belief that meaningful work transforms lives. Our commitment to earning, learning, and serving fuels everything we do as we strive to connect one million people to meaningful work and build leaders worth following.Our CultureAt CloudFactory, we believe in building a workplace where everyone feels empowered, valued, and inspired to bring their authentic selves to work. We are:Mission-Driven: We focus on creating economic and social impactPeople-Centric: We care deeply about our team's growth, well-being, and sense of belongingInnovative: We embrace change and find better ways to do things togetherGlobally Connected: We foster collaboration between diverse cultures and perspectivesIf you're passionate about innovation, collaboration, and making a real impact, we'd love to have you on board!About The RoleWe are looking for a highly analytical and detail-oriented Senior Data Analyst to support operational and performance-driven projects in a fast-paced, production environment. In this role, you will work closely with cross-functional stakeholders to translate business and project goals into robust data models, generate actionable insights, and ensure data integrity, governance, and performance visibility across projects.This role is ideal for someone who enjoys working with ambiguity, building datasets from scratch, and using statistical rigor to drive operational excellence.Core Responsibilities Requirements Definition & Data Engineering Engage with stakeholders to capture, clarify, and articulate data requirements. Translate project goals into well-structured, scalable data schemas. Identify gaps in existing datasets and design systematic approaches to generate or source required data. Statistical Performance Analysis Apply statistical techniques such as regression analysis, distribution analysis, and hypothesis testing to performance data. Distinguish between natural variance and statistically significant changes in throughput or quality. Use historical data to forecast future performance and proactively identify potential SLA risks. Data Quality & Governance Take ownership of data integrity throughout the project lifecycle. Define and implement data governance requirements to ensure high-quality and reliable performance data. Design and execute compliance testing frameworks aligned with internal governance, security, and privacy standards. Operational Efficiency & Optimization Build and maintain advanced operational dashboards to track performance, throughput, and accuracy. Provide real-time visibility into project health, enabling Project Leads to make timely, data-driven decisions. Conduct root cause analysis using methods such as outlier detection and correlation analysis when KPIs are not met. Design and run controlled experiments to test workflow changes and statistically validate process improvementsCultural AttributesAmbiguity Tolerance: Comfortable building datasets and solutions when clean or complete data does not yet exist. Global Mindset: Experience collaborating with distributed teams across Asia, Africa, Europe, the US, and South America. Attention to Detail: Deep care for data accuracy and a strong instinct to investigate anomalies and outliersRequirementsExperience 5+ years of experience in a data analytics role, ideally within an operational or production environment. Technical Skills Advanced proficiency in SQL. Strong hands-on experience with Python or R for statistical analysis. Expertise in BI and data visualization tools such as Tableau, Power BI, or Looker. Statistical & Analytical Foundation Solid understanding of probability distributions. Strong grasp of correlation vs. causation. Experience with predictive modeling and performance forecasting. Communication Proven ability to translate complex analytical findings into clear, actionable insights for non-technical stakeholders and leadershipKey Success Indicators (First 90 Days)Baseline Establishment: Complete a comprehensive audit of existing project data schemas and identify at least three optimization opportunities. Governance Framework: Implement standardized compliance testing for a minimum of two major workflows. Strategic Reporting: Deliver a predictive performance model capable of identifying SLA risks at least two weeks in advanceBenefitsGreat Mission and CultureMeaningful WorkMarket competitive salaryQuarterly variable compensationRemote and Home workingComprehensive medical cover Group life insurancePersonal development and growth opportunitiesOffice snacks and lunchPeriodic team building and social eventsAt CloudFactory, we believe that work should be more than just a job—it sho",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363573766/",
    "job_id": "4363573766",
    "source": "linkedin",
    "company_name": "DishHome",
    "job_title": "Associate Admin Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372257120/",
    "job_id": "4372257120",
    "source": "linkedin",
    "company_name": "Source Code - Fintech",
    "job_title": "Receptionist cum Admin Assistant",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353998354/",
    "job_id": "4353998354",
    "source": "linkedin",
    "company_name": "Abacus Insights",
    "job_title": "Senior Business & Data Analyst",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322772948/",
    "job_id": "4322772948",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Admin cum Front Desk Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4315389909/",
    "job_id": "4315389909",
    "source": "linkedin",
    "company_name": "Palladium: Make It Possible",
    "job_title": "Technical Consultants - Financial Sector Development Programme, Bangladesh",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353845019/",
    "job_id": "4353845019",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Sales Executive (For SPDL-Sarker Properties and Developments Ltd.) - Job ID : 1451107",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333952444/",
    "job_id": "4333952444",
    "source": "linkedin",
    "company_name": "Kanz",
    "job_title": "Arabic -Pro / Admin",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343578006/",
    "job_id": "4343578006",
    "source": "linkedin",
    "company_name": "CloudFactory",
    "job_title": "Senior Global Payroll Operations Manager",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "At CloudFactory, we are a mission-driven team passionate about unlocking the potential of AI to transform the world. By combining advanced technology with a global network of talented people, we make unusable data usable, driving real-world impact at scale.More than just a workplace, we're a global community founded on strong relationships and the belief that meaningful work transforms lives. Our commitment to earning, learning, and serving fuels everything we do as we strive to connect one million people to meaningful work and build leaders worth following.Our CultureAt CloudFactory, we believe in building a workplace where everyone feels empowered, valued, and inspired to bring their authentic selves to work. We are:Mission-Driven: We focus on creating economic and social impactPeople-Centric: We care deeply about our team's growth, well-being, and sense of belongingInnovative: We embrace change and find better ways to do things togetherGlobally Connected: We foster collaboration between diverse cultures and perspectivesIf you're passionate about innovation, collaboration, and making a real impact, we'd love to have you on board!Role SummaryWe are seeking a senior-level professional to lead our mission critical payroll operations, owning and overseeing the end-to-end payroll and pay ecosystem globally. This role is designed as a hands-on expert with deep executional ownership, operating with high autonomy in a complex, global environment.The role will be responsible to work closely with Technology, Delivery, Finance, Legal, and external payroll providers to ensure payroll and pay processes are accurate, compliant, scalable, and delivered with operational excellence. While this role also contributes to broader compensation strategy and governance, its primary focus is on pay execution, payroll integrity, and operational rigor.This role is ideal for someone who combines strong analytical capability with exceptional attention to detail, and who thrives in environments where precision, accountability, and cross-functional collaboration are critical.Key ResponsibilitiesPayroll & Pay Execution (Primary Focus)Lead the end-to-end global payroll operations, including governance, timelines, controls, validation, and issue resolution across multiple countries and employment modelsAct as the single point of accountability for payroll accuracy, timeliness, and compliancePartner with external payroll vendors and internal Finance and Tech teams to ensure seamless execution and continuous improvementIdentify, investigate, and resolve payroll discrepancies, root causes, and systemic issuesDrive standardization and documentation of payroll processes, controls, and escalation pathsStrategic Data & Insight StewardshipElevate payroll to strategic insights by transforming raw payroll data into executive-ready insights, proactively identifying cost drivers, operational risks, and opportunities for global process optimization and efficiency gains through automationEstablish data governance by designing and owning the strategic roadmap for payroll data integrity, reporting, and analytics, partnering with Finance to ensure seamless reconciliation, variance analysis, and accurate financial forecastingDevelop and maintain a suite of clear, reliable metrics and executive dashboards that provide senior leadership with the foresight needed to make informed decisions regarding global workforce cost and operational performanceExecutive Influence & Cross-Functional GovernanceAct as the primary strategic partner to Technology, Finance, Delivery, and Talent leadership, championing the design and control of reliable, scalable payroll systems, integrations, and data flowsProvide trusted, expert guidance to senior leaders on global payroll complexity, regulatory trade-offs, and risk mitigation strategies related to workforce changes,Govern cross-functional processes with Finance (funding, accounting, audits) and Technology (system integrity) to ensure operational rigor and maintain a highly controlled, compliant, and scalable global pay ecosystemCompliance, Risk & ControlsEnsure payroll compliance with local labor laws, tax regulations, and statutory requirements across geographiesEstablish and maintain strong internal controls, documentation, and audit readinessProactively identify payroll risks related to growth, change, or system implementation and lead mitigation effortsBenefits (Light Touch / Governance)Provide governance oversight to ensure benefit-related payroll deductions and contributions are accurately executedPartner with benefits owners or vendors where payroll integration or execution issues ariseEnsure benefits impacts are correctly reflected in payroll systems, without owning full benefits strategyWhat Success Looks LikePayroll is delivered accurately, on time, and with minimal exceptions, even in complex global environmentsPay changes are executed flawlessly and consistentlyLeaders trust payroll data and insights to inform dec",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371365880/",
    "job_id": "4371365880",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Business Development Manager - Logistics",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370636562/",
    "job_id": "4370636562",
    "source": "linkedin",
    "company_name": "Daraz",
    "job_title": "NP-Business Development Manager-Logistics",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Lead the development and execution of sales and business development strategies to drive sustainable revenue growth and market expansion across all logistics service verticals. Oversee and mentor the sales team, ensuring high performance, goal alignment, and continuous development of team capabilities. Identify and evaluate new business opportunities, strategic partnerships, and market segments to support long-term growth objectives. Cultivate and maintain senior-level relationships with key clients, partners, and industry stakeholders to enhance customer retention and expand strategic accounts. Collaborate cross-functionally with operations, product, finance, and marketing teams to align sales efforts with overall business goals and deliver a seamless customer experience. Monitor and analyze industry trends, customer needs, and competitor landscape to proactively adjust sales strategies and maintain a competitive edge. Drive the development of high-impact proposals and client presentations that demonstrate value, align with customer goals, and drive business outcomes. Report regularly to executive leadership on sales performance, pipeline health, market trends, and strategic initiatives. Own and refine the client onboarding and retention process, ensuring scalability, consistency, and a customer-centric approach.Job Requirements Bachelor's degree in Business Administration, Logistics, or a related field; MBA preferred. 5+ years of experience in B2B sales within the logistics, courier, or transportation industry, with a minimum of 2-3 years in a senior leadership role. Proven success in building and scaling sales teams, achieving revenue targets, and executing high-impact sales strategies. Exceptional communication, negotiation, and stakeholder management skills, with experience managing C-level relationships. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329408117/",
    "job_id": "4329408117",
    "source": "linkedin",
    "company_name": "Award Global",
    "job_title": "Product Expert",
    "location": "Lalitpur District, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366040609/",
    "job_id": "4366040609",
    "source": "linkedin",
    "company_name": "Cloudtech Bookkeeping LLC",
    "job_title": "Accountant",
    "location": "Khulna, Khulna, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About UsCloudTech Bookkeeping is a USA-based accounting BPO firm providing bookkeeping and accounting services to clients across the globe. As part of our team, you will have the opportunity to work with international clients (USA, Canada, UK) and gain global exposure while advancing your professional career in accounting.Office Hours:Saturday to Thursday | 11:00 AM – 8:00 PM (Office Job – Do not apply if you are seeking a remote position)Job ResponsibilitiesMaintain accurate and well-organized financial records for international clients.Record and categorize financial transactions accurately and on time.Perform regular bank and ledger reconciliations to ensure accurate financial reporting.Manage accounts payable and accounts receivable efficiently.Review accounting entries and workflows to ensure accuracy and compliance.Communicate professionally and confidently with international clients in fluent English.Assist in presenting and explaining accounting services to foreign clients when required.Stay updated on basic international accounting standards and industry practices.RequirementsMinimum 1 year of hands-on experience as an Accountant (mandatory).Bachelor’s degree in Accounting, BBA, or a related discipline.Preference will be given to graduates from reputed universities.Partially completed CMA, ACCA, or CA will be highly preferred.Strong proficiency in Microsoft Excel, Google Sheets, Word, and PowerPoint.Must be fluent in spoken and written English (IELTS certification is a plus).Experience with any accounting software will be an advantage (training will be provided if needed).Only Bangladeshi candidates are eligible to apply.ExperienceAt least 1 year of direct accounting experience is mandatory.BenefitsCompetitive salary: BDT 20,000Opportunity to work with international clientsProfessional growth and long-term career developmentSupportive and learning-focused work environment Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370328573/",
    "job_id": "4370328573",
    "source": "linkedin",
    "company_name": "World Food Programme",
    "job_title": "Procurement Associate, G6, Dhaka",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DEADLINE FOR APPLICATIONS21 February 2026-23:59-GMT+06:00 Bangladesh Standard Time (Dhaka)WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability.ABOUT WFPThe World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change.At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves.To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok.WHY JOIN WFP?WFP is a 2020 Nobel Peace Prize Laureate.WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal & professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities.A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe.We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement).To provide coordination, administrative services and research to support the efficient and effective procurement services.KEY RESPONSIBILITIES (not all-inclusive, nor exhaustive): Provide operational coordination and administrative services, to support procurement projects and activities, following standard processes and contributing to the effective procurement of goods and services. Identify and recommend potential suppliers and compile data/documents to support the selection of suppliers, ensuring standard processes are followed. Review, record and prioritise purchasing requests, and provide support to requisitioners, in order to support the procurement of appropriate goods and services, at lowest cost to WFP. Contribute to negotiations with new suppliers on terms and conditions of orders, alongside a senior officer, in order to obtain the best terms and lowest costs for WFP. Prepare Purchase Orders, contracts and any supporting documentation for approval by the appropriate stakeholder, and approve purchases within delegated authority, to enable the swift purchase of goods and services. Resolve issues related to delivered goods, using initiative, liaising with all parties and following standard processes, to ensure timely and accurate resolution of problems. Research, collect and analyse data in order to produce reports to enable informed decision-making by Procurement Officers, and consistency of information presented to stakeholders. Manage updates and further develop databases and records, to ensure information is accurate, organised, and available for others to access, and supports reporting requirements. Maintain relationships with internal counterparts, to support the alignment of procurement activities with wider programmes and ensure a coherent approach to meeting food assistance needs. Supervise the work of support staff, providing practical advice and guidance, to ensure individual and team objectives are delivered to agreed standards and deadlines. Follow standard emergency preparedness practices to support WFP to quickly respond and deploy food and needed resources to affected areas at the onset of the crisis.QUALIFICATIONS AND EXPERIENCE:Education: Completion of University Degree (Bachelor or equivalent) is required. Education in Supply Chain, Procurement or any other relevant field is preferable.Experience: At least 6 years of experience in Procurement, Supply Chain or any other relevant fields.Language: Fluency in spoken and written both in English and Bangla language.Job Title: Procurement AssociateGrade: G6Type of contract: Fixed TermDuration: 12 MonthsDuty Station: Dhaka with frequent travel to the fieldNumber of positions: 01This vacancy announcement is for only Bangladeshi Nationals.WFP offers a competitive benefits package including salary, leave plus medical insurance.All documents will be verified, and any discrepancies will lead to automatic disqualification.WF",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371888791/",
    "job_id": "4371888791",
    "source": "linkedin",
    "company_name": "World Food Programme",
    "job_title": "Programme Policy Officer (Impact Evaluation), SC9, Dhaka",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DEADLINE FOR APPLICATIONS25 February 2026-23:59-GMT+06:00 Bangladesh Standard Time (Dhaka)WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability.ABOUT WFPThe World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change.At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves.To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok.WHY JOIN WFP?WFP is a 2020 Nobel Peace Prize Laureate.WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal & professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities.A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe.We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement).BACKGROUND AND PURPOSE OF THE ASSIGNMENTDigital Financial Literacy and Social Behavioral Change InterventionWFP’s Office of Evaluation (OEV) has received funding from the Gates Foundation to conduct a three-country study assessing the impact of Digital Financial Inclusion (DFI) and Nutritional Social Behavioral Change (SBC) on maternal- and child health outcomes using impact evaluation. As part of the workstream, OEV held internal consultations and reviewed expressions of interest (EOIs) from country offices. As a result of that process Bangladesh was selected as one of the three countries to be included in the study. These terms of reference outline the responsibilities and requirements of the Programme Policy Officer - Impact Evaluation Short term contract position for an impact evaluation focusing on one of the Gates Foundation projects for evidence generation in Bangladesh.The Bangladesh CO jointly with the Office of Evaluation (OEV) is in the process of planning a randomized trial to measure the impacts of a cash Top-up, paired with a joint Digital Financial Literacy and Nutritional Social Behavioral Change intervention, on maternal- and child health outcomes.The research design seeks to compare households receiving the top-up plus DFI & SBC training against households receiving only the top-up and/or basic regular allowances. Main outcome dimensions are food security, digital financial inclusion, nutritional intake, and other measures of maternal- and child health. Data for the IE is planned to be collected in at least 3 waves from approximately 4000+ randomly selected households starting around middle of 2026, ending 12 months after implementation of the programme. The overall study is intended to end April 2028.KEY ACCOUNTABILITIES (not all-inclusive, within delegated authority):The Programme Policy Officer - Impact Evaluation will work under the supervision of the evaluation team, including RAM (M&E) unit of WFP Bangladesh Country Office, and WFP OEV (Office of Evaluation), HQ. He /she or they will oversee the day-to-day implementation of the DFI & SBC impact evaluation, and liaise with the implementing partner organization, their assigned enumerators, and the evaluation team. This will include dialogue with local governments, UN agencies and other stakeholders, supervision of data collection activities, analysis, and preparation of papers and reports. Specifically, the position of Programme Policy Officer - Impact Evaluation will involve the following elements:Effective CooperationProvide daily coordination between the impact evaluation team and local counterparts (including the project implementing partners who will also act as enumerators), ensuring that concerns are effectively communicated between parties, flagging emerging issues that may be of potential concern to one or both parties, and ensuring that effective and productive collaboration is maintained. Help ensure that",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368114566/",
    "job_id": "4368114566",
    "source": "linkedin",
    "company_name": "World Food Programme",
    "job_title": "Programme Policy Officer (Resilience Innovation - Anticipatory Action), NOA, Dhaka",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DEADLINE FOR APPLICATIONS14 February 2026-23:59-GMT+06:00 Bangladesh Standard Time (Dhaka)WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability.ABOUT WFPThe World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change.At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves.To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok.WHY JOIN WFP?WFP is a 2020 Nobel Peace Prize Laureate.WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal & professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities.A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe.We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement).BACKGROUND AND PURPOSE OF THE ASSIGNMENTThe position is based in Dhaka, Bangladesh and report to a more senior Programme Policy Officer or designate. Job holders are likely to be working under the close support and guidance of a more experienced professional staff member receiving guidance and regular feedback on work performed. They are typically involved in programme or policy activities or similar nature and analytical work of limited complexity.To provide support to resilience policy and programme activities that effectively meet food assistance needs.KEY RESPONSIBILITIES (not all-inclusive, within delegated authority): Contribute towards the development of resilience innovation projects, plans and processes—with a focus on Anticipatory Action (AA), ensuring alignment with wider programme policies and guidance. Provide project management support to the Resilience Innovation Unit’s programme activities, serving as the primary focal point for AA, ensuring a coordinated approach with wider programmes that complies with WFP standards and procedures. Under AA, oversee a small team dedicated to the maintenance and regular updating of the AA database as well as support the design of an eventual handover plan for the database to Government. Serve as the primary focal point for AA activities, overseeing coordination with other resilience innovation activities as well as WFP’s Emergency Preparedness and Response Unit. Liaise with WFP’s Cooperating Partners (CPs) for the implementation of resilience activities and specifically on AA, ensuring the timely onboarding, training, communication and coordination, and report/payment processing for AA-related activities. Liaise and coordinate with external stakeholders; participate in the AA TWG as a member; represent WFP at the UNCERF coordination group; and participate in other forums as requested to represent WFP’s AA work as well as overall resilience portfolio. Research and analyze policy and operational issues to support senior colleagues in the development of policies, programmes and activities, notably related to AA in isolation as well as within shock-responsive social protection. Contribute to the preparation of accurate and timely reporting on programmes and activities that enable informed decision making and consistency of information presented to stakeholders. Support the identification, development and management of potential partnerships to collaborative working leading to improved food assistance packages. Support the capacity building of WFP staff, partners and national government to prepare for and respond to food assistance needs, e.g. through project management support of learning initiatives. Performs duty as assigned.QUALIFICATIONS AND EXPERIENCE:Education: Completion of Advanced University Degree (Master’s or equivalent) is required. Education in International Affairs, Economics, Development Studies, Geography, Agriculture, Enviro",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355914921/",
    "job_id": "4355914921",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Internal Pre-Payment Audit Department - For A Reputed Group of Companies - Job ID: 1453368",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "A Reputed Group of Companies is looking for Executive - Internal Pre-Payment Audit DepartmentJob Description / ResponsibilityBill checking and bill forwardingReverting and correspondence with stakeholdersRecording bills and checking PDFPO/WO checkingChecking salary , earn leave, bonus on monthly basisEducational RequirementsBachelor of Business Administration (BBA)Bachelor of Commerce (BCom)MastersCA-CC will be preferredExperience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s): Manufacturing (FMCG),Pharmaceutical/Medicine Companies, Restaurant, Tea Garden, Group of Companies, LPG Gas/Cylinder GasAdditional RequirementsShould have sound knowledge of IFRS, ISA.Job LocationDhaka (Tejgaon Industrial Area) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370333245/",
    "job_id": "4370333245",
    "source": "linkedin",
    "company_name": "World Food Programme",
    "job_title": "VAM Officer (Economic & Market Analyst), NOB, Dhaka",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DEADLINE FOR APPLICATIONS21 February 2026-23:59-GMT+06:00 Bangladesh Standard Time (Dhaka)WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability.ABOUT WFPThe World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change.At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves.To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok.WHY JOIN WFP?WFP is a 2020 Nobel Peace Prize Laureate.WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal & professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities.A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe.We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement).BACKGROUND AND PURPOSE OF THE ASSIGNMENTThe VAM Officer (Economic and Market Analyst) will work under the supervision of the Head of the RAM Unit at the WFP Bangladesh Country Office. He/she will oversee day‑to‑day activities and provide end‑to‑end analytics—from price data collection, market analysis, and economic modeling to policy advice—to inform market‑based assistance, targeting, and early warning.The role will involve regular engagement with local governments, UN agencies, and other partners; oversight of data collection activities; analysis of market and economic information; and the preparation of reports, briefs, and analytical papers. Specifically, the responsibilities of the VAM Officer (Economic and Market Analyst) will include the following elements:KEY ACCOUNTABILITIES (not all-inclusive, within delegated authority): Design and manage routine market price data collection, including sample frame development, tool design, enumerator training, and spot checks. Track key commodities, wage rates, transport costs, and seasonal availability, ensuring adequate geospatial coverage. Produce monthly market bulletins and ad hoc alerts for shocks (e.g., floods, cyclones, displacement, and policy changes). Lead market functionality assessments, including trader capacity, competition, supply routes, and inventory turnover. Provide inputs on the feasibility of food assistance modalities—Cash and Voucher vs. in kind—supported by vendor transaction analysis. Monitor transfer values using real time price data and conduct outlier checks. Manage data pipelines (mobile data collection using MoDA/ODK/KoBo, data cleaning, and validation rules). Develop simple dashboards and maps, maintain methodologies, and prepare Standard Operating Procedures for cash transfer calculations, major market assessments, and return on investment methods. Participate and engage in Cash & Markets Working Groups, government forums, clusters, and partner coordination platforms. Train field teams on market price assessments, data collection standards, and reporting. Analyze CPI, inflation, exchange rate movements, real wages, and terms of trade, and interpret their implications for food security and vulnerability. Build and update food basket costing and transfer value models (cash and in kind), including sensitivity analyses. Develop a market functionality index incorporating supply chain risks and the pass through of macroeconomic shocks to retail prices. Maintain price forecasting models, seasonality profiles, and scenario-based projections. Contribute to early warning bulletins and Integrated Phase Classification (IPC) projection analyses. Assess fiscal, monetary, and policy changes (e.g., subsidy reforms, tariffs, foreign exchange measures) and advise on their implications for WFP operations in Bangladesh. Produce cost efficiency and cost effectiveness comparisons for Cash and Voucher versus in kind response modalit",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369180726/",
    "job_id": "4369180726",
    "source": "linkedin",
    "company_name": "UNDP in the Arab States region",
    "job_title": "Project associate (Green Business and Innovation)- NPSA 6",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Dhaka, BangladeshTrendingJob InfoJob Identification 31648 Posting Date 02/03/2026, 07:55 AM Apply Before 02/16/2026, 08:54 PM Job Schedule Full time Locations Dhaka, Bangladesh Agency UNDP Grade NPSA-6 Vacancy Type National Personnel Service Agreement Practice Area Inclusive Growth Bureau Regional Bureau for Asia and the Pacific Vacancy Timeline 2 Weeks Job DescriptionBackgroundThe Local Government Initiative on Climate Change (LoGIC) is a flagship project of the Government of Bangladesh that has established a nationally recognized model for locally led climate adaptation by channeling climate finance to Local Government Institutions (LGIs) and vulnerable communities through innovative, low-transaction-cost mechanisms. LoGIC will promote local action on climate change adaptation at scale through its’ Initiation Plan (IP) for phase-II. The Initiation Plan (IP) for Scaling the Local Government Initiative on Climate Change (LoGIC) will be implemented over a 12-month period as a preparatory phase designed to bridge the gap between the completion of LoGIC I and the development, approval, and launch of LoGIC II. This phase aims to lay the groundwork for the full-scale roll-out of LoGIC II by providing targeted support to the Local Government Division (LGD) and technical assistance to the Economic Relations Division (ERD).The IP will facilitate the national scaling of the LoGIC model by supporting LGD in institutionalizing the approach, while enabling ERD to initiate and complete critical technical studies, including cost-benefit analyses, feasibility studies, and the development of financing tools and models. It will also ensure the systematic capture of lessons learned and help establish the operational, financial, and institutional foundations required for a sustainable, government-led, and financially viable LoGIC II.During this phase, the project will provide technical, operational, and policy support for preparing and securing funding for the Development Project Proposal (DPP) and the Project Document (ProDoc) for LoGIC II. It will further support the design of a blended finance model; strengthen institutional memory; promote community engagement; and conduct feasibility assessments related to Nature-based Solutions (NbS), community resilience, and private sector partnerships. Additional efforts will focus on developing models that link vulnerable communities to value chains, and on enhancing institutional, legal, and policy frameworks for improved service delivery and long-term sustainability.The IP will adopt an adaptive management approach to minimize the impact of political transitions on the initiation of LoGIC II. This will include maintaining flexibility to scale the project with a combination of loans and grants as planned, or to proceed with the Government of Bangladesh’s committed funds alongside development partners’ grants.Within this context, the Green Business and Innovation Associate will play a critical role in supporting the design, analysis, and coordination of green business, innovation, and value-chain components during the IP phase, ensuring that LoGIC II is ready for rapid, cost-effective, and impactful rollout at national scale.The Admin and Finance Associate will be responsible for preparing, managing and expenditure of project annual and multi-year budget, managing audit, preparation of financial report and compliance related to financial issues as per government and UNDP policies and procedure.Duties And Responsibilitiesi. The Project Associate (Green Business and Innovation) will be responsible for the following functions:Summary Of The Key Functions:Assist the Project Coordinator in the development and execution of the cooperatives green businesses;Provide support in private sector partnership development;Support designing and piloting climate resilient green livelihoods;Provide capacity building support for green businessCooperatives knowledge management and documentation support;Programme and proposal development support.Duties And Responsibilitiesii.Green Business Development Support:Support the identification, assessment, and promotion of green and climate resilient business opportunities at local levels for the LoGIC climate resilient cooperativesAssist in the development and refinement of green business proposals, value chains, and market linkages for local entrepreneurs, and climate resilient cooperativesFacilitate establishing new green business for the LoGIC CooperativesFacilitate the growth & advancement of already established green businesses by the cooperatives.Facilitate Preparation of relevant documents, like business plans, deeds, memorandum/article of association, resolutions, operation manual, etc., for the identified legal structure and facilitate the enterprise registration process. Facilitate appropriate mechanism for the green enterprise for sustainabilitySupport positioning of cooperative‑led green businesses as market‑ready and finance‑ready enterprises, inc",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367822038/",
    "job_id": "4367822038",
    "source": "linkedin",
    "company_name": "ssbdi",
    "job_title": "Senior Chartered Accountants",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368210583/",
    "job_id": "4368210583",
    "source": "linkedin",
    "company_name": "WaterAid Bangladesh",
    "job_title": "Young Professional-Finance",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355387066/",
    "job_id": "4355387066",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Store In charge- For GOLDEN INFINITY LIMITED.- Job ID: 1452931",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368099698/",
    "job_id": "4368099698",
    "source": "linkedin",
    "company_name": "WaterAid",
    "job_title": "Young Professional-Finance",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365278396/",
    "job_id": "4365278396",
    "source": "linkedin",
    "company_name": "Himalayan Distillery",
    "job_title": "Market Auditor",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370070566/",
    "job_id": "4370070566",
    "source": "linkedin",
    "company_name": "Standard Chartered",
    "job_title": "Credit Analyst (Assistant Manager)",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367188234/",
    "job_id": "4367188234",
    "source": "linkedin",
    "company_name": "QIMA",
    "job_title": "Laboratory Testing Specialist",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionAt QIMA, we’re on a mission to help our clients make products consumers can trust.Working with over 30,000 global brands, retailers, manufacturers and food growers, we are on the ground wherever products are made. We help businesses secure every step of their supply chain with quality inspections, supplier audits, certifications, and lab testing, all powered by our intelligent digital platform.Our team of 5,000 QIMers (and counting) across 40 offices and laboratories, are united in our shared passion for innovation and integrity, and guided by our QIMA values in the decisions we make every day. We believe in the work we do, and in making a positive difference in the world. Does this sound like something you’d like to be a part of?Our Consumer Goods Division is dedicated to helping brands, retailers and manufacturers worldwide deliver safe, quality and ethically made products to their consumers. Every day at work, our inspectors, auditors, and lab techs use their expertise to help safeguard the products you use every day in your home: from clothes and footwear to toys and baby products, to electronics, appliances, and furniture.Job DescriptionImplement the management system and ISO/IEC 17025;Accept and conduct all chemical testing assignments on textile/leather/toy/children’s product according to company quality handbook and testing SOPAssist sample cutting, extraction, instrumentation and result reporting.Issue testing results with test datasheets and ensure result accuracyOperate the analytical instruments (e.g.MS, LC MS, HPLC DAD, ICP-OES, ICP-MS, UV-VIS. Etc.).Carry out tests according to international standards/client specific method;Assist to perform method validation and prepare accreditation audit.Involved in operation, maintenance, calibration / verification, performance check, and/or intermediate check of equipment in chemical testing Lab;Assist CRM preparation, documentation and store management.Knowledge of safety protocols and regulations related to chemical handling and laboratory practices.Finish other tasks assigned by Manager.QualificationsEDUCATION:Minimum B.Sc./ bachelor's degree in science or engineering.TRAININGISO/IEC 17025 requirement, Chemical Testing Training etc.TECHNICAL KNOWLEDGEKnowledge of measurement uncertainty estimation and applicationKnowledge of method validation or verificationSkillsGood communication skills.Able to manage the test instrument，（e.g. GC/MS, LC MS, HPLC DAD, ICP-OES, ICP-MS, UV-VIS etc.)EXEPRIENCE>3 years’ experience in Textile testing laboratory; Experience of Accreditation Body Audit is advantageLANGUAGE PROFICIENCYGood command in written and spoken English and BengaliOthersStrong technical knowledge.Analytical mind and logical thinking.CompensationsAdditional Information Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293463860/",
    "job_id": "4293463860",
    "source": "linkedin",
    "company_name": "Control Union Sri Lanka",
    "job_title": "Social Compliance Auditor",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "As a Social Compliance Auditor, you will be responsible for the application of social regulatory requirements and principles against established standards and protocols. The position requires strong communication. You will be initiating and conducting on-site audit activities at our clients. You will be responsible for the document review as well as preparing and distributing your audit findings in an audit report.Are you committed to integrity, quality, and a self-driven, systematic, service-oriented person and do you want to be part of our international network? Then we are looking for you!Tasks And ResponsibilitiesAuditing: Assessing the conformity of operations against established international standards and regulations by visiting clients on-site and examining records, reports, operating practices, and documentationDocument reviewPreparing and conducting all on-site audit activitiesPreparing, approving and distributing the audit reportEnsuring audits reports and documents are submitted on time and review it for its completenessConducting audit follow-upMaintaining good relationship with the clientsMaintaining contact with the Certifier (Certification Manager) on regular basisAssisting with handling of claims and appealsAssisting in generating business leads for the entire gamut of Social Programmes (SLCP, SA 8000, SMETA, URSA, ETI, Buyer’s COC)Provide inputs to perform market analysis for the industry and identify new opportunities (markets, service, clients)Provide inputs to develop marketing and sales strategy to improve service awareness and enhanced CU brand propositionKeeping upbreast of all the related Certifications Programmes offered by the company as well as any market innovationKeeping abreast of developments, issues and legislative changes pertaining to related industry sectorsRequirementsGraduate in any discipline (Agriculture/ Textile would be advantageous)Must be APSCA Qualified (CSCA) levelTotal job experience should be at least 5 years in conducting social audits (Textile, Food, Packaging and Paper Industries experience will get preference)Relevant job experience/Lead Auditor should be 2-3 yearsSA8000 Advanced Lead Auditor Training and SLCP will add value.Understanding of SMETA guidelines, best practice and Social Audit terminology, and how to apply themExperience and knowledge of national and international laws, including ILO conventions and industry practicesKnowledge of Human resources management systemsGood command of English in speech and in writingGood presentation skillsResourceful, fast learner with strong interpersonal skillsProficiency with MS OfficeWillingness to travel extensively anywhere in the countryOur values drive our business and our people demonstrate these attributes in all that they do. We are looking for candidates that act with integrity, demonstrate the highest level of service quality, are resilient, have an adaptive mindset and are committed to working safe, with long term view and sustainability. If you have these qualities then we look forward to welcoming you to our global family!Apply for this vacancy Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359892207/",
    "job_id": "4359892207",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Medical Officer - (For Tusuka Group) - Job ID - 1456535",
    "location": "Gazipur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361776829/",
    "job_id": "4361776829",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager, IT Infrastructure- For Evercare Hospital Dhaka- Job ID: 1458075",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Evercare Hospital Dhaka is looking for Deputy Manager, IT InfrastructureJob Description / ResponsibilityPerform System, Network and Security design and capacity planning, Install and maintain ICT environments.Provide second/third level technical support to users concerning network and Security system operations.Install, configure, and maintain multi-user software in the network environment.Administer and maintain end user accounts, permissions, and access rights, if neededOversee installation, configuration, maintenance, and troubleshooting of network connected end-user hardware, software, and peripheral devices.Oversee all local and wide area network, security compliance and implement security standard.Manage security solutions, including firewalls, anti-virus, and intrusion detection systems etc.Ability to organize, prioritize and multitask Hands-on experience in system, security, networking, routing, and switching.Strong understanding of computer network infrastructure including IP Camera and NVR and storage.Good analytical and critical thinking skillsInstall, configuration and troubleshooting of the entire Network infrastructure.continuously monitors the network for security breaches, carries out simulated attacks to identify vulnerabilities, and develops security protocols to prevent potential threats.Educational RequirementsBachelor of Science (BSc) in Computer Science & EngineeringExperience Requirements5 to 7 year(s)The applicants should have experience in the following business area(s):HospitalAdditional RequirementsHands-on experience on Enterprise grade Cisco and Juniper Switch -Expert levelHands-on experience on Fortinet, Palo Alto and Checkpoint devices - Expert levelHands-on experience on Wireless Device and controller (Fortinet and Ruckus) - Expert levelHands-on experience on monitoring the network and security infrastructure - Expert level. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371105806/",
    "job_id": "4371105806",
    "source": "linkedin",
    "company_name": "The Organic Valley Private Limited",
    "job_title": "Quality Systems & Compliance Officer",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description:The Organic Valley Private Limited (TOV) was established in 2011 to make a significant difference in the field of organic agro-production and trading. Its corporate office lies in Bakhundole, Lalitpur. TOV is one of the pioneers in promoting Organic Agriculture and food practices in Nepal. It has been the first of its kind to Trade Organic Products from Nepal to various countries in the World. TOV has been involved in various projects as well as product research and diversification since its inception.Role Description:Location: Lalitpur basedEmployment Type: Full-timeSector: Agriculture, Food Processing & TradeWe are seeking a highly system-oriented Quality Systems & Compliance Officer who can design, implement, and sustain integrated compliance systems aligned with regulatory, certification, and organizational requirements.This role requires a professional who can analyze regulatory intent, translate it into practical systems, enable people to follow those systems, and ensure consistent compliance beyond audits.Key ResponsibilitiesStandards & Regulatory SystemsAnalyze, contextualize, and operationalize applicable standards, certification requirements, and regulatory obligationsAssess applicability of requirements and define clear, organization-wide compliance expectationsMonitor regulatory and certification updates and ensure system alignmentSystem Design & StructuringDesign, implement, and maintain integrated compliance systems aligned with operational workflowsDevelop and control SOP hierarchies, work instructions, formats, records, and control mechanismsEstablish clear responsibility, accountability, and escalation structures for compliance activitiesGap Analysis & Risk-Based PlanningConduct structured gap analysis against applicable standards and internal systemsIdentify compliance risks, system weaknesses, and improvement areasDevelop and monitor corrective and preventive action plansTraining & System EnablementDesign and deliver structured training programs for relevant internal and external stakeholdersEnable supervisors and line managers to implement and enforce compliance through their teamsEvaluate training effectiveness and ensure ongoing capability buildingImplementation Control & MonitoringEmbed compliance systems into routine operational practicesConduct internal audits, inspections, and monitoring activitiesTrack non-conformities, corrective actions, and system performance indicatorsDocumentation, Audit & Certification ManagementMaintain controlled documentation, records, and traceability systemsCompile audit evidence and maintain audit readinessPlan and coordinate internal and external auditsLiaise with certification bodies, auditors, and regulatory authoritiesSupport audit conduct, respond to non-conformities, and ensure timely closureQualifications:Key Skills & CompetenciesCore CompetenciesStrong systems thinking and structured problem-solving abilityCapability to analyze regulatory and certification requirements and translate intent into operational controlsExperience designing and maintaining compliance systems rather than isolated documentsStrong documentation discipline and audit preparedness mindsetEffective communication with authorities, auditors, and internal stakeholdersAbility to manage compliance through structure, accountability, and influence rather than direct authorityHigh integrity and consistency in compliance managementEducational BackgroundBachelor’s degree in Food Technology, Food Science, or related field preferredCandidates with other relevant academic backgrounds may be considered if they demonstrate strong system implementation experienceExperience RequirementsProven experience implementing and maintaining compliance or certification systems (e.g., Organic standards, HACCP, ISO 9001 / ISO 22000, GMP/GHP, or similar)Experience in conducting gap analysis, internal audits, training, and corrective action managementExposure to certification, regulatory, or customer auditsIdeal Candidate ProfileHighly system-oriented and process-drivenComfortable working across multiple functions and levelsAble to simplify complex requirements into practical actionsPersistent in follow-up and continuous improvementCalm, logical, and confident during audits and compliance discussionsHow to ApplyInterested candidates should apply with their CV, reference, PP size photo, and a brief note describing: One compliance or quality system you have designed, implemented, or managed, including scope and audit exposure. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361468304/",
    "job_id": "4361468304",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Service Trainer (2-Wheeler) - (For Runner Group)-Job ID: 1457197",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Runner Group is looking for Service Trainer (2-Wheeler)Job Description / ResponsibilityDesign and deliver structured technical training programs for service technicians, workshop supervisors, and service advisors.Conduct new product and model training covering engine systems, electrical systems, fuel systems, EV components, and diagnostic procedures.Prepare annual training calendars aligned with business expansion and product launches.Develop training manuals, SOPs, videos, and technical reference materials.Train dealership service teams on usage of diagnostic tools and equipment.Ensure service processes comply with OEM service standards and warranty guidelines.Conduct workshop audits and technical skill assessments.Monitor training effectiveness through post-training evaluation and performance tracking.Conduct training at dealer locations and regional service centers.Identify skill gaps within service network and recommend development interventions.Maintain updated technical training database and service knowledge repository.Educational RequirementsDiploma in Mechanical in AutomobileBachelor of Science (BSc) in Mechanical EngineeringSkills Required: Trainer, Mechanical Engineering, Service Sector, Automobile Engineer, Technical Skills, Teaching and Training, Bike Servicing, Automotive workshop, EV Battery (Easy Bike Battery), Automobile systemExperience Requirements3 to 5 year(s)The applicants should have experience in the following business area(s):Manufacturing (Light Engineering and Heavy Industry),University,Tannery/Footwear,Real Estate,Group of Companies,Automobile,Motor Vehicle body manufacturer,Motor Workshop,Fuel/PetroleumAdditional RequirementsStrong knowledge of 2W vehicle systems and diagnostics.Understanding of workshop operations and service workflow.Knowledge of EV systems, battery technology, and controller diagnostics.Familiarity with service manuals, warranty processes, and technical documentation.Training content development and presentation skills.Excellent proficiency in MS Office (Word, Excel, PowerPoint, Outlook) and modern communication tools.Job LocationDhaka Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4298529563/",
    "job_id": "4298529563",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Finance & Accounts Officer- (For The Bangladesh Red Crescent ...",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3129378468/",
    "job_id": "3129378468",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Citi hiring Finance Manager in Dhaka, Dhaka, Bangladesh",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4178261641/",
    "job_id": "4178261641",
    "source": "linkedin",
    "company_name": "Recover নিয়োগ",
    "job_title": "Finance Director",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323487979/",
    "job_id": "4323487979",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Assistant Manager Finance / Executive Finance",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4220877941/",
    "job_id": "4220877941",
    "source": "linkedin",
    "company_name": "For Maheen Accessories Ltd.",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4062673698/",
    "job_id": "4062673698",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Senior Executive/Assistant Manager-Finance & Accounts",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4012207667/",
    "job_id": "4012207667",
    "source": "linkedin",
    "company_name": "For Empreo Developers ...",
    "job_title": "Assistant Manager (Finance & Accounts)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4235806649/",
    "job_id": "4235806649",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Zatiq নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4257143460/",
    "job_id": "4257143460",
    "source": "linkedin",
    "company_name": "For FinSource Limited (Job ID: 1380549)",
    "job_title": "Financial Analyst",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4073724071/",
    "job_id": "4073724071",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Finance Manager (For LifeSpring Consultancy Limited)-Job ID",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370650927/",
    "job_id": "4370650927",
    "source": "linkedin",
    "company_name": "Bangladesh Honda",
    "job_title": "Senior Finance Business Analyst",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295603829/",
    "job_id": "4295603829",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Plant Finance Analyst (For JERA Meghnaghat Power Limited)-Job ID",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3944949051/",
    "job_id": "3944949051",
    "source": "linkedin",
    "company_name": "(For Karupannya Group)",
    "job_title": "Business & Financial Analyst",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356274488/",
    "job_id": "4356274488",
    "source": "linkedin",
    "company_name": "tapmad নিয়োগ",
    "job_title": "Junior Financial Analyst",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4270396117/",
    "job_id": "4270396117",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Junior Financial Analyst (For Odin Outsourcing)-Job ID: 1386249",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4153692489/",
    "job_id": "4153692489",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4315488216/",
    "job_id": "4315488216",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Sr. Executive, Finance (For Kazi Farms Group)-Job ID",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293184159/",
    "job_id": "4293184159",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Financial Analyst (For Staff America)-Job ID: 1402337",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348520395/",
    "job_id": "4348520395",
    "source": "linkedin",
    "company_name": "(For A Renowned MNC)",
    "job_title": "Executive-Accounts & Finance",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4130046645/",
    "job_id": "4130046645",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "BRAC নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3837401987/",
    "job_id": "3837401987",
    "source": "linkedin",
    "company_name": "Optimizely",
    "job_title": "Senior Financial Analyst, FP&A",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358077872/",
    "job_id": "4358077872",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "WeGro Global hiring Financial Planning And Analysis Analyst in ...",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4179316501/",
    "job_id": "4179316501",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ECHOTEX LIMITED নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3942015825/",
    "job_id": "3942015825",
    "source": "linkedin",
    "company_name": "For A Reputed Group of Companies ...",
    "job_title": "Business/Finance Analyst",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4038856695/",
    "job_id": "4038856695",
    "source": "linkedin",
    "company_name": "Optimizely নিয়োগ",
    "job_title": "Financial Analyst",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4107814981/",
    "job_id": "4107814981",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4160750418/",
    "job_id": "4160750418",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4223284668/",
    "job_id": "4223284668",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Officer/Sr. Officer, Cost & Budget- For Danish Foods Limited- Job ID",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348180594/",
    "job_id": "4348180594",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318019508/",
    "job_id": "4318019508",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337910843/",
    "job_id": "4337910843",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337495733/",
    "job_id": "4337495733",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341371800/",
    "job_id": "4341371800",
    "source": "linkedin",
    "company_name": "(For Rocky Textile Mills (Pvt) Ltd)",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4183735397/",
    "job_id": "4183735397",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293074148/",
    "job_id": "4293074148",
    "source": "linkedin",
    "company_name": "SIM Group",
    "job_title": "Internal Auditor",
    "location": "Nārāyanganj, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description We suggest you enter details here. Role Description This is a full-time on-site role for an Internal Auditor located in Nilphāmāri. The Internal Auditor will be responsible for conducting financial audits, preparing detailed audit reports, and analyzing financial data to identify areas of improvement. Other day-to-day tasks include reviewing financial statements and ensuring compliance with regulatory standards. The role also includes communicating findings and recommendations to stakeholders to support decision-making processes. Qualifications Audit Reports and Financial Audits skillsStrong Analytical SkillsFinance knowledgeExcellent Communication skillsStrong attention to detailAbility to work independently and as part of a teamBachelor's degree in Accounting, Finance, or related fieldExperience in the dyeing or manufacturing industry is a plus Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4154050471/",
    "job_id": "4154050471",
    "source": "linkedin",
    "company_name": "(For NAM Jute Mills)-Job ID ...",
    "job_title": "Executive- Internal Audit (CACC must)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3987457912/",
    "job_id": "3987457912",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Executive, Internal Audit (For Popular Pharmaceuticals PLC.)-Job ID",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4228750882/",
    "job_id": "4228750882",
    "source": "linkedin",
    "company_name": "Meghna Group of Industries (MGI)",
    "job_title": "Internal Auditor",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4131552426/",
    "job_id": "4131552426",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "Internal Auditor (For RUPASHI GROUP OF INDUSTRIES.)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4185203486/",
    "job_id": "4185203486",
    "source": "linkedin",
    "company_name": "For Tamzid Real State Company",
    "job_title": "Senior Officer (Internal Audit)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4066062508/",
    "job_id": "4066062508",
    "source": "linkedin",
    "company_name": "US Based External Audit (Night Shift)",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4114380492/",
    "job_id": "4114380492",
    "source": "linkedin",
    "company_name": "(For Next Accessories Ltd ...",
    "job_title": "Executive / Sr. Executive (Internal Audit)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3085459326/",
    "job_id": "3085459326",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "IPE Global Limited hiring Performance Audit International Expert in ...",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348940765/",
    "job_id": "4348940765",
    "source": "linkedin",
    "company_name": "(For Sanvir Bashundhara ...",
    "job_title": "Executive (Internal Audit & Compliance)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330237901/",
    "job_id": "4330237901",
    "source": "linkedin",
    "company_name": "A. Qasem & Co. Chartered Accountants",
    "job_title": "Audit Associate",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3986513065/",
    "job_id": "3986513065",
    "source": "linkedin",
    "company_name": "banglalink",
    "job_title": "Internal Audit Manager (Engineer)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4308742871/",
    "job_id": "4308742871",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Audit (For Syed N Haque & Associates Ltd.)-Job ID: 1413656",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353242589/",
    "job_id": "4353242589",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3765098615/",
    "job_id": "3765098615",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "Assistant/ Deputy Manager, Internal Audit",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4289212948/",
    "job_id": "4289212948",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Audit Unit, ICCD- For SHIMANTO BANK PLC (Job ID:1396969)",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4105135457/",
    "job_id": "4105135457",
    "source": "linkedin",
    "company_name": "Audit & Accounts",
    "job_title": "Officer",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  }
]