[
  {
    "url": "https://www.linkedin.com/jobs/view/4360400453/",
    "job_id": "4360400453",
    "source": "linkedin",
    "company_name": "SFVN - Đầu tư hàng hóa cùng chuyên gia",
    "job_title": "Transaction Accountant",
    "location": "Ho Chi Minh City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367251092/",
    "job_id": "4367251092",
    "source": "linkedin",
    "company_name": "Alphera Marine Services Inc.",
    "job_title": "Accounting Assistant",
    "location": "Metro Manila",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369843792/",
    "job_id": "4369843792",
    "source": "linkedin",
    "company_name": "Mashreq Corporate & Investment Banking Group",
    "job_title": "Head of Treasury, Qatar.Treasury Sales.International Banking Group",
    "location": "Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369424057/",
    "job_id": "4369424057",
    "source": "linkedin",
    "company_name": "KORT Payments",
    "job_title": "Senior Credit Underwriter",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357732157/",
    "job_id": "4357732157",
    "source": "linkedin",
    "company_name": "UAE Accountability Authority",
    "job_title": "رئيس قسم الحسابات",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326662265/",
    "job_id": "4326662265",
    "source": "linkedin",
    "company_name": "Dempsey Resource Management",
    "job_title": "Chief Accountant",
    "location": "Mandaluyong, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353764535/",
    "job_id": "4353764535",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive/ Officer - Compliance - For Jay Jay Mills (Bangladesh) Pvt. Ltd. - Job ID : 1447422",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361196679/",
    "job_id": "4361196679",
    "source": "linkedin",
    "company_name": "Masan Consumer Holdings",
    "job_title": "Compliance Supervisor",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353703314/",
    "job_id": "4353703314",
    "source": "linkedin",
    "company_name": "Qatar Foundation Research and Development",
    "job_title": "Lead Compliance Specialist",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326775535/",
    "job_id": "4326775535",
    "source": "linkedin",
    "company_name": "HR TechX Corp.",
    "job_title": "Compliance Manager",
    "location": "Pasay, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370304512/",
    "job_id": "4370304512",
    "source": "linkedin",
    "company_name": "AFA - Accounting and Financial Advisory",
    "job_title": "Chief Financial Officer -CA(SA) Public Sector",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354001362/",
    "job_id": "4354001362",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Branch Manager (Microcredit Program) - For Patakuri Society - Job ID: 1451221",
    "location": "Habiganj District, Sylhet, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353573604/",
    "job_id": "4353573604",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Commercial Finance Business Partner - International sales & Private label",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The Finance Business Partner is responsible for overseeing and managing the financial operations of the retail channel in UAE. This role involves detailed financial management including D&A management budgeting, forecasting, variance analysis, and supporting commercial decisions to drive revenue growth and cost efficiency.Description: D&A Management:Lead the BDA discussion with the commercial team and drive efficiencies.Trade spend monthly tracker with variance analysis to drive optimizationExamine trade spend claims submitted.Verify supporting documents to ensure accuracy, completeness, and adherence to company policies.Identify discrepancies or inconsistencies in trade spend submissions and seek clarification as needed.Reporting and Analysis:Consolidate and interpret financial results on a monthly and quarterly basis, presenting them to management.Provide detailed reports on variances from the established budget, identifying reasons for these variances.Produce customer and promotional analysis to evaluate the profitability of promotional activities.Strategic Financial Planning:Present a clear outlook for the remaining fiscal year, highlighting full financials and key takeaways with distributor.Work closely with Sales Managers to plan and optimize trade spend and investments at the channel and customer levels.Support and Compliance:Provide financial support to commercial and marketing teams to drive the Revenue Growth agenda.Ensure all promotions have the necessary permissions and comply with regulatory standards before execution.Monitor trade spend by market/category to maintain Gross to Net percentages as per budget. Pricing and Product profitabilityMaintain and review price list to trade to drive pricing opportunities or non complianceNPDs launch support – Full P&L preparation for newly launched productsQualifications, experience & Skills:Bachelor’s degree in Finance, Accounting, or related field.Minimum of 5 years’ experience in financial management, preferably in a similar role.Strong analytical skills and proficiency in financial software.Detail-oriented with a focus on accuracy and precision.Excellent communication and interpersonal skills.Proficient in Microsoft Excel and financial analysis tools.Knowledge of trade spend management systems and ERP software is a plus.Previous experience in trade spend analysis or related financial roles is preferred. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365038966/",
    "job_id": "4365038966",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Finance Manager",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4288405060/",
    "job_id": "4288405060",
    "source": "linkedin",
    "company_name": "FlySafair",
    "job_title": "Graduate Intern",
    "location": "City of Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341802626/",
    "job_id": "4341802626",
    "source": "linkedin",
    "company_name": "Artelia Vietnam",
    "job_title": "Project Assistant",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364300632/",
    "job_id": "4364300632",
    "source": "linkedin",
    "company_name": "Bradbury Group",
    "job_title": "Finance Executive",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job SummaryWe are seeking a detail-oriented and analytical Finance Executive with at least 2 years of experience to support daily financial operations, accounting activities, and reporting functions. The ideal candidate is organized, dependable, and able to work independently in a fast-paced environment.Key ResponsibilitiesHandle day-to-day accounting operations including AP, AR, payment processing, invoicing, and bank reconciliation.Prepare monthly financial reports, statements, and supporting schedules.Ensure accurate and timely closing of monthly and yearly accounts.Maintain proper documentation, filing systems, and compliance with company policies and Malaysian financial regulations.Coordinate with auditors, tax agents, and external partners for statutory requirements.Monitor cash flow, manage petty cash, and update financial records regularly.Support the Finance Manager in preparing financial insights, cost analysis, and variance reports.Identify process improvements and enhance financial controls.RequirementsDiploma or Bachelor’s degree in Accounting, Finance, or related field.Minimum 2 years of experience in finance, accounting, or audit roles.Strong knowledge of accounting principles (MFRS), financial reporting, and Malaysian tax regulations.Proficient in accounting software (e.g., SQL) and Microsoft Excel.Excellent attention to detail, accuracy, and time management.Good communication skills in English and Bahasa Malaysia.Able to work independently with minimal supervision and meet tight deadlines.Familiar with MFRS formatPreferred AttributesStrong analytical and problem-solving skills.Positive attitude and proactive approach.High level of integrity and professionalism.Ability to work collaboratively with cross-functional teams.Benefits and compensation: • Good salary and opportunity to grow• Annual leave• Personal insurance• Transportation allowance• On job training• Career planning and opportunity for advancement or promotion Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369203444/",
    "job_id": "4369203444",
    "source": "linkedin",
    "company_name": "Radisson Hotel Group",
    "job_title": "Income Auditor",
    "location": "Sandton, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359813271/",
    "job_id": "4359813271",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Head of Audit & Monitoring Department - For Society Development Committee (SDC) - Job ID: 1456462",
    "location": "Faridpur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Society Development Committee (SDC) is looking for Head of Audit & Monitoring DepartmentJob Description / ResponsibilityJob Location: SDC Head Office, Faridpur (With frequent field visit at SDC’s Branch & Other Unit Offices)Job Grade Structure: 11Position Reportable TO: Executive DirectorReportable to this Position: Manager/Team Leader / Sr. Officer & Officer Audit & MonitoringAge: 38-55Application deadline AS RequiredAbout UsAt SDC, we believe in transparency, accountability, and sustainable development. As a leading organization in the microfinance and social development sector, we work closely with partners such as PKSF, MRA, government bodies, and international donors. We are committed to fostering a culture of integrity and excellence in everything we do.We are now looking for an experienced, dynamic, and forward-thinking professional to lead our Audit & Monitoring Department. If you are passionate about governance, risk management, and making a real impact, this role is for you.The RoleAs the Head of Audit & Monitoring, you will play a critical role in safeguarding our organizational assets and ensuring compliance across all operations. You will lead the audit function, provide strategic oversight, and work closely with senior management to strengthen internal controls and operational efficiency.You will report to: Executive DirectorYour team will include: Managers, Team Leaders, Senior Officers, and Officers in Audit & Monitoring.What You will DoDevelop and execute annual audit and monitoring plans aligned with organizational strategy. Specifically Microfinance, Others Projects & Various unit System Audit)Evaluate internal controls, risk management systems, and compliance across financial, operational, and project activities.Conduct detailed testing, document findings, and prepares clear, actionable audit reports with suggesting proper solution and necessary further planning and actions.Identify control weaknesses, fraud risks, and areas for process improvement.Present findings and recommendations to management and stakeholders.Monitor the implementation of corrective actions and ensure timely resolution of issues.Ensure adherence to policies of SDC, PKSF, MRA, donors, and government regulations.Facing internal and external queries and provides proper solutions upon consulting with respective management.Work as a focal personal while facing external bodies audit and monitoring like, MRA, PKSF, Donor agencies etc.Mentor and guide junior audit staff, fostering a culture of continuous learning.Employment StatusFullTimeWorkplaceWork at officeEducational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor’s degree in Accounting, Finance, Banking, Business Administration, Statistics, or a related field.Experience RequirementsAt least 10 year(s)The applicants should have experience in the following business area(s):NGOAdditional RequirementsAt least 10 years of experience in auditing, internal control, or risk management, with 5 years in a leadership role as Head of Audit in a PKSF partner organization.Professional Certifications (Preferred):CMEP, CIA, CPA, CISA, CA or similar credentials.Skills & Competencies:Strong technical proficiency in audit software, data analytics, and MS Office.Excellent analytical, problem-solving, and leadership abilities.High integrity and excellent communication skills (written and verbal).Ability to work independently and collaboratively in a team environment.Sound knowledge on Microfinance Operation is highly required.Job LocationFaridpur Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356429986/",
    "job_id": "4356429986",
    "source": "linkedin",
    "company_name": "Genpact",
    "job_title": "Auto Finance - Customer Support",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose - the relentless pursuit of a world that works better for people - we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI. We are inviting applications for the role of Auto Finance – Agent Customer Service 5B – English – On site Johannesburg Reports To: Team Leader Job overview Provide direct support to UK customers handling inbound/outbound calls and emails, ensuring FCA-compliant outcomes, accurate case documentation, and timely resolution. You will contribute to team KPIs, escalate complex cases, and support continuous improvement initiatives. Responsibilities Handle inbound and outbound calls and email correspondence with UK customers professionally and compliantly Validate customer information and supporting evidence to ensure accurate case handling Maintain accurate, detailed records in Salesforce CRM for all interactions Escalate complex, high-risk, or unresolved cases to Senior Agents or Team Leaders Resolve customer queries and complaints within delegated authority, exercising judgment where appropriate Adhere to FCA rules, Treating Customers Fairly (TCF) principles, and internal policies always Participate in Quality Assurance (QA) evaluations, implement feedback, and continuously improve performance Meeting service metrics: call handling times, first contact resolution, email response times, and case closure volumes Support team initiatives, process updates, and new campaigns by adapting to procedural changes quickly Contribute to MI reporting by ensuring data is complete and accurate in Salesforce CRM Identify trends, common issues, or potential compliance risks, and report them to Team Leaders Assist with training refreshers or knowledge sharing sessions for peers Ensure confidentiality and data protection in line with UK regulations Minimum Qualifications / Skills Matric Certificate with English D result or better Experience in customer service, collections, or financial services 2+ Years Knowledge of financial services operations and regulatory environment B2-level English proficiency (spoken and written) Strong written communication skills for email correspondence Comfortable working UK operating hours Preferred Qualifications / Skills Hands-on experience with Salesforce CRM, Genesys, MS Office/Excel Experience in Auto Finance, Redress, Banking Operations, or Collections Understanding of FCA rules and TCF principles Ability to work independently while escalating appropriately Strong interpersonal, problem-solving, and time management skills What can we offer? • Attractive salary and benefits such as Medical Aid, Retirement and risk benefits • Work in a multicultural environment. • Various trainings (technical & soft skills). • Development opportunities in a growing multinational company. Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. Get to know us at www.genpact.com and on X, Facebook, LinkedIn, and YouTube. In case Genpact does not respond to your application within 30 days, please consider it was not successful for the current recruitment process for this role. Furthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a 'starter kit,' paying to apply, or purchasing equipment or training. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353712203/",
    "job_id": "4353712203",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Customer Support Executive - For FAIZA LLC - Job ID: 1449079",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353822056/",
    "job_id": "4353822056",
    "source": "linkedin",
    "company_name": "Spruson & Ferguson",
    "job_title": "Administrator (Renewals)",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4307951603/",
    "job_id": "4307951603",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Analyst-Revenue Management",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369066467/",
    "job_id": "4369066467",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Investment Analyst",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353733765/",
    "job_id": "4353733765",
    "source": "linkedin",
    "company_name": "Macdonald & Company",
    "job_title": "Analyst/Senior Analyst, Investments",
    "location": "Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4332535850/",
    "job_id": "4332535850",
    "source": "linkedin",
    "company_name": "Intervest Software Technologies (Private) Limited",
    "job_title": "IT Disaster Recovery Manager",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About IntervestIntervest is a rapidly growing Global Delivery Hub based in Colombo, Sri Lanka. From our humble beginnings in 2005 supporting Staysure Travel Insurance, we’ve evolved into a dynamic, multi-entity organization delivering tech and shared services across the entire Staysure Group and its affiliated brands.We proudly serve as the exclusive technology and services provider within the broader Howsam Capital ecosystem a portfolio of high-growth ventures spanning InsurTech, TravelTech, Retail, and Logistics.About the RoleThe IT Disaster Recovery (DR) Manager is responsible for developing, implementing, and maintaining the organization’s disaster recovery and business continuity strategies. This role ensures that critical IT systems and infrastructure can be restored quickly and effectively in the event of a disruption, minimizing downtime and data loss.Key Responsibilities:Strategy & PlanningDesign and maintain the IT disaster recovery framework aligned with business continuity plans.Conduct risk assessments and business impact analyses to identify critical systems and dependencies.Collaborate with stakeholders to define recovery time objectives (RTOs) and recovery point objectives (RPOs).Implementation & MaintenanceDevelop and maintain DR policies, procedures, and documentation.Coordinate the implementation of DR solutions across infrastructure, applications, and data.Ensure DR plans are integrated with third-party vendors and cloud services.Testing & ValidationPlan and execute regular DR tests and simulations.Document test results and drive continuous improvement based on findings.Ensure compliance with internal policies and external regulations (e.g., ISO 22301, GDPR).Monitoring & ReportingMonitor DR readiness and report on key metrics to senior leadership.Maintain an inventory of critical IT assets and recovery resources.Provide post-incident analysis and recommendations for improvement.Training & AwarenessConduct training sessions and awareness programs for IT staff and business units.Act as a subject matter expert on DR best practices and emerging technologies.Job RequirementsBachelor’s degree in Computer Science, Information Systems, or related field.5+ years of experience in IT disaster recovery, business continuity, or IT risk management.Strong knowledge of DR technologies (e.g., backup solutions, replication, cloud recovery).Experience with frameworks such as ISO 22301, NIST, or ITIL.Excellent project management and communication skills.Certifications such as CBCP, ITIL, or CISSP are a plus.Desired Skills:Experience with hybrid cloud environments (Azure, AWS, GCP).Familiarity with enterprise architecture and IT service management.Ability to work under pressure and manage multiple priorities.Diversity & InclusionAt Intervest, we’re proud to be an equal opportunity employer. We believe in the power of diverse perspectives and are committed to creating an inclusive environment where everyone can thrive.Want to find out more about our culture and journey?Visit our website: Intervest, technology, people & cultureCareers page: Careers | Intervest Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370506305/",
    "job_id": "4370506305",
    "source": "linkedin",
    "company_name": "bp Launchpad",
    "job_title": "Sr. Finance & Commercial Analyst",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357441010/",
    "job_id": "4357441010",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Senior Accountant",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369330510/",
    "job_id": "4369330510",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Underwriter",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357411034/",
    "job_id": "4357411034",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Financial Analyst",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368568104/",
    "job_id": "4368568104",
    "source": "linkedin",
    "company_name": "Rencana Bijak",
    "job_title": "Financial Planner Opportunities for CFP Holders or Aspiring Candidates (Full-time and Part-time)",
    "location": "Jakarta Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369123090/",
    "job_id": "4369123090",
    "source": "linkedin",
    "company_name": "Segari",
    "job_title": "Account Receivable Staff",
    "location": "Kota Tangerang Selatan, Banten, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365271640/",
    "job_id": "4365271640",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Manager - Funds and Corporate Services",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358335489/",
    "job_id": "4358335489",
    "source": "linkedin",
    "company_name": "Pump & Abrasion Technologies",
    "job_title": "Accountant - Cape Town based",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369232521/",
    "job_id": "4369232521",
    "source": "linkedin",
    "company_name": "Clicks Group",
    "job_title": "Accountant CA (SA)",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Listing reference: click_023509Listing status: OnlineApply by: 10 February 2026Position SummaryIndustry: Wholesale & Retail TradeJob category: Financial AccountingLocation: Cape TownContract: PermanentEE position: YesIntroductionTo provide accurate, timeous and relevant financial information to facilitate decision-making. To ensure that financial transactions are controlled and processed timeously.Job DescriptionJOB OBJECTIVES Assist with the budgeting and forecasting process from inception to completion including:Ø Prepare and communicate the timelines and instructions.Ø Ensure the budgeting tool is ready for use and users are trained accordingly.Ø Actively manage the planning and submissions.Ø Consolidate the business units to produce a consolidated group budget.Ø Compilation of the Group 3 year and detailed budget reporting packs.Ø Ensure all deadlines are met. Assist with the fixed asset process from initiation to reporting, including capex processes and management of the fixed asset register. Assist with lease accounting (IFRS 16) for the group, including the treatment of transactions, reconciliation of accounts and financial statement disclosure. Assist with the group’s insurance portfolio, including the renewal process, claims and financial reporting. Review of balance sheet recons prepared by the business teams and assisting with review of internal financial controls. Assist with monthly, interim and year end internal and external reporting. Assist with ad-hoc reporting and analysis. Create opportunities for improved team work. Identify and implement improvements within the finance control environment. Assist in delivering long term objectives and goals. Provide coaching and mentorship for future development.Minimum RequirementsEDUCATION CA (SA) (essential) B.Com Honours with accounting (essential)Experience 0-2 years post article experience within a corporate environment. 1 year financial reporting experience. SAP experience. SAP EPM/SAC experience. Commercial acumen and experience within a finance function.Knowledge And Skills Financial reporting and statutory requirements Sound IFRS knowledge Financial management Supervision and performance management Strategic thinking and problem solving Organisational and planning ability Conceptual and problem solving skills Administration Computer literacy on MS OfficeCOMPETENCIES Leading and deciding Writing and reporting Presenting and communicating information Analysing Planning and organising Adapting Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369870280/",
    "job_id": "4369870280",
    "source": "linkedin",
    "company_name": "Pragmatike",
    "job_title": "Group Financial Controller",
    "location": "Bucharest, Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Role: Group Financial ControllerLocation: Fully remote (EMEA timezone)Start date: ASAPLanguage: Fluent EnglishIndustry: Cloud Computing / AI / European Deep-Tech SaaSAbout The CompanyPragmatike is recruiting on behalf of a European deep-tech company building a sovereign, energy-efficient cloud platform for modern AI and high-performance workloads. The company operates a distributed, automated infrastructure and is scaling rapidly in a multi-entity, international environment.Building an AI-native finance organization is a strategic priority.About The RoleReporting directly to the CFO, the Group Financial Controller will own group accounting, reporting, consolidation and controls across multiple legal entities. This is a senior, hands-on role for a finance leader capable of structuring, scaling and automating finance operations in a deep-tech context.Strong, proven experience leveraging AI in accounting operations is mandatory.The role is not about maintaining legacy processes, but about designing an AI-first accounting function.Key ResponsibilitiesOwn monthly, quarterly and annual group close and consolidation Deliver accurate management accounts, board and investor reporting Ensure IFRS / local GAAP compliance across jurisdictions Define and enforce group accounting policies and internal controls Lead and optimize NetSuite ERP across the group (NetSuite is a must-have) Drive automation and AI adoption (reconciliations, anomaly detection, journal automation, close acceleration) Manage audits, statutory compliance and intercompany processes Partner closely with the CFO on strategic initiatives and growth Required Experience & Profile8–12+ years in accounting / financial control Strong experience in multi-entity, international environments Background in SaaS, cloud, infrastructure or deep-tech companies NetSuite expert (+++) Mandatory hands-on experience implementing AI tools in accounting workflows Strong IFRS / GAAP knowledge and consolidation expertise Qualified accountant (CPA, ACA, ACCA or equivalent) Comfortable building finance infrastructure from the ground up What We OfferKey leadership role in a European AI & cloud deep-tech company High autonomy and ownership Opportunity to build a best-in-class, AI-native finance function Fully remote setup (EMEA) with limited travel (:10–15%) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4308259180/",
    "job_id": "4308259180",
    "source": "linkedin",
    "company_name": "Robertson & Company Ltd.",
    "job_title": "Senior Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366871464/",
    "job_id": "4366871464",
    "source": "linkedin",
    "company_name": "Clarity Recruitment",
    "job_title": "Director of Finance And Administration",
    "location": "York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4210231898/",
    "job_id": "4210231898",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366066623/",
    "job_id": "4366066623",
    "source": "linkedin",
    "company_name": "Borderless AI",
    "job_title": "Payroll Specialist",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Role: Payroll Operations SpecialistLocation: Toronto, OntarioCompanyWe are on a mission to transform HR for everyone. Borderless AI builds AI agents for HR departments. The company leverages the power of generative AI to automate and accelerate routine tasks for HR teams such as employee onboarding, payroll, and paying international team members. Borderless AI’s AI agents allow users to access the world’s HR knowledge and execute tasks such as AI-powered employment agreement generation. The company is headquartered in Toronto, Canada and is backed with over $30M in funding by investors like Susquehanna, Aglaé Ventures, and the co-founders of Cohere. For more information, go to: https://www.hireborderless.com/.With the advancements in AI agents, technology companies like Borderless AI are turning labour into software. That means the addressable market is not the software market, but the services market measured in the trillions of dollars. We have a world-class suite of seasoned executives from some of tech's most prestigious companies, and are continuing to scale our team very quickly. Borderless AI has found product-market fit and we’re excited by our mission to build tooling for the future of HR. Interested in joining our customer obsessed, hardworking, and fast-moving team? Check out the opportunity below.The Opportunity: We’re looking for a Payroll Operations Specialist to help us run our payroll smoothly as we continue to scale. You’ll work hands-on with internal teams and customers to ensure accurate, timely, and compliant payroll processing globally. In countries where we already operate, your mission is to level up how we work. You’ll help build a scalable and resilient payroll process that continues to be best in class in our industry. This role is ideal for someone who enjoys rolling up their sleeves, bringing structure to complex operations, and making our business work better every week.Role and Responsibilities Process payroll accurately and on time for employees and contractors globallyCoordinate with customers to ensure payroll inputs, approvals, and deadlines are metReview and validate payroll data including hours, salaries, bonuses, deductions, and benefitsInvestigate and resolve payroll discrepancies, in partnership with internal Operations and Engineering teams, our customers, and our payroll providersEnsure compliance with local payroll, tax, and employment regulations, keeping up-to-date with any compliance changesMaintain accurate payroll records, reports, and documentationPartner with Customer Success and Product on payroll-related workflow improvementsSupport payroll audits, reconciliations, month-end, and year-end payroll activitiesGreat candidates will have:3+ years of experience in payroll operations Experience with payroll systems and tools (experience with multi-country systems is a plus!)Strong attention to detail and the ability to manage sensitive informationWorking knowledge of payroll compliance, taxes, and statutory requirementsExceptional organizational and communication skillsA strong sense of ownership — you care deeply about the quality and impact of your workAbout the Borderless AI team:We're an early stage company and we love to collaborate in person 5 days a week in our Toronto HQ.We offer a healthy benefits & perks package, including free lunch everyday.Customers are the heart of our business, we're obsessed with our customers, and that drives the bulk of our decisions.Big challenges don’t scare us. We’re solving global problems that need creativity, technology, and determination.We'll grant you a lot of autonomy and trust, and back it up with meaningful empowerment and support.We appreciate your interest and application. Only those applicants under consideration will be contacted.﻿Borderless AI is an Equal Opportunity Employer. Employment decisions are based on merit and business needs and are not influenced by race, ancestry, place of origin, colour, ethnic origin, citizenship, creed, sex, sexual orientation, gender identity or expression, age, marital status, family status, disability, or any other characteristic protected under federal or provincial law.Reasonable accommodation is available for qualified individuals with disabilities, upon request.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370557538/",
    "job_id": "4370557538",
    "source": "linkedin",
    "company_name": "AIP Connect",
    "job_title": "Payroll Specialist",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Please note: This role is onsite 5 days a week in office, in Toronto.This is a highly trusted role for someone who enjoys ownership, accuracy, and collaboration supporting the people who make meaningful community work possible every day. Our client is a non-profit organization where they are keen to find a Payroll Specialized with aligned values in their mission and their community.The Payroll Specialist is an integral part of our client's finance team, managing semi-monthly payroll for 400+ employees. You’ll work closely with HR and business unit leaders to ensure a seamless payroll experience from onboarding to year-end.Payroll Operations:Own and process two semi-monthly payrolls, ensuring timely and accurate payment for all employees.Payroll includes full-time, part-time, and seasonal staff.Manage payroll updates including promotions, salary increases, terminations, and incentive compensation.Review and approve part-time timesheets for accuracy and authorization.Prepare payroll reconciliations, registers, and required reports.Employee Support & Onboarding:Coordinate with departments to collect and verify new-hire documentation.Set up new employees in payroll and HR systems and manage onboarding access and communications.Serve as the primary point of contact for payroll-related inquiries, including employment confirmation letters and system support.Records, Compliance, Admin & Reporting:Maintain secure and confidential digital personnel files and lead the digitization of legacy paper records.Process Records of Employment (ROEs).Review and track employee leaves (vacation, sick, ESA-approved, etc)Support audits and year-end activities, including T4 preparation and distribution.Produce lists and reports as required.Contribute to continuous improvement of payroll and HR administrative processes.The experience needed for this role: 3+ years of payroll experience, ideally in a large, complex organization (400+ employees).Payroll or accounting certification/diploma (completed or in progress).Experience working with large payroll databases. Hands-on experience with Ceridian Dayforce Payroll (Dayforce HR Onboarding experience is a strong asset).Experience with union payroll an asset. Strong HR administrative experience is an asset. Exceptional attention to detail, organization, and time management skills.Ability to work autonomously while managing multiple priorities and deadlines.Excellent interpersonal and communication skills.The salary range for this role is: $55,000-$60,000 plus benefits and otherperks.This posting is for an existing vacancy.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369549022/",
    "job_id": "4369549022",
    "source": "linkedin",
    "company_name": "Clifton Blake",
    "job_title": "Accounts Payable Coordinator",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357361211/",
    "job_id": "4357361211",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounting Intern - For Taxsense Limited - Job ID: 1455631",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Taxsense Limited is looking for Accounting InternJob Description / ResponsibilityAssist in maintaining accounting records for multiple clientsSupport bookkeeping, data entry, and ledger maintenanceHelp prepare invoices, bills, and expense records for clientsAssist with bank reconciliations and account reviewsOrganize and maintain client financial documentsSupport the team in monthly reporting and compliance tasksEducational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA) in FinanceSkills Required: Microsoft ExcelJob LocationAnywhere in BangladeshSalaryTk. 8000 - 10000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4008382802/",
    "job_id": "4008382802",
    "source": "linkedin",
    "company_name": "For Electra International (Job ID : 1281860)",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361426756/",
    "job_id": "4361426756",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager / Manager - Credit & Recovery - For Fareast Finance & Investment Limited - Job ID: 1457205",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4015112351/",
    "job_id": "4015112351",
    "source": "linkedin",
    "company_name": "Noor Staffing Group নিয়োগ",
    "job_title": "Accounts Payable Analyst",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4328465012/",
    "job_id": "4328465012",
    "source": "linkedin",
    "company_name": "Accounts Payable",
    "job_title": "Executive / Supervisor",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4299040306/",
    "job_id": "4299040306",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Dahl Consulting hiring Accounts Receivable",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4007761656/",
    "job_id": "4007761656",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "CG Foods (Bangladesh) Limited নিয়োগ",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357011627/",
    "job_id": "4357011627",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accountant - For Ultima Caps & Headwears Ltd. - Job ID : 1454429",
    "location": "Turag Thana, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368183958/",
    "job_id": "4368183958",
    "source": "linkedin",
    "company_name": "Xanadu",
    "job_title": "AP Staff Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365569816/",
    "job_id": "4365569816",
    "source": "linkedin",
    "company_name": "Zulu Alpha Kilo",
    "job_title": "Account Executive",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369215115/",
    "job_id": "4369215115",
    "source": "linkedin",
    "company_name": "Premier Services and Recruitment",
    "job_title": "SAP Deputy Director",
    "location": "Giza, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4288776859/",
    "job_id": "4288776859",
    "source": "linkedin",
    "company_name": "Dkhoon Emirates",
    "job_title": "Senior SAP Business One",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360390819/",
    "job_id": "4360390819",
    "source": "linkedin",
    "company_name": "Robinsons Land Corporation",
    "job_title": "IT Business Application Analyst - SAP MM",
    "location": "Pasig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370150182/",
    "job_id": "4370150182",
    "source": "linkedin",
    "company_name": "JobsMedia.io",
    "job_title": "Personal Lines Insurance Account Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353743130/",
    "job_id": "4353743130",
    "source": "linkedin",
    "company_name": "National Bank of Canada",
    "job_title": "Directeur associé solutions de financement",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357508085/",
    "job_id": "4357508085",
    "source": "linkedin",
    "company_name": "UAE Accountability Authority",
    "job_title": "نائب مدير إدارة استشراف المستقبل",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357587335/",
    "job_id": "4357587335",
    "source": "linkedin",
    "company_name": "UAE Accountability Authority",
    "job_title": "اخصائي اول شؤون المنظمات",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "الهدف الوظيفيتخطيط وتنفيذ الفعاليات والمناسبات الخاصة بكبار المسؤولين، بما في ذلك الوفود الأجنبية والدبلوماسيين وكبار مسؤولي جهاز الإمارات للمحاسبة، بما يساهم في دعم الأهداف الاستراتيجية العامة للجهاز.المسؤوليات التشغيليةإعداد الخطط الاستراتيجية والتشغيلية السنوية للإدارة، بما يشمل مؤشرات الأداء الرئيسية والمشاريع والمبادرات والأنشطة وسجلات المخاطرالمساهمة في إعداد ومراجعة وتحديث اللوائح والسياسات المتعلقة بالوحدة التنظيمية، بالتنسيق مع الإدارات المعنيةإعداد الميزانية المالية وخطط المشتريات الخاصة بالإدارة، ومتابعة المصروفات بالتنسيق مع الجهات المعنية، لضمان تلبية احتياجات الوحدات المختلفة ودعم تحقيق أهداف واستراتيجية الهيئةمتابعة تنفيذ المشاريع الاستراتيجية والتشغيلية وفق الخطط المعتمدة، وبالتعاون مع الوحدات التنظيمية ذات العلاقةمتابعة تنفيذ عقود الخدمات المرتبطة بمهام وصلاحيات ونطاق عمل الإدارةتنفيذ أي مهام أو أنشطة أخرى تُكلّف بها من قبل القيادةالكفاءات الفنيةمراجعة وتطوير وتنفيذ السياسات والإجراءاتتطوير ومراجعة وتنفيذ السياسات والإجراءات بما يضمن توافقها مع الأهداف التنظيمية والمتطلبات القانونية وأفضل الممارسات في مجال عمل الإدارةالتخطيط الاستراتيجي وإدارة الأداءتطوير الخطط الاستراتيجية والتشغيلية، وتحديد مؤشرات الأداء الرئيسية، ومتابعة التنفيذ وتقييم النتائج لضمان مواءمتها مع الأهداف المؤسسية والاستخدام الأمثل للمواردالتنسيق والإشراف متعدد الوظائفالتنسيق مع أصحاب المصلحة الداخليين والخارجيين لضمان اتساق المشاريع والمبادرات والعمليات مع الاستراتيجيات المؤسسية الشاملة، بما يحقق التعاون والكفاءة وتسليم النتائج في الوقت المحددإعداد الميزانية والمشتريات وتحسين المواردإعداد وإدارة ميزانية الإدارة وخطط المشتريات وتخصيص الموارد لدعم العمليات على مستوى القسم، وضمان تحقيق الأولويات الاستراتيجية بكفاءة وفعالية من حيث التكلفةالكفاءات الأساسيةالالتزام القدرة على إظهار الموثوقية من خلال الحضور المنتظم والانضباط والتفاعل والمسؤولية والالتزام بالمهام والتطوير المهنيالتفاؤل القدرة على الحفاظ على موقف إيجابي عند مواجهة التحديات وإظهار المرونة وتشجيع الآخرين على تبني نظرة بنّاءةالاحترام معاملة الآخرين بكرامة وتقدير الآراء المختلفة والحفاظ على المهنية والأدب في جميع التفاعلاتالأخلاق الالتزام بقيم ومبادئ المنظمة وإظهار الصدق والنزاهة والشفافية في القرارات والأفعالالكفاءات السلوكيةالتعاون العمل بفعالية مع الآخرين نحو أهداف مشتركة وتعزيز بيئة تعاونيةالمرونة والتكيف القدرة على التكيف مع الظروف الجديدة والاستجابة للتغيرات بموقف إيجابيالتحليل تقييم المواقف المعقدة وتحديد الأنماط واستخدام المنطق لتطوير حلول فعّالةالاستباقية اتخاذ المبادرة والتنبؤ بالتحديات أو الفرص والعمل على معالجتها مسبقًاالمسؤوليات العامةأداء المسؤوليات بما يعكس المؤهلات العلمية والتخصصات ومتطلبات الإنتاجيةضمان الالتزام الدائم بالسياسات والإجراءات ودليل السلوك الوظيفيتعزيز العمل بروح الفريق والتعاون والالتزام أثناء تنفيذ المهامضمان أمن وسرية وتصنيف البيانات وفق سياسات المنظمةالحفاظ على الملفات والسجلات والوثائق وأرشفتها وفق المعايير المعتمدةالالتزام بمعايير الصحة والسلامة المهنية وتعزيز بيئة عمل آمنةدعم أي تغييرات تنظيمية من خلال الاستخدام الأمثل للموارددعم مبادرات إدارة التغيير وفق المعايير المؤسسيةضمان تنفيذ المخرجات بدقة وفي الوقت المحدد ووفقًا للمعاييرتنفيذ المهام باستقلالية ما لم تتطلب تفويضًا رسميًاتنفيذ المهام الأخرى التي تحددها القيادةالمتطلبات والمؤهلاتالمؤهلات الأكاديمية درجة البكالوريوس في العلاقات الدولية أو تخصص ذي صلةالخبرة المهنية4 – 6 سنواتالكفاءة اللغويةإتقان اللغتين العربية والإنجليزية Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370142434/",
    "job_id": "4370142434",
    "source": "linkedin",
    "company_name": "JobsMedia.io",
    "job_title": "Assistant(e) technique – Support administratif (100% télétravail)",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353008768/",
    "job_id": "4353008768",
    "source": "linkedin",
    "company_name": "Object1.uae",
    "job_title": "Chief Financial Officer",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370116160/",
    "job_id": "4370116160",
    "source": "linkedin",
    "company_name": "Signature Cosmetics",
    "job_title": "Finance Manager Head Office - Edenvale",
    "location": "Edenvale, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366121345/",
    "job_id": "4366121345",
    "source": "linkedin",
    "company_name": "Ayedh Dejem Group",
    "job_title": "Vice President of Investment",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342608735/",
    "job_id": "4342608735",
    "source": "linkedin",
    "company_name": "Love, Bonito",
    "job_title": "Finance Executive - GL",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356150881/",
    "job_id": "4356150881",
    "source": "linkedin",
    "company_name": "BAYEGAN",
    "job_title": "Senior Compliance Officer",
    "location": "Pendik, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364360723/",
    "job_id": "4364360723",
    "source": "linkedin",
    "company_name": "TMF Group",
    "job_title": "O2C Manager - Billing (APAC)",
    "location": "WP. Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351647367/",
    "job_id": "4351647367",
    "source": "linkedin",
    "company_name": "KUWAIT JOBS HERE",
    "job_title": "HR PAYROLL OFFICER",
    "location": "Kuwait City, Al Asimah, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360548981/",
    "job_id": "4360548981",
    "source": "linkedin",
    "company_name": "CAREER141",
    "job_title": "Personal Assistant to Director",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368049814/",
    "job_id": "4368049814",
    "source": "linkedin",
    "company_name": "KUWAIT JOBS HERE",
    "job_title": "Senior Accountant (Cost Accounting)",
    "location": "Jahra, Jahra, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Accountant Job Id :100183483×Please enter details to report jobName*Email*Reason to reportDescriptionPosition Title: Senior Accountant (Cost Accounting Responsibilities)Department: Finance & AccountingReports To: Financial ManagerRole Summary-The Senior Accountant (Cost Accounting Responsibilities) is responsible for monitoring, analyzing, and controlling costs related to the company's manufacturing, maintenance, service projects, and spare parts sales. The role involves preparing financial reports, reconciling accounts, managing cost structures, and ensuring accurate cost allocation for improved financial performance. Additionally, the position includes supporting cash flow forecasting for new projects, supporting budgeting efforts, and ensuring compliance with financial policies and regulations.Key ResponsibilitiesCost Accounting & Financial Analysis-Supporting Cash Flow Management & Financial Planning-Accounts Payable & Supplier Reconciliation-Budgeting & Reporting-Financial Audits & Compliance-Required Qualifications, Skills, And Competencies- Bachelor’s degree in Accounting, Finance, or a related field. 5+ years of experience in cost accounting, financial analysis, or a related role. Strong knowledge of manufacturing, maintenance, and project-based cost accounting. Proficiency in ERP systems, financial modeling, and cost analysis tools. Excellent analytical, problem-solving, and attention-to-detail skills.To ApplyPlease send your CV and cover letter to hr.officer@gulfcenter.co or 60736821Key Responsibilities Costing & Budget Control Prepare job / project cost sheets for fabrication, installation, and maintenance works Monitor actual cost vs budgeted cost for projects and production Identify cost overruns and suggest cost-saving measures Material & Inventory Cost Control Track raw materials, spare parts, consumables, and tools Coordinate with procurement & store for material costing Verify material issues, returns, and wastage Conduct inventory valuation and stock audits Labor & Overhead Costing Calculate direct labor cost (man-hours, overtime, productivity) Allocate factory overheads (power, depreciation, maintenance, utilities) Analyze machine hour rates and production efficiency Job / Project Costing Maintain job-wise costing for mechanical projects Prepare cost reports for completed and ongoing jobs Support billing & progress invoicing with cost data Financial Reporting & Analysis Prepare monthly cost reports, variance analysis, and MIS Assist in profitability analysis by project or department Support management decision-making with cost insightsBasic DetailsLocation : Jahra , KuwaitQualificationPosted : 6 days agoJob Type : Full-TimeCompany : Kuwait JobsContact InfoMobile : +965 60736821Alternate Mobile : Not-MentionedEmail : Not-Mentioned Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360522446/",
    "job_id": "4360522446",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Company Secretary (For Islamic Finance and Investment PLC.)-Job ID: 1456563",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353773660/",
    "job_id": "4353773660",
    "source": "linkedin",
    "company_name": "Moomoo SG",
    "job_title": "Investment Counsellor, Private Wealth",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354203928/",
    "job_id": "4354203928",
    "source": "linkedin",
    "company_name": "SPEEDWELL Development",
    "job_title": "Financial Controller",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361704744/",
    "job_id": "4361704744",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Financial Controller",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359682007/",
    "job_id": "4359682007",
    "source": "linkedin",
    "company_name": "bp Launchpad",
    "job_title": "Planning & Performance SME",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360890459/",
    "job_id": "4360890459",
    "source": "linkedin",
    "company_name": "Royal Lestari Utama",
    "job_title": "Internal Controller",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324905974/",
    "job_id": "4324905974",
    "source": "linkedin",
    "company_name": "Triputra Visi Energi",
    "job_title": "Accounting Supervisor",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4289786474/",
    "job_id": "4289786474",
    "source": "linkedin",
    "company_name": "Sunday",
    "job_title": "Unit Head of Finance and Credit Control",
    "location": "Jakarta Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357351036/",
    "job_id": "4357351036",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Junior Accountant",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322533748/",
    "job_id": "4322533748",
    "source": "linkedin",
    "company_name": "Akulaku Indonesia",
    "job_title": "Senior Tax Specialist",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369325531/",
    "job_id": "4369325531",
    "source": "linkedin",
    "company_name": "wherewework Magyarország",
    "job_title": "Credit Risk Manager",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360542517/",
    "job_id": "4360542517",
    "source": "linkedin",
    "company_name": "Clicks Group",
    "job_title": "Finance and Risk Manager – Montague Garden",
    "location": "City of Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "PurposeTo improve the profitability of the distribution centre by managing the financial, and risk management activities, ensuring adherence to financial and budget requirementsObjectivesTo co-ordinate and plan the distribution centre’s annual budget as well as forecasts within the agreed business objectives to measure the DC’s annual financial performanceTo compile the distribution centre monthly financial statements and business review reports, clearly indicating deviations to targets and to investigate appropriate actions required to remedy these deviationsTo ensure compliance to financial policies and procedures, thereby ensuring compliance with internal controls and reducing risk within the distribution centre together with satisfying the internal and external auditors recommendationsEnsure that the financial viability of projects within the distribution centre is aligned to business objectives by ensuring the return on investment for capex is achievedTo develop the understanding around financial decision making as well as understanding financial statements to ensure that management can make sound business decisionsTo manage the administrative functions, including export documentation within the distribution centre, ensuring compliance with legislation and business policies and proceduresTo manage the Central Audit Process (CAP) to ensure that stores are compensated adequately for picking inaccuracies and to determine the reason for inaccuracies in order to recommend improvementsTo take responsibility for and appropriately manage the staff compliment by empowering, developing and ensuring performance and delivery of targetsThe management of the outsourced facilities management business partner, to ensure adherence to service level agreement thereby achieving best value for the distribution centreDrive financial performance by identifying cost-saving opportunities and operational efficiencies across labour, transport, maintenance, utilities, and security.Oversee the implementation and monitoring of risk mitigation controls across safety, security, and compliance areas, ensuring adherence to internal risk frameworks.Minimum requirementsJob KnowledgeEssentialStrong understanding of logistics and distribution operations.Sound knowledge of accounting principles, financial controls, and auditing standards.Experience in warehouse cost management, systems, and operational processes.DesirableKnowledge of warehouse procedures (receiving, put-away, replenishment, picking, and dispatch).Job Related SkillsAdvanced Excel and financial modelling skills.Strong analytical and problem-solving ability.Excellent written and verbal communication.Strong planning, organisation, and presentation skills.People management and team development capability.Negotiation and influencing skills.Job ExperienceMinimum 3–5 years in a finance role within an FMCG or logistics environment.At least 1 year of staff management experience.3 years of auditing or internal control experience.Demonstrated success in financial forecasting, risk assessment, and cost optimization.EducationEssential: BCom in Finance, Accounting, or Management Accounting.Desirable: CIMA, CA(SA), SAIPA, or equivalent professional qualification.Job related competenciesDeciding and Initiating ActionLeading and SupervisingPersuading and InfluencingPresenting and Communicating InformationWriting and ReportingApplying Expertise and TechnologyAnalysingPlanning and OrganisingCoping with Pressures and SetbacksEntrepreneurial and Commercial Thinking Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370716083/",
    "job_id": "4370716083",
    "source": "linkedin",
    "company_name": "Heartwood Financial Group",
    "job_title": "Senior Financial Analyst, FP&A",
    "location": "North York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367283439/",
    "job_id": "4367283439",
    "source": "linkedin",
    "company_name": "Vaco by Highspring",
    "job_title": "Senior Financial Analyst - 6 month contract",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367291187/",
    "job_id": "4367291187",
    "source": "linkedin",
    "company_name": "Vaco by Highspring",
    "job_title": "Finance Manager (6 month contract)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353813217/",
    "job_id": "4353813217",
    "source": "linkedin",
    "company_name": "National Bank of Canada",
    "job_title": "Associate Manager Financing Solutions",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "A career as Manager financing solutions in the Commercial & Wealth management 1859 team means working closely with the commercial account managers and several other internal and external partners as a credit expert. This job allows you to have a positive impact on your colleagues and customers thanks to your knowledge on commercial financing.Your JobPerform high-quality credit analyses in accordance with the standards established by the Credit Centre, and make recommendationsStructure credit applications (board sheet structuring) by mitigating risks and developing financing scenarios that meet client needs and match the Bank's risk criteriaParticipate in determining client financing needs in collaboration with the Commercial Account ManagerNegotiate credit terms and conditions with the Credit Risk Management as needed and confirm the availability of financing for the Commercial Account ManagerObtain comments from the Account Managers on the preliminary versions of credit applications, adjust them as needed, then present them to the RVP before they are forwarded to the Credit Risk Management to ensure they meet the Bank's requirements for overall client profitabilityProduce documents and update client files in collaboration with account representatives and the Credit Risk Management to ensure credit applications are processed efficientlyAct as a resource person for your team in handling credit matters and assist, as needed, in addressing team members' skills development in this area.Identify the risks inherent to sector activitiesYour TeamWithin the Commercial & Wealth Management 1859 sector, you are part of a team of professionals supporting commercial clients. In addition, you are surrounded by an entire ecosystem of experts to help you offer the best possible solutions to customers.Reporting to the Managing Director, the selected candidate have to be based in the province of Quebec. You have the flexibility to work from home and/or go to the office, but you will also have to travel occasionally for client and team meetings.Our learning-by-doing training programs enable you to master your job. Access to colleagues with different expertise, experience and profiles will enrich your development in every way.Basic requirements A bachelor’s degree in a related field and 6 years of relevant experience, OR a master’s degree in a related field and 4 years of relevant experience, OR an undergraduate diploma from the National Bank University Program and 8 years of relevant experienceNegotiation experienceExperience in commercial creditExperience analyzing financial statementsExcellent interpersonal and communication skills with an ability to effectively collaborate with partners and form well-reasoned recommendationsYour benefits In addition to competitive compensation, upon hiring you’ll be eligible for a wide range of flexible benefits to help promote your wellbeing and that of your family. * Health and wellness program, including many options * Flexible group insurance * Generous pension plan * Employee Share Ownership Plan * Employee and Family Assistance Program * Preferential banking services * Opportunities to get involved in community initiatives * Telemedicine service * Virtual sleep clinic These are a few of the benefits available to you. We have an offer that keeps up with trends as well as your needs and those of your family. Our dynamic work environments and cutting-edge collaboration tools foster a positive employee experience. We actively listen to employees’ ideas. Whether through our surveys or programs, regular feedback and ongoing communication is encouraged. We're putting people first We're a bank on a human scale that stands out for its courage, entrepreneurial culture, and passion for people. Our mission is to have a positive impact on peoples' lives. Our core values of partnership, agility, and empowerment inspire us, and inclusivity is central to our commitments. We offer a barrier-free workplace that is accessible to all employees. We want our recruitment process to be fully accessible. If you require accommodation, feel free to let us know during your first conversations with us. We welcome all candidates! What can you bring to our team? Come live your ambitions with us!Additional required languages: French Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362257271/",
    "job_id": "4362257271",
    "source": "linkedin",
    "company_name": "Eaton",
    "job_title": "Gestionnaire Qualité / Quality Manager",
    "location": "Saint-Lambert-de-Lévis, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353845019/",
    "job_id": "4353845019",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Sales Executive (For SPDL-Sarker Properties and Developments Ltd.) - Job ID : 1451107",
    "location": "Uttara, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371618227/",
    "job_id": "4371618227",
    "source": "linkedin",
    "company_name": "CIMA+",
    "job_title": "Administrative Assistant",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Welcome to a place where people are at the heart of everything we do. Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects. We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you. When you join CIMA+, we welcome you to a place that you can call home.Job DescriptionThe Administrative Assistant is responsible for various administrative functions and will support Project Managers in project coordination. This position is available in the Sherbrooke, Laval, Montréal, Longueuil, or Québec City offices. The selected candidate may work in a hybrid mode.Primary ResponsibilitiesProvide administrative support to project and engineering teams for the preparation, review, and formatting of presentations, spreadsheets, reports, service proposals, contracts, and other documents in French and English, as requiredCarry out various tasks for project teams (document management, filing, archiving, standards management, purchase orders, invoicing, change order tracking, project and proposal setup, contract and deliverable tracking, procurement, conference registrations, training registrations, vehicle/accommodation/flight bookings, etc.) while complying with the firm’s quality assurance proceduresPrepare and review correspondence and other types of documents using the appropriate format. Occasionally coordinate team activitiesDemonstrate versatility and a commitment to continuous learningEstablish and maintain effective working relationships with office colleagues and various clientsQualificationsDEC, AEC, or DEP in administration, office technology, or another relevant field. Minimum of five (5) years of significant experience as an Administrative AssistantExperience in the consulting services industryExperience with ERP systems (such as Microsoft Dynamics)Strong attention to aesthetics in communications, high standards of work quality, and attention to detailBilingualism: Proficiency in both English and French (written and spoken) is an essential requirement for this administrative role, enabling effective communication with national stakeholders such as clients, suppliers, and internal teamsProficiency in Microsoft 365, strong team spirit, ability to manage multiple files simultaneously, and strong priority and deadline management skillsKnowledge or proficiency in practical and relevant artificial intelligence tools for document drafting and analysisFor more information, please contact Ibrahima Amadou LYAt CIMA+, we value diversity of talent and perspective. You think you can add value, but don't meet all the job requirements? We invite you to apply, because everyone has something unique to offer. The outstanding talents that choose to join us at CIMA+ soon realize that we go all out to encourage them to grow. We look forward to hearing how you can contribute to our success. Why choose CIMA+? Because we offer you: Comprehensive Group Benefits available from day one for all permanent employees working at least 20 hours per week Employee and Family Assistance Program Retirement Savings Plan (RRSP) with up to 4% employer contribution As an employee-owned company, an annual opportunity to purchase shares for all employees Flexible work schedule in a hybrid work mode Work/Life balance policy across Canada 3-5 weeks of vacation, based on years of relevant experience Tailored training to improve your existing skillsAdditional InformationAt CIMA+, we recognize the richness and diversity of each individual’s experience. Compensation for this role is therefore based on the candidate’s experience, skills, and qualifications, while maintaining internal equity. The level and associated salary may vary depending on the candidate’s profile.CIMA+ uses an applicant tracking system that includes an automated match score feature. However, this score is not used to screen, assess, or select applicants. All hiring decisions are made through human review.Ethics and integrity are fundamental values at CIMA+. That is why we are committed to ensuring equal access to resources and opportunities for candidates, regardless of their identity (race, ethnicity, colour, religion, gender, age, disability, sexual orientation, gender identity or expression, socio-economic status or background, etc.).​In keeping with the principles of employment equity, we encourage all applications, including, but not limited to, those from women, Indigenous people, people with disabilities and visible minorities. We also encourage candidates to complete the self-identification form when applying for employment.​Accommodations are available on request. Your Business Partner will process your request.Find out about The CIMA+ advantage - CIMA+.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372974119/",
    "job_id": "4372974119",
    "source": "linkedin",
    "company_name": "BeachHead",
    "job_title": "Treasury Finance Analyst – Cash Management & Intraday Liquidity",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Are You Skilled in Cash Management and Intraday Liquidity? Apply Now!Working with one of our top financial clients, this role calls for a Treasury Finance Analyst – Cash Management & Intraday Liquidity. This position involves supporting the day-to-day operations and strategic management of cash flows, collateral, and liquidity positions within a leading treasury department. The role provides an excellent opportunity to collaborate with internal and external stakeholders, optimize cash processes, and contribute to operational excellence in a dynamic environment.Pay rate range (CAD): $40.30/hr – $48.36/hrResponsibilitiesManage and monitor Bank of Canada accounts, including collateral management and liquidity positionsAnalyze daily CAD and USD cash flow data to forecast and project closing balancesOptimize payment processes and ensure timely settlement of obligations with the Bank of CanadaInvestigate discrepancies and unexpected changes in cash balances to ensure accurate reconciliationMaintain sufficient collateral levels for large payment obligationsSupport the management of Intraday Liquidity, including start-of-day and usage monitoringCollaborate with Payment and Intraday Liquidity teams to enhance cash management capabilitiesEngage in industry forums, committees, and internal initiatives related to cash and liquidity managementPrepare reports, analysis, and documentation for internal stakeholders and managementAct as a liaison between Cash Management, Intraday Liquidity, and Payment teams to improve real-time cash management efficiencyDesired Skill-Set3-5 years of experience in finance, treasury, payments, or related fieldsPost-secondary degree in Finance, Business, Risk Management, or similar disciplineStrong analytical skills with the ability to interpret complex data trendsExcellent verbal and written communication skillsProven ability to work well under pressure and meet deadlinesAttention to detail in both analysis and documentationProficiency with MS Office Suite (Excel, PowerPoint, Word)Nice to HaveExperience handling challenging stakeholders or strong personalitiesKnowledge of AI tools or automation technologies in finance operationsFamiliarity with industry forums or liquidity management best practicesBeachHead is an equal opportunity agency and employer. We advocate for our candidates and welcome applicants regardless of race, color, religion, national origin, sex, age, or physical or mental disability. BeachHead or our clients may use technology-enabled tools, including automation and artificial intelligence (AI), to support parts of the recruitment process such as resume screening, application management, and candidate matching. These tools assist our recruiters and our clients, and do not replace human decision-making. This job posting represents a current or anticipated vacancy. The position may be filled at any time, and the posting may be removed without notice once the role has been filled.Privacy Policy",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372072674/",
    "job_id": "4372072674",
    "source": "linkedin",
    "company_name": "Pacer Group",
    "job_title": "Business System Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "5+ years of Business Systems Analysis experience in Capital Markets domainExpert knowledge of SQL and Excel for data analysisGood Capital Markets product knowledge, particularly derivativesData Analysis experience and project delivery in financial service industry preferably in MS Access",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371448389/",
    "job_id": "4371448389",
    "source": "linkedin",
    "company_name": "Tundra Technical Solutions",
    "job_title": "Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Title: Financial AnalystLocation: Toronto, ON (Hybrid)Estimated Duration: FulltimeToronto, Ontario, 4 days on-siteOur Finance team plays a key role in helping us stay competitive in the ever-changing retail environment by providing accurate, timely, and high-quality financial planning & reporting, analysis, and advice. Reporting to the AVP, CTR, Specialty Banners and IT FP&A, this role helps drive the organization to achieve its financial and strategic targets by providing financial insights, partnering with business clients, and leading efficiency improvements during a period of significant transformation. We are seeking an experienced and dynamic Senior Financial Analyst of FP&A to support various initiatives across the IT portfolio. This role will deliver seamless and timely forward looking financial and business information, as well as actionable value-added business insights to key executive decision makers. The ideal candidate will possess strong financial acumen and communication skills, be a self-starter with the proven ability to deliver results.What you will doDevelop understanding of major financial performance drivers and assist business decision makers in the development of action plans to meet financial goals and mitigate risksPreparation of meaningful and innovative performance reporting that communicates the story behind the financial performance to senior managementCollaborate across the organization to ensure the financial impacts of key strategic initiatives are accurately reflected within our financial plans and forecastsBe a leader of change – challenging current approaches and fostering new ways of approaching business questionsBring efficiencies to the reporting and forecasting and planning processesWho you areWe are looking for individuals who are: Creative and courageous, with the ability to manage in an environment of change and ambiguity to help us take bold, strategic moves in this rapidly evolving retail environmentAction oriented, outcome focused, and critical thinker with the ability to analyze and visualize, to ensure continuous improvement across the corporationCollaborative team players, who build relationships easily across various stakeholder groups to move initiatives forwardIf you’re innovative, curious, determined, won’t accept the status quo and ready to take on new challenges, then this is the place to beWhat you bringInnovative mindset to help drive the transformation of the broader FP&A teamDrive - Results oriented and organized, with the ability to prioritize and manage multiple responsibilities, maintaining attention to detail while retaining focus on the big pictureCritical Thinking - Be able to think through business problems wholisticallyComfortable analyzing and interpreting large, complex datasets from multiple sources to drive business insights and strategic decisions to identify trends, variances, and opportunitiesAdvanced proficiency in Excel, including (complex formulas, pivot tales, Power Query, and data modeling) is essential.Reporting and forecasting experience, as well as experience with financial modeling including experience using Power BIUniversity degree in Business, Accounting, or Finance1 to 3 years progressive experience in finance rolesWorking towards a professional accounting/financial designation (CPA, CFA), or Post Graduate Degree (MBA) considered an asset",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372007093/",
    "job_id": "4372007093",
    "source": "linkedin",
    "company_name": "Flexstaf I.T. Inc.",
    "job_title": "Senior Risk/Compliance Specialist",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DescriptionRole Title: Senior Risk / Compliance SpecialistDepartment: Risk, Security & GovernanceEmployment Type: Full-Time / ContractLocation: Hybrid, Downtown TorontoRole OverviewThe Senior Risk / Compliance Specialist is responsible for leading enterprise technology risk assessments, evaluating internal control effectiveness, and ensuring alignment with regulatory, security, and governance requirements. This role provides subject matter expertise across risk management, control design, and compliance monitoring within complex technology environments.The position partners with technology, security, audit, and business stakeholders to identify control gaps, design remediation strategies, and provide advisory support to senior leadership on risk posture and compliance obligations.Must Haves:7+ years experience Strong understanding of internal control frameworks, control mappings7+ years experience Technical concepts: logical access control, agile development process7+ years experience Expertise in gap analysis, remediation, control design and risk assessmentsKey ResponsibilitiesRisk Assessment & AnalysisPlan and execute risk assessments across systems, applications, infrastructure, and business processesAnalyze data from multiple sources to identify risk exposure and control weaknessesEvaluate control design and operating effectivenessMaintain risk registers and assessment documentationControl Design & GovernanceDesign, document, and evaluate internal controls aligned to regulatory and organizational requirementsMap controls to applicable frameworks and standardsDefine scope and control boundaries for assessments and auditsSupport development and enhancement of governance processesGap Analysis & RemediationPerform structured gap analysis against policies, standards, and control frameworksDevelop risk remediation plans with measurable outcomesTrack remediation progress and validate implementationSupport issue management and risk treatment lifecyclePolicy & Regulatory InterpretationInterpret legislation, standards, and internal policy requirementsTranslate compliance obligations into actionable operational and technical controlsProvide advisory guidance to technical teams and managementTechnical Risk AdvisoryAssess risk across technical domains including:Logical access and identity controlsSecure software development practicesSecurity architectureInformation security programsNetwork securityData protection and privacy controlsEvaluate risk implications of new technologies and system changesReporting & Stakeholder EngagementPrepare risk and compliance reports for management and executive audiencesCommunicate findings, risk exposure, and remediation prioritiesSupport audit readiness and regulatory review activitiesCollaborate with cross-functional teams to implement risk mitigation strategiesRequired Technical CompetenciesStrong understanding of internal control frameworks and control lifecycle managementExperience with control mapping, control testing, and control effectiveness evaluationExpertise in risk assessment methodologies and risk scoring modelsKnowledge of security and technology risk domains including identity management, network security, secure development, and data protectionExperience interpreting regulatory and compliance requirementsStrong documentation and technical reporting capabilitiesGovernance & Framework KnowledgeExperience working with one or more of the following is strongly preferred:Information security and risk management frameworksControl-based compliance frameworksEnterprise governance and risk management modelsTools & TechnologyGovernance, Risk, and Compliance (GRC) platformsRisk and control documentation systemsSecurity and audit evidence management toolsData analysis and reporting toolsExperience & QualificationsMinimum 7 years of experience in risk management, compliance, IT audit, or security governanceDemonstrated experience performing risk assessments and control evaluations in technology environmentsProven experience conducting gap analysis and managing remediation programsExperience advising senior stakeholders on risk and compliance mattersStrong verbal and written communication skillsPreferred QualificationsProfessional certifications in risk, audit, security, or governance disciplinesExperience supporting regulatory reviews or external auditsBackground in complex enterprise or regulated environmentsDeliverablesRisk assessment reports and risk registersControl design and evaluation documentationGap analysis findings and remediation plansExecutive risk and compliance reportingAudit and regulatory support documentationCollaborates with: Technology, Security, Risk, Audit, Legal, and Business UnitsSuccess MetricsTimely completion of risk assessmentsReduction in control gaps and unresolved risk itemsEffective remediation implementationAudit readiness and compliance posture improvementClear and actionable executive risk reporting",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356206132/",
    "job_id": "4356206132",
    "source": "linkedin",
    "company_name": "Neterra",
    "job_title": "Business Analyst",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Neterra is a global hi-tech and telecommunications company with over 30 years of experience, operating across 220+ locations in 65+ countries. We deliver integrated global connectivity solutions, combining fiber, IP/Ethernet, satellite technologies, cloud services, and data center solutions to support mission-critical business operations worldwide.The Business / Market Analyst plays a key role in supporting strategic planning, product development, and business growth through market intelligence and data-driven analysis.This role sits at the intersection of market research, business analysis, and strategic insight, working closely with Product, Sales, and Leadership to identify opportunities and shape future initiatives.Key responsibilitiesConduct qualitative and quantitative market research to analyze industry trends, customer behavior, and emerging market opportunitiesMonitor and assess competitive landscapes, including products, pricing models, positioning, and go-to-market strategiesDevelop market segmentations, customer profiles, and use-case-driven analysesBuild and maintain TAM / SAM / SOM models, opportunity sizing, and market attractiveness assessmentsAnalyze business performance metrics and market signals to support strategic and product-related decisionsPrepare clear reports, dashboards, and presentations that translate complex data into actionable insights for stakeholdersCollaborate with Product and Commercial teams to validate assumptions and support new product or market initiatives.What we’re looking forExperience in market research, business analysis, consulting, or a similar analytical roleStrong analytical mindset with the ability to synthesize data into structured insightsFamiliarity with market sizing methodologies, competitive analysis, and strategic frameworksComfortable working with data, reports, and presentations for senior stakeholdersStrong communication skills and ability to explain findings clearly to both technical and non-technical audiencesCurious, proactive, and business-oriented mindsetWe Offer:The opportunity to work in a reputable, growing, and people-oriented global telecom companyAn attractive remuneration and social benefits packageA rewarding career with the opportunity to make a real difference in your workEngaging and challenging projectsA creative and stimulating working environment",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4264428702/",
    "job_id": "4264428702",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4311061301/",
    "job_id": "4311061301",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371762375/",
    "job_id": "4371762375",
    "source": "linkedin",
    "company_name": "Emerging Credit Rating Limited",
    "job_title": "Research Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3117798696/",
    "job_id": "3117798696",
    "source": "linkedin",
    "company_name": "BRAC",
    "job_title": "Manager, Payroll, Human Resource Division",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4029035095/",
    "job_id": "4029035095",
    "source": "linkedin",
    "company_name": "Noor Staffing Group নিয়োগ",
    "job_title": "Accounts Payable Specialist",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3279723422/",
    "job_id": "3279723422",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "banglalink hiring Corporate Account Manager in Dhaka, Bangladesh",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326791803/",
    "job_id": "4326791803",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Madina Group hiring Cost Manager in New Market Thana, Dhaka ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4332190106/",
    "job_id": "4332190106",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Account Officer (For Pubergoan krira Shikkha Protishthan (PKSP ...",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3818105929/",
    "job_id": "3818105929",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]