[
  {
    "url": "https://www.linkedin.com/jobs/view/4356048846/",
    "job_id": "4356048846",
    "source": "linkedin",
    "company_name": "Confidential Careers",
    "job_title": "Accountant",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368557228/",
    "job_id": "4368557228",
    "source": "linkedin",
    "company_name": "Olaben",
    "job_title": "Executive Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356351400/",
    "job_id": "4356351400",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager - Accounts & Finance (Real Estate) - For Fortress Developments Ltd - Job ID : 1454734",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368829139/",
    "job_id": "4368829139",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Finance Senior Manager",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356330807/",
    "job_id": "4356330807",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive / Senior Executive - Internal Audit & Compliance (Accounts) - For AHSAN Group LTD- - Job ID : 1454486",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366309050/",
    "job_id": "4366309050",
    "source": "linkedin",
    "company_name": "51Talk",
    "job_title": "Business Support Specialist",
    "location": "Qesm El Maadi, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366400973/",
    "job_id": "4366400973",
    "source": "linkedin",
    "company_name": "MicroSourcing",
    "job_title": "Credit Controller",
    "location": "Parañaque, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366449183/",
    "job_id": "4366449183",
    "source": "linkedin",
    "company_name": "RCBC",
    "job_title": "Risk Manager",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366374332/",
    "job_id": "4366374332",
    "source": "linkedin",
    "company_name": "Beox",
    "job_title": "Finance and Administrative Affairs Manager",
    "location": "Ataşehir, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "BEOX is a technology company that has been operating in the telecommunications sector since 2004, providing Voice and SMS services, sustaining steady growth, and actively operating in international markets. In order to elevate our financial structure to a more strategic, sustainable, and scalable level, we are looking for a Finance and Administrative Affairs Manager who will manage all financial processes of the company end-to-end, work closely with senior management, and help steer our growth objectives.This role is a critical management position that covers not only operational finance processes but also the development and execution of the company’s financial strategy.Scope of the PositionThe Finance and Administrative Affairs Manager will ensure financial stability by having full command of the company’s revenue, expenses, cash flow, receivables, and payables; will manage budgeting and reporting processes in close collaboration with departments; and will create financial roadmaps that contribute to the company’s annual growth targets.Key ResponsibilitiesManage all financial processes of the company end-to-end (income–expense, cash flow, receivables and payables tracking)Prepare and present:Monthly, quarterly, and annual profit & loss statementsFinancial analysis and evaluation reportsManagement reportsDevelop strategies to ensure the effective and efficient use of existing financial resourcesPrepare financial plans, budgets, and projections in line with the company’s annual growth targetsManage relationships with banks; oversee credit, limit, collateral, and contract processesMonitor and manage government incentives, support programs, and financial advantagesEnsure legal compliance by working in coordination with accounting and financial consultancy processesWork in close collaboration with all departments to:Prepare department-based budgetsTrack budget realizationsAnalyze variances and develop action plansEnsure that tax, social security (SGK), and other legal obligations are fulfilled accurately and on timeAnalyze, anticipate, and take preventive actions against financial risksQualificationsBachelor’s degree in Business Administration, Finance, Economics, Economics and Administrative Sciences, or related fieldsMinimum of 10 years of experience in finance, accounting, or financial affairsPreferably experienced in telecommunications, technology, or international company structuresExperience working closely with senior management and taking an active role in financial decision-making processesAdvanced level of written and spoken EnglishStrong analytical thinking and reporting skillsAbility to analyze, interpret financial statements, and convert them into strategic actionsEffective communication skills with banks, auditors, financial advisors, and public institutionsStrong planning, prioritization, and time management skillsDetail-oriented, systematic, and highly responsibleAiming to make long-term contributions within a growing and dynamic organizational structure Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357428433/",
    "job_id": "4357428433",
    "source": "linkedin",
    "company_name": "Quartzelec Limited",
    "job_title": "Finance Leader",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4271298632/",
    "job_id": "4271298632",
    "source": "linkedin",
    "company_name": "Eksim Holding",
    "job_title": "Kıdemli Bütçe ve Raporlama Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366721539/",
    "job_id": "4366721539",
    "source": "linkedin",
    "company_name": "Al-Futtaim",
    "job_title": "Assistant Manager - Internal Audit | Group Audit | Corporate Services",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366717154/",
    "job_id": "4366717154",
    "source": "linkedin",
    "company_name": "Quess Malaysia",
    "job_title": "Senior Internal Auditor",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366314875/",
    "job_id": "4366314875",
    "source": "linkedin",
    "company_name": "BMW Group Financial Services South Africa",
    "job_title": "Specialist: Risk Management",
    "location": "Midrand, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job PurposeThe Specialist: Risk Management assures that residual value risks of BMW Financial Services (South Africa) (Pty) Ltd (SF3-ZA) are identified, analysed, steered and communicated appropriately within the local SF3-ZA and the SF central functions. The associate is also responsible for managing and steering residual value risk on a predictable and profitable basis. The function is responsible for safeguarding the company’s assets and liabilities from adverse market movements, principally related to residual value (RV) risk through proactively managing risks and setting risk parameters in accordance with both, economic projections and the risk strategy/appetite. The function assures that the local SF3-ZA entity is compliant, at all times, with BMW Central Residual Value Risk and related guidelines along with applicable local regulations.Key Accountabilities:Market risk:Steer all residual value risk related topics and proactively drive improvements on all latest developments.Presents the residual value risk management topics in various committees or working groups, e.g. local management committee, national risk committee, RV expert working group.Understand and supports liquidity risk processes.Responsible for establishing and monitoring of local RV risk guidelines/regulations, risk policies, procedures and controls in retail and commercial finance business areas within the local organization.Responsible for ensuring compliance with the SF central guidelines and for handling exception requests in local competence or with central risk function.Steers the local residual value setting process, interacting with remarketing department, National Sales Company (NSC) and SF Headquarters.Responsible for monitoring, validation, development and implementation of RV risk models, impairment methodology, etc. based on central guidance.Develops, evaluates and implements changes to residual value risk related systems and processes to enhance effectiveness and efficiencies. Responsible for accuracy and quality assurance of residual value related system. - Manages methodological changes.Prepares internal / external prognosis and internal realized market value information.Liaises with external prognosis institutes on a regular basis to discuss current market trends and influence the positioning of BMW Group products.Valuates the RV risk bearing Portfolio (Leasing/Select) at least on a quarterly basis.Calculates the standard RV risk cost according to central RV Risk Guideline for new business booking and planning and the expected losses.Supports the implementation of RV-based products and conducts necessary analysis required for the NPP process. Advises on necessary tools.Consults on residual value reserve level to ensure adequate provision coverage of portfolio.Initiates measures and leads projects to further develop the local RV risk management (e.g. purchase of external prognosis data).Cooperates with cross-functional teams (Sales, Operations, Finance) to gain efficiencies in the RV and Sales success. - Initiates and leads projects to further develop the local residual value risk managementRegularly validates and back tests all parameters (Standard Risk Cost, Provisioning, and RVaR). Manages the residual value risk parameters calculation, methodological changes and stress-testing.Analyses the impact of historical and predicted economic, industry, product, competitor and demographic changes on the existing and future portfolios. Recommends appropriate reserve (provision) and risk costs levels for budgets and long-range forecasts.Stays informed about latest developments (and regulators’ requirements) regarding methods of residual value risk detection and evaluation, and if appropriate, will decide with the CRO on implementation. Function must ensure that organization is compliant on residual value risk related regulationsLiaises with local and central departments to ensure transparency and accuracy of residual value risk management and reporting.Reviews local reports to discover trends and changes of residual value risk KPIs. Researches the questions raised by the monthly reporting and develops analysis to better understand and explain changes. Responsible for further development of the reports and definition of market specific risk KPIs.Performs stress tests and scenario analyses applying centrally provided parameters and procedures on a regular basis.Responsible for the implementation of audit (internal and external) findings in residual value risk area.Monitors residual value risk related outsourced activities as well as off balance activities and risk concentrations.Identify improvement and new opportunities to enhance controls and increase effectiveness, in residual value risk related functions.Active management and steering of vendors supporting residual value risk function. Job includes ensuring contractual documentation and adherence to same, KPI/ deliverables steering, etc.Supports the regular central residual va",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366405593/",
    "job_id": "4366405593",
    "source": "linkedin",
    "company_name": "Koru Partners Pte Ltd",
    "job_title": "Investment Analyst",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Position: Investment AnalystTo ApplyPlease kindly prepare the following information and submit your job application via this link: https://www.korupartners.com/jobposting/?jobid=87Resume.Academic Transcript.500 words or less response to “What matters to you the most? And why?” (An email will be sent to you requesting this essay the next working day after the job application is submitted).Applications are reviewed on a rolling basis and all applications with missing information and no justifiable reason will be considered incomplete and will not be processed.OverviewKoru Partners is a thematically driven alternative investment firm identifying attractive investment opportunities that are backed by macro-holistic themes encompassing forward-looking social, economic, demographic, and technological changes.We are inspired to be the world’s leading business partner for unique insights, understanding and decision making. It is our mission to understand the challenges facing humanity and to empower people and companies, working to transform such challenges into opportunities through allocation of capital.We are looking for an Investment professional who is looking to grow with us. Currently, we are primarily focused on late stage private opportunities as well as public equities but will shortly be expanding into other asset classes. If you are up for the challenge, we can promise a great journey and an opportunity to learn the various parts of our business. Be part of a scaling organisation where your contributions directly influence our growth!What You Can ExpectSalary: SGD 6,000 to 11,000 per monthBenefit:Group Insurance.Medical Reimbursement.Health Screening Reimbursement.Vision and Health Reimbursement.Company culture:Strong emphasis on company core values to guide you in your day-to-day work and life.A dynamic team that will challenge and support you.Flexible and transparent work culture.ResponsibilitiesResearch on wide-ranging topics that include macro, thematic, industry, and company.Prepare detailed presentations, reports, and financial models.Develop independent views on investment opportunities.Manage investment due diligence process and various stakeholders involved.Monitor, review, and analyse the performance of existing investments.Collaborate in the design of the investment process and framework.Liaise with the Product team to develop in-house analytics tools.Assist other departments (such as Operations, Finance, etc.) as and when required.Essentials to HaveAt least 1-2 years of experience in investment banking, investment-related or relevant fields with a preference for direct experience in public and/or private equity.Excellent verbal and written communication skills (English).Ideal RequirementsFirst principles thinker.Intellectually curious.Has a growth mindset.Able to learn and work independently.Able to manage multiple deliverables with a decent amount of uncertainty.Logical problem solver.Detailed oriented.Able to clearly articulate findings and conclusions in a concise manner.Proficient in financial modelling, MS Office, Bloomberg, Factset, and other tools.Singapore Citizen or PR preferred.About YouWe are a firm expecting collaborators to be highly aligned with our core values. Therefore, you should be:Dedicated and Driven. You are a self-starter who is able to work effectively with low levels of supervision or minimum direction while under pressure in a fast-paced environment. You are energetic, resourceful, and a hands-on individual who pursues goals with sense of urgency. You readily cope with changing priorities, take initiative, and able to follow through with assigned tasks.Integrity and Ethics. You have a strong, ingrained sense of professional integrity and ethics.Entrepreneurial and Effective Team Member. You have the ability to see the commercial angle, while being mindful of associated risks. You have strong leadership qualities and can assume responsibilities, while being a team player within a high-performance group.Agile Thinker. You enjoy solving complex problems and able to see the big picture while mapping out the details to achieve your goals. You are creative about providing innovative solutions (new processes, technologies, and approaches).To ApplyPlease kindly prepare the following information and submit your job application via this link: https://www.korupartners.com/jobposting/?jobid=87Resume.Academic Transcript.500 words or less response to “What matters to you the most? And why?” (An email will be sent to you requesting this essay the next working day after the job application is submitted).Applications are reviewed on a rolling basis and all applications with missing information and no justifiable reason will be considered incomplete and will not be processed. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366427245/",
    "job_id": "4366427245",
    "source": "linkedin",
    "company_name": "SGInnovate",
    "job_title": "Portfolio Manager (1 year fellowship with Coronet Ventures)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368560517/",
    "job_id": "4368560517",
    "source": "linkedin",
    "company_name": "Principle Partners",
    "job_title": "Chief Financial Officer",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The ideal candidate will be responsible for financial strategy, financial planning and analysis, financial reports, company audits, compliance, and bank relationships. They will collaborate with the CEO and the executive team to make decisions regarding company's financial strategy and operations. The candidate will possess a strong background in finance and management. ResponsibilitiesCreate and present financial and tax strategy recommendations to CEOSupport the financial planning and analysis effortsOversee cash flow, cash management, working capital, and company auditsPrepare financial statements and reportsEnsure legal compliance on all financial functionsManage relationships with banksQualificationsStrong finance-based analytical skillsat least 10 years' of finance experienceCPA or MBA preferred but not required Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356200965/",
    "job_id": "4356200965",
    "source": "linkedin",
    "company_name": "Majid Al Futtaim",
    "job_title": "Section Manager- Pastry",
    "location": "Kuwait City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "JOB TITLESection Manager- Pastry | MAF Retail | CommercialROLE SUMMARYThe Section Manager- Pastry is responsible for implementing quality, range and freshness standards of offered goods to attract customers in order to achieve the set sales targets. The role holder is also responsible for exceptional customer service is delivered within the section.ROLE PROFILEMonitor and report competitor activities (prices, range, promotional activities etc.) to ensure competitive advantageNegotiate internal promotions with suppliers to enforce the image of discount inside the sectionOversee the establishment of a competitive assortment offerSupport comparative studies within section that can contribute to the efficiency of the commercial conceptsEnsure the proper conservation, utilization and profitability of the department’s assetsProvide inputs on the price image and freshness imageEnsure proper stock management (stock value, control out of stock, orders and merchandise deliveries)Enforce safety, health and security rules as per internal standards and external rules and regulationsREQUIREMENTS2+ years in Bakery & Pastry and +1+year of experience in the operational \"Retail Exp is preferred \"Bachelor’s degree in any relevant universities Good experience in train people for any new recipes Good awareness on quality and hygiene standards.Good Communication skills and detailed oriented WHAT WE OFFERAt Majid Al Futtaim, we’re on a mission to create great moments, to spread happiness, to build, experiences that stay in our memories for a lifetime. We’re proud to say that over the past 27 years, we have built a reputation as a regional market leader in what we do. Join us!Work in a friendly environment, where everyone shares positive vibes and excited about our future.Work with over 45,000 diverse and talented colleagues, all guided by our Leadership Model. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356058039/",
    "job_id": "4356058039",
    "source": "linkedin",
    "company_name": "Boutiqaat",
    "job_title": "Junior Internal Control",
    "location": "Hawalli, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352820602/",
    "job_id": "4352820602",
    "source": "linkedin",
    "company_name": "Motel One Group",
    "job_title": "Kontroler Finansowy Polska",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Ponad 100 hoteli w 13 krajach, które imponują wyjątkowym designem, najwyższymi standardami obsługi i doskonałymi lokalizacjami w samym sercu miast, a wszystko to w atrakcyjnej cenie. Jako założyciel i prekursor koncepcji budget design, z sukcesem rozwijamy się w metropoliach Europy i poza nią.Opis oferty pracyRaportowanie wyników finansowych do Centrali hoteli w Gdańsku i Warszawie;Ścisła współpraca z działem controllingu w Centrali, audytorami oraz zapewnienie merytorycznego wsparcia w obszarze zagadnień finansowych dla wybranych działów organizacji, w tym KseF;sporządzanie tygodniowych, miesięcznych i rocznych raportów finansowych zgodnie z wytycznymi działu kontroli finansowej;Wsparcie w finansowym i operacyjnym zamknięciu miesiąca w hotelach w Polsce / Gdańsk, WarszawaZapewnienie terminowego składania odpowiednich deklaracji podatkowychKwalifikacjeWyższe wykształcenie ekonomiczne;Min. 4 lata doświadczenia w dziale kontrolingu, mile widziane w branży hotelarskiej;Praktyczna, zaawansowana znajomość pakietu MS Office (w szczególności Excel);Znajomość języka angielskiego lub niemieckiego - warunek konieczny;Znajomość specyfiki finansów hotelowych (USALI) oraz wskaźników charakterystycznych dla branży hotelarskiej;Wysoko rozwinięte umiejętności analitycznego myślenia;Samodzielność oraz dobra organizacja pracy;Odpowiedzialność i terminowość;Gotowość do odbywania delegacji służbowych.Dodatkowe informacjeOferujemy: Noclegi w Motel One w bardzo atrakcyjnych cenach;Opiekę medyczną;Dofinansowanie dojazdów do pracy;Atrakcyjny system bonusowy dla każdego pracownika;Możliwość rozwoju osobistego z dedykowanym planem szkoleń w centrali Motel One;Eventy, imprezy integracyjne, wydarzenia roczne - razem celebrujemy sukcesy Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366727560/",
    "job_id": "4366727560",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Area Sales Manager – Modern Trade & Institutional Sales for (M/S Commander Soap Company Ltd.)",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356058544/",
    "job_id": "4356058544",
    "source": "linkedin",
    "company_name": "A.P. Moller - Maersk",
    "job_title": "Accounts Receivable Manager - with German Language Skills",
    "location": "Warsaw Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361479880/",
    "job_id": "4361479880",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Chief Business Officer (For United Finance PLC)-Job ID: 1457904",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368996000/",
    "job_id": "4368996000",
    "source": "linkedin",
    "company_name": "SF Express Indonesia",
    "job_title": "General Ledger Accountant (Mandarin Speaking)",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366439993/",
    "job_id": "4366439993",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Junior Adótanácsadó - Budapest",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Az EY egyike a világ vezető könyvvizsgáló, adó-, tranzakciós és üzleti tanácsadást nyújtó vállalatainak, cégünk 1989 óta nyújt szakmai szolgáltatásokat Magyarországon.Célunk egy jobban működő világ kialakítása – egy olyan környezeté, mint a miénk, amelyben a fenntartható növekedés, a tehetséggondozás valamennyi formája érvényesül, az együttműködéseket pedig valódi mélység jellemzi.A legjobb lehetőséget keresed arra, hogy kihozd magadból a legtöbbet és karriert építs az adótanácsadás területén?2026 szeptemberében ismét elindul az EY adótanácsadói programja, amely azoknak szól, akik nemcsak belépni szeretnének a szakmába, hanem valódi, a piacon versenyképes tudást, kiépített karrierutat és egy szakmailag és emberileg is kiemelkedő közösséget keresnek.Miért izgalmas ez a lehetőség?Sokszínű tanácsadási projektek – magyar és nemzetközi ügyfeleinken keresztül különböző iparágak adózási kérdésein át ismerheted meg a piac működését,Tanulás és komplex adózási feladatok – a tapasztalt kollégák támogatásával elsajátíthatod a teljes tanácsadási folyamatot,Ügyféltalálkozók és prezentációk – az első pillanattól kezdve fontos tagja vagy a csapatnak, így a projekt minden szegmensébe, az ügyfelekkel való kapcsolatépítésbe bevonásra kerülsz,Specializálódási lehetőség – az első héten megrendezésre kerülő onboarding tábor keretében minden adózási területünk szakértőitől hallhatsz gyakorlatorientált előadásokat, amelyek átfogó képet adnak a csapatok működéséről és projektjeiről, ezáltal körvonalazódik benned, hogy melyik területen szeretnél karriert építeni.Várjuk jelentkezésed, ha...Közgazdasági vagy jogi végzettséggel (BSc, MSc vagy osztatlan képzés) rendelkezel, vagy utolsó félévedet töltöd az egyetemen és ennek megfelelően 40 órában, azaz teljes munkaidőben tudsz munkát vállalni,Érdeklődsz az adózás területei iránt, s előnyt jelent, ha releváns specializáción tanulsz vagy voltak e témához kapcsolódó tárgyaid, illetve szereztél már tapasztalatot hasonló szakterületen,Magabiztos angol nyelvtudással rendelkezel (egyéb nyelv ismerete előnyt jelent),Felhasználói szinten ismered az MS Excel-t, Word-öt és PPT-t,Nyitottság, proaktivitás jellemez és tanulni, fejlődni szeretnél,Munkádat a magas minőség, alaposság és pontosság jellemzi.Mire számíthatsz sikeres pályázat esetén?Egy támogató, magas szintű szakmai tudással és széleskörű ügyfélkörrel rendelkező hazai és nemzetközi csapat, ahol a vezetőség elkötelezett a közös siker érdekében,Lehetőség magyar és nemzetközi képzésekben való részvételre, hogy folyamatosan naprakész maradhass a legújabb szakmai trendekkel és fejlesztésekkel,Kiszámítható, teljesítményalapú karrierépítési lehetőség, ahol az elért eredmények közvetlenül hozzájárulnak előrelépésedhez,Mentorprogramunknak köszönhetően az első munkanapodtól fogva egy dedikált counsellor kolléga fogja segíteni munkádat egy buddy kollégával együtt,Juttatási csomagunk a rugalmas munkavégzés mellett, tartalmaz cafeteriat, élet- és balesetbiztosítást, egészségbiztosítást, teljesítményalapú éves bónuszt, céges iPhone-t privát használatra is.A Kiválasztási FolyamatunkKattints a jelentkezés gombra és töltsd fel naprakész önéletrajzod!CV-d pozitív értékelését követően toborzó kollégáink veszik fel Veled a kapcsolatot, hogy egyeztessetek egy telefonos beszélgetés keretében.Amennyiben a telefonos előszűrés során kedvező visszajelzést kapsz, meghívunk egy kiválasztási napra. Itt lehetőséged lesz jobban megismerni minket, és feltenni az összes kérdésedet, amelyekre még választ vársz. Ezt követően pedig már a „kezedben” is foghatod az ajánlatunkat!A 2026 szeptemberétől induló munkavégzésre irányuló ajánlatunk elfogadása után, megtörténik a munkaszerződés aláírása, mely után már csak annyi dolgod van, hogy a nyár végén megérkezel hozzánk és részt veszel az EY-os karrieredet elindító orientációs napunkon!Legyen ez a döntés a sikeres karriered első nagy mérföldköve – jelentkezz még ma! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366415788/",
    "job_id": "4366415788",
    "source": "linkedin",
    "company_name": "TACO Group",
    "job_title": "Tax Accounting Manager",
    "location": "Kemayoran, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356113255/",
    "job_id": "4356113255",
    "source": "linkedin",
    "company_name": "GXO Logistics, Inc.",
    "job_title": "Senior Accountant",
    "location": "Bucharest, Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Logistics at full potentialGXO is a leading provider of cutting-edge supply chain solutions to the most successful companies in the world. We help our customers manage their goods most efficiently using our technology and services. Our greatest strength is our global team – energetic, innovative people of all experience levels and talents who make GXO a great place to work.To support our presence in Romania, we are looking for an Senior Accountant to join our team. This role is based either in Nicolae Cânea, nr. 140-158, Bucharest.What you do on a typical day:Perform general accounting tasks in compliance with internal policies and local regulations.Accurately register all financial documents in the accounting system.Review and verify the correctness of accounting entries.Execution of month/year end closing process from FP&A perspective, in accordance with the methodology adopted in the group and the cluster.Analyzing and evaluating operational processes in terms of their economic efficiency, proposing improvements and corrective measures.Collaborate cross-functionally with various departments to ensure accuracy, completeness, and timeliness of financial deliverables.Maintain a comprehensive understanding of business transactions and their impact on both financial and management accounting.Reconcile financial records and promptly report any discrepancies.What you need to succeed at GXO:University degree in Finance, Accounting, Economics, Business Administration, or a related field.3-5 years of relevant experience in accounting, financial analysis, or controlling, ideally within a multinational or operations-driven environment.Proven ability to manage accounting processes such as budgeting, forecasting, and month-end/year-end closing.Advanced Excel skills and experience with financial modeling and ERP systems.Demonstrated ability to work independently and as part of a team in a fast-paced environment.Unlock the potential of your future!Your future work environmentYou will work in an informal and dynamic environment with motivated colleagues. We provide cutting-edge supply chain solutions to the world’s most successful companies. Our work is important, competitive and satisfying. We’re growing worldwide, and we’re constantly looking for talented individuals at all levels who can deliver the caliber of service our customers require. If you’re ready to give us your best, let’s talk. We’d like to invest in you.Our ultimate visionCreate game-changing opportunities for the world’s best companies.Want to know more about GXO?Check our YouTube channel: Logistics at Full Potential - YouTube - www.gxo.comInterested?Apply by clicking the button and leave your updated resume.GXO is a leading provider of cutting-edge supply chain solutions to the most successful companies in the world. We help our customers manage their goods most efficiently using our technology and services. Our greatest strength is our global team – energetic, innovative people of all experience levels and talents who make GXO a great place to work.The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367754170/",
    "job_id": "4367754170",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Front Office Manager",
    "location": "Lusail, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365967352/",
    "job_id": "4365967352",
    "source": "linkedin",
    "company_name": "Ngân hàng SHB",
    "job_title": "Trưởng phòng Quản lý Rủi ro - Campuchia",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366242489/",
    "job_id": "4366242489",
    "source": "linkedin",
    "company_name": "BJRC Recruiting",
    "job_title": "Accounting Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365043856/",
    "job_id": "4365043856",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Senior Accountant, Tax",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job DetailsDescriptionMake an impact with our Tax team as a Senior Accountant. This diverse team of professionals delivers customized tax strategies within a complex and dynamic regulatory framework. As a trusted advisor, you’ll design solutions for clients that meet compliance and reporting requirements, minimize risk, drive efficiencies and maximize returns.MNP is proudly Canadian. Providing business strategies and solutions, we are a leading national accounting, tax and business advisory firm in Canada. Entrepreneurial to our core, our talented team members transcend obstacles into opportunities and are successfully transforming mid-market business practices.ResponsibilitiesResponsible for the completion of tax engagements by computing taxes owed, preparing personal and corporate tax returns (and other compliance slips), preparing year-end tax forms (T4s/T5s), calculating and reviewing share capitalSet up files for new clients and newly incorporated businessesEvaluate existing business processes and policies and advise on policy and tax changes; developing proactive tax strategies that make effective use of business opportunities and ensure businesses are run effectivelyIdentify issues and errors, investigate discrepancies and discuss with managers or engagement partners to develop resolutionsCorrespond with clients and various government agencies to address client tax compliance issuesPrepare correspondence, technical reports, client summaries and presentations outlining engagement findings, facts and highlightsCollaborate with client engagement team prior to commencement of client work to discuss roles and responsibilities, risk areas, materiality and deadlinesLead engagement teams, developing effective relationships with clients while coaching and mentoring junior team membersContribute to the development of new ideas and approaches to improve work processesParticipate in business development initiatives and identify new business opportunitiesMaintain flexibility to travel, as necessarySkills And ExperienceBachelor’s degree in commerce or business administration (accounting or finance major is preferred)Completion of, or working towards, a CPA designation; completion of CFE examination and working towards relevant practical experience requirements will also be considered2 to 4 years of relevant public accounting or tax experienceWorking knowledge of the Canadian Income Tax ActExperience working with accounting and tax softwareMyRewards@MNPWith a focus on high-potential earnings, MNP is proud to offer customized rewards that support our unique culture and a balanced lifestyle to thrive at work and outside of the office. You will be rewarded with generous base pay, vacation time, 4 paid personal days, a group pension plan with 4% matching, voluntary savings products, bonus programs, flexible benefits, mental health resources, exclusive access to perks and discounts, professional development assistance, MNP University, a flexible ‘Dress For Your Day’ environment, firm sponsored social events and more!Diversity@MNPWe embrace diversity as a core value and celebrate our differences. We believe each team member contributes unique gifts and amplifying their potential makes our business stronger. We encourage people with disabilities to apply!For further information, and to apply, please visit our website via the “Apply” button below.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322769564/",
    "job_id": "4322769564",
    "source": "linkedin",
    "company_name": "MARTÍ",
    "job_title": "Coordinador (a) de Análisis Financiero",
    "location": "Santo Domingo, Distrito Nacional, Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Profesional responsable de coordinar y supervisar las actividades de análisis financiero. Será el encargado de elaborar reportes, evaluar resultados, preparar proyecciones y brindar soporte a la toma de decisiones estratégicas. Deberá garantizar la precisión de la información financiera y coordinar los procesos de planeación y control financiero.Requisitos: Profesional en las áreas de Finanzas, Economía, Administración, Ingeniería Industrial, Contabilidad. Maestría en Finanzas (Deseable mas no imprescindible) Manejo de Excel (Avanzado). Dominio de Inglés (Avanzado). Manejo de Power BI. Mas de 2 años en posiciones similares.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356187523/",
    "job_id": "4356187523",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager/ Manager - (Supply Chain and Procurement Specialist) - For Universal Gas & Gas Cylinder Ltd. (Dhaka) - Job ID: 1454388",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Universal Gas & Gas Cylinder Ltd. (Dhaka) is looking for Deputy Manager/ Manager - (Supply Chain and Procurement Specialist)Job Description / ResponsibilityManage LC (Letter of Credit) opening and retirement processes in coordination with banks and finance departmentsMaintain regular communication and liaison with overseas suppliersCoordinate and execute export/import activities with international suppliersMonitor procurement, shipment schedules, and delivery timelinesEnsure compliance with trade regulations, documentation, and customs proceduresPrepare and maintain import/export documentationTrack shipments and resolve logistics or supply delaysSupport vendor management and supplier relationship developmentAssist in cost control, inventory planning, and supply forecastingCoordinate with internal departments (finance, sales, operations, warehouse) for smooth supply chain operationsPractical experience on e-GP Tender and Manual Tender Submission Independently.Monitor government procurement and other portals, industry news to stay informed about upcoming projects and initiatives.Minimum of 4-7 years of experience in government tendering, required tender document preparation and submission management.Reviewing tender documents requirements and the scope of works, checking the feasibility for qualification and financial criteria, getting through the contract terms and conditions, liquidity damages, performance guarantee, milestone, bank guarantee requirements, payment terms and special conditions, taxes and duties.Ensure that all tender documents, including technical specifications, pricing information, and compliance statements are accurately formatted, consistent, complete and compliance met with tender requirements.Stay informed about industry trends, regulatory changes, and best practices in government procurement to inform bid strategies and tactics.Sourcing of capable supplier(s) ensuring effective procurement of, quality materials with competitive price by way of effective negotiation and obtaining management approval of each consignment.Coordinate with concerned Department, C & F Agents and Transport Agency after arrival of the consignments at port for ensuring smooth delivery of the same to the projectMaintain deed of agreements in connection to a series of specific procurement covering a certain span of time or a future procurement towards protection of company interestDevelop and execute procurement plans for different materials and chemicals for maintaining uninterrupted project operationEducational RequirementsMaster of Science (MSc) in Mechanical EngineeringMaster of Business Management (MBM) in Supply Chain ManagementMaster of Business Administration (MBA)APICS Certified Supply Chain Professional (CSCP)Chartered Supply Chain Professional (CSCP)[IBA, Dhaka University, Jahangirnagar University, University of Chittagong, North South University, BRAC University ]students will get preferenceSkills Required: Foreign Communication, Microsoft Excel, Product Costing and budgeting, Cost and Inventory ManagementExperience Requirements5 to 10 year(s)The applicants should have experience in the following business area(s):GasAdditional RequirementsPGD in Supply Chain Management will be preferredGood communication skills (Both English & Bengali)Ability to work under pressure· EGP Tendering, Expert International Tender, Tender documentation, Tender Management· Correspondence in English· Expertise at Microsoft office (Excel & Word)Job LocationAnywhere in BangladeshSalaryTk. 60000 - 80000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366741763/",
    "job_id": "4366741763",
    "source": "linkedin",
    "company_name": "Origina",
    "job_title": "Payroll & Expenses Specialist",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About OriginaOrigina is a rapidly growing global challenger technology company on a mission to stop unnecessary technology change by helping enterprises to extend, protect and enhance their software assets. We believe organisations should be free to run their systems for as long as they choose - without being pushed into costly, unwanted upgrades that don’t align with their strategy, so we step in to provide an alternative from the original vendor.We’re scaling fast, with a clear path to €0.5 billion in the next five years, and expanding our presence across Europe, the US, and Australia. As a leading force in independent enterprise software support, we help the world’s largest organisations take back control of their technology roadmap and unlock genuine commercial freedom.If you’re energised by growth, excited by change, and motivated to help customers challenge long-standing industry norms, this is the team to join. At Origina, you’ll be part of a bold, fast-moving global business where your impact will be felt immediately.The RoleAs a fast-growing Irish scale-up with a globally distributed workforce, accurate and compliant payroll is critical to our employee experience and financial integrity.We are seeking an experienced Payroll & Expenses Specialist to take ownership of payroll operations across multiple countries, partnering closely with Finance, People & Culture, and external vendors to ensure our people are paid correctly, on time, and in line with local regulations.This role goes beyond payroll processing. You will play a key role in scaling payroll and expense processes, improving ways of working, and being a trusted point of contact for employees across the business as we continue to grow internationally.Key ResponsibilitiesGlobal Payroll OwnershipOwn end-to-end payroll operations across multiple jurisdictions including Ireland, the UK, France, the Netherlands, Australia, and the USA, ensuring accuracy and compliance with local regulations.Manage relationships with external payroll vendors (e.g., Vistra, Justworks, GT) to guarantee smooth and timely payroll processing.Act as the internal expert on payroll cycles, deadlines, and dependencies across regions.Administer bonuses and variable pay, ensuring accurate calculations, approvals, and reporting.Maintain accurate payroll and employee data across HRIS and payroll systems.Ensure ongoing compliance with statutory, tax, and reporting requirements in all countries of operation.Benefits & Employee SupportLiaise with benefits providers across multiple regions, supporting enrolment, changes, and employee queries.Partner closely with People & Culture to deliver a smooth, people-centric payroll and benefits experience.Act as a trusted point of contact for payroll-related queries from employees and managers globally.Expenses & GIE PaymentsAssist with cash management and ensure timely processing of invoices for GIEs (external consultants).Oversee payment of GIE invoices and maintain accurate records for audit and compliance purposes.Collaborate with People & Culture to ensure proper coding and reconciliation payroll & expensesReporting, Controls & Continuous ImprovementSupport Finance and People & Culture with payroll-related reporting, reconciliations, and ad-hoc analysis.Create and maintain payroll policies, procedures, and documentation.Identify opportunities to streamline, automate, or improve payroll and expense processes as the business scales.Support internal and external audits related to payroll and payments.About youProven experience managing multi-country payroll in a growing or international organisation.Strong understanding of payroll compliance, statutory requirements, and vendor-led payroll models.Experience working with HRIS and payroll platforms (e.g. BambooHR, Justworks, Remote.com or similar).IPASS qualification is beneficial but not essential.Highly organised with exceptional attention to detail.Confident communicator who can partner effectively with Finance, People & Culture, vendors, and employees.Comfortable working independently in a scale-up environment with evolving processes.People-centric mindset with a strong focus on accuracy, trust, and employee experience.Why Origina?Join a high-growth Irish scale-up with a global footprint.Take real ownership of global payroll in a business that values accuracy, trust, and continuous improvement.Work closely with senior leaders across Finance and People & Culture.Shape how payroll operates as we scale into new countries and complexity.What we offerCompetitive compensation that rewards achievementHybrid, flexible working modelHigh-level Health, Dental, and Vision insuranceLife insurance & Income Protection23 days Annual Leave plus 2 company daysGenerous Maternity & Paternity leave policies6% Pension match€200 annual wellness benefit€1,000 professional development benefitEmployee Assistance ProgrammeFun and inclusive environment with regular events organised by Engagement, and Diversity Commi",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369238116/",
    "job_id": "4369238116",
    "source": "linkedin",
    "company_name": "Lex Consultancy Recruitment",
    "job_title": "Payroll Specialist",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372446999/",
    "job_id": "4372446999",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Officer - Finance, Admin and Logistics - For The Bangladesh Red Crescent Society- Job ID: 1460659",
    "location": "Cox’s Bazar, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373781777/",
    "job_id": "4373781777",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Administrative Officer (For Ahsania Mission Cancer & General Hospital)-Job ID: 1459693",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Ahsania Mission Cancer & General Hospital is looking for Administrative OfficerJob Description / ResponsibilityOffice ManagementReport writingHR and administrative workPurchase and procurement knowledgeComputer proficiencyEducational RequirementsMaster of Business Administration (MBA)Skills Required: Office Management, Staff Management, Team Leadership, HR and Administration, Purchase and ProcurementExperience Requirements3 to 5 year(s)The applicants should have experience in the following business area(s):Hospital,Clinic,Healthcare StartupJob LocationDhaka (Mirpur 14)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374235743/",
    "job_id": "4374235743",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Assistant (For Caritas Regional Office)-Job ID: 1461505",
    "location": "Bandarban District, Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Caritas Regional Office is looking for Accounts AssistantJob Description / ResponsibilityCaritas Bangladesh (CB) is a national and nonprofit development organization that has been operating in Bangladesh since 1967. It has its Central Office in Dhaka and eight Regional Offices (Barishal, Chattogram, Dhaka, Dinajpur, Khulna, Mymensingh, Rajshahi, and Sylhet Region). CB is currently operating 88 projects covering 185 Upazilas focusing on eight main priorities: i) Social Welfare and Service of Love for Vulnerable Communities, ii) Ecological Conservation, Climate Justice and Sustainable Food System, iii) Humanitarian Response and Disaster Management, iv) Education, Skill Development and Employment Creation, v) Health Care, Nutrition and Education, vi) Development of Indigenous Peoples, vii) Integral Human Development and viii) Institutional Development and Sustainability.Caritas Bangladesh (CB)’s Chattogram Regional Office is looking for suitable candidate for the project of “Promotion of comprehensive social inclusion of vulnerable groups especially Senior Citizens and People with Disabilities (SDDB) 2025-27” Project and also to generate a panel for future recruitment.The details of the positions including job responsibilities, educational qualification and other qualities/ competency required for the above position are given below as ready reference:This position is based in the Regional office. Responsible to support the overall finance and fund management and addressing compliance issues of the SDDB project level.Financial monitoring and supervision of the project. Provides accounts and financial guidance to the project team. Preparation of monthly financial report, preparation of modification, and reviews.Key responsible person to keep and maintain all account records of the project in soft as well as in hard form. The responsibilities are as follows;Reporting to:Sr. Accounts and Admin Officer with close collaboration with Field Officer- SDDB.Job Nature: Contractual/ TemporaryJob location: Regional office, Chattogram.Study and adhere to the donor’s and organizational financial policies and regulations, including the stipulations outlined in the sanctioned budget.Check all hard copies of vouchers (e.g., voucher number, date, budget head) along with supporting documents with the voucher list.Ensure all supporting documents are attached to the vouchers as per the guidance of the reporting supervisor.Provide English translations on vouchers, if required.Scan all vouchers according to the donor’s guidelines.Cross-check scanned vouchers received from the field offices with the tally and voucher list.Assist with other related tasks as required.Assist in preparing financial report of SDDB project.Financial monitoring visit to the project’s field areas.Well communication with Region and Central level concern department.Perform any other duties/responsibilities assigned by the competent authority.Educational RequirementsBachelor/HonorsMinimum bachelor’s degree, in Commerce discipline preferably in Accounting from any recognized university in Bangladesh/abroad.Experience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): NGOAdditional RequirementsEducational qualifications & age may be flexible for highly experienced, skilled & competent candidates.Experience Requirements:Work experience with NGOs/INGOs is preferable with a minimum of 2 years of experience particularly on Accounts keeping and financial reporting.Ability to produce high quality work under tight timeframes.Evidence of undertaking similar assignments.Good report writing skillsKnowledge on computer operation, including MS Word, Excel, Power Point.Demonstrated results implementing and tracking field-based activities.Knowledge of local context.Ability to work in a multi-cultural environment.Good time management skills with ability to work on multiple tasksGood communication and interpersonal skills.Work with the team as per management requirement.Ability to travel extensively to working locations and willing to stay at field;Job LocationChattogramSalaryTk. 30000 (Monthly)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374204114/",
    "job_id": "4374204114",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer/Sr. Officer - ICT - For GPH Ispat Limited - Job ID: 1460995",
    "location": "Chattogram, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "GPH Ispat Limited is looking for Officer/Sr. Officer - ICTJob Description / ResponsibilityProvide Level 1/Level 2 support for hardware, software, and network issues.Install, configure, and maintain desktops, laptops, printers, and other IT equipment.Manage user accounts, email configurations, and access controls.Monitor network performance and troubleshoot connectivity issues.Maintain IT inventory and asset records.Ensure data backup and system security compliance.Provide end-user support for SAP modules (MM, SD, FICO, PP, HCM, etc.)Analyze and resolve SAP tickets within SLA timelines.Maintain and update master data in SAP.Assist in SAP configuration, testing, and documentation.Support SAP report generation and data validation.Coordinate with external vendors for IT-related services.Educational RequirementsBachelor of Science (BSc) in Computer Science & EngineeringBachelor of Science (BSc) in Information TechnologyBachelor’s degree in IT, Computer Science, MIS, or related field.Skills Required: IT Support Service, SAP SoftwearExperience RequirementsAt least 1 year(s)The applicants should have experience in the following business area(s):Manufacturing (Light Engineering and Heavy Industry),IT Enabled Service,Computer Hardware/Network Companies,Group of Companies,SteelAdditional RequirementsHands-on experience with at least one SAP module.Strong knowledge of networking basics (LAN/WAN, routers, switches).Good understanding of Windows OS and MS Office.Problem-solving and analytical skills.Good communication and teamwork skills.Job LocationChattogram (Sitakunda)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373790641/",
    "job_id": "4373790641",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts and VAT - (For Salahuddin Associates SA) - Job ID - 1460875",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356081301/",
    "job_id": "4356081301",
    "source": "linkedin",
    "company_name": "GoGoX",
    "job_title": "Accountant Intern",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366442428/",
    "job_id": "4366442428",
    "source": "linkedin",
    "company_name": "CMPartners Vietnam",
    "job_title": "Senior Bookkeeper",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "THE OPPORTUNITYWe are a well-established Chartered Accounting practice (CA) based in Sydney, Australia.We are seeking highly motivated individuals to work as part of our growing team in our Ho Chi Minh City office, supporting a range of Australian clients.This role provides end-to-end accounting support for a group of Australian professional services companies. The accountant will work closely with the Sydney finance team, Senior Associates, and Principals on invoicing, reporting, payroll preparation, and general accounting tasks. Strong English communication, accuracy, and proactive follow-up are essential.COMPANY BENEFITS13th month & annual performance-based bonuses12-20 days annual leaveFull package of social insurance compliant with Vietnamese LawTeambuilding activities (Birthday, Mid-Autumn Festival, Year-end party, Tet gift, Christmas gift exchange, ....)On the job training to perform job assignmentsInternal training periodicallyABOUT THE ROLEJob title: AccountantLocation: 2nd floor, MORE Building, 27c Quoc Huong Street, Thao Dien Ward, Thu Duc District, Ho Chi Minh City.Position type: Full-timeSalary: Negotiable, based on experienceRESPONSIBILITIES AND DUTIES1. End-to-End BookkeepingEnsure accurate, timely, and complete processing of all bookkeeping functions, maintaining the integrity of financial and administrative processes.Prepare monthly progress invoices and ensure accuracy in line with project billing schedules.Manage the invoicing process end-to-end, including supporting documentation, revisions, and follow-ups.Maintain invoice registers and produce debtor reports.Support quarterly revenue reconciliation.2. Accounts Payable (AP) & Accounts Receivable (AR)Process supplier invoices and payment enquiries.Prepare payment batches and submit for approval.Manage supplier payments, customer receipting, and debtor follow-up.Conduct regular bank reconciliations and resolve variances.3. Payroll & People SupportPrepare payroll, leave entries, and Xero leave reporting.Set up new starters in Xero and Fresh Projects.Prepare PAYG, super, and payroll tax submissions for approval.4. Project AccountingSet up new projects in Fresh Projects ERP.Maintain project data and ensure accuracy of project reporting.Prepare sales forecasts and management reports.Assist Principals and Senior Associates with project-related financial queries.Ability to work with multiple cost centres and understand project-level and office-level cost allocations.5. Month-End & Year-End ProcessesPrepare and post journal entries including accruals, prepayments, and adjustments.Assist with preparation of monthly management reports and variance analysis.Maintain orderly financial records across SharePoint and Microsoft Suite.Support ad hoc reporting and management requests.6. Financial Reporting (for senior level)Draft accurate profit and loss statements, balance sheets, and cash flow reports.Provide support for internal management reporting, budget monitoring, and forecasting activities.SKILLS AND QUALIFICATIONSMinimum 3–5 years’ experience in bookkeeping, assistant accountant, or similar finance roles.Excellent English communication skills both verbal and written.Professional services or multi-entity experience preferred.Solid working knowledge of accounting software (Xero) and proficiency in MS Excel.Exposure to ERP systems.Strong understanding of Australian accounting standards and statutory compliance (GST and payroll tax).Demonstrated track record of accuracy, accountability, and initiative in financial operations.Ability to liaise with a range of internal and external stakeholders.Excellent attention to detail.Ability to prioritise workloads.Pro-active and self-motivated.High level of interpersonal skills and initiative.Ability to maintain a customer service mindset.Strong organisational and administrative skills.Adaptable and confident learning new systemsAbility to work independently and collaboratively in a dynamic team environment. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365950654/",
    "job_id": "4365950654",
    "source": "linkedin",
    "company_name": "Tech JDI",
    "job_title": "The Senior General Accountant (Service accounting)",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356141087/",
    "job_id": "4356141087",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Junior Officer - Accounts - (For Ezma Industries Ltd) - Job ID - 1454022",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366236256/",
    "job_id": "4366236256",
    "source": "linkedin",
    "company_name": "Paymob",
    "job_title": "Sales Account Manager",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366334627/",
    "job_id": "4366334627",
    "source": "linkedin",
    "company_name": "Magnet",
    "job_title": "Cost Controller (F&B)",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366428209/",
    "job_id": "4366428209",
    "source": "linkedin",
    "company_name": "Mida Food Distributors Inc.",
    "job_title": "Cost Accountant",
    "location": "Pasig, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355982955/",
    "job_id": "4355982955",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager - VAT & Tax (For A Renowned Group of Company) - Job ID - 1454001",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360517537/",
    "job_id": "4360517537",
    "source": "linkedin",
    "company_name": "Michael Page",
    "job_title": "Tax Manager",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366055335/",
    "job_id": "4366055335",
    "source": "linkedin",
    "company_name": "First National Financial LP",
    "job_title": "Associate Mortgage Underwriter",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325739534/",
    "job_id": "4325739534",
    "source": "linkedin",
    "company_name": "EBC Inc.",
    "job_title": "Directeur | Directrice finances corporatives",
    "location": "L'ancienne-Lorette, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356091347/",
    "job_id": "4356091347",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Coordinator to Management- For A Well Reputed Real Estate Group of Company- Job ID: 1453832",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356321520/",
    "job_id": "4356321520",
    "source": "linkedin",
    "company_name": "BEACON RED",
    "job_title": "Interpreter- EN ↔ AR",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356049059/",
    "job_id": "4356049059",
    "source": "linkedin",
    "company_name": "BEACON RED",
    "job_title": "Translator ML ↔ AR",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are seeking experienced Malayalam–Arabic Translators / Interpreters (ML ↔ AR) to support sensitive case-related and legal documentation. The role requires high linguistic accuracy, strong formal writing skills, and the ability to work with confidential material.Key ResponsibilitiesTranslate written investigative and legal reports, statements, and case documentation between Malayalam and ArabicProvide interpretation support during interviews, briefings, and formal discussions as requiredEnsure accuracy, clarity, and consistency of terminology across Malayalam and ArabicProduce clear, structured, and evidentially sound written translationsHandle sensitive and confidential information in line with security and governance requirementsRequired ExperienceProven experience as a Malayalam–Arabic translator and/or interpreter (ML ↔ AR)Strong experience in legal or investigative translation, particularly formal report writingExcellent written and spoken Malayalam and Arabic, with the ability to draft formal, structured reportsFamiliarity with legal, investigative, or case-related terminologyHigh attention to detail, discretion, and professional integrityPreferred ExperiencePrior experience working with sensitive case material or formal proceedingsRelevant translation or interpretation certifications Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356205466/",
    "job_id": "4356205466",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Admin & Compliance (Garments, Factory, Ashulia)- For Reputed Knit Garments Group of Company- Job ID: 1454624",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365046329/",
    "job_id": "4365046329",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Senior Consultant/ Assistant Manager - Risk Management",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366114239/",
    "job_id": "4366114239",
    "source": "linkedin",
    "company_name": "FWD Insurance",
    "job_title": "Senior Manager, ITOP Governance",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356370716/",
    "job_id": "4356370716",
    "source": "linkedin",
    "company_name": "DOHA BANK",
    "job_title": "Information Technology Business Partner",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366453140/",
    "job_id": "4366453140",
    "source": "linkedin",
    "company_name": "RCBC",
    "job_title": "Operations & Compliance Specialist",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366450169/",
    "job_id": "4366450169",
    "source": "linkedin",
    "company_name": "RCBC",
    "job_title": "Business Process and Governance Officer",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366444266/",
    "job_id": "4366444266",
    "source": "linkedin",
    "company_name": "RCBC",
    "job_title": "Business Risk and Compliance Officer",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366453137/",
    "job_id": "4366453137",
    "source": "linkedin",
    "company_name": "RCBC",
    "job_title": "Reserve Officer",
    "location": "Mandaluyong, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366704266/",
    "job_id": "4366704266",
    "source": "linkedin",
    "company_name": "the Hive Hong Kong",
    "job_title": "Assistant Finance Manager",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356490176/",
    "job_id": "4356490176",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "Audit Trainee Accountant (AGA Qualification) - JHB | CPT",
    "location": "Midrand, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionAt Deloitte, our Purpose is to make an impact that matters for our clients, our people, and society. This is the lens for which our global strategy is set. It unites Deloitte professionals across geographies, businesses, and skills. It makes us better at what we do and how we do it. It enables us to deliver on our promises to stakeholders, while creating the lasting impact we seek.Harnessing the talent of 450,000+ people located across more than 150 countries and territories, our size and scale puts us in a unique position to help change the world for the better—by bringing together the services we provide, the societal investments we make, and the collaborations we advance through our ecosystems.Deloitte offers career opportunities across Internal Client Services, Audit & Assurance (A&A), Tax & Legal (T&L) and our Consulting services business, which is made up of Strategy, Risk & Transactions Advisory (SR&T) and Technology & Transformation (T&T). Are you ready to apply your knowledge and background to exciting new challenges? From learning to leadership, this is your chance to take your career to the next level.Job DescriptionA trainee works under the guidance of a senior professional to perform statutory external audits in accordance with specific laws and rules, on financial statements of a company, government entity or organisation. This process includes evaluating a company's internal controls, policies and guidelines, and to ensure that such policies are adequate and functional. A trainee is also required to provide leadership and guidance to junior trainees on external audit engagements.QualificationsRelevant SAICA endorsed degree for the AGA QualificationAcademic performance:Evidence of high academic achievement Curiosity for learningFunctional Competencies:Ability to prioritiseExcellent communication skills across all mediumsNegotiation abilityIn-depth understanding of business operationsAbility to think strategically as well as understand the detailNetworking skillsHave strong analytical skillsHave strong business acumen skillsTechnical Competencies:Strong Leadership skillsExcellent computer literacyProject management skillsStrong numerical accuracy and attention to detailBehavioural Competencies:Highly influentialAbility to deal with pressureAbility to prioritise and multi-taskFlexibility and embracing of changeAbility to actively engage with people at all levelsStrong relationship building skillsFocused on client service and satisfactionAbility to work in a teamHigh level of energy and enthusiasmAdditional InformationNote: The list of tasks / duties and responsibilities contained in this document is not necessarily exhaustive. Deloitte may ask the employee to carry out additional duties or responsibilities, which may fall reasonably within the ambit of the role profile, depending on operational requirements.Be careful of Recruitment Scams: Fraudsters or employment scammers often pose as legitimate recruiters, employers, recruitment consultants or job placement firms, advertising false job opportunities through email, text messages and WhatsApp messages. They aim to cheat jobseekers out of money or to steal personal information.To help you look out for potential recruitment scams, here are some Red Flags:Upfront Payment Requests: Deloitte will never ask for any upfront payment for background checks, job training, or supplies. Requests for Personal Information: Be wary if you are asked for sensitive personal information, especially early in the recruitment process and without a clear need for it. Fraudulent links or contractual documents may require the provision of sensitive personal data or copy documents (e.g., government issued numbers or identity documents, passports or passport numbers, bank account statements or numbers, parent’s data) that may be used for identity fraud. Do not provide or send any of these documents or data. Please note we will never ask for photographs at any stage of the recruitment process.Unprofessional Communication: Scammers may communicate in an unprofessional manner. Their messages may be filled with poor grammar and spelling errors. The look and feel may not be consistent with the Deloitte corporate brand.If you're unsure, make direct contact with Deloitte using our official contact details. Be careful not to use any contact details provided in the suspicious job advertisement or email.At Deloitte, we want everyone to feel they can be themselves and to thrive at work—in every country, in everything we do, every day. We aim to create a workplace where everyone is treated fairly and with respect, including reasonable accommodation for persons with disabilities.We are committed to employment equity and building a diverse and inclusive workplace across the African continent. Our recruitment processes are aligned with our Employment Equity Plan and the principles of the Employment Equity Act. Preference may be given to candidates from designated grou",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366690831/",
    "job_id": "4366690831",
    "source": "linkedin",
    "company_name": "Beijing Foreign Enterprise Management Consultants Co.,Ltd.",
    "job_title": "[Huawei] Project Finance Controller",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356206952/",
    "job_id": "4356206952",
    "source": "linkedin",
    "company_name": "DP World",
    "job_title": "Assistant Branch Manager",
    "location": "Kempton Park, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367137307/",
    "job_id": "4367137307",
    "source": "linkedin",
    "company_name": "Jex Recruitment | Connecting top talent with leading companies",
    "job_title": "Group Finance Director",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366428666/",
    "job_id": "4366428666",
    "source": "linkedin",
    "company_name": "Liberty General Insurance Berhad",
    "job_title": "Executive- Financial Operations",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4271702124/",
    "job_id": "4271702124",
    "source": "linkedin",
    "company_name": "Eksim Holding",
    "job_title": "Bütçe ve Raporlama Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356320061/",
    "job_id": "4356320061",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Medical Assistant- For Confidence Infrastructure PLC- Job ID: 1454464",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Confidence Infrastructure PLC is looking for Medical AssistantJob Description / ResponsibilityTo provide first aid treatment and primary management of regular sick and emergency patient by taking necessary action as instructed by Medical officer.To provide primary management of different types of injuries i.e., cut injury, traumatic injury, burn injury, chemical injury etc. Should be capable of giving stitches, major dressings, minor sprain plaster as per requirement.To maintain various types of registrar (Both soft copy in medical software and hard copy) related to medical center and compliance.Assist to prepare monthly sickness reports, injury report, medicine issue report etc.To prepare monthly medicine requisition as per requirement.Must have to have computer literacy (Basic as well as Medical software management).Primary checking of medical bills for submission to Medical Officer.To keep record of medical expenses.To maintain the data of factory workers after any kind of Health care awareness program.To maintain all the medical equipment (In autoclave machine) by sterilizing regularly.To assist Medical Officer when required i.e., providing age verification and fitness certificate at the time of recruitment.To be capable of managing challenging occurrences in emergency injury cases very much sophisticatedly, confidently and smartly.Any other tasks assigned by Medical officer and Management.Educational Requirements4 years Diploma in Medical Faculty (Group - MATS) from recognized Institutions.Must have BMDC Registration number as Medical Assistant.Experience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):Telecommunication, Manufacturing (Light Engineering and Heavy Industry),IT Enabled Service, Engineering Firms, Group of Companies, Cement Industry,Steel,Battery, Storage cell,PowerAdditional RequirementsExcellent personal behavior.Self-motivated, time management skill; must possess the ability to work under pressure.Proficient in MS Office. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346544041/",
    "job_id": "4346544041",
    "source": "linkedin",
    "company_name": "Bupa Acıbadem Sigorta",
    "job_title": "Internal Control and Compliance Specialist",
    "location": "Maltepe, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321493488/",
    "job_id": "4321493488",
    "source": "linkedin",
    "company_name": "Thundersoft Vietnam",
    "job_title": "Project Manager (Japanese)",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366333942/",
    "job_id": "4366333942",
    "source": "linkedin",
    "company_name": "nextjobz",
    "job_title": "Business Analyst for (M/S Commander Soap Company Ltd.)",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366441143/",
    "job_id": "4366441143",
    "source": "linkedin",
    "company_name": "Etiqa Insurance and Takaful",
    "job_title": "Protégé FC Compliance",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365953208/",
    "job_id": "4365953208",
    "source": "linkedin",
    "company_name": "CrimsonLogic",
    "job_title": "Senior Accountant",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367826644/",
    "job_id": "4367826644",
    "source": "linkedin",
    "company_name": "KUWAIT JOBS HERE",
    "job_title": "We Are Hiring – HR & Payroll Professionals (Kuwait",
    "location": "Egaila, Ahmadi, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366683968/",
    "job_id": "4366683968",
    "source": "linkedin",
    "company_name": "The Esplanade Co Ltd",
    "job_title": "Assistant Manager, Learning & Development (2-yr contract)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are looking for an Assistant Manager, Learning & Development to support organisational learning and development initiatives. You will be instrumental in seeking innovative ways to enhance employees’ learning experiences, managing the end-to-end L&D programme lifecycle at a company-wide level, ensuring staff have the skills to perform effectively and achieve their full potential.You must be able to deliver and support industry skills development and Continuing Education and Training (CET) initiatives in the performing arts. You will work closely with the Assistant Head, Human Resources, and the departments ensuring exceptional service to staff and reflecting our organisational values.KEY RESPONSIBILITIESPlan, coordinate and deliver L&D Programmes for Staff including conducting Learning Needs Analysis to identify training priorities.Support the Assistant Head, HR in developing and implementing the Total Company Training Plan.Design, develop, implement, and facilitate in-house programmes, incorporating blended learning approaches.Source and assess external learning solutions, including exchanges and learning journeys. Evaluate programme effectiveness and recommend improvements.Administer and coordinate in-house and external training programmes.Maximise training funds by identifying and applying for applicable grants in a timely manner.Ensure submission of enterprise grants and claims, ensuring accuracy and compliance with funding guidelines.Maintain accurate training records and ensure timely reporting of relevant data using existing platforms.Ensure compliance with organisational processes, procurement requirements, and audit standards.Assist to review requests for learning journeys, coordinate and obtain approval to facilitate the learning journeys.JOB REQUIREMENTSA recognised university degree or diploma in Human Resources/Learning & Development.Relevant adult learning certifications (e.g., ACLP/ACTA, DACE/DDDLP) will be an advantage.Able to effectively facilitate learning and development initiatives.At least 4 years of relevant working experienceStrong interpersonal and communication skills.Ability to effectively work with internal and external stakeholders.Commitment to supporting and promoting organisational values through learning initiatives.Salary range: $4,300 - $5,000If you are excited about this opportunity and meet the requirements, we would love to hear from you. Please submit your resume to hr@esplanade.com, including details of your experience and an indication of your current and expected salary.Thank you for your interest in the Esplanade – only shortlisted candidates will be notified. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366964860/",
    "job_id": "4366964860",
    "source": "linkedin",
    "company_name": "EPOS",
    "job_title": "Admin Executive",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365551929/",
    "job_id": "4365551929",
    "source": "linkedin",
    "company_name": "Praca.pl",
    "job_title": "Specjalista / Specjalistka ds. Wsparcia Zarządu",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Opis stanowiskaprzygotowywanie materiałów prezentacyjnych oraz bieżącej komunikacji wewnętrznej,organizacja i obsługa spotkań kadry zarządzającej, w tym sporządzanie podsumowań i notatek,koordynacja obiegu dokumentów oraz nadzór nad ich poprawnością,udział w działaniach wspierających wizerunek pracodawcy oraz komunikację w kanałach wewnętrznych,wsparcie projektów administracyjnych oraz współpracy pomiędzy zespołami,bieżąca pomoc w funkcjonowaniu biura i realizacji zadań operacyjnych.Wymaganiadoświadczenie na stanowisku asystenckim lub administracyjnym w środowisku międzynarodowym,swobodna komunikacja w języku angielskim w mowie i piśmie,dobra znajomość narzędzi biurowych, w szczególności pakietu MS Office,umiejętność organizowania pracy własnej oraz efektywnej współpracy z zespołem.Oferujemystabilną formę współpracy w oparciu o umowę o pracę lub zlecenie,narzędzia niezbędne do wykonywania powierzonych zadań,możliwość rozwoju zawodowego w międzynarodowym środowisku,dostęp do benefitów pozapłacowych, w tym opieki medycznej i karty sportowej,programy wsparcia i konsultacje specjalistyczne z różnych obszarów.Informacje Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366452070/",
    "job_id": "4366452070",
    "source": "linkedin",
    "company_name": "MOH Holdings (Singapore)",
    "job_title": "Assistant Manager, Central Treasury",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "ORGANISATION / DIVISION INFORMATION As the holding company of Singapore’s public healthcare institutions, we are always looking for qualified, passionate individuals who are keen to make a valuable contribution to public healthcare. At MOH Holdings, we believe our employees are our greatest asset and we are dedicated in helping them achieve their full potential through professional development and by providing an environment to develop their leadership skills and competencies.The Finance Division ensures the financial accountability and sustainability of the company, projects and initiatives.Join us and be part of a team - a uniquely MOHH spirit that propels us forward through every circumstance we face.Acting Today for Tomorrow: We work pragmatically with the realities of the present, with a mindset that is geared to the needs of the future.Starting Where You Can: We take a can-do approach to problem-solving, even if it means starting small, because every contribution counts.Leaving No Job Undone: We take pride in seeing things through. Our high standards means it’s not just about getting the job done, but getting it done well.Moving Together as One: Care for all starts within, with us as an organisation. We look out for one another, leaving no on behind as we grow.SUMMARY OF THE ROLE Member of the Central Treasury team supporting the CFO, EXCO, and Investment Committee “IC” for cash management and treasury investment of the Group’s funds.JOB RESPONSIBILITIES1) Assist with monitoring the compliance and performance of investment mandates awarded to external fund managers.Retrieve relevant information from Bloomberg, bank portal and external fund managers.Prepare relevant Microsoft Excel tables, charts, reports and slides.Prepare investment compliance and returns analysis reports.Check the accuracy of the financial statements and journal entries prepared by the Financial Control & Reporting team.Prepare financial schedules required by auditors.2) Assist with market surveillance and researching on information relating to the performance of asset classes and reasons for that performance.Prepare daily morning news update and market surveillance and weekly update on portfolio performance and market summary.Research on relevant information from Bloomberg and other sources e.g. fund managers.Prepare relevant Microsoft Excel tables, charts, reports and slides.3) Assist to review the credit quality of counterparty financial institutions and corporate bond issuers.Retrieve relevant information from annual reports, credit rating agencies and Bloomberg.Prepare relevant Microsoft Excel tables, charts, reports and slides.4) Assist on matters relating to long-term portfolio, including subscription / redemption of unit trusts and segregated mandate, and return distribution for the long-term portfolio.Prepare Forms in relation to subscription/redemption of the unit trust and segregated mandate. Prepare relevant Microsoft Excel tables for return distribution.Input subscription/redemption and return distribution transactions into TMS and file relevant documents.5) Assist to set up process flows for new fund managers and custodians.Design and document operational process flows to manage fund inflows/outflows, protocols to be used, data feeds for accounting or other purposes for new fund managers and custodians.6) Back up other members of the Central Treasury team for treasury operations.Input intercompany and account transfer transactions into TMS, SAP In-House Cash module and bank portals. Prepare and file relevant documents.Monitor bank balances, and settlement of transactions with bank counterparties and subsidiaries.On-the-job training with a view on succession planning, to take on more responsibilities and senior position in the team.7) Assist in executing new projects or initiatives to improve treasury and investment management of the Group.Assist in drafting meeting minutes and preparing project meeting materials and liaising.Assist in testing new IT systems and bank solutions.JOB REQUIREMENTS:Education Requirement(s):Tertiary Accountancy or Finance qualifications.Other requirements / qualities:Good grasp of financial markets, cash management, financial and operational risk management and treasury accounting.Demonstrated ability to work in a small collaborative team environment.Good communication skills.Strong quantitative and analytical skills.Meticulous, accurate and timely.Have strong work ethics and workplace etiquette.Highly proficient in Microsoft Office applications.Chartered Financial Analyst qualifications, Chartered Accountant qualifications, proficiency in Treasury Management Systems and SAP ERP Systems would be advantageous.Years of Experience Required:At least 3 to 5 years of full-time work experience in in auditing, accounting, fund management, banking and finance or treasury operations. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366724829/",
    "job_id": "4366724829",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Treasury Manager (Transportation)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "This role is responsible for supporting day‑to‑day financial operations with a strong focus on cash management, payments, and liquidity in a fast‑paced marine offshore environment. The position provides hands‑on exposure to treasury, banking, and operational finance, working closely with the CFO and wider finance team.Client DetailsOur client is a global provider of marine transportation services. Amid continued business growth, the organisation is seeking a collaborative and experienced finance professional to support and strengthen its expanding finance and treasury function.DescriptionSupport daily cash and liquidity management to ensure smooth business operationsOversee payment processes, including vendor payments and operational disbursementsAssist with cash flow forecasting (short‑ and medium‑term) to support funding decisionsLiaise with banks and financial institutions on routine banking mattersSupport accounts payable activities with a focus on control, accuracy, and timely executionAssist in monitoring debt facilities and banking documentationMaintain strong internal controls and support audit requirementsWork closely with accounting, operations, and management teams on finance‑related mattersProfileBachelor's degree in Accounting, Finance, or a related discipline5-8+ years of experience in accounting, treasury, or finance rolesPrior exposure to marine, offshore, shipping, oil & gas, or asset‑heavy industries is highly advantageousStrong understanding of cash flow, payments, and financial controlsDetail‑oriented with a hands‑on and proactive mindsetComfortable operating in a fast‑paced and operationally driven environmentStrong communication skills and ability to work collaboratively across teamsJob OfferCompetitive salary and benefits packageHands‑on exposure to treasury and cash management in a global businessStrong learning and development opportunities with career growth potentialHigh visibility role with close interaction with senior finance leadershipTo apply online please click the 'Apply' button. For a confidential discussion about this role please contact Swee Kee Chu (Lic No: R21103443/EA No.: 18C9065) on +65 6416 9889. © Michael Page International Pte Limited, company number 199804751N (including Page Executive (53295516A) and Page Personnel Recruitment Pte Ltd (Registration Number: 201736642C)) operates under the EA Licence Numbers of 18S9099 and 18C9065. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366427842/",
    "job_id": "4366427842",
    "source": "linkedin",
    "company_name": "MUFG",
    "job_title": "Vice President, Securitization Finance",
    "location": "Marina South, Central Singapore Community Development Council, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366713277/",
    "job_id": "4366713277",
    "source": "linkedin",
    "company_name": "Adecco",
    "job_title": "CFO - Confidential",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366713423/",
    "job_id": "4366713423",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Internal Audit and Risk Support Officer",
    "location": "Kuwait City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Role Overview:Internal Audit and Risk Officer will play a pivotal role in supporting the Group’s internal audit and risk function. The role involves conducting internal audits, maintaining and monitoring risk registers, supporting governance initiatives and ensure portfolio companies adherence to internal policies and procedures.Key Responsibilities:Assist in preparing audit work plans, performing risk assessments, and executing fieldwork in line with IIA Standards.Review and evaluate internal controls, operational processes, and governance frameworks; draft actionable recommendations for improvement.Prepare audit working papers, draft reports, and support follow-up on audit findings.Maintain and update risk registers; monitor key risks and provide timely reporting on emerging issues.Support governance initiatives, including managing audit reports, risk registers, and policy documentation.Conduct ad hoc reviews, investigations, and projects aimed at enhancing internal audit and governance effectiveness.Collaborate with business units to ensure compliance with internal policies, procedures, and governance standards.Ad hoc Reviews and Investigations:Conduct special audits, investigations and reviews as requested.Identify systemic control weaknesses and recommend corrective actions to enhance risk management and governance practices.Skills & Competencies:Strong understanding of internal audit principles, risk management and corporate governance.Experience in maintaining and monitoring risk registers and tracking key risk indicators.Strong analytical, report-writing and communication skills.Demonstrate commercial sensibility respecting that business decisions are the purview of the portfolio companies’ management.Proactive, detail oriented, and capable of working collaboratively with multiple stakeholders.Ability to operate systems or modules that support internal audit, risk and governance functions.Ability to identify issues, formulate opinions, make conclusions and recommend solutions. Ability to work independently; commitment to continuous learning and willingness to keep up to date on new developments in the audit field. Working knowledge of IT systems and standard MS office products. Ability to write in a clear and concise manner and to communicate effectively orally.Good interpersonal skills and the ability to work in a multi-cultural, multi-ethnic environment with sensitivity and respect for diversity. Ability to develop and maintain effective working relationships with officials at all levels. Qualifications:University degree (or equivalent) in business administration, accounting (or related field).Experience: A minimum of two years’ experience in internal auditing and risk management or a closely related field is highly desirable. Experience in private sector administration or internal auditing is an advantage. Past experience in store audits/reviews is an advantage.Proficiency in reading Arabic required. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284790469/",
    "job_id": "4284790469",
    "source": "linkedin",
    "company_name": "Virtusa",
    "job_title": "C#.Net Lead",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364269971/",
    "job_id": "4364269971",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Regional Finance Director - Merchant Services Europe",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356153801/",
    "job_id": "4356153801",
    "source": "linkedin",
    "company_name": "iSTYLE Hungary",
    "job_title": "Chief Accountant",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366679994/",
    "job_id": "4366679994",
    "source": "linkedin",
    "company_name": "INTI NYA GROUP",
    "job_title": "Supervisor Finance, Accounting, Tax",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Bidang Usaha: Jasa & Layanan Gaya HidupMenyediakan layanan berbasis pengalaman pelanggan, seperti jasa photobox dan layanan pendukung lainnya. PT Inti Nya Retail mengedepankan kreativitas, kenyamanan, dan kepuasan pelanggan dalam setiap layanan yang diberikan.Lokasi Kerja : Jakarta UtaraJam Kerja : Senin – Jumat (10.00 - 18.00), Sabtu (10.00 - 15.00)Jobdesc:-Mengelola dan memantau kinerja keuangan, termasuk analisis data serta pemberian rekomendasi strategis untuk meningkatkan profitabilitas.-Menyusun, memelihara, dan menyajikan laporan keuangan, anggaran, prakiraan, serta laporan audit kepada manajemen eksekutif.-Mengelola arus kas, memastikan likuiditas, serta mengawasi kewajiban perpajakan dan proses pelaporannya.-Memastikan kepatuhan terhadap hukum dan peraturan serta membangun hubungan dengan lembaga dan penasihat keuangan eksternal.Kualifikasi:-Pendidikan Min. D3/S1-Pengalaman min. 1 tahun di bidang Finance, Accounting, dan Tax-Paham menggunakan software akuntansi-Memiliki kemampuan komunikasi dan memimpin yang baik-Mampu bekerja di bawah tekanan dan berorientasi pada target Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356225457/",
    "job_id": "4356225457",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Visa Consultancy Officer - (For NPT) - Job ID - 1454332",
    "location": "Badda Thana, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366704768/",
    "job_id": "4366704768",
    "source": "linkedin",
    "company_name": "HSBC",
    "job_title": "Client Relationship Support Associate",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "HSBC Corporate and Institutional Banking is a markets-led, financing-focused business that provides investment and financial solutions. Corporate Banking provides international financial services solutions that support businesses ranging from mid-market enterprises to large corporates across industries and sectors. Leveraging the strength, scope, and expertise of our global product network, Corporate Banking is positioned as an essential partner to firms seeking to maximise their potential internationally, offering streamlined business access to HSBC’s international network and broad range of market leading banking products and services.We are currently seeking an ambitious individual to join this team in the role of Client Relationship Support Associate.Principal Accountabilities Provide full operational support to the team, as required, anticipating workload and supporting with appropriate materials Ensure timely and accurate maintenance of customer information in Group systems Liaise and work with other Corporate/CIB teams to develop the best possible experience and outcomes for both the customers, employees and the Bank Adhere to HSBC policy, procedures and control requirements applicable to day-to-day working, exceptional and project activities, and raise any concerns about actual or potential issues promptly, in line with reporting and escalation procedures Take personal responsibility for understanding and agreeing performance expectations, completing the necessary mandatory training and developing the levels of capability and competence needed to be effective in the role Support achievement of the HSBC vision, Values, goals and culture in personal behavior, actions and decision making Experience, Skills And Qualifications Bachelor’s degree from a public/private university Experience in banking operations particularly in Wholesale banking, credit or risk Sound knowledge of trade services, treasury, and investment banking products, local regulations and exposure to corporate banking industry is crucial Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361824146/",
    "job_id": "4361824146",
    "source": "linkedin",
    "company_name": "FF Co. Ltd.",
    "job_title": "Financial Analyst",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351799821/",
    "job_id": "4351799821",
    "source": "linkedin",
    "company_name": "PT Megatama Global Transportasi (J&T Cargo)",
    "job_title": "AR AP Staff",
    "location": "Jakarta Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293887113/",
    "job_id": "4293887113",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Best Practicify নিয়োগ",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321263742/",
    "job_id": "4321263742",
    "source": "linkedin",
    "company_name": "Eskimi",
    "job_title": "Media Buyer (Roigen)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About UsRoigen is a leading performance marketing solution and a spin-off from Eskimi. We help ambitious brands scale their acquisition and brand campaigns in competitive markets using ROI-driven paid advertising, powered by AI and advanced buying technologies.YOUR TEAM & YOUR MISSIONWe are seeking a Senior AdOps / Media Buyer to manage, execute, and optimize digital campaigns across programmatic and key performance channels. This hybrid role blends traditional ad operations with hands-on media buying, ensuring campaigns are efficiently launched, optimized, and deliver measurable results.What You’ll DoCampaign Management & Optimization (≈60%) Plan, execute, and optimize campaigns on programmatic platforms (StackAdapt, Quantcast, Eskimi DSP) and key performance marketing channels (PPC, Social Media Acquisition & DR, SEM, Ad networks….) Manage digital ad inventory and ensure campaigns run smoothly with maximum efficiency and quality. Implement daily campaign processes, troubleshoot delivery or ad-serving issues, and coordinate with internal teams (Sales, Tech, Creative) to align optimizations with client KPIs. Develop and execute audience segmentation, bid strategies, and creative testing to drive performance. Ensure server-to-server (S2S) tracking and proper pixel/tag setups for accurate attribution. Stay updated on paid media best practices, platform updates, and emerging technologies.Analytics & Reporting (≈25%) Monitor, analyze, and report campaign performance metrics (CTR, CPC, CPA, ROAS, etc.) to internal stakeholders and clients. Prepare actionable insights and performance summaries for continuous improvement. Leverage analytics tools (Google Analytics, Meta Ads Manager, Tag Manager, Eskimi/StackAdapt reporting) to measure campaign impact.Other Responsibilities (≈15%) Support data entry, analysis, and technical QA (pixel setup, tag implementation). Collaborate with Sales on campaign planning, forecasting, and media recommendations. Work closely with Creative and Strategy teams to develop and test performance-driven creatives.What Will Help You Do It Proven experience managing campaigns across programmatic and key performance marketing channels (Meta, TikTok, Google Ads, Snapchat, X…). Strong analytical mindset, curiosity, and a problem-solving approach to drive optimizations. Understanding of digital media metrics (CPM, CPC, CPA, CTR, ROAS, etc.) and S2S tracking. Proficiency with analytics and tracking tools (Google Analytics, Tag Manager, Pixels). Exceptional attention to detail, organization, and the ability to work independently in a fast-paced environment. Strong learner and challenger—willingness to question assumptions and experiment. Experience working in international business contexts to navigate cultural differences effectively.What’s In It For YouFlexible work arrangements: Hybrid work models in cities with physical offices, and remote work options everywhere else. With our hybrid model, Eskimians enjoy Work Away Days—up to one month of fully remote work each year—and flexible schedules, typically beginning the day at 9 a.m. locally.Professional development opportunities: Grow with programs like Leaders Assembly for managers, mentorship programs for growing talents, regular learning sessions, and access to external consultants. Our internship programs also serve as stepping stones for career starters, often leading to full-time roles within the team.Recognition & rewards: Your efforts matter, so we reward contributions with bonus programs and Bonusly, our peer-to-peer recognition system that turns appreciation into points for gifts and vouchers.Additional perks: Private health insurance (location-dependent), volunteer days, and team get-togethers both online and in-person to foster meaningful connections in Eskimi.Take a day off to celebrate your birthday! Everyone deserves to unwind and enjoy their special day, so we provide an extra day off just for your birthday.JOIN US!Be a part of a fast-growing adtech company and work with products that change the landscape of digital advertising around the globe. Let's grow together! With us, not even the sky's the limit. Apply or reach out to ieva@eskimi.com and let’s chat. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366475056/",
    "job_id": "4366475056",
    "source": "linkedin",
    "company_name": "OneDayOnly.co.za",
    "job_title": "Financial Accountant",
    "location": "City of Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About UsStep into the wild world of OneDayOnly – South Africa's OG daily deals hub. We're the pioneers of cool discounts, hitting you for just one day because, well, why overcomplicate things? We've got the big names, top suppliers, and a dash of our secret sauce to make you feel like a BIG DEAL. Not to brag, but we have over a million potential savvy shoppers getting our daily dose every 24 hours.We're not fussy – if the price is right and the quality checks out, we're selling it. That's what makes us the go-to for both the smart buyer and the eager seller. Toss in the urgency of our deals, and boom, success happens quicker than you can blink. So, jump in, where FOMO meets killer deals, and let's turn every day into aAbout YouYou’re the kind of person who finds actual joy in a perfectly balanced reconciliation and gets a little thrill when Excel formulas behave themselves. Numbers are your love language, and you pride yourself on spotting a R0.01 discrepancy from a mile away. You’re organised, detail-obsessed (in a healthy way), and you believe deadlines are not suggestions.While you take accuracy and integrity seriously, you don’t take yourself too seriously - you’re just as comfortable cracking a joke as you are cracking the books. You thrive in a fast-paced environment, enjoy solving financial puzzles, and love being the calm, reliable human behind the scenes making sure everything adds up at OneDayOnly.ResponsibilitiesCreditor and Debtor reconciliationsInvoicing Customers and SuppliersOther daily reconciliationsDaily supplier paymentsCapturing and reconciling Cash BooksMaintaining the Fixed Asset registerMonitoring Voucher FraudAssisting with drawing up monthly Management AccountsAssisting with drawing up AFSAd hoc admin dutiesAssisting the Financial Manager and Head of FinanceExperience and SkillsB. Com (Financial Accounting) or similar degree3 years’ experience in a similar position (or completed articles)Excellent communication skills in English and AfrikaansStrong affiliation to systems, and accuracy within the administration systemsStrong knowledge of Microsoft ExcelMust love figures and enjoy reconciliationsValuesChallenge Accepted: We own our numbers, keep financial operations accurate, and make the numbers count, delivering clarity, precision, and timeliness so the business can win with confidence.Solve Smart: We identify opportunities to improve processes, solve problems efficiently, and ensure financial operations run smoothly and effectively.Character Counts: We act with honesty, integrity, and transparency in every transaction, decision, and interaction, building trust across the company.Customer Obsessed: We treat suppliers and internal teams as our customers, providing clear and timely support to help business processes run smoothly.Seriously Unserious: We focus on getting the numbers right while keeping the team environment positive and approachable. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366367337/",
    "job_id": "4366367337",
    "source": "linkedin",
    "company_name": "Adecco",
    "job_title": "Senior Accountant",
    "location": "Bucharest Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357741875/",
    "job_id": "4357741875",
    "source": "linkedin",
    "company_name": "ManpowerGroup",
    "job_title": "Account Manager",
    "location": "Casablanca Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354933758/",
    "job_id": "4354933758",
    "source": "linkedin",
    "company_name": "HELL ENERGY",
    "job_title": "Key Account Manager",
    "location": "Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363080155/",
    "job_id": "4363080155",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "PAC Business Development Head - For Practical Action - Bangladesh. - Job ID: 1458213",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361177182/",
    "job_id": "4361177182",
    "source": "linkedin",
    "company_name": "Activate Games",
    "job_title": "Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362490792/",
    "job_id": "4362490792",
    "source": "linkedin",
    "company_name": "FDM Group",
    "job_title": "Payroll Administrator",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323195107/",
    "job_id": "4323195107",
    "source": "linkedin",
    "company_name": "ExaCare AI",
    "job_title": "Vice President of Finance",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company OverviewWe are a trailblazing health tech company on a mission to revolutionize the nursing home & post acute space. Our innovative AI software is transforming the admissions process and care delivery in these settings. We’ve just raised $30M and are experiencing rapid growth. We are looking for a VP of Finance to join our growing team.About the RoleAs ExaCare’s VP of Finance, you will be responsible for leading all accounting and financial planning and analysis functions, driving strategic financial decisions, and ensuring robust financial health to support our rapid growth. You will ensure financial rigor, forecast accuracy, compliance, and excellent financial health so ExaCare can scale responsibly, raise capital, meet investor expectations, and drive profitable growth. You will balance being hands-on in accounting and operations with strategic financial planning and stakeholder management.What you’ll doStrategic Financial Leadership Partner with the executive team, and Board on financial strategy, fundraising, capital allocation, and long-term planning.Build models, run scenario planning (growth, cost, cash burn, runway).Define and monitor key metrics (SaaS-focused: MRR/ARR growth, churn, LTV/CAC, net retention, burn multiple, sales efficiency, etc.).FP&A, Forecasting & Budgeting Lead all aspects of financial planning and analysis, including budgeting, forecasting, long-range planning, and financial modeling to support strategic initiatives and while balancing operational goals.Establish and lead the annual & quarterly budgeting process; coordinate budgets across departments.Build rolling forecasts, track variances, perform root cause analysis.Provide financial insight for hiring and investment decisions. Accounting, Compliance & ReportingOversee accounting operations: monthly close, AR/AP, revenue recognition (ASC 606), payroll, expense management. Ensure compliance with accounting standards, tax, audit, regulatory matters.Prepare internal management reporting, investor / Board decks. Maintain “audit readiness” for external audits.Operational Excellence Managing and optimizing cash flow, working capital, and capital expenditures to ensure the company’s financial stability and maximize returns. Manage relationships with banks, lenders, accountants.Select, implement, and optimize financial systems (ERP, billing / revenue recognition, forecasting tools). Build scalable processes and controls to enable growth. Oversee finance operations: invoicing, collections, payment terms, vendor contracts.Fundraising and Investor RelationsLead debt or equity fundraises. Own financial narrative, data room, and term-sheet modeling for growth equity, PE, and prospective public investors. Leading audit and due diligence efforts and financial integration for potential mergers, acquisitions, or strategic partnerships, if applicable.Team Building & LeadershipCollaborating cross-functionally with all departments to understand their financial needs, support their growth initiatives, and ensure financial discipline throughout the organization.Recruit, mentor, and scale the finance team (Accounting, FP&A, operations, RevOps if under Finance). Foster a culture of ownership, transparency, accountability.What You’ll Bring7+ years of progressive experience in finance Strong FP&A toolkit: budgeting, forecasting, scenario modeling, and partnering with leaders on headcount and investment decisions.Solid accounting foundation with mastery of SaaS revenue recognition (ASC 606), monthly close, cash management, and audit/tax support.Deep familiarity with SaaS metrics (ARR/MRR, net retention, LTV/CAC, burn multiple, sales efficiency) and using them to drive decisions.Proven experience owning board and investor reporting, fundraising support (equity and/or debt), and working directly with executives and directors.Track record of building and leading lean, high-performing finance teams in fast-paced startup environments.Systems and process builder: comfortable selecting and implementing tools (ERP, billing, FP&A/BI) and designing scalable, lightweight processes.Benefits and perksCompetitive salary and equity in a high-growth startupFlexible PTO, take what you needMedical, dental, and vision coverageGreat startup culture, including ChatGPT premium and company off-sitesHigh-achieving team, including ex-Amazon engineers and alumni of Bain, BCG, and Goldman Sachs",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371872959/",
    "job_id": "4371872959",
    "source": "linkedin",
    "company_name": "BENU Bulgaria",
    "job_title": "SENIOR ACCOUNTANT",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BENU is one of the largest pharmaceutical chains in Europe, present in 17 countries, and a market leader in several of them. It serves an average of around 200 million patients each year and enjoys strong brand recognition and trust.BENU entered the Bulgarian market in 2022 with the mission to set a European standard in patient service and healthcare for the Bulgarian population. BENU’s goal is to always be close by as a trusted health expert for the whole family, offering professional advice, consultation and reliable guidance.As part of the expansion of our team, we are looking for an experienced and motivated SENIOR ACCOUNTANT to join our Accounting Department.Key Responsibilities:Overseeing accounting records, revenues, and expenses with a focus on tax compliance.Monitoring account balances and ensuring the accuracy of financial data.Preparing and submitting VAT returns.Accounting for fixed assets and leases in accordance with IFRS 16.Participating in the preparation of tax declarations and annual financial statements.Communicating with tax authorities and auditors, including preparation for tax audits.Supporting the Chief Accountant to ensure timely and accurate monthly, quarterly, and annual closings.Requirements:Minimum 3 years of experience in a similar role;University degree in Accounting and/or Finance;Good knowledge of IFRS and Bulgarian tax legislation;Experience with SAP is an advantage;Prior experience in retail is an advantageProficiency in Microsoft Office, especially Excel;Good command of English is a plus.Ideal Candidate Profile:Takes personal responsibility for results;Detail-oriented and analytical;Well-organized with strong prioritization skills;Willing to participate in various projects;Team player with strong collaboration skills.The company offers: Work in a well-established multinational company with a strong entrepreneurial culture;A chance for real development and long-term career opportunities;Modern and dynamic business environment;Attractive remuneration package;Additional health insurance package, including extensive medical and dental care;200 BGN food vouchers;Sports cards at discounted price;Corporate discounts on products and services;Gifts for special occasions;Hybrid workplace;Family benefits program.If you are interested in joining our company and meet the requirements for this position, please send us your CV.Only shortlisted candidates will be contacted.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372303398/",
    "job_id": "4372303398",
    "source": "linkedin",
    "company_name": "BRAC",
    "job_title": "Deputy Manager, Financial Planning & Analysis, Otithi",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Location: Head Office, Dhaka, BangladeshLast Date of Application: February 25, 2026BRAC is an international development organization founded in Bangladesh in 1972 that partners globally with over 100 million people living with inequality and poverty to create opportunities to realise their potential.Working at BRAC is not like any other job. It is a platform where you can bring about real change for people who need it the most. We are not just dreaming of a better world, we are building it with our partners. Join us to find the way.We are looking for a purpose-driven professional with strong analytical skills to join as a Deputy Manager, Financial Planning & Analysis who will support BRAC-Otithi, in transforming tourism in Bangladesh by ensuring the financial viability and profitability of its tourism offerings. This position will be responsible for conducting comprehensive cost analyses and developing competitive pricing strategies while working closely with the Finance Head to optimize revenue streams. The role also contributes to sustaining BRAC-Otithi’s mission of connecting urban generations with rural communities and promoting sustainable tourism by supporting financially sound and well-priced tour offerings for both local and foreign travellers.Key Responsibilities:Conduct in-depth analysis of all tour costs, including transportation, accommodation, meals, guide services, entry fees, and other relevant expenses.Develop and maintain accurate cost models for various tour packages by considering seasonality, group size, and local market conditions.Analyze and compare costs across different tour options to identify opportunities for cost optimization and efficiency improvements.Conduct market research to understand competitive pricing in the tourism industry and identify target market segments.Develop and implement pricing strategies for tour packages that are competitive, profitable, and attractive to the target audience.Analyze pricing data and market trends to identify opportunities for price adjustments and revenue maximization.Prepare regular financial reports on tour profitability, including revenue, cost of goods sold, gross profit, and other key performance indicators.Analyze financial data to identify trends, assess the impact of pricing decisions, and provide insights for business improvement.Collaborate with the Finance Head to ensure accurate financial reporting and compliance with all relevant accounting standards.Additional Job Requirements:The role requires strong analytical and problem-solving skills with the ability to analyze complex data, ensure data accuracy, and prepare comprehensive cost models and financial reports. A strong understanding of financial accounting principles and proficiency in Microsoft Excel and other financial software are essential to support budgeting, pricing, and forecasting in a dynamic environment. Effective communication and interpersonal skills are required to convey financial information clearly, support cross-functional collaboration, and contribute to client management and key business decisions.Safeguarding Responsibilities:Ensure the safety of Programme Participants, people who come into contact with the organization and team members from any harm, abuse, neglect, harassment and exploitation including sexual exploitation and abuse (SEA) to achieve the programme's goals of safeguarding implementation. Act as a key source of support, guidance and expertise on safeguarding for establishing a safe working environment.Practice, promote and endorse the issues of safeguarding policy among team members and ensure the implementation of safeguarding standards in every course of action.Follow the safeguarding reporting procedure in case any reportable incident takes place and encourage others to do so.Educational Requirements:Graduation in Finance, Accounting, Economics, or a related field from any reputed university.Experience Requirements:Minimum 3 years of experience in the relevant field. Other Benefits:Festival Bonus, Contributory Provident Fund, Gratuity, Health and Life Insurance, Maternity/ Paternity Leave, Wellness Centre Facility, Day Care Facility and others as per policy.If you feel you are the right match for this position, apply through LinkedIn or send your CV to resume@brac.net stating the position title in subject line by February 25, 2026.This position is open for Bangladeshi nationals only.BRAC believes that everyone we work with—including our staff, programme participants, partners, and the communities we serve—has the right to be protected from all forms of harm, abuse, neglect, harassment, and exploitation, including sexual exploitation and abuse.We uphold human dignity and inclusion for all, regardless of race, religion, gender, disability, ethnic origin, or socio-economic background. We are an equal opportunity employer. We especially encourage those who have shown resilience—who have faced personal struggles, bounced back, and continued t",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364514349/",
    "job_id": "4364514349",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Branch Manager (BM) - (For Palli Mongal Karmosuchi (PMK)) - Job ID - 1458367",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371169792/",
    "job_id": "4371169792",
    "source": "linkedin",
    "company_name": "NielsenIQ",
    "job_title": "Market Data Analyst",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "NIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. Job DescriptionKey Responsibilities:Data Processing & AnalysisAnalyze structured and unstructured data to support business operations and decision-makingMonitor and validate data completeness, accuracy, and consistency using BI tools and SQL. Investigate anomalies and resolve data quality issues in collaboration with local and global teamsClient & Stakeholder SupportRespond to client and internal queries with accurate and timely feedbackAttend daily stand-ups to track progress, report blockers, and align with team prioritiesEnsure deliverables are met on time and aligned with client expectations and internal KPIsAutomation & Process ImprovementIdentify and participate in initiatives to automate repetitive tasksContribute to process documentation, QA dashboards, and internal tooling enhancementsSupport strategic projects aimed at improving operational workflowsCross-Functional CollaborationCommunicate and coordinate with product managers, analysts, technical and business teamsTake ownership of sub-projects and drive task execution across global teamsMaintain clear operational documentation and SOPsQualificationsWhat We’re Looking For:2-3 years of experience in data operations, analytics, or a related fieldSolid SQL skillsProven experience with data visualization tools (e.g., Tableau, Looker, Power BI)Strong analytical mindset and attention to detailGreat communication skills and attention to detail (crucial when working with data that people rely on to make decisions). Fluency in English (written and spoken)Ability to work independently and manage multiple prioritiesBusiness-driven mindsetNice to Have:Knowledge of e-commerce data and industry trends. Exposure to agile workflows or data product development. Additional InformationBenefits:Food vouchers € 62. Additional Medical Insurance, incl Prophylactics, Outpatient care, Inpatient care, еxpenses for medications and medical products. Life Insurance. Multisport card (self-funded by the employee). A Hybrid model of working: 3 days of the week you work from home (home office), 2 days from the office. Additional paid leave of 3 days in case of no overdue leave days from previous year. Free access to LinkedIn Learning platform. In addition:Flexible working hours and home officeEco friendly travelers are welcome to the office – parking places for bikersSofia office is located close to the city centre and easily accessible from any point by public transportationOur BenefitsFlexible working environmentVolunteer time offLinkedIn LearningEmployee-Assistance-Program (EAP)NIQ may utilize artificial intelligence (AI) tools at various stages of the recruitment process, including résumé screening, candidate assessments, interview scheduling, job matching, communication support, and certain administrative tasks that help streamline workflows. These tools are intended to improve efficiency and support fair and consistent evaluation based on job-related criteria. All use of AI is governed by NIQ’s principles of fairness, transparency, human oversight, and inclusion. Final hiring decisions are made exclusively by humans. NIQ regularly reviews its AI tools to help mitigate bias and ensure compliance with applicable laws and regulations. If you have questions, require accommodations, or wish to request human review were permitted by law, please contact your local HR representative. For more information, please visit NIQ’s AI Safety Policies and Guiding Principles: https://www.nielseniq.com/global/en/ai-safety-policies. About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. NIQ is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population.For more information, visit NIQ.comWant to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionAt NIQ, we are steadfast in our commitment to fostering an inclusive workplace that mirrors the rich diversity of the communities and markets we serve. We believe that embracing a wide range of perspectives drives innovation and excellence. All employment decisions at NIQ are m",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359058918/",
    "job_id": "4359058918",
    "source": "linkedin",
    "company_name": "Senior Persons Living Connected",
    "job_title": "Accounting Manager (Full-Time)",
    "location": "Scarborough, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Mission Statement: Understand the aspirations of seniors and respond with innovative supports.Vision Statement: Building inclusive communities where all seniors are connected to living their best possible life.Why Work With UsAt Senior Persons Living Connected (SPLC), your work makes a real difference in our communities. Our mission is to understand the aspirations of seniors and respond with innovative support so seniors can live their best possible life.We offer a supportive and inclusive workplace that values collaboration, professional growth, and work-life balance. By joining SPLC, you’ll work alongside passionate professionals, contribute to meaningful programs and services, and be part of an organization committed to positive social impact.What To Expect When You Join SPLCCompetitive compensation and Benefits, including group health and pension for eligible positions. Rewarding career that supports meaningful work in our communities. Ongoing training and professional Development opportunities. Healthy and safe working environment. Position: Accounting Manager (Supervisory Role)Position Type: Full-Time PermanentHours of Work: 35 hours per week (on-site)Compensation: From $36.93 up to $46.16Reports to: Director of FinanceDate Posted: January 15, 2026Position SummaryThis is a vacant position.The Accounting Manager supports the Director of Finance in managing the day-to-day operations of the Finance Department at SPLC, including payroll, general ledger, accounts receivable, and accounts payable.ResponsibilitiesOverall responsibility includes monthly preparation of financial statements and government reports and working directly with the Director to ensure internal control measures and ministry policies are adhered to.This will include reviewing current processes and developing or enhancing processes, policies, and procedures.Core Responsibilities Include But Are Not Limited ToSupport the Director in annual preparation of audit to include preparing working papers and providing information as requestedPrepares timely and accurate completion of monthly internal financial statements and government reports.Leads and performs monthly, quarterly and year-end closing including account reconciliations and analysis Leads and performs monthly, quarterly, and year-end closings, including account reconciliations and financial analysis.Responsible for preparing monthly closing entries, e.g. deferred revenue, allocation entries, intercompany invoices and expense reportsPrepares quarterly and annual information for Federal and Provincial governments (HST, WSIB, Tax returns)Ensures compliance with all policies, procedures and regulationsMaintain confidential files, including timely filing of all documents pertaining to required changesEnsures accounts receivable and payable activities are performed accurately and timelyLiaises with the other departmental supervisors to address and resolve issues relating to financial reporting, Receivables and Payables Provides detailed financial analysis and ad-hoc reports as requiredQualificationsCompletion of Post-Secondary Degree/Diploma in Business, Finance, or AccountingAn active accounting designation (CMA, CGA, CPA) or completion of the CFE-level examination or currently being at that stage.A minimum of 4-5 years progressive accounting experience, including supervisory roles either from a public accounting firm or Not for ProfitStrong computer literacy skills with Microsoft Office and advanced level Excel skill (pivots, v-lookups, and advanced formulas) and accounting software (Great Plains).Must have demonstrated proficiency in Great Plains, Sage 300 – all modules and Cash managementStrong background in audit, internal controls and working in a non-profit sector/Ministry funded organizationMust be flexible with hours and have the ability to work occasional additional hours when required to meet strict deadlinesVulnerable Sector screening requiredProof of full vaccination against COVID-19 or medical exception. Senior Persons Living Connected is an inclusive and diverse work environment. We encourage applications from all persons, including persons with disabilities. Accommodation will be provided upon request to our team at hiring@splc.caSPLC is committed to fair and transparent hiring practices. Hiring decisions are based on job-related qualifications, skills, and experience. Artificial intelligence tools are not used to screen, assess, or select applicants for this position.Please submit your application by visiting our website at www.splc.ca/careers While we thank all applicants for their interest, only those applicants selected for interview will be contacted.This is a full time position",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330626600/",
    "job_id": "4330626600",
    "source": "linkedin",
    "company_name": "Collins Recruitment Group",
    "job_title": "Director, Tax & Estate Planning, Private Wealth Management",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Director, Tax and Estate Planning, Private Wealth ManagementAboutThis opportunity is with one of Canada’s leading independent wealth management firms, focused on delivering comprehensive financial solutions to high-net-worth individuals and families. The firm operates with a disciplined, client-centric approach and is recognized for its expertise in wealth preservation, tax efficiency, and intergenerational planning. Tailored strategies and solutions are delivered with professionalism, integrity, discretion, and a strong commitment to excellence.Position OverviewExcellent opportunity exists for an accomplished tax and estate planning professional to join the firm's Toronto office. This role requires a high level of technical proficiency, strategic judgment, and a passion for guiding clients through complex financial decisions. The successful candidate will collaborate closely with portfolio managers and senior leadership to further enhance the firm’s wealth planning capabilities and support the delivery of sophisticated, customized solutions to affluent individuals and families.Key ResponsibilitiesDesign and implement advanced wealth planning strategies, including tax optimization, estate planning, and succession planning.Conduct comprehensive client reviews to ensure tax and estate planning strategies are appropriately implemented and aligned with client objectives.Work collaboratively with clients’ external legal and accounting advisors to execute integrated planning solutions.Develop and deliver educational initiatives focused on next-generation wealth stewardship.Provide thought leadership in areas such as family office services and cross-border planning.Ensure compliance with regulatory requirements and internal policies.QualificationsMinimum 5 years of experience in wealth planning and tax strategy for high-net-worth clients.Completion of CPA In-Depth Tax Program or equivalent designation.CFP or TEP designations considered an asset.Exceptional communication skills with the ability to build and maintain trusted professional relationships.Proficiency in Financial Planning and/or tax preparation software.Work ArrangementHybridFor more information, please contact Shan Collins directly at: scollins@collinsrecruit.comAll applications and enquiries will be held strictly confidential.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366640608/",
    "job_id": "4366640608",
    "source": "linkedin",
    "company_name": "Solugenix",
    "job_title": "Junior Accountant",
    "location": "Santo Domingo, Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Junior AccountantSanto Domingo, Dominican Republic (Remote)Direct HireJPC - 19880We are looking for a Junior Accountant. This is a direct hire opportunity based out of Santo Domingo, Dominican Republic (Remote).We are seeking a detail‑oriented and motivated Junior Accountant to support our accounting operations in the Dominican Republic. This role assists the Staff Accountant in maintaining accurate financial records in accordance with local accounting standards, processing accounts payable, supporting month‑end close activities, and managing collections from U.S. based customers.Qualifications:1–2 years of accounting experience.Strong working knowledge of basic accounting principles.Proficiency with accounting software and Microsoft Excel.Strong English verbal and written communication skills.High attention to detail, accuracy, and organization.Qualifications Preferred:Experience working with U.S. companies or international teams.Familiarity with Dominican tax or regulatory requirements.Ability to work independently in a remote environment when necessary.Responsibilities:Accounting SupportAssist the Staff Accountant with maintaining accounting records in accordance with Dominican local accounting standards.Prepare and update accounting entries in the general ledger.Help reconcile accounts and ensure accuracy and completeness of financial data.Accounts PayableEnter, verify, and process vendor invoices.Follow up with vendors regarding missing documents, discrepancies, or payment status.Assist with weekly and monthly AP reporting.Month-End CloseSupport month-end closing activities, including journal entries, reconciliations, and schedules.Assist in preparing internal financial reports.Help ensure deadlines are met and documentation is complete and audit‑ready.Collections & Accounts ReceivableManage collection efforts for U.S.-based customers, including follow-ups on outstanding invoices.Monitor aging reports and escalate past‑due balances as needed.Maintain professional communication with customers in English.Work Environment:Option to work onsite in Santiago or remotely from Santo Domingo.Collaborative team environment with opportunities for growth and development.Standard business hours with occasional flexibility during close periods.About SolugenixSolugenix is a leader in IT services, delivering cutting-edge technology solutions, exceptional talent, and managed services to global enterprises. With extensive expertise in highly regulated and complex industries, we are a trusted partner for integrating advanced technologies with streamlined processes. Our solutions drive growth, foster innovation, and ensure compliance—providing clients with reliability and a strong competitive edge.Recognized as a 2024 Top Workplace, Solugenix is proud of its inclusive culture and unwavering commitment to excellence. Our recent expansion, with new offices in the Dominican Republic, Jakarta, and the Philippines, underscores our growing global presence and ability to offer world-class technology solutions. Partnering with Solugenix means more than just business—it means having a dedicated ally focused on your success in today's fast-evolving digital world.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356281079/",
    "job_id": "4356281079",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Management Trainee Officer (Business Development) - (For BROS Ingredients Limited) - Job ID - 1454384",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "BROS Ingredients Limited is looking for Management Trainee Officer (Business Development)Key PointsBROS seeks a high-performing Management Trainee Officer- Business Development for industrial Chemicals through B2B to help us meet customers`/suppliers` demands & assist the higher managers in achieving operational goals.Job Description / ResponsibilityDrive business growth through technical promotion, sales, market development, and support activities for industrial and specialty chemicals across domestic and international markets.Provide professional customer service, technical assistance, and operational support, ensuring high levels of client satisfaction and long-term relationships.Achieve assigned B2B sales, operational, or functional targets, contributing to overall brand expansion, revenue growth, and company profitability.Identify and develop new customers, suppliers, projects, and business opportunities, while actively supporting and growing existing accounts.Maintain continuous follow-up on inquiries, prospects, and internal requests, ensuring smooth execution of projects and business pipelines.Negotiate commercial terms, coordinate internally, and support deal closures, agreements, and contracts in line with company policies.Monitor and maintain regular updates on raw material status, inventory movement, financial data, HR records, and market trends (local & global) relevant to the role.Ensure effective communication with customers, suppliers, partners, and internal teams via email, phone, LinkedIn, social media, and other professional platforms.Track competitive activities, market intelligence, cost trends, and industry developments, reporting key insights to management for strategic decision-making.Work closely with senior management and cross-functional teams (Sales, Finance, HR, Operations) to support business objectives and operational excellence.Identify growth opportunities through trade shows, exhibitions, expos, partnerships, and distributorships, aligned with departmental responsibilities.Participate in industry events, meetings, and professional forums to expand networks and strengthen business relationships.Conduct market, operational, financial, or talent-related research to support expansion, efficiency, compliance, and workforce planning within the assigned territory or function.Ensure compliance with company policies, ethical standards, regulatory requirements, and internal procedures.Support continuous improvement initiatives by contributing ideas to enhance process efficiency, cost optimization, customer experience, and team performance.Educational RequirementsBachelor of Science (BSc) in Applied ChemistryMaster of Business Administration (MBA) in PharmacyMaster of Business Administration (MBA) in Finance & BankingBachelor of Commerce (BCom) in AccountingProfessional Course:Supply Chain ManagementComputer TechnologyDiploma in Operation Management[University of Dhaka, Jahangirnagar University, North South University, BRAC University, Rajshahi University of Engineering and Technology ]students will get preferenceSkills Required: Sales & Marketing, Human Resource Management, Pharmaceutical/ Medical Marketing, Banks & Financial, Accounts and Finance, Operational ManagementExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s):Trading or Export/Import,Direct Selling/Marketing Service Company,Indenting FirmFreshers are also encouraged to apply.Job LocationDhaka",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371943523/",
    "job_id": "4371943523",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Relationship Officer (AO-Officer): Branch Banking- For National Credit and Commerce Bank PLC- Job ID: 1459573",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "National Credit and Commerce Bank PLC is looking for Relationship Officer (AO-Officer): Branch BankingJob Description / ResponsibilityIdentify, acquire and onboard new retail & SME clients to expand the bank’s customer base, ensuring alignment with the bank’s business strategy.Build, nurture, and maintain long-term, trust-based relationships with retail & SME clients, ensuring superior service, satisfaction and retention.Drive business by expanding the customer base and achieving targets for loans & deposit by cross-selling and up-selling appropriate banking products and services tailored to client needs.Conduct regular visits to existing and prospective clients to strengthen relationships, explore opportunities and provide proactive solutions.Address and resolve client concerns promptly, ensuring a seamless, one-stop banking experience.Perform financial analysis, assess creditworthiness and prepare credit proposals to support sound lending decisions.Monitor portfolio quality, minimize NPLs to ensure sustainable asset growth and asset quality, enforce adherence to bank policies, credit standards and regulatory guidelines.Prepare and review credit proposal/ call reports; maintain accurate MIS; and ensure proper documentation and archiving of client files.Ensure smooth execution of banking operations (account services, fund transfers, e-GP, etc.) with adherence to AML/KYC standards.Liaise effectively with internal teams (credit, operations, compliance, audit, etc.) and external stakeholders to ensure smooth operations and timely service delivery.Undertake any other responsibilities assigned by management to support the smooth functioning of the branch.Educational RequirementsBachelor/HonorsMaster of Business Administration (MBA)Master of Business Management (MBM)MastersMBA/MBM/Masters (preferably Business) from UGC approved universities having no 3rd class in academic records. Candidate having minimum 16 years of schooling will be eligible.Experience RequirementsAt least 1 year(s)The applicants should have experience in the following business area(s):BanksAdditional RequirementsMinimum 01 years of work experience as relationship officer or relevant experience in a commercial banks/ financial institution.Candidates should have enthusiasm, self-motivation and strong interpersonal skill along with high level of integrity to develop career in a highly competitive and challenging environment. Excellent verbal, written and communication skills in both Bangla and English.Job LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366727083/",
    "job_id": "4366727083",
    "source": "linkedin",
    "company_name": "TechHeads",
    "job_title": "Chief Technology Officer",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Chief Technology Officer (PCF-49) FinTech - Investments | Dublin City Centre (Hybrid)A rare opportunity has arisen for a senior technology executive to join a well-funded, regulated FinTech organisation headquartered in Dublin City Centre. Having evolved from a smaller operation into a global, technology-led financial services business, the organisation is entering a significant next phase of growth and is seeking an experienced CTO / CIO-level leader to join the Irish executive team and contribute at board level.Reporting to the Irish Chief Operating Officer and working in close partnership with the Group CTO, this role blends executive governance, regulatory accountability, and hands-on technology leadership. It will suit a senior technologist with experience operating in complex, highly regulated FinTech or financial services environments who is comfortable balancing strategic oversight with practical delivery.The successful candidate will play a critical role in shaping and safeguarding the organisation’s technology, governance, operational resilience, and security framework, while collaborating with international technology teams across a distributed operating model.The culture is pragmatic, collaborative, and delivery-focused, with high performance standards and a strong emphasis on ownership, accountability, and professional judgement.The RoleAs Chief Technology Officer (PCF-49), you will assume end-to-end accountability for technology, technology risk, and operational resilience, with direct exposure to board governance and regulatory engagement.Key areas of focus include:Act as the accountable executive for technology within a regulated FinTech, leading governance, oversight, and regulatory engagement, including with the Central Bank of Ireland. (PCF-49)Set technology strategy while maintaining hands-on oversight of infrastructure, cloud, cybersecurity, systems, and operational resilience.Own compliance with EU and Irish regulatory requirements, including DORA, ICT risk management, business continuity, and outsourcing governance.Provide executive oversight of large-scale, production-critical FinTech platforms, ensuring stability, security, and scalability.Partner with international engineering, security, and operations teams within a distributed technology model, without direct local headcount.Operate effectively in a lean, high-trust leadership environment with strong emphasis on judgement, ownership, and delivery.Act as the senior point of contact for technology, cybersecurity, and resilience matters with regulators and external auditors.Bring senior technology leadership experience within investment firms, brokers, or similar regulated trading or capital markets environments.Compensation & Benefits• Base Salary: €150,000 – €175,000 – DOE • Discretionary Bonus – Up to 50% • Comprehensive Benefits Package • Hybrid Working: 3 days onsite per week (Dublin City Centre)ContactFor a confidential discussion, please contact Aoife Murtagh📞 087 406 8964✉️ Aoife@techheads.ieTechHeads – Executive Search (Permanent & Contract)Specialising in Technology, Data, Software & Business Change, with a focus on securing C-suite executives and their direct reports across the IT domain.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358097875/",
    "job_id": "4358097875",
    "source": "linkedin",
    "company_name": "Echelon Data Centres",
    "job_title": "Financial Controller",
    "location": "Sandyford, Dún Laoghaire-Rathdown, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371174564/",
    "job_id": "4371174564",
    "source": "linkedin",
    "company_name": "Elation Partners",
    "job_title": "Senior Bookkeeper",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company DescriptionMy client is a well-established B2B SaaS company specializing in email compliance and governance solutions for Microsoft 365. Serving over 5,000 organizations worldwide, they help companies meet regulatory requirements and reduce risk through integration between Outlook and SharePoint. With more than 20 years of experience in the SharePoint ecosystem, they're recognized as a leader in email governance and compliance technology.We're seeking a detail-oriented Senior Bookkeeper who genuinely loves the craft of bookkeeping and wants to be the go-to financial operations expert for a lean, high-performing team.Role DescriptionThis Senior Bookkeeper role is an on-site position based in Toronto, ON, with flexibility between part-time (25 hours/week) or full-time arrangements for the right candidate. The Senior Bookkeeper will be responsible for managing day-to-day accounting functions, preparing and maintaining financial statements, recording accurate journal entries, overseeing all bookkeeping activities, and ensuring compliance with financial regulations. The role also includes maintaining accounting software and collaborating with other team members to facilitate smooth financial operations.ResponsibilitiesOwn the end-to-end bookkeeping function, including month-end close processes, journal entries, and financial reporting.Manage accounts payable and accounts receivable processes, including invoice processing and payment tracking.Perform regular bank reconciliations and maintain accurate financial records.Interface with external audit firms, ensuring smooth year-end processes and timely delivery of required documentation.Support budget tracking and expense management, providing insights to leadership on financial performance.Prepare subscription revenue data and calculate key SaaS metrics including MRR and ARR.Prepare and file sales tax returns (HST/GST) and manage tax compliance requirements.Proactively identify process improvements and maintain best practices in financial operations.Qualifications3+ years of bookkeeping or accounting experience, ideally in a SaaS or technology company environment.Strong proficiency with modern accounting platforms (experience with Xero, Plooto, Dext, or similar tools preferred).Exceptional attention to detail with strong organizational and analytical skills.Ability to work independently, manage multiple priorities, and meet deadlines with minimal supervision.Clear and professional communication skills - you'll be the financial operations expert for the team.Comfort working in-person at the company's office.Genuine passion for bookkeeping and financial operations - this role is ideal for someone who loves the craft and wants to excel at it, not someone eyeing a CFO role.CPA / CA designation is not required - we're looking for strong execution and operational excellence.Work StructureThis role offers flexibility between part-time (approximately 25 hours per week) or a full-time arrangement for the right candidate. The position is in-office and based in downtown Toronto, ON.Salary Range: $45,000 - $80,000 CAD annually (depending on part-time vs. full-time arrangement)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369686418/",
    "job_id": "4369686418",
    "source": "linkedin",
    "company_name": "Hana Bank Canada",
    "job_title": "Coordinator, Strategic Planning & Communications",
    "location": "North York, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About usHana Bank Canada is a federally regulated Schedule II bank and is a subsidiary of Hana Financial Group, a leading global financial group headquartered in South Korea. As a leading provider of financial solutions for the Korean community in Canada, our mission of “Growing Together, Sharing Happiness” keeps us focused and grounded as we strive to fulfill our role as a “Solution Provider” for our growing customer base in a rapidly changing financial environment. With 7 branches and a strong global network across 24 countries, we combine international expertise with a deep understanding of local banking needs to provide trusted financial services. We are committed to advancing sustainable growth and fulfilling our social responsibilities.OverviewWe are currently searching for the Coordinator, Strategic Planning & Communications to join our Corporate Strategy and Communications department.Job Type: Full-time, PermanentVacancy Status: ReplacementSalary: CAD $45K ~ $55KJob Summary:The Coordinator, Strategic Planning & Communications supports the department by contributing to strategic planning and corporate communications initiatives. This position conducts market research, analyze business performance data to help formulate strategic directions, and plans management initiatives in line with the bank’s strategy. The Coordinator, Strategic Planning & Communications also supports the development of effective communication to engage employees to align with the bank’s overall goal, while also providing general administrative and executive support as a secondary responsibility.Key Responsibilities :Corporate Strategy PlanningConduct research on macro-economy, financial industry, market trends, and related regulations to produce actionable insights for developing bank’s strategic planAssist with development, execution, and monitoring of the Bank’s Mid-long Term Strategy and Annual Business PlansAssist with planning and implementing management initiativesConduct regular reviews of current management issuesCorporate CommunicationDevelop and circulate newsletters, CEO messages, and other corporate communications to employeesExecute bank-wide surveys and compile, analyze, and reports the survey findingsProvide information on the Bank’s vision, mission and long-term objectives to employees including the Parent Bank’s vison and missionOrganize and coordinate bank-wide program or event that promote bank-wide collaboration to reinforce consistent understanding of the Bank’s overall goals and values, including collaboration with other areasPerform other duties as assignedExecutive Support & Other Administrative TasksProvide executive support to the CEO and administrative support to the department, including coordination, documentation, and follow-up on parent bank related mattersPerform other administrative and management support duties as required to ensure effective coordination and smooth day-to-day operationsQualification and Skills :Understanding of the financial landscape and overall economic environmentAbility to plan and execute through clear communicationOutstanding research and analytical skillsAbility to summarize complex information into clear and concise messagesProficiency in MS office (Word, Excel, PowerPoint)Strong organizational and planning skillsBachelor’s degree in Business Administration or Economics, Banking/financial industry experience, and Bi-lingual in English and Korean are preferred.At Hana Bank Canada, you’ll join a close-knit and diverse group of professionals in a collaborative, supportive environment. You will have the unique opportunity to gain exposure to the global market, make a real impact, and grow your career. With a focus on growth, happiness, and customer satisfaction, Hana Bank Canada is a company that truly values its employees.To learn more about the opportunity and explore career openings, please visit our Careers page at www.hanabank.ca.This recruitment process does not use artificial intelligence (AI) enabled tools.Hana Bank Canada is an Equal Opportunity Employer.We value diversity and inclusion in our workplace and are committed to providing fair and unbiased treatment to all employees and applicants. At Hana Bank Canada, we strive to create an environment where everyone feels respected, valued, and supported. We provide reasonable accommodations for individuals with disabilities and ensure that our hiring and employment practices are inclusive and accessible. We encourage individuals from all backgrounds to apply and join our team. Together, we can build a stronger and more inclusive workplace.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370999241/",
    "job_id": "4370999241",
    "source": "linkedin",
    "company_name": "CETAQ",
    "job_title": "Technicien(ne) comptable",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Offre d'emploi : Technicien(ne) comptable pour 3 entitésDescription du poste :Dans le cadre de notre croissance, nous recherchons un(e) technicien(ne) comptable pour assurer un soutien administratif et comptable auprès de trois organisations dynamiques : APCQ, CETAQ et CRIC. Votre mission consistera à contribuer activement à la gestion des opérations quotidiennes, à garantir une coordination efficace et à maintenir une communication fluide entre les entités. Ce poste représente une opportunité unique de rejoindre une équipe motivée et de jouer un rôle essentiel dans le développement de projets ambitieux. Si vous disposez d'une solide expertise en comptabilité et d'une grande polyvalence administrative, nous serions ravis de recevoir votre candidature. Tâches : Enregistrement des opérations comptables :Saisie des transactions quotidiennes (factures, paiements, encaissements) dans le logiciel de comptabilité et mise à jour des journaux.Gestion des factures :Émission et suivi des factures clients ainsi que la vérification, le classement et le paiement des factures fournisseurs. Rapprochements bancaires :Réalisation régulière des rapprochements entre les relevés bancaires et la comptabilité pour assurer la concordance des soldes. Déclarations fiscales et sociales :Préparation des déclarations, gestion des obligations fiscales et sociales en collaboration avec le service comptable et les experts externes.Suivi de la trésorerie :Contrôle et prévision des flux de trésorerie pour garantir la disponibilité des ressources financières nécessaires aux opérations.Clôtures mensuelles et annuelles :Participation aux procédures de clôture des comptes mensuels, trimestriels et annuels, ainsi qu’à la préparation des documents pour l’audit.Archivage et conformité :Organisation et gestion de l’archivage des documents comptables dans le respect des normes et obligations légales.Communication interne et coordination :Collaboration étroite avec les équipes administratives et financières des deux organisations (CETAQ et CRIC) pour assurer la fluidité des informations et la cohérence des processus comptables.Profil recherché : DEP ou DEC en bureautique ou comptabilitéExpérience significative dans un poste similaire, idéalement en gestion administrativeMaîtrise des outils bureautiques (Word, Excel, PowerPoint, Outlook).Rigueur, organisation et capacité à gérer plusieurs priorités simultanément.Excellentes compétences rédactionnelles et relationnelles.Autonomie et sens de l'initiative.Conditions :Lieu de travail : 859 Ancienne Rte De L'Église, Lourdes, Quebec G0S 1T0Rémunération : Selon expérienceTemps de travail : 4 jours/semaine ou plus (jusqu'à 5 jours par semaine)Salaire : 45 000$ à 60 000$ selon l'expérience3 jours de congés maladieActivités sociales Candidature : Pour postuler, veuillez adresser votre CV ainsi qu'une lettre de motivation à l’adresse suivante : recrutement@cetaq.qc.caNous étudierons chaque candidature avec la plus grande attention et sommes impatients de découvrir votre profil professionnel.Nous vous remercions de l'intérêt que vous portez à notre entreprise et restons à votre disposition pour toute information complémentaire.suite (Outlook, Excel, Word, PowerPoint, etc.)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370805651/",
    "job_id": "4370805651",
    "source": "linkedin",
    "company_name": "AgencyAnalytics",
    "job_title": "Account Executive",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "AgencyAnalytics is the go-to client reporting platform for marketing agencies. We help thousands of agencies automate their reporting, integrate with 80+ marketing platforms, and deliver clear value to their clients.We’re growing fast and looking for team members who thrive in a high-impact, customer-first environment. As a Sales Account Executive, you’ll be at the frontlines of our growth engine. You’ll work with inbound leads—primarily marketing agencies of all sizes—to understand their needs, show them the value of our platform, and guide them through their evaluation. This is a chance to join a rapidly scaling SaaS company, sharpen your sales skills, and help accelerate our growth.This role is hybrid (2 days in the office per week) at our Toronto location.What You'll DoConsultative selling. You won't just be a \"feature pusher.\" You’ll guide agency owners through the process by offering strategic advice on how AgencyAnalytics can improve their operationsOwning the cycle. You’ll handle the full process from start to finish. This means outreach to inbound leads, discovery, demos, negotiations, and closing.Following the playbook. We have a system that works. You’ll qualify inbound leads and use our sales playbook to make sure revenue opportunities don’t slip through the cracks.Showing the value. You’ll run tailored demos that connect our features to the prospect’s specific pain points to drive impact and ROI.Being the voice of the customer. You’ll work closely with our Marketing, Product, Support and Success teams to share what you’re hearing in the field so we can keep innovating.Keeping things organized. You’ll manage a full pipeline in HubSpot and stay on top of your deals without letting the details drop.Building the team. We want your ideas and value your experience! You’ll help us build a world-class sales culture as we grow.You’ll be a great fit if:You act like an owner. You set a high bar for yourself and don't wait for someone to tell you what to do. You’re ready to roll up your sleeves and make things happen.You’re driven by results. You love hitting targets, and you’re motivated by new challenges. You sell with curiosity and always look for the best solution for the customer.You’re a great communicator. You can talk to anyone. You’re clear, confident, and you know how to build rapport with agency leaders quickly.You’re resilient. You thrive in fast-paced spots, and you know how to pivot when you hit an objection. You think problem-solving is fun.You're a team player. You love to collaborate inter- and cross-departmentally. You thrive in a collaborative team environment.You have the right background. You have at least two years of experience in sales (SaaS or agency experience is a huge plus).You’re coachable. You actually want feedback and will apply it because you want to grow into a senior sales leader.This role won’t be a fit if:You want a predictable 9 to 5 routine. High-growth companies are dynamic and things change fast. You need to be okay with an evolving environment.You aren't a team player. We win as a group. If you prefer to work in a silo or don't like collaborating with other departments, you won't like it here.You struggle with feedback. We’re big on being open and honest. If direct feedback or taking calculated risks makes you uncomfortable, this isn't the spot for you.You have an ego. We’re customer-obsessed and humble. We want people who are hungry to learn, not people who think they have nothing left to prove.You get overwhelmed by volume. This is a high-velocity role. If you can’t stay organized with tools like HubSpot, Gong, and Slack, you’ll find the pace challengingCompensation This role offers a base salary between $70,000 and $100,000 CAD, plus variable compensation as part of a 60/40 OTE plan.Compensation is determined by factors such as market salary data within Canada, technical skills, previous work history, and internal pay equity. Many positions also include additional variable compensation, which our Talent Acquisition team will discuss with you during the interview process.Note: This posting is for an existing vacancy that we are seeking to fill.AgencyAnalytics is an equal-opportunity employer and is committed to providing an accessible recruitment process. We welcome applications from all qualified individuals and are committed to equal employment opportunities regardless of gender identity or expression, race, ethnic origin, creed, place of origin, age, sex, marital status, physical or cognitive need, sexual orientation, and any other category protected by law. Upon request, we will provide accommodation for applicants with disabilities.All your information will be kept confidential.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4239030248/",
    "job_id": "4239030248",
    "source": "linkedin",
    "company_name": "For Printer Manufacturer (Job ID:1372789)",
    "job_title": "Cost Accountant",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374749036/",
    "job_id": "4374749036",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst (Finance)",
    "location": "Kolkata, West Bengal, India",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About Turing:Turing is one of the world’s fastest-growing AI companies, accelerating the advancement and deployment of powerful AI systems.Turing helps customers in two ways: Working with the world’s leading AI labs to advance frontier model capabilities in thinking, reasoning, coding, agentic behaviour, multimodality, multilinguality, STEM and frontier knowledge; and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies.Role Overview:In this role, you will be working on projects to help fine-tune large language models (like ChatGPT) using your strong finance background, analytical thinking and English comprehension skills. The ideal candidate should have the ability to read, summarize, and break down large financial content into smaller logical blocks, conduct research online, validate claims made in content through online research, and work with the LLM (Large Language Models) to solve puzzles! The projects will also help you learn how to leverage AI to be a better analyst. This is your chance to future-proof your career in an AI-first world!What You'll Do Day-to-Day:Solve complex financial and logical reasoning problems that test and train LLMs.Analyze financial statements, models, and business scenarios to assess accuracy and factual consistency.Summarize financial reports or investment theses and validate claims through online research.Requirements:Qualification: Cleared CFA Level 1/2/3, or or have completed their CA / CPA certification or completed their MBA in Finance.Strong understanding of financial concepts, accounting principles, and investment analysis.Analytical mindset with the ability to research, verify, and reason logically.Excellent English comprehension and communication skills.Preferred Qualifications:Experience in roles such as: Financial Analyst, Financial Writer, Investment Analyst, Audit Associate, etc.Familiarity with tools like Excel, Google Sheets, and financial modelling.Proficiency in quantitative reasoning, logical deduction, and data interpretation.Perks of Freelancing with Turing:Work on the cutting edge of AI and finance.Fully remote and flexible work environment.Exposure to advanced LLMs and insight into how they’re trained.Evaluation Process:Shortlisted experts may be asked to complete an assessment.If you clear the assessment, you will be contacted for contract assignments with expected start dates, durations, and end dates.Some contract assignments require fixed weekly hours, averaging 20/30/40 hours per week for the duration of the contract assignment.After applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.Know amazing talent? Refer them at turing.com/referrals, and earn money from your network.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376807619/",
    "job_id": "4376807619",
    "source": "linkedin",
    "company_name": "Engage Recruitment",
    "job_title": "Executive Director, FP&A",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374066044/",
    "job_id": "4374066044",
    "source": "linkedin",
    "company_name": "Leadervest",
    "job_title": "Senior Audit Manager",
    "location": "Oshawa, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4240425675/",
    "job_id": "4240425675",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "PepsiCo hiring Finance Manager in Dhaka, Dhaka, Bangladesh",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4107525952/",
    "job_id": "4107525952",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Deputy Manager, MIS & Budget Analysis, BLC Operations",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353724938/",
    "job_id": "4353724938",
    "source": "linkedin",
    "company_name": "(For Images Ltd.)-Job ID",
    "job_title": "Executive (Internal & External Audit)",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357487556/",
    "job_id": "4357487556",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Social Compliance Auditor- For Service Unit Bangladesh Ltd- Job ID",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]