[
  {
    "url": "https://www.linkedin.com/jobs/view/4317210762/",
    "job_id": "4317210762",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Senior Tax",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesCalculate inventory costing Monthly tax lodgment Prepare bank reconciliation Liaising with tax officers Provide guideline to accountant regarding to tax matters Prepare other tax document and manage all related report and documents Other duties as may be assigned from time to time by senior tax officerJob RequirementsBachelor degree in Accounting or related field At least 1-year experience in accounting, Tax or related field Knowledge of accounting Understanding of English language, & computer literacy (Ms. Office) Excellent morality & professionalism Very good in interpersonal relationship High patient and strong commitment Curiosity, result-oriented, and team playerHow To ApplyAddress : G Gear Co., Ltd. #135, Monivong Blvd, Monorom, 7 Makara, Phnom Penh 12251Website : www.ggear.com.khNote : Only shortlisted candidates will be contacted for interview.Company DescriptionG Gear Co., Ltd is the Electronics distributor, retailer, and Mechanical Engineering of various brand include (1) LG Electronics products including Mobile Phone, Television, Refrigerator, Washing Machine, Commercial Air Conditioning, Household Air Conditioning, (2) Hyundai Elevator. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338092248/",
    "job_id": "4338092248",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Tax Consultant",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesAssisting in the preparation of tax returns, and submission of monthly and annual tax returns to the Tax DepartmentApplying the tax laws and regulations, and keeping up-to-date with any developments in tax laws and regulations and practiceAssisting to deliver a full range of tax services in compliance with local laws and regulations within the required timeframe.Assisting in building relationships and interacting with clients to provide excellent planning, consulting and expertise.Assisting with researching tax issues on behalf of the firm and its clientsLiaising with tax officials and other government authoritiesParticipating in knowledge management, professional development and firm administrative activities as requestedTranslation of documents from Khmer to EnglishOther duties as assigned from time to time by supervisorsJob RequirementsCambodian citizenExcellent command of spoken and written EnglishUniversity Degree in Accounting, Finance and banking, Business or other related fieldsHonesty, good interpersonal and communication skillsAble to work independently and as part of a teamPrior related experience is a plusHow To ApplyInterested candidates shall send cv to lita.heng@vdb-loi.com. Only shortlisted candidates will be notified.More InformationMs. Lita (Country HR Manager)Tel: (855) 23 964430lita.heng@vdb-loi.comCompany DescriptionWww.vdb-loi.com Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366564950/",
    "job_id": "4366564950",
    "source": "linkedin",
    "company_name": "Wing",
    "job_title": "Senior Tax Accountant",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Key ResponsibilitiesTax CompliancePrepare and submit monthly and annual tax returns (VAT, WHT, CIT, PIT).Review and validate tax computations.Ensure timely tax payments and maintain complete tax documentation.Tax Advisory & Risk ManagementProvide guidance on tax implications for business activities.Monitor tax law updates and ensure compliance.Identify tax risks and propose mitigation solutions.Tax Audit & External LiaisonCoordinate tax audits and prepare supporting documents.Liaise with tax authorities, auditors, and regulators.Reporting & AnalysisPrepare monthly and quarterly tax reports.Support annual CIT and year-end tax activities.Assist in developing internal tax policies and guidelines.Process ImprovementRecommend improvements to tax workflows and controls.Support automation and system enhancements for tax processes.Job RequirementsBachelor's in Accounting, Finance, or related field.ACCA, CPA, or CAT certification preferred.3–5+ years in tax accounting, finance, or auditing.Experience with tax filings and audits.Strong analytical and problem‑solving skills.Good communication and stakeholder management.Able to work under pressure and meet deadlines. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371398536/",
    "job_id": "4371398536",
    "source": "linkedin",
    "company_name": "De Heus TMH Cambodia",
    "job_title": "Tax Specialist",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Role DescriptionThis is a full-time on-site position for a Tax Specialist, based in Phnom Penh, Cambodia. The Tax Specialist will be responsible for tax planning, tax preparation, researching tax regulations, and managing tax compliance. Perform Tax Declaration.Job ResponsibleReview payment request and supporting document of upcoming payment date. Verify original VAT invoice to ensure the invoices are qualified with the tax law.Provide advice or guidance to stakeholders on tax compliance and documentation requirements.Coordinate with other staff in the FIN/ACC department to operate accounting figures accurately to comply with company’s policy and lawMaintain Company license/Permit related to all tax DepartmentsPrepare, review Monthly Tax Returns / Declarations and make Tax Payments in a timely and accurate mannerPrepare monthly tax / annual TOI / other tax filing and ensure submission.Support in issue solving related to Limit audit tax, Comprehensive audit tax, and other issues related to GDT, or other government institution.Check to verify the invoices in Payment system and accounting system. Reconcile balance in Tax system with account tax receivables/ tax payables in accounting system.Check to verify and record of supplier invoices into purchase/import journal for withholding tax declaration.Make request payment and submit to Management on time.Control and monitoring vehicle tax paper with related department.Keep up to date with Tax Prakas/ Regulations and communicate relevant updates to Finance Team and Management.Prepare annual TOI report timely and correctly.Support providing all requirements from auditors for annual audit (Internal/ External)Perform other duties as assigned by Line Manager.QualificationsProven expertise in Tax Planning and Tax PreparationStrong knowledge of Tax Law and general Tax regulationsExperience in Finance, including financial reporting and complianceThe ability to analyze complex tax scenarios and provide effective solutionsStrong communication and teamwork skillsRelevant educational qualification in Accounting, Finance, or a related fieldAdvanced knowledge of tax software and Microsoft Office applicationsExperience in the agricultural or manufacturing industry is an advantageQualificationsKnowledge and experience in Tax Planning, Tax Preparation, and Tax ManagementUnderstanding of Tax Law and its applicationsProficiency in Finance-related tasks and analysisStrong analytical and problem-solving abilitiesExcellent organizational and communication skillsBachelor’s degree in Accounting, Finance, or a related field; relevant certifications are a plusPrior experience in tax-related roles, preferably within the agricultural or manufacturing sector, is advantageousApplication InstructionsInterested and qualified candidates are invited to submit their CV and cover letter to the following email address:📧 khrecruitment@deheus.comPlease include the position title in the subject line of your email. Only shortlisted candidates will be contacted for an interview. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338042390/",
    "job_id": "4338042390",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Senior Accountant and Auditing Tax",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesJob Responsibilities:Prepare, examine, and analyze accounting record, financial statements, and other financial reports to assess accuracy, completeness, and conformance to reporting and procedural standards.Compute taxes owed and prepare tax returns, ensuring compliance with payment, reporting and other tax requirements.Analyze business operations, trends, costs, revenues, financial commitments, and obligations, to project.Report to management regarding the finances of establishmentEstablish tables of accounts and assign entries to proper accountsDevelop, implement, modify, and document recordkeeping and accounting systems, making use of current computer technology.Other duties and projects as assigned.RequirementJob Requirements:Deal effectively with complex and sensitive issuesKnowledge of methods, practices, and terminology used in accounting; pertinent rules, laws, and policy regarding accounting methods.Have exceptional problem-solving abilitiesBe able to work independentlyBe detail- oriented and organizationAbility to work in a high – pressure environment and to tight deadlinesMinimum QualificationsAny combination of experiences and training that would likely provide the required knowledge and abilities is qualifying. However, we prefer the following.Bachelor’s degree in Accounting or equivalent or part ACCA qualified is an advantage.At least three years of related experienceThorough knowledge of basic accounting procedure and principles.Experience with preparation of financial statementsExperience with general ledger functions and the month – end/year end closing process.Having an external audit working experience is a plusFluency of English, both orally and in writingChinese literacy is a must.Excellent accounting software ( QuickBooks) user and administration skillsHow To ApplyHow to apply: Interested candidate, please submit the CV and Cover Letter not later than October 31th, 2018 by using the contact details below with salary expectation. Only shortlisted candidates will be notified.Contact Person: HR & Operations DepartmentAddress: New Steung Mean Chey Market, 1st Flood, #523, Preah Monireth Boulevard., Phnom Penh, CambodiaTel: +855(0) 23 987 252/ 017345 546Email: hrd@wboutsourcing.com or Website: www.wboutsourcing.comCompany DescriptionWorldBridge Outsourcing Solutions Co. Ltd having a company register No. Co.3400E/2015 dated September 2015. The company incorporated under the law of the kingdom of Cambodia with register address at New Steung Mean Chey Market, 1st Flood, #523, Preah Monireth Boulevard and Phnom Penh, Cambodia. WorldBridge Outsourcing Solutions Co. Ltd offer 24/7 Call center services including in-bound calls, out-bound calls, data entry/ scanning, data center services, E-training, Media monitoring and other complementary services including projects such as market research, customer satisfaction surveys, etc Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317202879/",
    "job_id": "4317202879",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "FINANCE ANALYST – TAX AND AP",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & Responsibilities Comply with monthly tax declaration / filing, and ensure monthly tax payments are within the timeline Reconcile Reimbursable and Contra Account for each Line of Business (LOB) Ensure PO’s under Finance’s responsibility are created with correct information ad within budget, or accruals are posted if actualcharges are not available. Ensure the whole AP process are in place, payments to vendors are within the terms and no outstanding AP matters more than 30 days Monitor the monthly list of Fixed Assets and conduct the asset verification annually as per company policy Ensure that month end process of accrual, re class, reversal and others are completed prior to system close.Job Requirements BA Degree holder in Accountancy/Finance Logistics / shipping knowledge Good technical Accounting and Finance knowledge, analytical and interpretation of data Local Tax Law and Regulation Good understanding of the finance processes and priorities Proficient in Microsoft excel and computer applications Ability to work under pressure Good spoken and written English skills Good communication and interpersonal skills Commitment to task Adherence to policy and procedures Computer literacy, MS Office Advance Excel Additional accounting packageHow To ApplyContact PersonHuman Resource DepartmentPhone023 211 882/017 666 909Emailrecruitment_cam@apllogistics.comWebsitewww.apllogistics.comAddressRegency Complex C, Monireth Blvd, Sangkat Tumnubtuk, Khan Chamkarmorn, Phnom PenhCompany DescriptionAPL Logistics provides global, integrated supply chain services in more than60 countries, including both origin and destination services such as freightconsolidation, warehousing, and distribution management. APL Logisticsoffers consulting solutions and uses IT for maximum supply chain visibility andcontrol. APL Logistics is a member of the Kintetsu World Express (KWE)group, a global logistics services provider. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370602553/",
    "job_id": "4370602553",
    "source": "linkedin",
    "company_name": "Moore Cambodia",
    "job_title": "Senior Associate Tax & Accounting",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The Senior Associate, Tax & Accounting works in the Tax and Accounting Department and is responsible for managing monthly and annual tax returns, tax audits, and tax advisory services. The role and other related administrative tasks, while ensuring accuracy, timeliness, and compliance with relevant regulations.Job DescriptionCommunicate with clients on assigned matters and tasks.Review documents and information collected from clients.Prepare and review monthly tax returns.Prepare and review monthly closing accounts, including financial statements, payment vouchers, journal vouchers, fixed asset schedules, stock reports, bank reconciliations, and prepayment schedules.Prepare and review year-end closing accounts.Provide accounting review and advisory services.Prepare and review annual tax returns.Conduct tax health checks and handle tax audits.Build and maintain strong relationships with clients, ensuring timely and reliable service delivery.Participate in knowledge management, professional development, and firm administrative activities as requested.Supervise and guide Associate Accountants (AAs) in daily tasks and professional growth.Perform other duties as assigned by the ManagerEssential RequirementsBachelor’s degree or pursuing a degree in Accounting or Finance.Minimum of 2 years’ experience as a Tax Accountant, Tax Analyst, or Tax Preparer in an accounting firm.Strong organizational and follow-up skills, with the ability to handle multiple priorities and meet deadlines.Willingness to work at client sites or meet with government officers as required.Good command of English & Chinese (speaking, listening, and writing).Ability to work under pressure and manage competing priorities.Fast learner, proactive, and honest. Able to maintain confidentiality and handle sensitive matters professionally Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4316227048/",
    "job_id": "4316227048",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Unit Manager, Tax Administration - 01 Post.",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesClosing Date: 18/12/2020Location: Head Office - Phnom PenhFacilitate and manage the preparation and review company’s monthly and annual tax returns and the accurate and timely filing of all tax forms.Develop and implement strategic tax planning for all necessary taxes.Identify and mitigate tax risks.Manage members of the tax team as they prepare components of the company’s tax return and other tax documents.Find and implement opportunities for process improvement in company tax procedures.Manage and coordinate tax audits including desk/limit/comprehensive audit.Monitor legislative and regulatory tax law developments, communicate the effects of these developments to management and the tax team and create strategies to capitalize on changes to taxation legislation.Organize and manage all tax reports, statements and documents related.Coordinate taxation related matters with local tax authority and Group Company.Assist in preparing the documents related to transfer pricing.Involve in advertising and promoting services, spread good reputation of the company.Perform other tasks assigned by supervisor.Job RequirementsBachelor degree in Finance and Banking, Accounting or other related fields (Perusing CAT/ACCA/Certificate from National Tax School of General Department of Taxation is preferable).At least 2 years of experience in tax consultant role.Excellent knowledge of tax accounting, tax compliance and all types of tax returns.Strong accounting and tax, analytical, and research skills.Strong leadership and personnel management skills.Good at meeting deadlines and solving problems.Have a good skill in MS Office includes Word, Excel, PowerPoint, Internet & Email.High proficiency in writing, speaking, reading and listening in English.How To ApplyEmail: career@hatthabank.comSubmit to our nearest branchCompany DescriptionHattha Bank Plc. is a leading bank in Cambodia, licensed by National Bank of Cambodia. Having been operating for more than 25 years with MDI status in the market, with its rapidly success, Hattha Bank has transformed its status from MDI to commercial bank in 2020, and continue providing diversified financial services to individual and SME businesses; and jump into retail consumer financial market and corporate customer in urbanities through its 177 branches and 129 ATMs (24/7) nationwide. As December 2019, HKL deposit balance stood at USD 599 million with 259,720 depositors, while credit portfolio accounted for USD 1,051 million with 168,889 borrowers.Hattha Bank is a subsidiary of Bank of Ayudhya (Krungsri), the fifth largest commercial bank in Thailand, and a member of MUFG Bank, the Japan’s largest banking group, and one of the largest and most diversified financial groups in the world. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317203893/",
    "job_id": "4317203893",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Assistant Tax Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & Responsibilities Deliver a full range of tax services in compliance with laws and regulations within time frame; Support on tax planning scenarios and review of income tax returns; Identify and mitigate tax risks; Manage tax provision and tax compliance process; Manage and coordinate tax audits; Maintain tax balances on general ledger; Prepare all tax papers in regular basis and handle all information data requests; Review all the monthly tax paper work, and make sure all the tax payment done accurate within time frame. Review and deal with engaged consultant on TOI Do all the Tax advisory to all the Department and make sure that all the Advisory comply with all the Tax PurposeJob Requirements Bachelor degree of Business Administrative and other related fields is preferable. Any field related to Accounting, Tax and Business Good in English for communication 05 years working experience in Accounting, Tax and Business Management Good communication and interpersonal skills Strictly in job Highly job responsibilities, Accountabilities High ethic, Hard working, Honesty, Self-confidence, Flexibilities Able to work in group or individual Able to work under pressures Computer literacy (Microsoft Office, Internet & E-mail, Open Bravo System, Quick book and peach tree)How To ApplyContact Person: Human Resource DepartmentPhone: 015 888 036Email: recruitment.kh@carlsberg.asiaAddress: #1881, Russian Blvd, Phum Ta Ngoun, Sangkat Kakap, Khan Posenchey,Phnom Penh, Cambodia.Company DescriptionCarlsberg (Cambodia) established in 1847 by brewer J.C. Jacobsen, the Carlsberg Group is one of the leading brewery groups in the world today, with a large portfolio of beer and other beverage brands. The Carlsberg Foundation (One of the world’s oldest commercial foundations) continuously govern the brewery to continue the art of brewing, and give back to society by supporting science, art and the humanities. Carlsberg manages the majority of shares of Cambrew (Angkor Beer) portfolio of Beers, Stouts, Soft Drinks and bottled water in Cambodia. Our brands include the Kingdom’s most loved beer – Angkor Premium Beer, Angkor Premium Extra Stout, Klang, Black Panther, Turbog, Carlsberg, Guinness, Pepsi, Angkor Puro and many more. Keen to embark on a career with a portfolio of renowned local and international brands?Join us and be part of a dynamic and exciting team today! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4316228035/",
    "job_id": "4316228035",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Unit Manager, Tax Administration - 01Post.",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesFacilitate and manage the preparation and review company’s monthly and annual tax returns and the accurate and timely filing of all tax forms as well as taxes provision at end of month.Develop and implement strategic tax planning for all necessary taxes.Identify and mitigate tax risks.Manage members of the tax team as they prepare components of the company’s taxes returns and other tax documents.Find and implement opportunities for process improvement in company tax procedures.Manage and coordinate tax audits including desk/limit/comprehensive audit.Monitor legislative and regulatory tax law developments, communicate the effects of these developments to management and the tax team and create strategies to capitalize on changes to taxation legislation.Organize and manage all tax reports, statements and documents related.Coordinate taxation related matters with local tax authority, external audit(s) and Group Companies.Assist in preparing the documents related to transfer pricing.Prepare required administrative letter(s) to tax and other authorities as required by Head of ATD.Provide training to staff (both new and existing staff) relating to taxes.Involve in advertising and promoting services, spread good reputation of the company.Perform other tasks as assigned by Direct Supervisor/ Head of Finance / Senior Management Team.Job RequirementsBachelor degree in Finance and Banking, Accounting and Finance, or other related field (Perusing CAT/ACCA/Certificate from National Tax School of General Department of Taxation is preferable).At least 3 years of experience in tax consultant role.High proficiency in writing, speaking, reading, and listening in English.Full commitment to Hattha Bank’s vision, mission, purposes, values, procedures and objectives.Excellent knowledge of tax accounting, tax compliance and all types of tax returns.Strong accounting and tax, analytical, and research skills.Strong leadership and personnel management skills.Good at meeting deadlines and solving problems.How To ApplyInterest candidate, please submit us your Application Form or CV (attached with National ID Card or Birth Letter) via email: career@hatthabank.com or our nearest branches or Telegram 069 222 800 / 086 354 354 / 069 720 169.Company DescriptionHattha Bank Plc. is a leading bank in Cambodia, licensed by National Bank of Cambodia. Having been operating for more than 25 years with MDI status in the market, with its rapidly success, Hattha Bank has transformed its status from MDI to commercial bank in 2020, and continue providing diversified financial services to individual and SME businesses; and jump into retail consumer financial market and corporate customer in urbanities through its 177 branches and 129 ATMs (24/7) nationwide. As December 2019, HKL deposit balance stood at USD 599 million with 259,720 depositors, while credit portfolio accounted for USD 1,051 million with 168,889 borrowers.Hattha Bank is a subsidiary of Bank of Ayudhya (Krungsri), the fifth largest commercial bank in Thailand, and a member of MUFG Bank, the Japan’s largest banking group, and one of the largest and most diversified financial groups in the world. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4336012724/",
    "job_id": "4336012724",
    "source": "linkedin",
    "company_name": "Covestro",
    "job_title": "Junior Accountant General Accounting Tax Operations",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are Covestro. We are curious. We are courageous. We are colorful. We refine chemical material solutions with game-changing products. Let us empower you to push boundaries. Join us and our 18.000 colleagues now and together we will make the world a brighter place.The Junior Accountant for General Accounting Tax Operations ensures timely, accurate and compliant service delivery for all General Accounting Tax Operations transactions assigned to his role.What We OfferThe Junior Accountant for General Accounting Tax Operations supports the day to day General Accounting Tax Operations activities for the following process areas:Support the tax set-upPerforms plausibility checks on transactional accounting dataFollow-up activities related to General Accounting Tax Operations plausibility checksSupport the preparation of different Tax reportsCheck proper system functionality after system maintenanceGeneral Accounting Tax Operations activities for other local taxesAssists and supports ad-hoc requests. Ensures the understanding and compliant service delivery across Covestro AG of agreed policies and procedures.Understands service level agreements and key performance indicators for General Accounting Tax Operations related processes.Supports team members to achieve performance and quality standards as defined in relevant service level agreements.Assists the implementation of initiatives for improving the efficiency and/or effectiveness of the General Accounting Tax Operations transaction processing.The minimum base gross salary is 1400 EUR and can be higher depending on individual skills & experience of the candidate.What You OfferHigh school degree or equivalent experience, preferable in accounting or business.Some years of experience in a similar role is a plus, but not mandatory.Preferable experience in Tax Operations processes (in a complex and international business environment would be of advantage).Basic knowledge of Finance and Accounting end-to-end processes.Extensive knowledge of MS Excel, knowledge of SAP is a plus.Team player, but able to work independently.Ability to adapt to new cultures and people.Strong service orientation: strong commitment to customer orientation and understanding of customer needs.Highly motivated and eager to learn.Good communication skills.Business proficient English.YOUR APPLICATIONAre you as curious, courageous and colorful as we are? If so, we can offer you an exciting career opportunity. We look forward to receiving your application including a cover letter, resume/CV, and relevant certificates. Become part of our Team - apply now!Contact Uswww.covestro.comCovestro welcomes applications from all individuals, regardless of racial or ethnic origin, skin color, nationality, religion, philosophy, gender, age, physical characteristics, marital status, disability, appearance, sexual orientation and sexual identity. We are committed to treating all applicants fairly and avoiding discrimination. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366167299/",
    "job_id": "4366167299",
    "source": "linkedin",
    "company_name": "Covestro",
    "job_title": "Senior Tax Specialist",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are Covestro. We are curious. We are courageous. We are colorful. We refine chemical material solutions with game-changing products. Let us empower you to push boundaries. Join us and our 18.000 colleagues now and together we will make the world a brighter place.On this position, as Key contact person for all tax related activities you will work closely with external tax providers and internal partners. You will take the responsibility for the complete, timely execution of Tax Accounting operations jointly with the Head of Tax. In addition as Senior Tax specialist you will ascertain compliance with tax laws and regulations, specifically by ensuring due filling of local tax declarations, timely payment of taxes and by supporting local tax audits of all countries of activities – under the supervision of the Head of Tax.What We OfferBe responsible for tax service provider requests, monitor deliverables including budget & gap analysisFirst level review of prepared transfer pricing documentation: local/master file packageSupport Tax Knowledge Management in all Tax Jurisdictions in scopeManage Indirect Tax matters: Liaise with ACC shared service center & external tax provider,Review Indirect Tax returns, reconciliations & paymentsSupport during quarter, year-end & statutory closingPerform reconciliation of Tax Returns to IFRS accountsFirst level review of annual / bi-annual / monthly tax returns prepared by service providerPrepare tax payment, posting Instruction & accounts reconciliationReview of CIT estimatesProvide information related to the preparation of the annual Tax ReturnsReconciliation of Deferred tax accountsPrepare current tax accounts calculation and reconciliationsManage Indirect Tax matters: Liaise with ACC shared service center & external tax provider,Review Indirect Tax returns, reconciliations & paymentsSupport during quarter, year-end & statutory closingThe minimum base salary is 3100 EUR and can be higher depending on the skills and experience of the candidate.What You OfferMust have 3 to 4 years of experience in a similar function with focus on indirect & direct Tax expertise in an international environmentUniversity degree in business administration or similar education coupled with outstanding Accounting (Slovak Statutory & IFRS ) & Tax background (Local & International Tax law)Strong organizational skills, attention to details and ability to set priorities and meet deadlinesTeam work and ability to perform tasks independentlyCultural sensitivity, ability to communicate and present in a clear & concise mannerSolution oriented, ability to cope with complexityExperience with ERP Accounting Software/SAP FI/CO/SD and business warehouse is requiredFluent English skills (in writing and speaking)Outstanding ability to react flexible to different requirements, capability to work accurately and resourcefully while under tight deadlines or during peaksCapability and willingness to work in a fast-paced, dynamic and flexible environmentYOUR APPLICATIONAre you as curious, courageous and colorful as we are? If so, we can offer you an exciting career opportunity. We look forward to receiving your application including a cover letter, resume/CV, and relevant certificates. Become part of our Team - apply now!Contact Uswww.covestro.comCovestro welcomes applications from all individuals, regardless of racial or ethnic origin, skin color, nationality, religion, philosophy, gender, age, physical characteristics, marital status, disability, appearance, sexual orientation and sexual identity. We are committed to treating all applicants fairly and avoiding discrimination. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371367292/",
    "job_id": "4371367292",
    "source": "linkedin",
    "company_name": "Making It Easy Co.,LTD",
    "job_title": "Senior Accounting and Tax Specialist",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368064595/",
    "job_id": "4368064595",
    "source": "linkedin",
    "company_name": "ROUND ADVISORY CO., LTD",
    "job_title": "Senior Tax",
    "location": "Tuol Kouk, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320109402/",
    "job_id": "4320109402",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Junior Indirect Tax Consultant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337722063/",
    "job_id": "4337722063",
    "source": "linkedin",
    "company_name": "OPmobility",
    "job_title": "Tax Specialist",
    "location": "Lozorno, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293692066/",
    "job_id": "4293692066",
    "source": "linkedin",
    "company_name": "ESET",
    "job_title": "Senior Global Tax Specialist",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4282252830/",
    "job_id": "4282252830",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Manager - EMEIA Indirect Tax Compliance",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318342699/",
    "job_id": "4318342699",
    "source": "linkedin",
    "company_name": "PwC Slovakia",
    "job_title": "Senior Corporate Income TAX Consultant (CIT, M&A) (m/f)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369833107/",
    "job_id": "4369833107",
    "source": "linkedin",
    "company_name": "Clarios",
    "job_title": "Tax Technology Specialist",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4282252842/",
    "job_id": "4282252842",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Senior Consultant - EMEIA Indirect Tax compliance",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Senior Consultant - EMEIA Indirect Tax Compliance Place of work: Bratislava/KošiceContract type: Full timeStart date: ASAPAt EY, we’re all in to shape your future with confidence.We’ll help you succeed in a globally connected powerhouse of diverse teams and take your career wherever you want it to go.Join EY and help to build a better working world.The opportunity Join our award-winning Global Compliance and Reporting (GCR) team as a Senior Consultant in Slovakia and you will have the opportunity to work on EY’s largest multi-country client engagements. We deploy strong multi-skilled teams working seamlessly across countries and service lines, with major hubs in UK, Ireland, Belgium, Netherlands, Germany, Poland, Romania and Hungary.The GCR team is part of EY’s EMEIA Tax Center of Excellence (COE). The CoE is unique to EY: we are the only Big 4 professional services firm with a dedicated center of excellence focused on delivering exceptional client service across borders. Our 900+ talented COE professionals are based in 20+ countries across Europe, the Middle East, India and Africa (EMEIA), and work with clients across the area, regardless of our location or theirs.The GCR team is spread across 13 countries and more than 20 offices. We have specialist tax and finance skill sets spanning the areas of Indirect Tax Compliance, Service Management, Direct Tax Compliance & Reporting, Statutory Reporting, Finance BPO, Funds Tax Management, and Payroll.Our indirect tax compliance professionals support large multinational clients with their indirect tax obligations in EMEIA and globally. Dealing with the indirect tax compliance requirements is the heart of the operations but this goes hand in hand with VAT advisory, data and technology support which we provide or coordinate with our specialist teams. We apply a client centric approach meaning that our professionals are organized per client, and not per country or region, to maximize the knowledge of our client’s business.Your Key ResponsibilitiesAs a Senior Consultant, you will be working on a selection of clients where you are the “assistant VAT Controller” for the VAT/GST compliance outsourced to EY, including:Act as central point of contact – liaise with your international clients and colleagues with respect to European VAT and VAT complianceMonitoring, and giving feedback on, the quality of our client’s indirect tax data (using AI and other technologies) and reports of your clientsReview and approve indirect tax returnsFollow up on legislative changes and business changes in order to ensure that our client’s systems and/or processes are updatedIdentify issues and opportunities to continuously improve the VAT compliance processes and our client’s dataCoordinate VAT compliance advisory, technology, controversy and audit supportCoordinate with other VAT controllers and report to the client’s Process Owner at EY (Senior Manager or above)Supervise and coach junior team membersActively participate to the training and coaching session in your development plan to ensure continuous development of your technical knowledge.Monthly gross salary for this position starts at 2300 €, final offer will be adjusted based on actual candidate’s skills and experience.Skills And Attributes For SuccessA Bachelor/master’s degree in economics or equivalent, potentially with a supplementary degree in fiscal matters.Minimum 4 years of relevant professional experience in EMEIA VAT compliance, either in industry or with other service providers.Interest and curiosity in data interrogation and AIBasic understanding of other compliance activities such as statutory accounting and corporate tax compliance.Basic understanding of IT-systems and VAT/GST reporting solutionsFluent in English – written and spoken. Any additional European language is an assetInnovative & problem resolution focus with strong communication skills, both written and verbalData driven decision making / data analytics and interpretationClient centric, curious mindsetHighly motivated with the ability to work both independently and in a teamA desire to learn and develop into the roleWhat We Offer You Working conditions and flexibilityHome office and flexible working hours: Take advantage of the home office option and schedule your week according to your needs.Meal allowance RewardsBonuses and rewards: We value your individual performance and reward you for your achievements. Personal benefitsBonus for referring successful employment candidates: We will reward you for helping us find new talent.Possibility of permanent employment, after completion of studies, subject to mutual agreement. Technology and learningNew iPhone 15 and laptop computer provided for work purposes with permitted personal use.Support for professional learning, including a wide portfolio of professional training courses and e-learning programs. Health and well-beingMultiSport card: Gain access to various activities and facilities, not limited to sports.Weekl",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361837947/",
    "job_id": "4361837947",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Digital Marketer - (For Arif Academy Inc) - Job ID - 1458495",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Arif Academy Inc is looking for Digital MarketerJob Description / ResponsibilityJob Description:We are looking for a Digital Marketer to grow our online IELTS/Spoken English school. You will be responsible for the entire student acquisition funnel—from creating content that builds trust with test-takers to managing paid ads and optimizing our email automation.Core ResponsibilitiesDevelop and execute a content calendar focused on high-value IELTS topics.Create engaging short-form and long-form educational guides (blogs/YouTube) that showcase our teaching expertise.Manage \"Social Proof\" by collecting and showcasing student success stories and testimonial videos.Lead Generation & Funnel Management:Design and optimize lead magnets to capture student emails.Manage WhatsApp, Email marketing automation (drip campaigns) to nurture free users into paid course enrollees.Paid Acquisition (PPC):Run targeted ad campaigns on Facebook/Instagram (retargeting website visitors) and Google Ads (targeting keywords like \"IELTS online course\" or \"IELTS preparation\").Monitor ROI (Return on Investment) and CPA (Cost Per Acquisition) to ensure profitable student enrollment.Community Management:Engage with students in our social media comments, Facebook Groups, or Telegram channels to build community and trust.Answer pre-sales questions via DMs or email with a helpful, consultative tone.Educational RequirementsBachelor/HonorsSkills Required: Digital Marketing (Social Media Marketing)Experience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s):Educational Technology (Edtech) StartupAdditional RequirementsRequirements (Skills & Experience):Experience: 2+ years in digital marketing, preferably in EdTech, online coaching, or language learning sectors.Technical Skills:Proficiency with Google Analytics & Search Console to track traffic and conversion rates.Experience with email marketing tools.Basic graphic design (Canva/Photoshop) and video editing skills (CapCut/Premiere) for social content.Soft Skills:Ability to communicate effectively with a diverse, international audience of non-native English speakers.Understanding the \"pain points\" of IELTS students (fear of failure, deadline pressure) to write copy that resonates.Proven track record of selling digital courses or info-products.Familiarity with the IELTS exam structure (Academic vs. General Training).Experience managing student communities on Telegram or Discord.Knowledge of SEO strategies specifically for educational keywords.Job LocationAnywhere in BangladeshSalaryTk. 15000 - 25000 (Monthly) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370974758/",
    "job_id": "4370974758",
    "source": "linkedin",
    "company_name": "Artsen zonder Grenzen Nederland",
    "job_title": "Case Managers (x2)",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Médecins Sans Frontières (MSF) is an international, independent medical humanitarian organization. As a non-profit, self-governed movement of over 63,000 dedicated professionals, we provide life-saving medical assistance to people affected by armed conflict, natural disasters, disease outbreaks, and exclusion from healthcare.Our work is guided by medical ethics and the principles of impartiality, independence, and neutrality. We act based on need, and when we witness injustice, we speak out. Our commitment to professionalism and humanity can mean the difference between life and death.People are our priority. At Médecins Sans Frontières (MSF)/ Artsen zonder Grenzen, we are committed to an inclusive culture that encourages and supports the diverse voices of our employees. We encourage diverse applicants including individuals of all gender identities, ages, sexual orientations, nationalities, ethnic background, religions, beliefs, social and marital status, people with different abilities and all other diversity characteristics and how they intersect.With immediate effect, for our Country Programme in Bangladesh we are looking for:Case Managers (x2)Based in Bangladesh12 monthsObjectives of the positionMédecins Sans Frontières (MSF) OCA is seeking a dedicated and experienced Safeguarding and Code of Conduct (CoC) Case Manager to join our team in Bangladesh. This pivotal position is responsible for actively managing, investigating, and advising on complaints related to CoC violations, including high-risk and complex cases. The successful candidate will play a key role in safeguarding staff, partners, patients, and community members, ensuring a survivor-centred approach and upholding MSF’s commitment to fair process and confidentiality.Main responsibilities Ensure proper handling of all misconduct complaints, including safe and confidential reception, timely acknowledgment, triage, and immediate reporting of high-risk allegations to the Safeguarding Unit and compliance with Intersectional Platform on Behaviour Standards for Case Management.Provide technical advice and support to all actors involved in case management and ensure risk-mitigation and referral measures for complainants. - respondents and witnesses, including protection, medical, psychosocial and legal referrals when appropriate.Conduct and lead case triage, risk assessments, and investigations, including evidence gathering, interviews, analysis, and recommendations.Manage investigation documentation, including archiving, minute-taking, coordination of meetings/interviews, and preparation of final reports.Build capacity of country programme teams by training and supporting staff involved in complaint handling and misconduct investigations.Propose improvements to protocols and guidelines on case management based on country programme realities.Ensure quality, confidentiality, and data protection in case management processes, including managing complaint databases and reporting statistics.Coordinate internal and external collaboration, maintain communication with the Safeguarding Unit, engage in relevant forums, and coordinate external investigation experts.Candidate ProfileBSc in law, social or organizational sciences, gender, discrimination, whistleblowing, behavioural science, human rightsMinimum 2 years of experience in identifying and addressing safeguarding concerns in a humanitarian setting, preferably a hospital setting with MSF or similar INGOExperience working in high-risk contexts in countries of operation in the humanitarian, health, or development sector is highly desired.Strong analytical and advisory skills, with the ability to handle complex, sensitive, and high-risk cases independently.Excellent verbal communication skills, including the ability to deliver difficult information sensitively and appropriately.Excellent written communication skills, including the ability to draft investigation reports and present cases to senior management succinctly.Demonstrated commitment to confidentiality, survivor-centred practice, and fair process.Fluency in English. Bangla or Rohingya desirable. Other languages are an asset.Ability to develop case strategies, conduct investigative interviews and deliver investigation reports of high quality and within short deadlinesCertification as investigator highly desirable (CHS Tier 3, CFE/ CFF/ CPA/CCEP or equivalent)ApplicationIf you recognise yourself in this profile, we welcome you to apply directly via our website and upload a letter of motivation + Curriculum Vitae (in English) as one combined document. The closing date for applications is:January 24th 2026 at 23:59 CETInformation For more information about the recruitment procedure, please contact Masha Petrovic (Recruiter) – masa.petrovic@amsterdam.msf.org***No agencies please*** Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362274250/",
    "job_id": "4362274250",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Digital Marketing Executive (Sales Focused) - For YAMAAN - Job ID: 1458497",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370050828/",
    "job_id": "4370050828",
    "source": "linkedin",
    "company_name": "Créatif",
    "job_title": "Digital Marketing Officer",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "𝗣𝗼𝘀𝗶𝘁𝗶𝗼𝗻: 𝗝𝘂𝗻𝗶𝗼𝗿 𝗗𝗶𝗴𝗶𝘁𝗮𝗹 𝗠𝗮𝗿𝗸𝗲𝘁𝗶𝗻𝗴 𝗢𝗳𝗳𝗶𝗰𝗲𝗿 (𝗣𝗮𝗶𝗱 𝗠𝗲𝗱𝗶𝗮 𝗠𝗮𝗿𝗸𝗲𝘁𝗶𝗻𝗴)Company: CréatifLocation: House No: 15A, Road No: 35, Gulshan 2, Dhaka 1212𝗝𝗼𝗯 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:Créatif is seeking a performance-driven 𝗝𝘂𝗻𝗶𝗼𝗿 𝗗𝗶𝗴𝗶𝘁𝗮𝗹 𝗠𝗮𝗿𝗸𝗲𝘁𝗶𝗻𝗴 𝗢𝗳𝗳𝗶𝗰𝗲𝗿 (𝗣𝗮𝗶𝗱 𝗠𝗲𝗱𝗶𝗮 𝗠𝗮𝗿𝗸𝗲𝘁𝗶𝗻𝗴) to manage and optimize 𝗽𝗮𝗶𝗱 𝗮𝗱𝘃𝗲𝗿𝘁𝗶𝘀𝗶𝗻𝗴 𝗰𝗮𝗺𝗽𝗮𝗶𝗴𝗻𝘀 𝗮𝗰𝗿𝗼𝘀𝘀 𝗱𝗶𝗴𝗶𝘁𝗮𝗹 𝗽𝗹𝗮𝘁𝗳𝗼𝗿𝗺𝘀. The ideal candidate should have hands-on experience in Facebook, LinkedIn, and Google Ads, along with strong analytical and budget management skills.𝗞𝗲𝘆 𝗥𝗲𝘀𝗽𝗼𝗻𝘀𝗶𝗯𝗶𝗹𝗶𝘁𝗶𝗲𝘀:👉Plan, execute, and optimize paid advertising campaigns on Facebook, LinkedIn, and Google Ads👉Manage daily ad budgets and ensure cost-effective campaign performance👉Monitor campaign KPIs including CTR, CPC, CPA, ROAS, and conversions👉Perform A/B testing on ad creatives, copies, audiences, and placements👉Analyze campaign data and prepare performance reports with insights👉Coordinate with content and design teams for ad creatives👉Stay updated with platform policies, ad formats, and industry trends👉Ensure campaigns align with client goals and business objectives𝗥𝗲𝗾𝘂𝗶𝗿𝗲𝗺𝗲𝗻𝘁𝘀:✅ 1–2 years of hands-on experience in Paid Media / Performance Marketing✅ Strong knowledge of Facebook Ads Manager, LinkedIn Campaign Manager, and Google Ads✅ Experience in campaign optimization and budget handling✅ Ability to analyze data and prepare performance reports✅ Understanding of conversion tracking, pixels, and analytics tools is a plus✅ Good communication and teamwork skills✅ Detail-oriented with a performance-focused mindset𝗪𝗵𝗮𝘁 𝗪𝗲 𝗢𝗳𝗳𝗲𝗿:💹Competitive salary based on experience (Salary: Negotiable) 💹Opportunity to work with diverse brands and industries💹Professional growth in a fast-growing digital agency💹Supportive and collaborative work environment𝗔𝗽𝗽𝗹𝗶𝗰𝗮𝘁𝗶𝗼𝗻 𝗗𝗲𝗮𝗱𝗹𝗶𝗻𝗲: 🗓️ 14𝘁𝗵 𝗙𝗲𝗯𝗿𝘂𝗮𝗿𝘆𝗛𝗼𝘄 𝘁𝗼 𝗔𝗽𝗽𝗹𝘆: 𝗦𝗲𝗻𝗱 𝘆𝗼𝘂𝗿 𝘂𝗽𝗱𝗮𝘁𝗲𝗱 𝗿𝗲𝘀𝘂𝗺𝗲 𝘁𝗼:📩 𝗰𝗿𝘁𝗳𝗿𝘂𝗺𝗮𝗹𝘆@𝗴𝗺𝗮𝗶𝗹.𝗰𝗼𝗺#digital_marketing #job #creatif #hiring #paid_media_marketing Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365307659/",
    "job_id": "4365307659",
    "source": "linkedin",
    "company_name": "A Igreja de Jesus Cristo dos Santos dos Últimos Dias",
    "job_title": "Senior Accountant",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "View More JobsSenior AccountantCambodiaHong KongTailândiaTaiwan(No Local)To meet the needs of the Church, we seek to build teams that represent the diverse perspectives, broad life experiences and backgrounds of our global Church membership. With that in mind, we encourage all qualified applicants to apply.ResponsibilitiesMaintain records (physical and digital) and ledgers according to Church and statutory requirement Initiate general ledger file maintenance so that financial statement presentations will be accurate and meaningful.Reconcile accounts and make sure that all outstanding items are properly clearedPrepare journal entries and other adjustments to correct errorsReview expenditures against budget and make necessary reconciliations, investigations, and correcting entriesDraft correspondence to appropriate parties regarding any differences that require investigation or further action.Review and monitor invoices submission and initiate paymentsReview project accounts for compliance with the Church financial standards and correspond with appropriate parties regarding the status of these projectsAssist in banking, taxation and other government filings, and statutory auditProvide training to Church employees, volunteers, and leaders on financial policies, processes, and other operating procedures under the direction of the managerCollaborate with Area Finance team, other department employees, and Church leaders to implement new changes to policies and proceduresQualificationsRequirements: Bachelor’s Degree in Accounting or Finance A minimum of 4 years of professional accounting experience. Candidates with less experience will also be considered.Required languages: Proficiency in English (An understanding of Khmer is preferred)Knowledge of generally accepted accounting principles preferredUnder the direction of the Manager, be able to train and explain the approved Church financial policies, procedures, and the principles in the Church’s General Handbook of InstructionsGood communication skills (writing and speaking)Very skilled using Microsoft Office Suite of applications, PCs, and networksSchedules and deadlines are expected to be met, and proficiency is demonstrated on required accounting systemsKey BehaviorsStrong customer-service orientation. Sees the impact of his/her work through the eyes of customersAbility to identify root causes of problems and then fix them within policies, not just process transactionsSelf-starter and self-directed, to prioritize competing work and deadlinesIncumbents typically work under moderate supervision while they continue to gain experience in using Church accounting systemsAccuracy is demonstrated in maintaining assigned ledgers, records, accounts, etc.About UsChurch employees find joy and satisfaction in using their unique talents and abilities to further the Lord’s work. From the IT professional who develops an app that sends the gospel message worldwide, to the facilities manager who maintains our buildings— giving Church members places to worship, teach, learn, and receive sacred ordinances—our employees seek innovative ways to share the gospel of Jesus Christ with the world. They are literally working in His kingdom.Only members of the Church who are worthy of a temple recommend qualify for employment. Apart from this, the Church is an equal opportunity employer and does not discriminate in its employment decisions on any basis that would violate U.S. or local law.Qualified applicants will be considered for employment without regard to race, national origin, color, gender, pregnancy, marital status, age, disability, genetic information, veteran status, or other legally protected categories that apply to the Church. The Church will make reasonable accommodations for qualified individuals with known disabilities.Job Identification 372830 Job Category FA - Finance & Accounting Posting Date 01/22/2026, 07:52 AM Locations 179 A, Street 1015, Corner Street 1936, Phnom Penh, KH G-7/F, 118 Gloucester Rd, Hong Kong, HK 1645/6 New Phetchburi Road, Ratchathewi, Bangkok, 10400, TH 5, Lane 183 Chin Hua Street, Da'an Dist., Taipei City, 10642, TW (No Local) Apply Before 02/21/2026, 03:55 PM Job Schedule Full time Regular or Temporary Regular Worker Type Employee Number of Openings 1 Anúncio/Mais informações Please note that this job posting may close at any time without prior notice. Find out more about the many benefits of Church Employment at https://careers.churchofjesuschrist.org. Similar Jobs Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371113651/",
    "job_id": "4371113651",
    "source": "linkedin",
    "company_name": "BFX Capital",
    "job_title": "Accountant Manager",
    "location": "Boeng Trabaek, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370788337/",
    "job_id": "4370788337",
    "source": "linkedin",
    "company_name": "cellcard",
    "job_title": "Supervisor, Internal Audit",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Location: Phnom Penh (01 position)Job Summary: To ensure efficient and cost-effective annual audits that identify and manage company risks, you will develop the audit plan and create standardized methods for auditors You will then lead and perform audits across various areas including planning, testing, and reporting. You will monitor progress by following up with auditees on recommendations, ensuring proper documentation of completed audits, and maintaining the accuracy and organization of all audit materials.Key ResponsibilitiesDevelop the annual audit plan to identify and manage risks for the company. This means making sure the plan is efficient and cost-effective.Create methods for auditors to follow when conducting audits.Plan out monthly tasks to ensure all audits are completed on time and meet objectives.Lead and perform audits in various areas, including operations, customer service, IT, business processes, and subsidiary companies. This involves planning the audit, conducting tests, and writing reports.Prepare and monitor quarterly follow up with heads of auditees on issued audit recommendations to ensure proper and timely implementation;Monitor and ensure the audit evidence and working papers of each completed audit mission are appropriate, sufficiently obtained, and documented within acceptable quality.Make sure all audit documentation is accurate, complete, and organized.Job RequirementsBachelor's degree in Accounting or a relevant field. (CPA qualification is a plus).At least 2-3 years of experience in internal or external audit.Understanding of risk management practices.Strong planning and time management skills.Results-oriented and proactive.Ability to adapt and work independently under pressure.Able to thrive in a collaborative environment.Microsoft Office Suite literacy.English proficiency.📥𝐀𝐩𝐩𝐥𝐲 𝐍𝐨𝐰:Tel. 017 555 909Telegram: https://t.me/CC_EZE_Recruitment_6Email: careers@cellcard.com.khJoin us on Telegram: https://t.me/careersatcellcardExplore More Job Opportunities: https://www.linkedin.com/company/cellcardcamgsmplc/jobs/ Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365949003/",
    "job_id": "4365949003",
    "source": "linkedin",
    "company_name": "ABA Bank",
    "job_title": "Branch Audit Officer",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4335343215/",
    "job_id": "4335343215",
    "source": "linkedin",
    "company_name": "Fii&Associates",
    "job_title": "Senior Accountants x 3ppl",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369896472/",
    "job_id": "4369896472",
    "source": "linkedin",
    "company_name": "East Group Career",
    "job_title": "Senior Accounting Executive",
    "location": "Chamkar Mon, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description We suggest you enter details here. Role Description This is a full-time, on-site role for a Senior Accounting Executive located in Chamkar Mon. The role involves managing day-to-day accounting tasks, preparing financial reports, monitoring budgets, and ensuring compliance with financial regulations. Responsibilities also include overseeing accounts payable and receivable, managing payroll processing, reconciling bank statements, and assisting with tax preparation and audits. Qualifications Strong knowledge and experience in accounting practices, financial reporting, and budget managementProficiency in financial software and tools, with strong Microsoft Excel skillsAttention to detail, accuracy, and excellent analytical and problem-solving skillsAbility to manage multiple tasks, meet deadlines, and work under pressureProficiency in local tax regulations and compliance requirements is highly desirableBachelor's degree in Accounting, Finance, or related field; CPA or related certification is an advantageStrong communication skills for effective collaboration with team members and stakeholders Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351302897/",
    "job_id": "4351302897",
    "source": "linkedin",
    "company_name": "ZTE Corporation",
    "job_title": "Finance Manager（Telecom）",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366438802/",
    "job_id": "4366438802",
    "source": "linkedin",
    "company_name": "ABA Bank",
    "job_title": "Head of Finance Audit Unit",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368581843/",
    "job_id": "4368581843",
    "source": "linkedin",
    "company_name": "Urbanland",
    "job_title": "Treasury Manager (ISI Group)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354077375/",
    "job_id": "4354077375",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Deputy Head, Financial Planning Department - 01 Post.",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesClosing Date: 25/12/2020Location: Head Office-Phnom PenhBe in charge of financial planning process for all offices and business functions to come up with reliable final version for approval and execution.Lead of cost accounting by root causes analyses and initiate cost reductions to increase efficiency and profitability.Perform necessary analysis (cost and benefit analysis…etc.) upon request, Direct rolling forecasting to improve reliability on financial planning and operations, Take lead in annual credit rating process.Report to other stakeholders (parent, lender, regulator…etc.) on routine and ad-hoc reports/analysis requests.Develop training materials, deliver training to RD/BM to achieve objectives and understand impact of financial decisions.Monitor implementation of financial execution by conducting Opex and Capex variance analysis for all level of operations.Assist Head of Financial Planning in prepare/revise annual financial plan to meet short-term Hattha Bank’s goal, Collaborating with Hattha Bank and Parent’s Corporate Strategy and Planning to build/revise medium (MTBP) and long-term financial plan to meet group level’s goal, Gauging Hattha Bank’s overall financial health based on analysis of key financial ratio and address to management to make informed decision, Benchmarking to increase productivity and efficiency, Design / enhance and implement financial module and financial analysis and regular update to support/drive the business operation.Participate in Promoting Hattha Bank business objectives, brand name, products / services to Individual and Institutions and participate in management meeting, branch manager meeting.Perform other tasks assigned by management.Job RequirementsBachelor degree in finance / accounting / management, MBA or pursuing CPA is a plus.04 years’ experience in banking / financial institutions with at least 03 years supervisory role.Extensive experience on financial control / performance management/ planning and forecasting.Competency on Business Administration, leadership, management, and ability to handle multi-tasks.Very good presentation and analytical skills.Very good interpersonal and communication skills, both written and verbal.English language: Speaking and Writing at very good level.Strong software skills including extensive experience with Spreadsheet, Word, and Power Point. VBA is a plus.  Able to travel locally and internationally.How To ApplyEmail: career@hatthabank.comSubmit to our nearest branchCompany DescriptionHattha Bank Plc. is a leading bank in Cambodia, licensed by National Bank of Cambodia. Having been operating for more than 25 years with MDI status in the market, with its rapidly success, Hattha Bank has transformed its status from MDI to commercial bank in 2020, and continue providing diversified financial services to individual and SME businesses; and jump into retail consumer financial market and corporate customer in urbanities through its 177 branches and 129 ATMs (24/7) nationwide. As December 2019, HKL deposit balance stood at USD 599 million with 259,720 depositors, while credit portfolio accounted for USD 1,051 million with 168,889 borrowers.Hattha Bank is a subsidiary of Bank of Ayudhya (Krungsri), the fifth largest commercial bank in Thailand, and a member of MUFG Bank, the Japan’s largest banking group, and one of the largest and most diversified financial groups in the world. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4316216170/",
    "job_id": "4316216170",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Chairman Assistant (Thailand)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352973001/",
    "job_id": "4352973001",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Chairman Assistant (Chinese)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesAssist the chairman of the board to convene and preside over the company's senior management meetings, organize discussions and decide on the company's development plans, business policies, annual plans, and major issues in daily operations;Organize relevant personnel to review, supervise, assess, and inspect the company's various development plans and implementation results;Master the overall operating status of the company and provide first-hand information for the chairman of the board to make timely business decisions;Responsible for coordination of external public relations and assist in handling relevant business reception work;Assist the chairman to regularly review the company's financial statements and other important reports, and comprehensively monitor the company's financial status;Review important economic contracts and important reports, documents, materials, etc.;Communicate and coordinate the work of relevant departments of the company on behalf of the chairman of the board;Assist the chairman of the company's daily affairs management; Handle other affairs authorized by the chairman of the board.LanguageJob Requirements:Mother tongue: Chinese (Overseas Chinese born in Singapore, Hong Kong, Taiwanese, Vietnam, Thailand, Malaysia is preferred. Candidates from Mainland China and Candidates with Cambodian work experience are NOT accepted)Working language: English (listening, speaking and writing, all working documents are in English)CertificateBachelor degree above. Overseas study experience, British, American, Australian and Canadian study abroad experience is preferred.CPA/CIA/ACCA/ACA or other equivalent professional qualifications.Work BackgroundMore than 3 years audit work experience in Big-4 (Ernst & Young, Deloitte, Price Waterhouse Coopers, KPMG) or more than 3 years investment or finance experience in well-known Investment company.More than 5 years of business management experience in logistics, international trade, e-commerce, IT, etc. industry.AgeMale. 35-50 years old.How To ApplyInterested and qualified applicants should submit only your updated covering letter and CV stating the position you apply for with your current photo (4x6) to the below contact information:Email: cammahr@camma.bizPhone: 011 650 444BenefitsSalary: Negotiable (5000-6000 USD/month, a reasonable increase will be made on the basis of the candidate's current salary)Working time: 8:00-12:00am to 13:30-17:30pm from Monday to Saturday morningAnnual leave: 10 working days per yearThe company provides accommodationFree visa and work permit10 working days per year to visit family leave and 2 round-trip air ticketsCambodian social insurance, commercial supplementary medical insurance, accident insuranceCompany DescriptionCambodian Investment Holding Group was founded in 2018, headquartered in Phnom Penh, with registered capital of 100 million US dollar. Based on strong financial strength and top investment professionals, the group rapid invested a line of industries involving national economy and people’s livelihood, to build an industrial ecosystem with 4 cores, inclduing transportation, energy, land and finance. Cambodia’s economic growth rate reached 7.3% last year as the leading one in ASEAN, and is expected to continue its rapid development in the next 5 years. Taking advantage of Cambodia national development strategy, the Group actively responeded to “One Belt One Road” intiative, set up a bridge bewteen ressources and market, and committed to becoming a top-grade international enterprise, which possesses rational industrial structure, flexible business model, significant comprehensive advantages and efficient operation management.Tagschairman assistant expatriates Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361202621/",
    "job_id": "4361202621",
    "source": "linkedin",
    "company_name": "Mondelēz International",
    "job_title": "Internal Controls Coordinador",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionAre You Ready to Make It Happen at Mondelēz International?Join our team as an Internal Controls Coordinator reporting to the Internal Controls Manager, where you will play a key role in shaping and strengthening the control environment across our European operations. This is your chance to make a real impact, strengthening our processes and controls through innovation, controls digitalization and smart process redesign.In this role, you’ll take part in a variety of projects; from advisory reviews and process redesigns to digitalization, capability building and SOX testing. You’ll be directly involved from planning to execution, uncovering insights, identifying risk areas, and driving continuous improvement across our business.We’re looking for a curious professional, with a strong critical thinking and analytical abilities, excellent organizational skills, and proactive mindset. Someone who enjoys working collaboratively and feels confident engaging with senior leaders. This is a great opportunity for you to take the next step in your career and grow with us.How You Will Contribute Internal Control Projects – Remediations, redesign and deep dives: Contribute to the end-to-end execution of advisory reviews, remediation and improvement projects. Independently execute the tasks and areas of responsibilities assigned, contribute to define the action plan for remediation and sustainment. Risk Assessment & Advisory: Help the Internal Controls team and the business stakeholders in identifying control gaps and risk areas. Contribute to the design and implementation of pragmatic solutions in collaboration with internal stakeholders. Act as risk advisor to the business stakeholders. Digitalization & Data Analytics: Collaborate in transforming manual processes into digital tools that enhance control visibility and effectiveness. Help build dashboards and tools for data-driven insights using your analytical skills. Training & Change Management: Become a key contributor on building a culture of ownership and control accountability. Actively support the development of capabilities resources & training sessions. Help foster a culture of awareness on good control practices. Business Stakeholder Partnership: Work closely with internal teams and process owners to provide visibility into risks and improvement opportunities. Help maintain effective communication and follow-up that give management visibility into the control environment and risks that demand attention. Fraud & Special Investigations: Provide support during internal investigations. SOX: Support and execute SOX related activitiesWhat You Will Bring4-6 years of professional experience in internal audit, internal controls, risk management, or compliance.Analytical mindset with strong problem-solving skills to identify risks, assess controls, translate complex data into insights, and recommend process optimizations/remediation (e.g., MTI, RTR, STP, STC).Knowledge of risk/control frameworks and Sarbanes-Oxley (SOX) compliance.Solid SAP knowledge and data analytics tools (Power BI/Tableau a plus).Good organizational/time management skills to handle multiple priorities independently.Strong verbal/written communication and collaboration skills.Ability to interact with teams and influence stakeholders at all levels.Experience in FMCG/global companies and manufacturing supply chain preferred.Fluent English required, additional European language a plus.Bachelor’s in Finance, Business, Accounting, Risk Management or related; CPA/CIA/ACA a plus.Career Growth & Development:At Mondelez, we believe in investing in our people. As an Internal Controls Coordinator, you’ll have access to continuous learning opportunities & development programs, and the chance to work on impactful global and regional projects in close collaboration with business team and leads to strengthen our organization. We encourage exposure to different activities and teams, enabling you to broaden your expertise and grow your career within our global organization.Flexible Working:We understand the importance of balancing work and life. This role offers flexible schedules and remote work options, allowing you to work from home a significant percentage of the time to support your well-being while effectively managing your work commitments and advancing your career.Diversity & Inclusion:We are an equal opportunity employer and are committed to creating an inclusive environment for all employees. We celebrate diversity and are dedicated to fostering a workplace where everyone feels valued and empowered to contribute.Relocation Support Available? No Relocation support availableBusiness Unit SummaryWe value our talented employees, and whenever possible strive to help one of our associates grow professionally before recruiting new talent to our open positions. If you think the open position you see is right for you, we encourage you to apply!Our people make all the difference in our succesMondelēz Int",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366101249/",
    "job_id": "4366101249",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4273420411/",
    "job_id": "4273420411",
    "source": "linkedin",
    "company_name": "ITC Worldwide",
    "job_title": "Advisory | Accounting | Audit | Tax | Payroll",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About the job Advisory | Accounting | Audit | Tax | PayrollAbout UsITC Worldwide Advisors, LLP is a rapidly growing, modern provider of professional services to the middle market, operating globally. Our mission is to instill confidence in a world of change. Enable Transformation while doing more with less! Our exceptional people are the cornerstone of our unique culture and talent experience.Responsibilities Understand clients' needs and expectations, their business and industry, accounting and control systems, employees, company values, and industry-related GAAP and GAAS issues. Develop an understanding of the ITC audit automation approach and ERP tools. Assess risks and evaluate the client's internal control structure. Perform substantive tests and tests of internal controls to identify and resolve accounting or reporting issues.Prepare financial statements under prescribed formats.Required Skills And Qualifications Completion of 90+ credit hours towards a B.A. / B.S. degree or equivalent from an accredited university in Accounting or Finance. You must have passed your ACCA, CPA, CFA, or CIMA exam.N.B: We kindly request you to complete a brief survey. Your feedback will help us enhance the candidate experience and ensure we attract the best talent.https://tinyurl.com/4fttcf59https://tinyurl.com/4hak5svchttps://tinyurl.com/2hvxnwhyNext Steps: Once you have completed the survey, please proceed with your job application as instructed.Learn more:https://itcdynamics365.support/advisory-bpo-accounting-tax-audit﻿﻿ Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340154109/",
    "job_id": "4340154109",
    "source": "linkedin",
    "company_name": "Mondelēz International",
    "job_title": "Internal Controls Coordinator (Audit & Controls background needed, English fluency required)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionAre You Ready to Make It Happen at Mondelēz International?Join our Mission to Lead the Future of Snacking. Make It Uniquely Yours.Join our team as an Internal Controls Coordinator reporting to the Internal Controls Manager, where you will play a key role in shaping and strengthening the control environment across our European operations. This is your chance to make a real impact, strengthening our processes and controls through innovation, controls digitalization and smart process redesign.In this role, you’ll take part in a variety of projects; from advisory reviews and process redesigns to digitalization, capability building and SOX testing. You’ll be directly involved from planning to execution, uncovering insights, identifying risk areas, and driving continuous improvement across our business.We’re looking for a curious professional, with a strong critical thinking and analytical abilities, excellent organizational skills, and proactive mindset. Someone who enjoys working collaboratively and feels confident engaging with senior leaders. This is a great opportunity for you to take the next step in your career and grow with us.How You Will ContributeInternal Control Projects – Remediations, redesign and deep dives: Contribute to the end-to-end execution of advisory reviews, remediation and improvement projects. Independently execute the tasks and areas of responsibilities assigned, contribute to define the action plan for remediation and sustainment.Risk Assessment & Advisory: Help the Internal Controls team and the business stakeholders in identifying control gaps and risk areas. Contribute to the design and implementation of pragmatic solutions in collaboration with internal stakeholders. Act as risk advisor to the business stakeholders. Digitalization & Data Analytics: Collaborate in transforming manual processes into digital tools that enhance control visibility and effectiveness. Help build dashboards and tools for data-driven insights using your analytical skills. Training & Change Management: Become a key contributor on building a culture of ownership and control accountability. Actively support the development of capabilities resources & training sessions. Help foster a culture of awareness on good control practices. Business Stakeholder Partnership: Work closely with internal teams and process owners to provide visibility into risks and improvement opportunities. Help maintain effective communication and follow-up that give management visibility into the control environment and risks that demand attention. Fraud & Special Investigations: Provide support during internal investigations.SOX: Support and execute SOX related activitiesWhat You Will BringBachelor’s degree in finance, Business Administration, Accounting, Risk Management, or a related field. Professional qualifications (e.g., CPA, CIA, ACA, etc.) would be a plus.5-6 years of professional experience in internal audit, internal controls, risk management, or compliance.Knowledge of risk/control frameworks and Sarbanes-Oxley (SOX) compliance.Solid knowledge of SAP and data analytics tools (Power BI or Tableau experience is a plus).Good organizational and time management skills; ability to handle multiple priorities and work independently.Strong communication and collaboration skills (verbal and written).Analytical mindset with ability to translate complex data into compelling stories, identifying key risks and insights.Ability to effectively interact with different teams, organizational levels and influence outcomes.Strong and creative problem-solving skills.Experience in FMCG or global companies is preferred. Knowledge and experience with Manufacturing Supply Chain processes is a plus.Fluent English (written and verbal) is required; an additional European language is a plusCareer Growth & Development:At Mondelez, we believe in investing in our people. As an Internal Controls Coordinator, you’ll have access to continuous learning opportunities & development programs, and the chance to work on impactful global and regional projects in close collaboration with business team and leads to strengthen our organization. We encourage exposure to different activities and teams, enabling you to broaden your expertise and grow your career within our global organization.Flexible Working:We understand the importance of balancing work and life. This role offers flexible schedules and remote work options, allowing you to work from home a significant percentage of the time to support your well-being while effectively managing your work commitments and advancing your career.Diversity & Inclusion:We are an equal opportunity employer and are committed to creating an inclusive environment for all employees. We celebrate diversity and are dedicated to fostering a workplace where everyone feels valued and empowered to contribute.Slovakia: We pride ourselves on having a high performing and collaborative culture where we support your career and devel",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325728926/",
    "job_id": "4325728926",
    "source": "linkedin",
    "company_name": "Swiss Re",
    "job_title": "Senior Accounting and Reporting Professional (Hybrid)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368334502/",
    "job_id": "4368334502",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Senior Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368337422/",
    "job_id": "4368337422",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Senior Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362814133/",
    "job_id": "4362814133",
    "source": "linkedin",
    "company_name": "SNP Group",
    "job_title": "Senior/Professional Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345450874/",
    "job_id": "4345450874",
    "source": "linkedin",
    "company_name": "Mondelēz International",
    "job_title": "Senior Internal Auditor",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342928737/",
    "job_id": "4342928737",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Senior Internal Auditor",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342938826/",
    "job_id": "4342938826",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Senior Internal Auditor",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339279915/",
    "job_id": "4339279915",
    "source": "linkedin",
    "company_name": "Foxelli Group",
    "job_title": "AI Video Ads Editor | DTC E-Commerce | 100% Remote EU",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318934544/",
    "job_id": "4318934544",
    "source": "linkedin",
    "company_name": "Johnson Controls",
    "job_title": "Business Unit Finance Partner",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339389731/",
    "job_id": "4339389731",
    "source": "linkedin",
    "company_name": "Foxelli Group",
    "job_title": "AI Video Ads Editor | DTC E-Commerce | 100% Remote EU",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Please be informed that Foxelli Group hires exclusively in-house and doesn't work with any external recruitment agencies. Any company or individual claiming to recruit on behalf of Foxelli Group is not affiliated with us.At Foxelli, we’re building more than e-commerce brands — we’re building a tribe of thoughtful humans: AI enthusiasts, curious builders, and ambitious minds who care about doing meaningful work together. Ten years in, our D2C brands reach millions and generate over $20M annually. Our focus stays simple: create products customers love and a team that actually enjoys building them.If you love to learn, experiment, think boldly, make decisions, and build things that matter — you’ll feel at home with us.WHY JOIN FOXELLI?Foxelli is a place for people who think deeply, learn quickly, automate repetitive work, enjoy spending time together, and build things that matter. We work hard, joke often, and don’t take ourselves too seriously.If you’re excited about AI, eager to learn, and want to create work that genuinely means something with people who care, you’ll feel right at home with us — no matter where you are in your career.THE ROLEWe’re looking for a creative and performance-driven AI Video Ads Editor to join our team and help us craft video content and UGC image generation that doesn’t just look good, but converts. This role is ideal for someone who thrives at the intersection of creativity and data, and who knows how to use AI tools to streamline production and drive results. You’ll play a key role in our growth strategy by producing high-impact, AI-generated video ads tailored for platforms like Meta. If you're passionate about pushing boundaries with AI, collaborating with growth teams, and delivering video content that performs, this is your opportunity to make a real impact.ResponsibilitiesCreate high-quality, AI-generated video ads that drive conversions on media buying channels (Meta, etc)Leverage AI Tools (e.g., for voiceovers, scriptwriting, animation, and video editing) to produce videos that drive potential customers to buy. Collaborate with our creative strategist and media buying team to align video content with overall marketing objectives and needs to scale on paid traffic. Monitor Video Performance using data-driven insights to refine strategies and enhance future content. Deliver High-Quality Videos on time, maintaining creativity, attention to detail, and consistency in all projects. Skills & ExperienceMandatory: Proven experience specifically in creating video ads with demonstrated success, including high conversion rates (CR) from past campaigns. Experience with platforms like Meta (Facebook, Instagram) or similar is essential. Proven experience in creating AI-generated video content, preferably for Meta or similar performance-driven advertising platforms. Strong experience using AI tools for video creation and editing. Ability to work independently and meet deadlines while maintaining a high standard of quality. Creativity in developing compelling content ideas that drive conversions and resonate with the target audience. Solid understanding of key media buying and ad performance metrics, such as CPC, CPA, CTR, and especially CR. A portfolio of past AI-generated video ad content is required for consideration. Experience creating sales or lead-generation-oriented content. Familiarity with marketing and advertising principlesTHE RECRUITMENT PROCESSApply - A simple form that helps us know who’s stepping into our world. Text Task - A small real-world challenge so we can see how you approach problems in action. Ribbon AI Interview - Ribbon is a short, guided video step that helps us understand your thinking style in a calm, private spaceInterview - A conversation with your manager to feel the work chemistry, get to know each other, and explore what we could build togetherPerks & BenefitsFull flexibility with your schedule in a fully remote setting, while Hubstaff ensures transparency and fairness. Complimentary gym memberships and company-sponsored outdoor adventures for your strength and to keep your physical well-being in check. A personal development budget is at your disposal for your personal and professional growth to ensure you keep growing continuously. Generous paid time off, including parental leave and vacation days, to recharge and rejuvenate and ensure you’re well-rested. A budget for your home office setup so you’re comfortable working how you like and where you like. Strong company culture and a network of unique individuals that celebrate you. ELIGIBILITY & LOCATION REQUIREMENTS❕This role is 100% remote.Our tribe works primarily in the Eastern European Time Zone (EET — UTC+2/UTC+3). We also use Revolut for payments, so we are open to hiring candidates in countries where Revolut payments are supported. For full-time roles, we ask that you’re available for at least 5 hours during typical EET working hours — it keeps collaboration smooth and communication easy. (This",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367222436/",
    "job_id": "4367222436",
    "source": "linkedin",
    "company_name": "BlueThrone",
    "job_title": "User Acquisition Manager",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365522112/",
    "job_id": "4365522112",
    "source": "linkedin",
    "company_name": "ClickOut Media",
    "job_title": "Creative Strategist - Meta Ads & Programmatic",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362250535/",
    "job_id": "4362250535",
    "source": "linkedin",
    "company_name": "Millennium",
    "job_title": "Digital Marketing & Brand Specialist",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363394540/",
    "job_id": "4363394540",
    "source": "linkedin",
    "company_name": "Swiss Re",
    "job_title": "Controlling & Reporting Specialist EMEA (Hybrid)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343218485/",
    "job_id": "4343218485",
    "source": "linkedin",
    "company_name": "Foxelli Group",
    "job_title": "AI Multimedia Designer | DTC E-Commerce | 100% Remote EU",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353772416/",
    "job_id": "4353772416",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Garments Production Audit (For Liberty Knitwear Ltd.) - Job ID : 1450569",
    "location": "Kaliakair Upazila, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361828285/",
    "job_id": "4361828285",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Account Manager - For Channel S - Job ID - 1458392",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4335304618/",
    "job_id": "4335304618",
    "source": "linkedin",
    "company_name": "Fii&Associates",
    "job_title": "Accounting Assistants x 3ppl",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4335145423/",
    "job_id": "4335145423",
    "source": "linkedin",
    "company_name": "Fii&Associates",
    "job_title": "Assistant Auditors x 12ppl",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Assistant Auditors x 12pplFii&Associates Co., Ltd, is a licensed accounting and auditing firm by Accounting and Auditing Regulator (ACAR), and accredited by the National Bank of Cambodia as external auditors for banks and financial institutions. We are also recognized by ACCA (UK) as Approved Employer for Professional and Trainee Development. Fii&Associates Co., Ltd has a combined history of over 15 years of operations and is a correspondent firm of RSM Global (ranked in 6th place of top international accounting firms).Successful applicants can expect advanced career development, participation in the high-quality training programmers, opportunities to experience in various industries and an environment that supports and develops staff competency. Currently, we are looking for many qualified and motivated candidates to join our teams in various departments with the following positions.RequirementsGraduates in accounting, finance, banking, or economics;Good organizational, time management, and analytical skill;High commitment and career passion toward auditing work;Able to work as team and be a team player and able to travelGood computer skill especially Ms. Excel;Good communication in both Khmer and English languages.Main ResponsibilitiesWork closely with team leaderAssist in audit fieldwork as assignedAssist to ensure that work documents are filed properly for audit purposesHow To ApplyInterested candidates should send their application (CV and Cover Letter) as early as possible or before 31 Oct 2023 to our Human Resource Department through e-mail: recruitment@3e-fii.com. Only shortlisted candidates will be contacted for test and interview.Address: #3E:Fii Building, Street Vimean Ahha, Kien Klaing Village, Sangkat Chrouy Changvar, Khan Chrouy Changvar, Phnom Penh.Google Map: https://lnkd.in/gdFtGzbSOffice Hour: 8:30am to 5:30pm [Monday to Friday] For more information, please contact us at +855 12 751 455 or visit our website www.3e-fii.com.Contact Mr. Phanara MAO, HR ManagerEmail: phanara.mao@3e-fii.comTel: 085 416 444 | 0966 416 444Job Category: AuditJob Type: Full TimeJob Location: Phnom PenhApply for this positionFull Name *Email *Phone *Cover Letter *Upload CV/Resume *Allowed Type(s): .pdf, .doc, .docxBy using this form you agree. * Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338062436/",
    "job_id": "4338062436",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Physical Cash Management Unit (1 Position at Head Office in Phnom Penh...",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369318169/",
    "job_id": "4369318169",
    "source": "linkedin",
    "company_name": "Sokha Real Estate",
    "job_title": "Accounting Manager",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352003581/",
    "job_id": "4352003581",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Head of Accounting and Tax Service ($1500-$2500)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesAccounting Part:Main Duties And ResponsibilitiesResponsible for fixed assets register and bank reconciliationVerify payment vouchers before getting approvalReview account receivable and follow up with customersResponsible for tax declarationResponsible for the effective management of internal controls and the operation effectiveness of accounting systemResponsible for monthly end closing of Financial ReportMonitor, check, post GL closing account (Accruals, prepayment)Responsible for Cash ManagementResponsible for Day to day decision makingBuild and manage accounting team under direction of senior management.Tax Part:Main Duties and ResponsibilitiesReview monthly tax return such as WHT, PToP, TOS, VAT, ToFB and submit to GDT no later than deadlinePrepare and Review yearly tax return such as ToP and other tax (Patent tax...)Schedule and organize tax works professionallyAnswer and respond to the tax problemsOrganize and manage all tax reports, statements and documents relatedAdhere to tax professional standards and ethics in tax assistant functionsDeal with tax auditor include Desk/Limit/Comprehensive auditPerform other duties as assigned from management of the CompanyRequirementsJob Requirements:Degree in Accountancy or CAT/ACCA student is preferableAt least 5 years working relating experiences (experience from accounting firm is preferable)Good in English communications, both verbal and writtenGood computer literacy (Microsoft office, Quickbook, Xero, internet, email)Strong analytical skills and accurateEase of working individually and in teamsTake responsibility of the work allocatedStamina to work under tight deadlinesHow To ApplyFor more informationPlease contact to 010 902 527 or Email: sidy@premiumhumanresources.comCompany DescriptionThe company is focus on recruitment and service tax and accounting service. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4316210259/",
    "job_id": "4316210259",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "VP & Head of Financial Reporting Department - 01Post.",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesEnsure financial report is accurately prepared based on data from system in accordance with CAS and submit to Group Company and users on timely manner.Ensure statutory financial statements comply with required accounting standards and guidelines issued by NBC.Prepare CoA report to NBC following CAS and CIFRS.Coordinate with internal and external auditors.Review the policy and procedures of the Bank to ensure that it is comply with the group’s accounting policy and procedure.Monitor daily accounting transactions to be sent to Group Company.Provide sufficient data to Group for TFRS conversion.Perform analytical review of the report under TFRS.Prepare reporting package as the requirement under TFRS.Prepare reporting as the requirement under USGAAP.Update the new law and regulation to Group Company (Fin GRC) on the quarterly basis.Coordinate, monitor and disclose related parties’ transaction on time.Coordinate and respond to any inquiries or request by Group Company.Involve in accounting related projects required by Group Company.Conduct training on financial reporting as required.Lead and manage staffs under Financial Reporting Department.Perform other duties and responsibilities as assigned by management.Job RequirementsFull commitment to Hattha Bank’s vision, mission, purposes, values, procedures and objectives.Bachelor degree in Banking and Finance or other related fields (Pursuing/Qualified ACCA is preferable).At least 5 years professional experiences in accounting and tax related fields.Experience as external auditor and have knowledge in CIFRS is an advantage.Have a good skill in MS Office includes Word, Excel, PowerPoint, Internet & Email.Advanced analytical, organization, and interpersonal skills.Ability to work under pressure and long-hours, highly self-motivated, strong sense of urgency with high level of commitment and determination in delivering a great result.High proficiency in writing, speaking, reading, and listening English.How To ApplyInterest candidate, please submit us your Application Form or CV (attached with National ID Card or Birth Letter) via email: career@hatthabank.com or our nearest branches or Telegram 069 222 800 / 086 354 354 / 069 720 169.Company DescriptionHattha Bank Plc. is a leading bank in Cambodia, licensed by National Bank of Cambodia. Having been operating for more than 25 years with MDI status in the market, with its rapidly success, Hattha Bank has transformed its status from MDI to commercial bank in 2020, and continue providing diversified financial services to individual and SME businesses; and jump into retail consumer financial market and corporate customer in urbanities through its 177 branches and 129 ATMs (24/7) nationwide. As December 2019, HKL deposit balance stood at USD 599 million with 259,720 depositors, while credit portfolio accounted for USD 1,051 million with 168,889 borrowers.Hattha Bank is a subsidiary of Bank of Ayudhya (Krungsri), the fifth largest commercial bank in Thailand, and a member of MUFG Bank, the Japan’s largest banking group, and one of the largest and most diversified financial groups in the world. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3649619037/",
    "job_id": "3649619037",
    "source": "linkedin",
    "company_name": "AnyMind Group",
    "job_title": "Senior Finance and Admin Executive",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "What You'll Do:Create PO, Issue Bill, Make Payment, Receive Order in NSCreate SO and Issue Sale Invoices in NS (Local and Intercom recharge invoicesIssue Sale VAT invoices in excel for local customersControl Account receivable and Account PayableGo out to collect payment from customer/Cheque deposit at bankPrepare Bank Reconciliation_CSV filePrepare staff payrollPrepare Health and Job Risk insurance report for NSSFUpdate all staff information into NSSF systemGo to ministry of labor and vocational training to submit report of NSSFWork with other ministries (Ministry of commerce, Ministry of Labor and Vocational trainingPrepare monthly tax declaration (VAT, PPT, TOS, WHT) by E-filling and make the paymentPrepare yearly tax with tax consultantWork with tax officer to provide supporting documentPrepare documents for external tax auditor and work with themUpdate Employee ListPrepare monthly closingOther tasks assigned by Line ManagerAdminAssist sale team to prepare, copy or scan supporting document for customersPrepare report of staff attendance every beginning of the month and send email to Regional HRAssist HR manager to process staff recruitmentControl office supplies, cleaning supplies computer supplies and printer suppliesWho You Are:Requirements Minimum Diploma in Accounting or ACCA Level 1Excellent written and oral communication skillsAble to handle large amount of dataOrganised, meticulous and strong initiative An energetic and self-motivated quick learnerIT savvy and excellent skills with Microsoft Office (Excel, Word) Experienced with accounting software (NetSuite will be an advantage)Experienced with Google Workspace (especially Google Sheets, Docs & Slides) will be an advantage Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370772675/",
    "job_id": "4370772675",
    "source": "linkedin",
    "company_name": "Mega Asset Management Co., Ltd.",
    "job_title": "Senior Internal Auditor",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370490930/",
    "job_id": "4370490930",
    "source": "linkedin",
    "company_name": "Dynamic Advanced Group Cambodia",
    "job_title": "Senior Accounting Officer",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369525364/",
    "job_id": "4369525364",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "General Ledger Accountant",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352699428/",
    "job_id": "4352699428",
    "source": "linkedin",
    "company_name": "Global Blue",
    "job_title": "Financial Accountant",
    "location": "Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341561936/",
    "job_id": "4341561936",
    "source": "linkedin",
    "company_name": "Mondelēz International",
    "job_title": "Taste The Future - Junior Management Program in Finance",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320169489/",
    "job_id": "4320169489",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Junior auditor",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4322212908/",
    "job_id": "4322212908",
    "source": "linkedin",
    "company_name": "MetLife",
    "job_title": "Senior Internal Auditor",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361320989/",
    "job_id": "4361320989",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Collection Analyst with French",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361330960/",
    "job_id": "4361330960",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Purchase To Pay Analyst with Spanish",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Description & RequirementsWho we are looking forJoin Deloitte's newly established Finance Operate business line, offering outsourcing services to global corporate clients. Be part of a dynamic team in Bratislava.Fluency in English, spoken and written, B2 or higher and SpanishKnowledge or experience in Accounts Payable or PTP (preferred)Strong communication and analytical skillsTeam player with pro-active approach A solution-oriented personality Ownership mindset Good understanding of business accountancy (preferred)EU PassportYour future roleInvoice & Payment processing: you will manage the full cycle of invoice processing, ensure accuracy and timely approvals, prepare payment runs and resolve any payment discrepancies with internal and external stakeholdersResponsibility for timely resolution of local business partner and vendor’s queries through an advanced platform and to ensure the vendor & business questions are dealt with in a timely and efficient manner Written & verbal communication on daily basisReporting: You will contribute to the generation of reports on P2P metrics, such as invoice processing time and payment accuracy and support data analysis.What we offerStable job in a multinational company based on an employment contract. Flexible hybrid work model – partially from home and the office. Great opportunity for professional development, including: Individual training plans, soft skills and technical training, access to training platforms, coaching program Worldwide travel insurance (also for private travel). MultiSport Card with an attractive employer contribution. Employee Assistance Program – free consultations with experts on law, psychology, and finance. Individual bonus evaluation scheme and much more. Salary: EUR 1.600 gross/month.About DeloitteDeloitte provides leading professional services to nearly 90% of the Fortune Global 500® and thousands of private companies. Our people deliver measurable and lasting results that help reinforce public trust in capital markets and enable clients to transform and thrive. Building on its 180- year history, Deloitte spans more than 150 countries and territories. Learn how Deloitte’s approximately 460,000 people worldwide make an impact that matters at website.For further information, and to apply, please visit our website via the “Apply” button below. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363796574/",
    "job_id": "4363796574",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Senior Professional in Statutory/Finance Team with Polish",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325644824/",
    "job_id": "4325644824",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Junior IT Auditor/Consultant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4264625787/",
    "job_id": "4264625787",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Senior Consultant - Finance Strategy & Transformation",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4113641171/",
    "job_id": "4113641171",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Experienced Senior Consultant - Finance 4.0 / Finance Process Optimization / Digitalization",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361283884/",
    "job_id": "4361283884",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Collection Analyst with Italian and Spanish",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361268194/",
    "job_id": "4361268194",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Billing & Order Entry Specialist with Dutch",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327656238/",
    "job_id": "4327656238",
    "source": "linkedin",
    "company_name": "PwC Slovakia",
    "job_title": "Talent Acquisition Specialist(m/f)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371845596/",
    "job_id": "4371845596",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Purchase To Pay Analyst with German or Danish",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369535206/",
    "job_id": "4369535206",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Collection Analyst with Dutch",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356625972/",
    "job_id": "4356625972",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Senior ABAP Developer",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370984183/",
    "job_id": "4370984183",
    "source": "linkedin",
    "company_name": "UNICEF",
    "job_title": "Batch Recruitment (2 Positions): Education Officer, (NO-2), Temporary Appointment (364 days), Chittagong #134679 and Barisal #134521, Bangladesh (Open to Bangladeshi Nationals only)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4344307301/",
    "job_id": "4344307301",
    "source": "linkedin",
    "company_name": "PwC Slovakia",
    "job_title": "Junior Auditor – Discover the World of Business (m/f)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Place of work: Karadžičova 2, Bratislava, SlovakiaStart date: 1.8.2026Contract type: full-timeWage (gross): From 1 600 EUR/monthStart your career with a team that has your back. We are hiring a new group of Junior Auditors.Fast career growth isn’t just a promise — it’s reality. After just one year, you can advance to a more senior role and take part in managing client projects.Do you want to see how the business world really works and be present when important decisions are made? PwC is one of the largest international consulting firms, where you will join a team that supports you, teaches you new things, and opens doors to the world of finance and innovation. With us, you can look forward to rapid growth, challenges, and opportunities that will move you forward. Join us and discover work that truly matters!Why is this opportunity worth it?Innovation & Learning: You’ll gain new experience and skills while working with modern technologies and digital tools that will open doors to the business world. We provide comprehensive training in both soft and hard skills — including ACCA certification support, professional trainings, and development of digital capabilities. You’ll also have the chance to learn tools such as Power BI and Alteryx. A job that’s never boring: You definitely won’t experience monotony — the work of an auditor is dynamic. You’ll examine financial statements, dive deep into the details of our clients’ businesses, and take part in inventory counts. Collaboration with professionals: You’ll work closely with experts who are happy to share their knowledge. At PwC, teamwork is essential — you’ll never be left on your own. Personal & career development: Our intensive development program will bring your ambitions to life. Within one year, you can grow into a Senior role and help lead client projects. Financial growth: Your achievements won’t go unnoticed — experience annual salary increases of up to 25%. These aspects offer not only a stable career, but also the chance to grow in an environment that supports innovation and development. Join us and experience what it truly means to work at PwC!What will you do?Support audit planning and strategy: Understand clients and their business processes, assess risks, and collaborate with experienced team members. Operational audit activities: Gather data, perform audit procedures, and ensure quality in all tasks. Work with teams and clients in Slovakia and abroad: We ensure all project phases are delivered on time and in accordance with PwC quality standards. Learn new skills every day: From audit planning to project management and time management. Gain insight into how businesses operate: You’ll get a unique look into various sectors (manufacturing, automotive, financial institutions, regional service centers, and more) and understand how they fit into the bigger picture. What should you bring?You will complete your university studies by June 2026Advanced English (minimum B2); German is an advantage but not requiredA background in economics or basic accounting knowledge is an advantageStrong analytical thinking — you can interpret data and make fact-based decisionsCuriosity, openness to challenges, and eagerness to grow across different areasStrong organizational skills and attention to detailAbility to work independently, while also being a team playerExcellent communication skills and ability to build professional relationshipsBenefits you can enjoy while working at PwC:Financial Rewards: Benefit from regular salary reviews, performance bonuses and other special bonuses. Enjoy meal contributions and a cafeteria benefit system offering personalized choices. Flexibility & Work-Life Balance: Enjoy our hybrid working policy, flexible working hours, 2 extra days off during Christmas along with Sick-days. Every minute of your extra work is valued and compensated. Career Development: Engage in tailored internal and external training programs as well as structured career development plan. Health & Well-being: Access premium benefits such as Multisport card and medical center membership. Take advantage of our Well-being and Work-Life Coaching program. Supportive Culture: Participate in teambuilding activities and social events and join our employee referral program. Experience a culture with regular feedback and a supportive environment. Global Opportunities: Seize the opportunity for international assignments and work on diverse projects with international clients. Explore the world while working with the possibility of working from abroad. Extra perks: Use various discounts at partner companies such as cars, health care, beauty, culture or others. Transfer up to 4 telephone numbers at discounted rates. Information about the selection process:Our recruitment process consists of the following steps: Online application – send us your CV. We will carefully review it and get back to you. Short phone interview – we’ll discuss your expectations and introduce ours. Onlin",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363022826/",
    "job_id": "4363022826",
    "source": "linkedin",
    "company_name": "Unicef CHAD",
    "job_title": "Batch Recruitment (2 Positions): Education Officer, (NO-2), Temporary Appointment (364 days), Chittagong #134679 and Barisal #134521, Bangladesh (Open to Bangladeshi Nationals only)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360551917/",
    "job_id": "4360551917",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Credit Analyst (Upto SEO)- For Bank Asia PLC- Job ID: 1455886",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338457023/",
    "job_id": "4338457023",
    "source": "linkedin",
    "company_name": "Eurofins",
    "job_title": "QA Officer",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362712831/",
    "job_id": "4362712831",
    "source": "linkedin",
    "company_name": "Hong Leong Bank Berhad",
    "job_title": "Manager, Credit Evaluation (Cambodia)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365967352/",
    "job_id": "4365967352",
    "source": "linkedin",
    "company_name": "Ngân hàng SHB",
    "job_title": "Trưởng phòng Quản lý Rủi ro - Campuchia",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362093099/",
    "job_id": "4362093099",
    "source": "linkedin",
    "company_name": "Manulife Cambodia",
    "job_title": "Senior Actuarial Analyst",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are seeking a highly motivated and detail-oriented Senior Actuarial Analyst o join our actuarial team. This role is pivotal in supporting actuarial reporting processes, contributing to the annual financial planning cycle, and assisting in the local adoption of IFRS 17. The successful candidate will also be involved in various ad hoc actuarial projects, providing analytical insights and technical expertise.Position ResponsibilitiesSupport business-as-usual (BAU) actuarial reporting, including reserve reviews, experience studies, and management reporting.Contribute to the annual financial planning process, including forecasting and scenario analysis.Assist in the implementation and local adoption of IFRS 17, including methodology development, data validation, and system testing.Participate in annual and ad hoc actuarial projects, such as basis change, product development, assumption reviews, and strategic initiatives.Collaborate with cross-functional teams including Finance, Risk, and IT to ensure alignment and accuracy of actuarial outputs.Effectively communicate the status and results of the changes to CA and/or CFO and other functions.Ensure compliance with internal valuation policies and external regulatory requirements.Required QualificationsBachelor’s degree in Actuarial Science, Mathematics, Statistics, or a related field.Progressing through actuarial exams with an internationally recognized actuarial body (e.g., SOA, IFoA, etc.).Proficiency in actuarial software (e.g., Prophet, AXIS) and data tools (e.g., Excel, SQL, Python/R is a plus).Excellent communication skills and ability to work effectively in a team-oriented environment.Preferred QualificationsMinimum 3 years of actuarial experience, preferably in life insurance or financial services.Strong analytical and problem-solving skills with attention to detail.When You Join Our TeamWe’ll empower you to learn and grow the career you want.We’ll recognize and support you in a flexible environment where well-being and inclusion are more than just words.As part of our global team, we’ll support you in shaping the future you want to see. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4309161583/",
    "job_id": "4309161583",
    "source": "linkedin",
    "company_name": "Manulife",
    "job_title": "Senior Actuarial Analyst",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are seeking a highly motivated and detail-oriented Senior Actuarial Analyst o join our actuarial team. This role is pivotal in supporting actuarial reporting processes, contributing to the annual financial planning cycle, and assisting in the local adoption of IFRS 17. The successful candidate will also be involved in various ad hoc actuarial projects, providing analytical insights and technical expertise.Position ResponsibilitiesSupport business-as-usual (BAU) actuarial reporting, including reserve reviews, experience studies, and management reporting.Contribute to the annual financial planning process, including forecasting and scenario analysis.Assist in the implementation and local adoption of IFRS 17, including methodology development, data validation, and system testing.Participate in annual and ad hoc actuarial projects, such as basis change, product development, assumption reviews, and strategic initiatives.Collaborate with cross-functional teams including Finance, Risk, and IT to ensure alignment and accuracy of actuarial outputs.Effectively communicate the status and results of the changes to CA and/or CFO and other functions.Ensure compliance with internal valuation policies and external regulatory requirements.Required QualificationsBachelor’s degree in Actuarial Science, Mathematics, Statistics, or a related field.Progressing through actuarial exams with an internationally recognized actuarial body (e.g., SOA, IFoA, etc.).Proficiency in actuarial software (e.g., Prophet, AXIS) and data tools (e.g., Excel, SQL, Python/R is a plus).Excellent communication skills and ability to work effectively in a team-oriented environment.Preferred QualificationsMinimum 3 years of actuarial experience, preferably in life insurance or financial services.Strong analytical and problem-solving skills with attention to detail.When You Join Our TeamWe’ll empower you to learn and grow the career you want.We’ll recognize and support you in a flexible environment where well-being and inclusion are more than just words.As part of our global team, we’ll support you in shaping the future you want to see.About Manulife And John HancockManulife Financial Corporation is a leading international financial services provider, helping people make their decisions easier and lives better. To learn more about us, visit https://www.manulife.com/en/about/our-story.html.Manulife is an Equal Opportunity EmployerAt Manulife/John Hancock, we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour, ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy-related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law.It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process. All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies. To request a reasonable accommodation in the application process, contact recruitment@manulife.com.Working ArrangementHybrid Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345522049/",
    "job_id": "4345522049",
    "source": "linkedin",
    "company_name": "Powerlines Group",
    "job_title": "Group-Controller (m/w) – Wolkersdorf bei Wien",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4333042735/",
    "job_id": "4333042735",
    "source": "linkedin",
    "company_name": "Powerlines Group",
    "job_title": "HR Director (m/w)",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "POWERLINES ist einer der führenden europäischen Anbieter in der Elektrifizierung von Bahninfrastruktur für den Nah- und Fernverkehr und ein langjähriger, zuverlässiger Partner beim Bau von Energieübertragungsinfrastruktur. Im Geschäftsfeld eMobility sind wir Lösungsanbieter im Bereich der Elektromobilität für LKW- und Busdepots.Als Systemanbieter und Projektpartner errichten wir die Lebensader der Bahn und das Rückgrat der Energieinfrastruktur der Zukunft. In vielen Ländern Europas – und das schon seit Jahrzehnten. Denn ohne den Ausbau der öffentlichen Verkehrsnetze und der Energienetze sind die ehrgeizigen Ziele für die zukunftssichere Energieversorgung und die Klimaneutralität Europas nicht erreichbar.Unsere 1.400 POWERLINES Mitarbeiter:innen arbeiten tagtäglich an der grünen Mobilität und der Energiezukunft Europas. Werden Sie Teil unseres passionierten Teams und bringen Sie mit uns die Energiewende und die grüne Mobilität in Fahrt. #ELECTRIFYINGTRANSITIONSDie POWERLINES Group ist Teil von Equans – einem der weltweit führenden Anbieter von multitechnischen Dienstleistungen mit über 90.000 Mitarbeiter:innen in 20 Ländern rund um den Globus. Equans gehört zur Bouygues Group.An unserem Unternehmensstandort in Wolkersdorf bei Wien suchen wir im Rahmen der Nachfolgeregelung einenHR Director (m/w)Ihre AufgabenAls HR Director haben Sie die strategische und operative Gesamtverantwortung des internationalen Personalwesens. Sie prägen die HR-Strategie maßgeblich und stellen sicher, dass alle HR-Prozesse die Unternehmensziele konzernweit optimal unterstützen.Kernaufgaben Im DetailImplementierung und Steuerung der Umsetzung einer gruppenweiten HR-Strategie in enger Abstimmung mit der POWERLINES Group- und lokalen MDs.Führung, Coaching und Weiterentwicklung eines internationalen HR-Teams (Schwerpunkt Österreich, Deutschland, UK).Nahtstelle zwischen HR Equans und POWERLINES Group (Policies and Regulations).Enge Zusammenarbeit mit MDs und Operations der Töchter in strategischen Personal- und Organisationsprojekten.Beratung der POWERLINES Gesellschaften in allen arbeitsrechtlichen, organisatorischen und personellen Fragestellungen.Weiterentwicklung und Steuerung von HR-Strukturen und -Prozessen.Verantwortung für die Talent Acquisition, Employer Branding, Personalentwicklung/Academy und Personaladministration.Implementierung moderner Compensation & Benefits-Systeme unter Berücksichtigung regionaler Besonderheiten.Verantwortung für HR-Controlling, -Reporting und KPI-basierte Steuerung der HR-Performance.Förderung einer leistungsorientierten Unternehmenskultur sowie Begleitung von Change- und Transformationsprozessen.Sicherstellung von Ethics und arbeitsrechtlicher Konformität in allen Ländern.Ihr ProfilAbgeschlossenes Studium im Bereich Wirtschaft, Rechtswissenschaften oder Human Resources Management.Mindestens 10 Jahre internationale HR-Erfahrung im internationalen Anlagenbau- oder Bauumfeld, davon mehrere Jahre in leitender Funktion. Mehrjährige Erfahrungen im Management- oder HR Consulting von Vorteil.Fundierte Kenntnisse in internationalem Arbeitsrecht, Organisationsentwicklung und Change Management.Erfahrung in der Führung internationaler HR-Strukturen (z. B. Entsendungs-Management, interkulturelle Teams, M&A-Prozesse).Strategisch denkende und zugleich umsetzungsstarke Persönlichkeit mit ausgeprägter Kommunikations- und Verhandlungskompetenz.Strategischer Umgang mit HR-IT-Systemen (z. B. ATOSS, Umantis, SAP SuccessFactors, …..).Verhandlungssichere Englischkenntnisse; weitere Sprachen von Vorteil.Hohe Reisebereitschaft (ca. 20–30 %) und interkulturelle Sensibilität.Unser AngebotUnbefristetes Arbeitsverhältnis in einer stetig wachsenden Unternehmensgruppe, welche europaweit rund 1.400 Mitarbeiter:innen beschäftigt.Als stabiles und erfolgreiches Unternehmen in einem Wachstumsmarkt bieten wir unseren Mitarbeiter:innen eine langfristige und sichere Perspektive.Im modernen Ecoplus-Wirtschaftspark Wolkersdorf sind Sie sowohl mit dem Auto (über die A5), als auch öffentlich sehr gut angebunden. In ca. 12 Minuten sind die Büroräumlichkeiten von der nördlichen Wiener Stadtgrenze erreichbar.Für diese verantwortungsvolle Position ist ein attraktives Vergütungspaket aus Fixum auf All-in Basis (Ubit KV) sowie zusätzlich einer erfolgs- und leistungsorientierten Bonuszahlung und Dienstfahrzeug vorgesehen.Sicher, zuverlässig und nachhaltig: Diese drei Worte haben für uns besonderen Wert und prägen unseren Erfolg seit Jahrzehnten. Werden auch Sie Teil unserer gemeinsamen Erfolgsgeschichte und bewerben Sie sich gleich.Weitere spannende Jobs finden Sie unter http://karriere.POWERLINES-group.com.Jetzt bewerben» Zurück zum Stellenmarkt Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371114616/",
    "job_id": "4371114616",
    "source": "linkedin",
    "company_name": "AUTO1 Group",
    "job_title": "Projektmanager (m/w/d) Produktion & Logistik",
    "location": "Sulz im Weinviertel, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346394858/",
    "job_id": "4346394858",
    "source": "linkedin",
    "company_name": "ZIB Training GmbH",
    "job_title": "Trainer_in bei ZIB Training",
    "location": "Neusiedl am See, Burgenland, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354220704/",
    "job_id": "4354220704",
    "source": "linkedin",
    "company_name": "Adient",
    "job_title": "Banking Specialist - PTP Banking",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365387605/",
    "job_id": "4365387605",
    "source": "linkedin",
    "company_name": "Powerlines Group",
    "job_title": "IT Operations Specialist (m/w) – Wolkersdorf bei Wien",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364130657/",
    "job_id": "4364130657",
    "source": "linkedin",
    "company_name": "DO & CO AG",
    "job_title": "Küchenhilfe (m/w/x)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "An unserem Standort am Flughafen verwöhnen wir unsere Gäste mit Premium DO & CO Qualität jeglicher Art. Unsere Food Courts bieten ein breites Band an kulinarischen Köstlichkeiten. Schaffen Sie unvergessliche Momente für internationale Gäste aus aller Welt und tragen Sie dazu bei, dass Premium DO & CO Qualität in die Welt getragen wird.StellenbeschreibungVorbereitung und Verarbeitung von RohmaterialienMithilfe bei der Produktion von GerichtenAnrichten unserer hochwertigen Speisen an den diversen BuffetstationenQualifikationenFreude an der Arbeit mit erlesenen LebensmittelnErfahrung im Küchenbereich von VorteilGute Deutsch- und/oder EnglischkenntnisseZusätzliche InformationenWir glauben, dass unsere Mitarbeiter die treibende Kraft hinter unserem Erfolg sind und bemühen uns, ein positives und unterstützendes Arbeitsumfeld zu schaffen. Als Mitglied unseres Teams haben Sie Zugang zu einer Reihe von Vorteilen, wie zum Beispiel:Einen Lohn, das Ihren Fachkenntnissen entspricht. Für diese Stelle bieten wir einen monatlichen Bruttolohn von € 2.640,95 + Trinkgeld (ab ca. € 300 netto bei Vollzeit) an. Mitarbeiterrabatte in verschiedenen GeschäftenVerdienen Sie eine Empfehlungsprämie von € 1.000, wenn Sie einen Freund oder Familienmitglied empfehlen Kostenlose Parkmöglichkeiten Erhalten Sie kostenlose Busfahrkarten zum und vom Flughafen Kostenloses Mittagessen und Obst wird zur Verfügung gestelltErweitern Sie Ihre Fähigkeiten und Kenntnisse durch unsere internen SchulungsmöglichkeitenEin Unternehmen, in dem Sie wirklich etwas bewirken können - wir haben keine Angst vor neuen Ideen!Echte berufliche Entwicklungsmöglichkeiten, sowohl auf nationaler als auch auf internationaler EbeneDie Möglichkeit, mit einem der innovativsten Akteure auf dem globalen Luxusmarkt für Gourmet Entertainment zusammenzuarbeiten und diesen zu vertretenGenau wie die unterschiedlichen Zutaten ein Gericht perfekt und besonders machen, so schätzen wir Diversität in unserem Unternehmen in Bezug auf unseren Mitarbeiter:innen. Jede:r ist herzlich willkommen - unabhängig von Geschlecht, Herkunft, Religion, Ethnizität und sexueller Orientierung. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356912289/",
    "job_id": "4356912289",
    "source": "linkedin",
    "company_name": "FLIP LAB Gmbh & Co. KG",
    "job_title": "Trainerleitung/Head of Instructors (m/w/d) 30 Stunden pro Woche",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354962204/",
    "job_id": "4354962204",
    "source": "linkedin",
    "company_name": "ISG International Service Group",
    "job_title": "Sales Manager (m/w/d)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323438747/",
    "job_id": "4323438747",
    "source": "linkedin",
    "company_name": "Flughafen Wien - Vienna Airport",
    "job_title": "Servicemitarbeiter (m/w/x)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367678991/",
    "job_id": "4367678991",
    "source": "linkedin",
    "company_name": "RWA Raiffeisen Ware Austria AG",
    "job_title": "Lohn- und Gehaltsverrechner (m/w/d)",
    "location": "Obersiebenbrunn, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4270651052/",
    "job_id": "4270651052",
    "source": "linkedin",
    "company_name": "Powerlines Group",
    "job_title": "Fachtrainer Oberleitung Bahnbau (m/w) – Wolkersdorf bei Wien",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363129716/",
    "job_id": "4363129716",
    "source": "linkedin",
    "company_name": "ZIB",
    "job_title": "Trainer_in für arbeitsmarktpolitische Projekte",
    "location": "Neusiedl am See, Burgenland, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361232809/",
    "job_id": "4361232809",
    "source": "linkedin",
    "company_name": "ISG International Service Group",
    "job_title": "Sales Manager (m/w/d)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371850300/",
    "job_id": "4371850300",
    "source": "linkedin",
    "company_name": "Powerlines Group",
    "job_title": "Buchhalter:in – Wolkersdorf bei Wien",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369223995/",
    "job_id": "4369223995",
    "source": "linkedin",
    "company_name": "Powerlines Group",
    "job_title": "IT Operations Specialist (m/w) – Wolkersdorf bei Wien",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4292026800/",
    "job_id": "4292026800",
    "source": "linkedin",
    "company_name": "Gesundheit Burgenland",
    "job_title": "Oberarzt für Radiologie (all gender)",
    "location": "Kittsee, Burgenland, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Ihre WirkungsstätteMit 2.500 engagierten Mitarbeiter*innen bilden wir das Fundament des größten Arbeitgebers im Gesundheitswesen im Burgenland. Flexibilität, Herzlichkeit und Engagement prägen unsere vier Kliniken und die Direktion. Wir suchen Persönlichkeiten, die sich mit Kompetenz und Freude unserem sinnstiftenden Auftrag der Gesundheitsversorgung anschließen.Oberarzt für Radiologie (all gender)Kittsee | Part-time / full-time | Eintrittsdatum: As of nowUnsere Klinik Kittsee ganz im Norden des Burgenlandes verbindet Tradition mit Moderne. Traditionelle familiäre Strukturen kombiniert mit einer offenen Kommunikation fördern die Kultur des Miteinanders und schaffen Verbindungen zwischen den verschiedenen Fachdisziplinen. Die vielfältigen Persönlichkeiten unserer Mitarbeiter*innen eingesetzt in flachen Hierarchien schaffen eine Arbeitsumgebung, wo unsere Mitarbeiter*innen hohe Qualität in der Patientenversorgung erbringen.Ihr Wirkungsbereich Allgemeine radiologische Diagnostik und Betreuung von ambulanten und stationären Patient*innen als Teil des künftig erweiterten RadiologieverbundesBefundung mittels moderner GeräteEigenverantwortliche radiologische Untersuchungen mit einem breit gefächerten Diagnosespektrum, unter anderem:Konventionelle Röntgenuntersuchungen und digitale Durchleuchtungen sowie Computertomographie und MagnetresonanztomographieUltraschalluntersuchungen inklusive DopplersonographieInterdisziplinäre ZusammenarbeitIhr FachgebietAbgeschlossene Facharztausbildung für RadiologieErfahrung in konventioneller Radiologie, Sonographie, Computertomographie und MagnetresonanztomographieGute Kommunikations- und TeamfähigkeitSoziale Kompetenz und FlexibilitätBereitschaft zur Leistung von Nacht- und WochenenddienstenIhre Aufnahme ist in einem Beschäftigungsausmaß von 50-100% vorgesehen. Das Bruttojahresgehalt beträgt, bei entsprechender Qualifikation, auf Basis einer 40h-Woche mind. € 132.643,- (B2/20, inklusive Marktzulage).Bei einer 48h-Woche inklusive verlängerter Dienste liegt das Einstiegsgehalt für einen Facharzt bzw. eine Fachärztin im ersten Berufsjahr bei ca. € 150.000,-. Durch facheinschlägige Berufserfahrung kann sich das Gehalt wesentlich erhöhen. Zusätzlich steht das Erlangen von Zusatzqualifikationen, eine laufende Weiterbildung und Karrieremöglichkeiten bei uns im Fokus.Wenn wir Ihr Interesse geweckt haben, freuen wir uns auf Ihre Online-Bewerbung über unsere Jobbörse unter www.gesundheit-burgenland.at/karriere.Ihr exklusiver Ärzteservice im Burgenland:Mag. Viktoria Lehner, MATel.: +43 (0)5 7979 36436Mail: arztservice@gesundheit-burgenland.at Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368258439/",
    "job_id": "4368258439",
    "source": "linkedin",
    "company_name": "Zeppelin Group",
    "job_title": "Projektingenieur/in für Motoren Integration (m/w/d)",
    "location": "Fischamend, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357402020/",
    "job_id": "4357402020",
    "source": "linkedin",
    "company_name": "VET7.well",
    "job_title": "IT-Support 2nd Level (m/w/d) – Cloud-Software für Tiermedizin",
    "location": "Untersiebenbrunn, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353977207/",
    "job_id": "4353977207",
    "source": "linkedin",
    "company_name": "ECE",
    "job_title": "Technischer Leiter (m/w/d)",
    "location": "Gerasdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371509537/",
    "job_id": "4371509537",
    "source": "linkedin",
    "company_name": "DO & CO AG",
    "job_title": "Küchenhilfe (m / w / x)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4292024872/",
    "job_id": "4292024872",
    "source": "linkedin",
    "company_name": "Gesundheit Burgenland",
    "job_title": "Oberarzt für Innere Medizin (all gender)",
    "location": "Kittsee, Burgenland, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351923794/",
    "job_id": "4351923794",
    "source": "linkedin",
    "company_name": "TRESCON Betriebsberatungsgesellschaft m.b.H.",
    "job_title": "(Projekt-) Einkauf Tiefbauleistungen Deutschland (w/m/d)",
    "location": "Wolkersdorf, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371853568/",
    "job_id": "4371853568",
    "source": "linkedin",
    "company_name": "DO & CO AG",
    "job_title": "Servicemitarbeiter (m/w/x)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4292034042/",
    "job_id": "4292034042",
    "source": "linkedin",
    "company_name": "Gesundheit Burgenland",
    "job_title": "Facharzt für Chirurgie (all gender)",
    "location": "Kittsee, Burgenland, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337056961/",
    "job_id": "4337056961",
    "source": "linkedin",
    "company_name": "Bunge",
    "job_title": "Elektroingenieur (m/w/d)",
    "location": "Bruck an der Leitha, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368953051/",
    "job_id": "4368953051",
    "source": "linkedin",
    "company_name": "CMA CGM",
    "job_title": "Sales Development Specialist Cambodia",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4292022986/",
    "job_id": "4292022986",
    "source": "linkedin",
    "company_name": "Gesundheit Burgenland",
    "job_title": "Facharzt für Urologie (all gender)",
    "location": "Kittsee, Burgenland, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Ihre WirkungsstätteMit 2.500 engagierten Mitarbeiter*innen bilden wir das Fundament des größten Arbeitgebers im Gesundheitswesen im Burgenland. Flexibilität, Herzlichkeit und Engagement prägen unsere vier Kliniken und die Direktion. Wir suchen Persönlichkeiten, die sich mit Kompetenz und Freude unserem sinnstiftenden Auftrag der Gesundheitsversorgung anschließen.Facharzt für Urologie (all gender)Kittsee | Full-time employee | Eintrittsdatum: As of nowUnsere Klinik Kittsee ganz im Norden des Burgenlandes verbindet Tradition mit Moderne. Traditionelle familiäre Strukturen kombiniert mit einer offenen Kommunikation fördern die Kultur des Miteinanders und schaffen Verbindungen zwischen den verschiedenen Fachdisziplinen. Die vielfältigen Persönlichkeiten unserer Mitarbeiter*innen eingesetzt in flachen Hierarchien schaffen eine Arbeitsumgebung, wo unsere Mitarbeiter*innen hohe Qualität in der Patientenversorgung erbringen.Die urologische Abteilung in der Klinik Kittsee hat zwölf stationäre Betten und zeichnet sich durch ihre kleinen Strukturen und die familiäre Stimmung aus. Es gibt auf der Abteilung keine Nachtdienste, sondern Bereitschaftsdienste und somit eine bessere Lebensqualität für unsere Mitarbeiter*innen. Wir bieten unseren Patient*innen eine allgemeine urologische Ambulanz, onkologische Sprechstunden und eine Inkontinenzambulanz. Ein wertschätzender und respektvoller Umgang ist uns besonders wichtig. Die Behandlungsschwerpunkte liegen auf Prostataleiden, urologische Tumorerkrankungen, Harn-Inkontinenz und Beckenbodenschwäche sowie Steinleiden (Nieren- und Harnleitersteine, Blasensteine).Ihr Wirkungsbereich Unser Leistungsspektrum:Komplexe Behandlung von Patient*innen mit Nierensteinen Endoskopie (URS, PCNL) Steinzertrümmerung (Laser, Trilogy LithoClast...) ESWL (Stein-Stoßwellentherapie - Dornier Delta III) Transurethrale Chirurgie (Prostata, Blasentumor mit PDD, Blasenstein) Inkontinenztherapie (Botox, Band, Hydrogel...) Chirurgie der äußeren Genitalien (Phimose, Hydrozele, Varikozele etc..) Ihr FachgebietFacharztdiplom für UrologieQualitätsorientierte PatientenbehandlungBereitschaft mit jungen Kolleg*innen in einem hochmotivierten Team zu arbeitenFreude an interdisziplinärer ZusammenarbeitGute Kommunikations- und TeamfähigkeitSoziale Kompetenz und FlexibilitätIhre Aufnahme ist in einem Beschäftigungsausmaß von 100% vorgesehen. Das Bruttojahresgehalt beträgt, bei entsprechender Qualifikation, auf Basis einer 40h-Woche mind. € 126.077,- (B2/19, inklusive Marktzulage).Bei einer 48h-Woche inklusive verlängerter Dienste liegt das Einstiegsgehalt für einen Facharzt bzw. eine Fachärztin im ersten Berufsjahr bei ca. € 146.000,-. Durch facheinschlägige Berufserfahrung kann sich das Gehalt wesentlich erhöhen. Zusätzlich steht das Erlangen von Zusatzqualifikationen, eine laufende Weiterbildung und Karrieremöglichkeiten bei uns im Fokus.Wenn wir Ihr Interesse geweckt haben, freuen wir uns auf Ihre Online-Bewerbung über unsere Jobbörse unter www.gesundheit-burgenland.at/karriere.Ihr exklusiver Ärzteservice im Burgenland:Mag. Viktoria Lehner, MATel.: +43 (0)5 7979 36436Mail: arztservice@gesundheit-burgenland.at Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369324039/",
    "job_id": "4369324039",
    "source": "linkedin",
    "company_name": "CMA CGM",
    "job_title": "Sales Development Specialist Cambodia",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320884627/",
    "job_id": "4320884627",
    "source": "linkedin",
    "company_name": "DO & CO AG",
    "job_title": "Servicemitarbeiter (m / w / x)",
    "location": "Schwechat, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "StellenbeschreibungWir Suchen Dich Für Unser Flughafenteam! Du Wohnst In Wien Oder Umgebung Und Kannst Zuverlässig Zum Flughafen Kommen. Deine Aufgaben UmfassenZubereitung von Kaffee-, Tee- und Saft­spezialitätenVerkauf von Speisen und Getränken sowie GästeserviceBetreuung von Buffet, Gäste- und KüchenbereichKassiertätigkeitenEinhaltung von Hygiene- und QualitätsstandardsEinsatz von Montag bis Sonntag, Dienstzeiten zwischen 04:00 und 22:00 UhrFlexibilität zur Arbeit im SchichtdienstUnternehmensbeschreibungAn unserem Standort am Flughafen verwöhnen wir unsere Gäste mit Premium DO & CO Qualität jeglicher Art. Unsere Food Courts bieten ein breites Band an kulinarischen Köstlichkeiten. Schaffen Sie unvergessliche Momente für internationale Gäste aus aller Welt und tragen Sie dazu bei, dass Premium DO & CO Qualität in die Welt getragen wird.QualifikationenAusbildung oder Berufserfahrung in GastronomieGepflegtes, freundliches und professionelles AuftretenSaubere, verlässliche und qualitätsbewusste ArbeitsweiseTeamfähig, kommunikativ und serviceorientiertEinwandfreies LeumundszeugnisGute Englisch- oder Deutschkenntnisse (weitere Sprachen von Vorteil)Flexibilität für Schichtarbeit und Erreichbarkeit des Flughafens im DienstzeitfensterZusätzliche InformationenMonatlicher Bruttolohn ab € 2.026 + Trinkgeld (ab ca. € 400 netto bei Vollzeit) Empfehlungsprämie von € 1.000 für die Empfehlung eines Freundes oder FamilienmitgliedsKostenlose ParkmöglichkeitenKostenlose Busfahrkarten zum und vom FlughafenKostenloses Mittagessen und Obst wird zur Verfügung gestelltMöglichkeit zur Erweiterung von Fähigkeiten und Kenntnissen durch interne SchulungenEchte berufliche Entwicklungsmöglichkeiten, national und internationalGenau wie die unterschiedlichen Zutaten ein Gericht perfekt und besonders machen, so schätzen wir Diversität in unserem Unternehmen in Bezug auf unseren Mitarbeiter:innen. Jede:r ist herzlich willkommen - unabhängig von Geschlecht, Herkunft, Religion, Ethnizität und sexueller Orientierung. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370638660/",
    "job_id": "4370638660",
    "source": "linkedin",
    "company_name": "ARDB Bank",
    "job_title": "បុគ្គលិកគ្រប់គ្រងហានិភ័យឥណទាន",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371339490/",
    "job_id": "4371339490",
    "source": "linkedin",
    "company_name": "Nextstep Recruitment",
    "job_title": "Senior Accountant / Assistant Accounting Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352350564/",
    "job_id": "4352350564",
    "source": "linkedin",
    "company_name": "NTT DATA, Inc.",
    "job_title": "Senior Financial Accountant",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367563639/",
    "job_id": "4367563639",
    "source": "linkedin",
    "company_name": "Nextstep Recruitment",
    "job_title": "Senior Accountant / Assistant Accounting Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Location: Phnom Penh, CambodiaEmployment Type: Full-time, PermanentWorkplace: Office-basedSalary Range: USD $500 – $700 (negotiable based on experience)Role OverviewThe Senior Accountant / Assistant Accounting Manager will support the Finance Manager in overseeing the full accounting function of the business. The role covers core operational accounting, financial reporting, tax compliance, and supervision of junior accounting staff.Who is This Role ForThis role is ideal for a Assistant Accounting Manager, Finance Manager, or Senior Manager looking to step up who enjoys responsibilitie across reporting, compliance, budgeting, and team supervision, making it a strong progression step toward Finance Manager level.Key ResponsibilitiesIssue invoices and official receipts Manage accounts receivable (AR) and follow up on overdue payments Post income and maintain daily accounting records Handle cheque collection and cheque preparation Oversee daily accounting activities (AP, AR, payroll, cash, inventory)Support budgeting, forecasting, and variance analysis Prepare monthly and yearly financial reports Ensure accuracy of financial statements and supporting scheduleEnsure compliance with local tax regulations Handle e-filing for VAT, WHT, and salary tax Maintain proper documentation for audits and tax reviewsSupport internal and external auditsRequirementsBachelors degree in Accounting, Finance, or related field 3–5 years experience in accounting or finance Strong knowledge of taxation and financial reporting Good analytical skills and attention to detail Comfortable working with Microsoft Excel and accounting software Experience with QuickBooks or similar systems is an advantageAble to communicate clearly in a professional office environmentAbout The CompanyThe employer is a well-established employer in Cambodia's design, construction and project delivery sector, working with top brands. The business delivers professional services across commercial and residential projects and maintains a strong reputation for quality, compliance, and operational efficiency. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363156739/",
    "job_id": "4363156739",
    "source": "linkedin",
    "company_name": "COSTMEBEAUTY",
    "job_title": "Finance Accounting Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317219626/",
    "job_id": "4317219626",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Manager, Corporate Finance",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317208817/",
    "job_id": "4317208817",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Finance Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368980199/",
    "job_id": "4368980199",
    "source": "linkedin",
    "company_name": "Realestate.com.kh",
    "job_title": "Finance & Transaction Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3852468625/",
    "job_id": "3852468625",
    "source": "linkedin",
    "company_name": "MVL",
    "job_title": "Finance Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Key ResponsibilitiesSet up and manage rule of accounting team Be able to manage cash flow Work with Senior business teams to grow the business formulating financial, strategies and plans Oversee all financial operations and direct financial planning and structure Coordinate, analyze and report the financial performance to management and Board of Director (Financial Performance, projections and other special projects as required Cash flow reporting Prepare short and long term financial forecasts of financial performance Oversee audit and tax functions, coordinate activities with outside (Audit firm and review firms performance, engagement and external parties Establish, review and update finance policies, framework and procedure that are relevant and cost effective to the business Ensure all financial policies and procedure are in compliance with local business law and regulations Ensure that the regulatory requirement of all statutory bodies are met in particular regulatory reporting to the National Bank of Cambodia Capital expenditure, evaluation and preparation of submissions Setting annual cost rates and prices for customers Manages ongoing cash and liquidity needs for loan fund and operations accounts Finding Risk and Opportunity for the company Manage funding and how to get more profit with the funding Any task assigned by management Job Requirement5 years of experience in related role, and experience in audit firms is great. Strong Knowledge in term of accounting and Cambodian taxes Ability to work effectively with management, engineers, vendors, client, and all office departments. Bachelor or Master Degree in any related field is required. Good in Speaking/Reading/Writing English & Khmer is required. Good Computer skill (Ms. Word, Excel, Power Point, Internet, and Email) Ability to analyse practices, methods and procedures and recommends new procedures. Professionalism, honesty, integrity and teamwork. Smart, flexible, able to work under pressure and complete work with deadline. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369307438/",
    "job_id": "4369307438",
    "source": "linkedin",
    "company_name": "MJQE Group",
    "job_title": "Business And Financial Analyst",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4195540140/",
    "job_id": "4195540140",
    "source": "linkedin",
    "company_name": "Canadia Bank",
    "job_title": "Credit Risk Analyst",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368943418/",
    "job_id": "4368943418",
    "source": "linkedin",
    "company_name": "Wing",
    "job_title": "Finance Transformation Manager",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369304891/",
    "job_id": "4369304891",
    "source": "linkedin",
    "company_name": "Wing",
    "job_title": "Finance Business Analysis Manager",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356790472/",
    "job_id": "4356790472",
    "source": "linkedin",
    "company_name": "DKSH",
    "job_title": "Manager Finance Business Partnering",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368981433/",
    "job_id": "4368981433",
    "source": "linkedin",
    "company_name": "Wing",
    "job_title": "Trade Finance Sales & Advisory Manager",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357359241/",
    "job_id": "4357359241",
    "source": "linkedin",
    "company_name": "ESET",
    "job_title": "Financial Controller",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368741740/",
    "job_id": "4368741740",
    "source": "linkedin",
    "company_name": "Swiss Re",
    "job_title": "Junior Financial Analyst (80-100%, Hybrid)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362257173/",
    "job_id": "4362257173",
    "source": "linkedin",
    "company_name": "Ayming",
    "job_title": "Financial Controller SK/CZ (čiastočný úväzok)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368605815/",
    "job_id": "4368605815",
    "source": "linkedin",
    "company_name": "Slovenská sporiteľňa",
    "job_title": "Senior makro-analytik /čka",
    "location": "Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Do nášho analytického tímu hľadáme seniorného analytika / analytičku, s prehľadom o ekonomickom dianí na Slovensku a v eurozóne, so znalosťou finančných trhov a menovej politiky. Hľadáme kandidáta / tku s veľmi dobrými komunikačnými a prezentačnými zručnosťami, schopnosťou pracovať s dátami, hľadať v nich súvislosti a vyberať to podstatné.Ako sa u nás môžete realizovať:Seniorný člen tímu má za úlohu vypracovávať konzistentnú makroprognózu slovenskej ekonomiky (HDP, trh práce, fiškálne a menové ukazovatele), spolupracovať na komentároch a analytických publikáciách, vystupovať voči médiám a klientom, pripravovať prezentácie na rôzne ekonomické témy pre manažment banky, kolegov a klientov. Flexibilita a schopnosť pracovať pod stresom sú nevyhnutné.V našom tíme zabodujete s:ekonomickým/matematickým vzdelanímanalytickým myslením, záujmom o politické a ekonomické dianie, zvedavosťouznalosťou makroekonómie a finančných trhov, predchádzajúcimi skúsenosťami v tejto oblastiskúsenosťou s prácou s časovými radmi, znalosť ekonometrie je veľmi vítanápokročilá znalosť angličtiny je nevyhnutnáPoďte s nami dokončovať to, čo sme načali a my vás odmeníme:Vašu prácu u nás si vážime. Odmeníme vás 13. platom a ročným bonusom.Extra money za úsilie navyše.Na kvalitné jedlo vám prispejeme 8€. Stravné hradíme v plnom rozsahu, a to aj v dňoch keď dovolenkujete.Participujte aj na úspechoch banky, cez zamestnanecký program sa stanete akcionárom, akcionárkou skupiny ERSTE.Chceme spolupracovať s ľuďmi, s ktorými rád/rada trávite čas. Odporučte nám nových kolegov a kolegyne, a my vás odmeníme sumou až do 1000€.Urobte si radosť, prispejeme vám na ňu 300€ ročne.Na to, aby ste boli na dôchodku finančne fit vám prispejeme do III. piliera až 1200€ ročne.Pre lepšie vyváženie práce a súkromia alebo, aby ste stihli dokončiť načaté aj doma:Dovolenkujte s nami až o 5 dní navyše.Ťažkosti súkromné aj pracovné môžete riešiť cez psychologickú podporu, prostredníctvom linky pomoci pre našich zamestnancov.Veríme, že v zdravom tele je zdravý duch, športujte s Multisport aj UpBalansea kartou.Zdravotný stav váš a vašich blízkych vás vďaka nám nezaskočí – využiť môžete našu digitálnu ordináciu, ktorá Vám je k dispozícií doma aj v zahraničí.Vzdelávajte sa a dokončujte svoje štúdia, veríme, že vám v tom pomôžu workshopy, ktoré pripravujeme spolu s platformou SEDUO.Oddychovať môžete aj vďaka „Lucky“ time.Nečakané výdavky nepočkajú do výplaty, máme pre vás PALM APP.V Sporke sa všetci poznáme aj vďaka spoločným eventom, ktoré organizujeme.Budúcnosť je Vaša v Slovenskej sporiteľniMzda: minimálne 2 500 EUR/mes. Uvedená výška mzdy predstavuje minimálnu garantovanú sumu základnej zložky mzdy vzťahujúcej sa na uvedenú pracovnú pozíciu. Skutočná suma základnej zložky mzdy bude upravená v súlade s vašimi odbornými znalosťami, schopnosťami a inými osobnými charakteristikami. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354470426/",
    "job_id": "4354470426",
    "source": "linkedin",
    "company_name": "MV Motion Advisory",
    "job_title": "Financial Analyst",
    "location": "Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338266407/",
    "job_id": "4338266407",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Financial Analyst",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341040477/",
    "job_id": "4341040477",
    "source": "linkedin",
    "company_name": "Henkel",
    "job_title": "Group Financial Analyst",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4343276482/",
    "job_id": "4343276482",
    "source": "linkedin",
    "company_name": "Mondelēz International",
    "job_title": "Senior Analyst MSC Finance Product Cost",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371468108/",
    "job_id": "4371468108",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Power BI Finance Data Analyst",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366736909/",
    "job_id": "4366736909",
    "source": "linkedin",
    "company_name": "Mondelēz International",
    "job_title": "Senior Analyst, Finance Planning & Performance Management (f/m/x)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4341945222/",
    "job_id": "4341945222",
    "source": "linkedin",
    "company_name": "Johnson Controls",
    "job_title": "Systems Operational & Finance Analysis Manager (EMEA)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Manager Operational Analysis – Systems EMEAAs Manager Operational Analysis – Systems EMEA, you will report directly to the Vice President Systems EMEA and play a pivotal role in driving operational excellence and supporting strategic decision-making across the region.What You Will DoYou will lead operational analysis and reporting for the Systems function across EMEA, ensuring alignment with regional priorities and driving efficiency improvements. Your role will focus on analyzing key performance metrics, managing cashflow and inventory, and providing actionable insights to senior leadership. You will also foster collaboration across teams, manage stakeholder relationships, and coach team members to build a culture of continuous improvement.How You Will Do ItPartner with regional senior leadership to align and prioritize operational initiatives.Analyze trends in KPIs and operational metrics across revenue, cost of sales, expenses, gross margin, Direct Field Labor productivity, utilization, and capacity.Oversee cashflow analysis for systems projects, including inventory and bad debt management.Drive improvements in operational efficiency for the centralized Systems Function, including engineering cost centers, global centers of excellence cost allocation, and cashflow metrics across the region.Lead operational reporting activities (System Scorecard, Metric Bowler, Segment Performance Reporting).Provide leadership and direction in tracking and monitoring committed results.Facilitate cross-functional reviews of key initiatives and support knowledge sharing.Manage stakeholder relationships and incorporate feedback for ongoing process enhancement.Coach and support team members, fostering a culture of continuous improvement.Contribute to internal projects and support ad-hoc assignments as required.RequiredWhat We Look ForBachelor’s degree in quantitative field (mathematics, finance, statistics, business analytics, data science, engineering, or equivalent).8+ years of experience in operational analysis, FP&A, or related discipline.Advanced proficiency in Power BI, Microsoft Excel, and PowerPoint.Strong analytical, mathematical, and statistical skills for data analysis, forecasting, and modeling.High standards of accuracy, precision, and organizational ability.Ability to work independently, take initiative, and drive tasks to completion.Excellent communication and interpersonal skills; proven ability to work in cross-functional, fast-paced environments.Fluent in English (written and spoken).PreferredExperience with HFM/OneStream.Prior leadership or management experience in a regional or global context.Our BenefitsAt Johnson Controls, we believe your work should come with perks that make life better. After your first six months, you’ll enjoy a regular monthly bonus. You’ll also enjoy meal vouchers that you can use in the building’s canteen, along with retail discounts that make the most of our great location and help with everyday errands.Our flexible benefits program gives you the freedom to choose what matters most to you. With over 3,500 options, you can tailor your benefits to fit your lifestyle – from gym memberships and multi-sport cards to medical coverage and wellness services.Relocating to join us? We’ll support your move with a housing allowance, making it easier to settle into your new home and start your journey in Slovakia.The gross monthly salary for this position starts from 2900 EUR per month, plus a monthly bonus that starts after your first 6 months. Please note this is a minimum salary and our compensation packages are based on your professional experience and qualifications.Our Culture At Johnson Controls you’ll have the opportunity to work on some of the most exciting projects in today’s market. Our hardworking people empower us, and we believe in being part of a team that is open, collaborative, results-oriented, hardworking and above all fun.We believe that diversity and inclusion matter and make a difference. By embracing the true value of diversity and inclusion, getting comfortable with having crucial conversations, and valuing different perspectives, we will be one of the most desirable places to work. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367179503/",
    "job_id": "4367179503",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Power BI Finance Data Analyst",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionWelcome to Kanadevia Inova, a global innovation leader in the waste infrastructure space, where we believe in creating a sustainable future through technology and innovation.Transforming Waste into ValueAt Kanadevia Inova, we pride ourselves on being at the forefront of waste-to-X technology. We are not just waste managers; we are creators of value from what communities discard. Your role at Kanadevia Inova directly contributes to turning something once considered useless - waste - into something invaluable: energy, heat, hydrogen, fertilizer, and beyond..Find out more about Kanadevia Inova at www.kanadevia-inova.com.Job DescriptionConsolidate and validate financial data from multiple sources, ensuring accuracy and completeness.Develop and maintain processes and databases for financial data aggregation in collaboration with IT.Use SQL to extract and analyze financial data, and create interactive Power BI dashboards.Partner with stakeholders to gather requirements, deliver insights, and support decision‑making through reports.Support the rollout of new digital tools and process improvements across finance.QualificationsAt least a Bachelor’s degree in Computer Science, IT, or Finance.Database Management: Knowledge of database systems and experience with querying languages, such as SQL (SQL Server).Experience in Power BI, including data modelling, DAX (Data Analysis Expressions), and report/dashboard development.Experience in financial reporting and analysis, with adaptability to new tools and methodologies.Proficient in MS Office and fluent in English.Additional InformationEmployment contract for an indefinite period+ 13th SalaryAnnual bonus (based on company results)Financial reward for working anniversariesFlexible working time (core time 9-3:30)Home Office possible 2 days a weekExtra days of leave (+1 day after the first, third and fifth year of service)Extra days of leave for special personal events (e.g., wedding, graduation etc.)Modern infrastructureFree drinking regime (coffee)Recreation allowanceMultisport cardThe third pillar of the pension schemeSupport for professional and career growth, education and trainingSupportive and team-oriented working environmentFor HR agencies: Please note that we do not accept applications coming from agencies. Thank you. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4312870134/",
    "job_id": "4312870134",
    "source": "linkedin",
    "company_name": "PwC Slovakia",
    "job_title": "Operations and Digitalization Analyst with German language skills - Financial Transformations (m/f)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Are you ready to turn strategies into successful projects? If German is your strong suit and you have experience in banking, insurance, sales, service, or project management — or you're simply passionate about these sectors—then you might be exactly who we’re looking for!At PwC Intelligence Processes Center team, it’s not just about being part of a large organization—it’s about understanding how things work across different companies. We operate at the heart of transformation, working in project teams that deliver everything from design to implementation of top-tier business and technology solutions for clients, primarily in Germany. We help them rethink how banks, insurance companies, and investment firms operate. You’ll be part of international projects where you’ll see the real impact of your work.At PwC, we value your effort, support your growth, and care about your health and well-being. Join us and experience a workplace where technology meets business—and your skills gain international relevance.What will your role involve?As an Operations Analyst, you’ll support transformation projects focused on operational efficiency and digitalization in the financial sector.Assist in analyzing and optimizing operational processes in banking and financeContribute to projects focused on back-office and middle-office digitalizationGather and process data for reporting and decision-makingSupport implementation of tools like business analytics, RPA, and process miningCommunicate across teams and support day-to-day operationsWhat makes you a great fit:University degree in economics, business administration, business informatics, business engineering or a related fieldGraduate or approx. 1 year of experience in banking, asset/wealth management, business analysis or consultingPassion for technology and its business applicationsOpen-minded approach to finding innovative solutions and willingness to learn new toolsStrong interpersonal and communication skills—daily collaboration with clients and teamMotivated, ambitious, and team-oriented mindsetEnglish at least B2 level German and English fluency (C1 level)—you’ll be working with German-speaking clients and teamsBenefits You Can Enjoy While Working At PwCFinancial Rewards: Benefit from regular salary reviews, performance bonuses and other special bonuses. Enjoy meal contributions and a cafeteria benefit system offering personalized choices. Flexibility & Work-Life Balance: Enjoy our hybrid working policy, flexible working hours, 2 extra days off during Christmas along with Sick-days. Every minute of your extra work is valued and compensated. Career Development: Engage in tailored internal and external training programs as well as structured career development plan. Health & Well-being: Access premium benefits such as Multisport card and medical center membership. Take advantage of our Well-being and Work-Life Coaching program. Supportive Culture: Participate in teambuilding activities and social events and join our employee referral program. Experience a culture with regular feedback and a supportive environment. Global Opportunities: Seize the opportunity for international assignments and work on diverse projects with international clients. Explore the world while working with the possibility of working from abroad. Extra perks: Use various discounts at partner companies such as cars, health care, beauty, culture or others. Transfer up to 4 telephone numbers at discounted rates. Place of work: Karadžičova 2, Bratislava, Slovakia (Job with occasional home office)Start date: by agreementContract type: full-timeWage (gross): From 1 900 EUR/month (base salary is 1 600 EUR + regular monthly bonus 300 EUR for knowledge of the German language)Information About The Selection ProcessIf you'd like to apply for this position, please click on the \"Send CV\" button below.Data privacy announcement you can find here: https://pwc.to/2s8n2tnWe seek to hire people who are great at what they do and bring our behaviours to life in how they do it. Our PwC Professional framework guides us to work together to create a better tomorrow. Together, Trusted Leadership and Distinctive Outcomes are how we deliver on our purpose and strategy, serving our clients and living our values in every interaction, everyday. The PwC Professional framework defines the behaviours we’re all expected to demonstrate at PwC and what we look for in our future talent.Are you ready to be a PwC Professional?If the current position is not right for you but you have friends or acquaintances in your area who could also be interested in working with us at PwC, feel free to direct them to us. If we establish cooperation with a candidate recommended by you, you can receive a reward ranging from 300 to 1000 EUR, depending on the seniority of the candidate. You can find the referral form at this link: https://www.pwc.com/sk/en/careers/get-rewarded-for-recommending-candidate.html Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369045600/",
    "job_id": "4369045600",
    "source": "linkedin",
    "company_name": "Talentor Austria",
    "job_title": "Finance Manager",
    "location": "Fischamend, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337988018/",
    "job_id": "4337988018",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Junior Accountant ($300 - $450)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360581402/",
    "job_id": "4360581402",
    "source": "linkedin",
    "company_name": "ING Hubs Slovakia",
    "job_title": "Data Analyst (Financial Markets & eServices)",
    "location": "Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "As Data Analyst, you will be responsible for gauging and analyzing the quality of FM data, harmonizing the data for use across FM processes. You initiate and implement changes required to ensure continuous flow of data and maintain data consistency.You have an overview of the product portfolio and know how the systems interact with each other on the data level. For the tasks assigned to you on specific epics (usually related to data), you will perform analysis on the impact on processes, systems and document it.You will assist (and challenge where needed) the epic owner on epic execution. You will take all possible measures to ensure that the processes you are responsible for work smoothly and any potential roadblocks or risks are addressed or escalated in a timely manner be it in on the content level or on operational level.Main roles and responsibilities:You have good overview of system landscape and data flows; help design and maintain data model and controls.Automate data processing and reconciliation tasks to improve efficiency, accuracy, and reliability.Analyze and assess database design and architecture by translating business requirements into structural data needs, ensuring efficient data flows and optimized reporting and BI solutions.You facilitate FM support and front office teams in need of data output, ensure fast turnaround time on data requests; respond to system/database problems in a timely manner.Drive and implement changes in data models, architecture, and reporting/BI solutions, including the creation, maintenance, and continuous improvement of BI dashboards and underlying data retrieval processes.We are looking for:A colleague with a talent for taking it on and making it happen, enthusiasm for helping others to be successful and a knack for always being a step ahead. In other words, you strive to bring fresh ideas to life and embrace challenges in a fast changing and complex environment. You are a naturally collaborative person who listens and invests in others to achieve common goals. You love to challenge the status quo and are eager to propose creative solutions to problems.Competencies and experienceRequired 2–3 years of experience in a data‑related role.Hands on Expercience with Power Bi, Python, and/or Google Cloud Platform.Experience with the Microsoft Power Platform (Power Automate, Power Apps) is considered an asset.Strong foundational knowledge of database design and development, data modeling, data mining techniques, and data analytics principles.Fluency in English, both written and spoken.Aspiration to learn more about ML/AI and possible use case implementation.Experience working in a project‑based environment, including exposure to project coordination or steering activities.Knowledge of the financial industry and/or financial markets is a strong plus.High level of accuracy with strong attention to detail.An inspiring, energetic and approachable person, displaying the following behaviours:Proactive, can-do, on top of your process (no surprises), positive mind-set, team player.Strong communication and influencing skills.The ability to facilitate decision-making to drive complex design issues to a conclusion.Strong ability to understand and consider the underlying issues, opportunities and dynamics of an international organization with multiple functional and hierarchical lines, dealing with multiple (sometimes conflicting) interests.A strong focus on understanding the business requirements and supportive data to build the target operating model design in line with INGs ambitions.The ability to display flexibility to teams and adapt the plan, approach and behavior to different needs, cultures and situations.A strong resilience: the ability to navigate through ambiguity and simplify complexity without losing essence.Wage (gross): 2.346 EUR/month*By legal requirement we are providing the information about the basic wage component (minimum salary) for the advertised position. Based on your experience/profile, the final financial conditions will be the subject to discuss and negotiate at the personal interview, however, not less than above mentioned minimum salary component.We offer you a bunch of great benefitsFriendly working environmentYou build your own working day - flexible working hours and work from homeDaily working time: 7hrs 45min instead of standard 8hrsDaily refreshments - coffee, fruits, drinksFully equipped gym accessible 24 hours / 7 days per weekGame room with unlimited accessModern designed coffee corner and terrace with the grill spotWellbeINGSick leave compensation: up to 80% of the monthly salaryLife insurance contribution: up to 22,14 EUR/per month3rd pillar contribution: up to 3% from your monthly salary24/7 external mental health supportLearning opportunities: internal and external learning programsRegular teambuildings, social events and communitiesYOU/family/friends timeExtra 3 PERSONAL days per yearExtra vacation days: up to 10 extra days/per yearWe wel",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337790813/",
    "job_id": "4337790813",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Accountant",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338147337/",
    "job_id": "4338147337",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Accountant Intern",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339506845/",
    "job_id": "4339506845",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Accounting Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356575624/",
    "job_id": "4356575624",
    "source": "linkedin",
    "company_name": "Sabara Best Food Co., Ltd",
    "job_title": "Accountant",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317213661/",
    "job_id": "4317213661",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "គណនេយ្យករ-ផ្នែកត្រួតពិនិត្យហិរញ្ញវត្ថុ (Accountant -Financial Control...",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368087786/",
    "job_id": "4368087786",
    "source": "linkedin",
    "company_name": "THE FLORA GROUP",
    "job_title": "Accounting Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338167050/",
    "job_id": "4338167050",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Finance Supervisor (02 Positions at Head Office)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339501686/",
    "job_id": "4339501686",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Finance Supervisor (2 Positions at Head Office)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337988026/",
    "job_id": "4337988026",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Finance Supervisor (1 Position at Head Office in Phnom Penh)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317220637/",
    "job_id": "4317220637",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Clearing Officer (1 Position at Head Office in Phnom Penh)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4337997815/",
    "job_id": "4337997815",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Deputy Head of Payment and Fixed Asset Payment Unit (1 Position at Hea...",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368707285/",
    "job_id": "4368707285",
    "source": "linkedin",
    "company_name": "Agb Consulting-EoR, RPO, HR Outsources & Compliance",
    "job_title": "Accounting Manager",
    "location": "Tuol Kouk, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "🚀 We’re Hiring: Accounting Manager📍 Location: Khan Toul Kork, Phnom Penh, Cambodia🏢 Industry: Global Property Management⏰ Work Schedule: Monday – Saturday (Morning) | 9:00 AM – 6:00 PMUnder the supervision of the Chief Operating Officer (COO), the Accounting Manager will lead and oversee the full accounting functions of managed properties, ensuring accuracy, compliance, and efficiency across all financial operations.🔑 Key ResponsibilitiesPrepare monthly and annual financial statements for internal management reportingMonitor daily cash flow and ensure sufficient funds for operationsReview and approve journal entries, payment vouchers, and reconciliations prepared by the teamOversee accounting for managed properties, including rental income, service charges, utilities, and owner accountsSupervise Accounts Payable and Accounts Receivable functions in line with company policiesAllocate income and expenses accurately to projects for cost tracking and analysisMonitor petty cash usage and ensure accountability across departmentsReview weekly and monthly income and expense reports for each projectIssue sales invoices and closely track receivablesReview monthly GRR income and expense statements prior to submission to developersPerform monthly reconciliations (bank, petty cash, AR, AP, VAT, WHT, PPT, and other tax accounts)Post accruals, prepayments, and manage fixed asset depreciation schedulesLead, train, coach, and evaluate the performance of the accounting teamAssist in preparing annual budgets and financial forecastsEnsure timely closing of monthly and annual accountsReview AMA deductions and commission calculations for accuracyIdentify process improvement opportunities and implement best accounting practicesPerform other duties as assigned by management🎓 Job RequirementsBachelor’s degree in Accounting, Finance, or a related fieldMinimum 5 years of progressive accounting experience, preferably in the real estate/property management sectorStrong knowledge of Cambodian tax laws and reporting regulationsProficient in accounting systems (QuickBooks, Sage, Xero) and Microsoft ExcelProven leadership, organizational, and analytical skillsExcellent communication skills in Khmer and EnglishDetail-oriented with a proactive mindset toward continuous improvement🎁 Benefits & PerksCompetitive salarySeniority paymentMeal allowanceQuarterly bonusKhmer New Year & Pchum Ben bonusesAnnual leave, sick leave, and special leaveTraining and professional development opportunitiesClear career advancement and promotion opportunitiesNSSF & work accident insuranceOther company benefits📩 How to Apply Interested candidates are invited to apply by submitting their CV or requesting more information via:Telegram: 096 993 4351Email: ttontan@agb-consulting.com🔖 Hashtags #Hiring #AccountingManager #FinanceJobs #PropertyManagement #RealEstateJobs #AccountingJobs #CambodiaJobs #PhnomPenhJobs #ManagementRole #FinanceCareers #JobOpportunity #LinkedInJobs #AGBConsulting Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317216679/",
    "job_id": "4317216679",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Account Executive (2 Positions)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4339501666/",
    "job_id": "4339501666",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "In-Door Sale and Operation Supervisor",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4294448074/",
    "job_id": "4294448074",
    "source": "linkedin",
    "company_name": "Y Chhe Group",
    "job_title": "OPERATION SUPERVISOR (WAREHOUSE)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4294443340/",
    "job_id": "4294443340",
    "source": "linkedin",
    "company_name": "Y Chhe Group",
    "job_title": "OPERATION SUPERVISOR (INDUSTRIAL PARK)",
    "location": "Kampong Chamlang, Kandal, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4294446151/",
    "job_id": "4294446151",
    "source": "linkedin",
    "company_name": "Y Chhe Group",
    "job_title": "OPERATION MANAGER (WAREHOUSE)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4294447135/",
    "job_id": "4294447135",
    "source": "linkedin",
    "company_name": "Y Chhe Group",
    "job_title": "OPERATION MANAGER (INDUSTRIAL PARK)",
    "location": "Kampong Chamlang, Kandal, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4303627793/",
    "job_id": "4303627793",
    "source": "linkedin",
    "company_name": "PARBURY Career",
    "job_title": "Housekeeping Supervisor",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369693536/",
    "job_id": "4369693536",
    "source": "linkedin",
    "company_name": "BVM Petroleum",
    "job_title": "Accounting Assistant: 01 Post",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368975181/",
    "job_id": "4368975181",
    "source": "linkedin",
    "company_name": "Joy Premium Drinking Water",
    "job_title": "Staff Accountant",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370412519/",
    "job_id": "4370412519",
    "source": "linkedin",
    "company_name": "Bangi Group of Companies",
    "job_title": "Junior Accountant",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Role OverviewWe are looking for a Junior Accountant to support the finance and administrative setup of our Cambodia entity and to be responsible for day-to-day accounting operations once the company is incorporated.This role is suitable for candidates with foundational accounting knowledge who are keen to gain hands-on exposure in a multinational and start-up environment, with guidance and training from senior finance team members.Key ResponsibilitiesPhase 1: Pre-Incorporation Support# Assist with the preparation and submission of documents for company incorporation with the Cambodia - Registrar of Companies, under guidance from consultants and senior team members# Support the opening of bank accounts and statutory registrations as required by Cambodian authorities# Help set up basic accounting records and systems for the new company# Organise and maintain incorporation and statutory documentsPhase 2: Post-Incorporation & Daily Operations (Accounting Support)Responsible for the maintenance of accounting records, including but not limited to:# Accounts Payable (AP)# Accounts Receivable (AR)# Invoicing# Cashbook entries# General Ledger support# Support monthly bank reconciliations and month-end closing activities# Prepare basic financial schedules and reports for review by senior finance staff# Tax & Statutory AssistanceThe potential candidate would be responsible for the preparation of tax filings and payments in accordance with Cambodian regulations.It is also important that the individual supports communication with government authorities on routine statutory matters and maintain proper filing of statutory and tax documents.Payroll & Administrative SupportThe potential candidate will be responsible for the maintenance of employee records and profile files.Support monthly payroll preparation and statutory employee contributions under supervisionEnsure payroll and employee information is handled confidentiallyAudit & Documentation# Organise and file accounting documents for statutory and audit purposes# Assist during year-end audits by preparing supporting documents and schedules# Maintain proper archiving of financial and statutory recordsRequirements & Qualifications• Diploma or Bachelor’s Degree in Accounting, Finance, or related field• 0–2 years of working experience in accounting or finance (fresh graduates are welcome)• Basic understanding of Cambodian accounting and tax regulations is an advantage• Familiarity with MS Excel and basic accounting systems• Willingness to learn and ability to follow processes and instructions• Good organisational skills and attention to detail• Basic communication skills in English and Khmer Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318008471/",
    "job_id": "4318008471",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Account Receivable",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4316221142/",
    "job_id": "4316221142",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Account Officer ($300-$500)",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesManage all accounting transactions, handle monthly, quarterly and annual closingsManage balance sheets and profit/loss statements.Manage and control petty cash and A/R/A/PFilling all accounting transaction into system.Daily, weekly and monthly report of invoicing totals, aging total and cash receipts.Perform other tasks assigned by line management.Job RequirementsBachelor Degree in finance and accounting or related to filed.Two year experiences in accountant.Be able to communication in English.Can be use Microsoft Office (Word, Excel….etc..).Fast learner, efficient work, be able to work under pressure and high responsibility.How To ApplyContact Person: HR DepartmentAddress: #705Eo, Monivong Blvd, Beong Keng Kong III, khan Chamkarmorn, Phnom Penh, Cambodia.Phone: Number 015334949/017615125Email: recruitment@nphomecenter.com/savuth.mith@gmail.comWebsite: www.nphnomecenter.comCompany DescriptionNPHC Trading Co., Ltd is one of the largest furniture store in Phnom Penh, Cambodia. Established in 1989, NPHC offers once of the industry's broadest product assortments to consumers in Cambodia. Our product ranges from Furniture, Bedding accessories, Custom Cabinetry, Interior design materials, Food and beverage (AMAZON St.310) as well as Interior design services. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324307192/",
    "job_id": "4324307192",
    "source": "linkedin",
    "company_name": "Swiss Re",
    "job_title": "Accountant (Hybrid)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369334372/",
    "job_id": "4369334372",
    "source": "linkedin",
    "company_name": "CHHAYVANN CO., LTD.",
    "job_title": "Accounting Officer",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Responsibilities· Record sale & purchase slip in excel & system.· File/ store related documents.· Record trading transaction with supplier· Assist with tax declarations.· Record daily operation expenses in the system.· Enter any accounting data into the system.· Prepare invoices for customers.· Update accounts receivable & payable.· Assist the senior accountant and the accounting supervisor in daily operational transactions.. Other tasks assigned by the CFO.Qualifications· Year 3 bachelor's in a related field (Law, Banking, Finance, Accounting, ...).· Good with numbers and figures and an analytical acumen.· Good understanding of accounting and financial reporting principles and practices.. Knowledge of computer software & Microsoft Excel Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320229215/",
    "job_id": "4320229215",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Payroll Accountant (F/M)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4317217648/",
    "job_id": "4317217648",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "AR Account",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesTimely and accurately issue monthly invoices after getting the data from sale admin and manual invoices.Ensure on-time delivery of invoices to clients by three working days of each month.Move differed revenueDo AR report workingCall follow up clientsCollect payment from clients ( checks and cash)Reconcile A/R report and clients’ statementsDeposit checks and cash in bankBook monthly receiptAllocate Account ReceivableCalculate agency rebateBook other revenueAccrued revenue sharing and sale commissionsCalculate revenue sharing and interest charge of overdue amountsIssue reminding lettersReconcile monthly revenue between Finance Department (Invoicing) andSales Department (S.O).Job RequirementsTimely and accurately issue monthly invoices after getting the data from sale admin and manual invoices.Ensure on-time delivery of invoices to clients by three working days of each month.Move differed revenueDo AR report workingCall follow up clientsCollect payment from clients ( checks and cash)Reconcile A/R report and clients’ statementsDeposit checks and cash in bankBook monthly receiptAllocate Account ReceivableCalculate agency rebateBook other revenueAccrued revenue sharing and sale commissionsCalculate revenue sharing and interest charge of overdue amountsIssue reminding lettersReconcile monthly revenue between Finance Department (Invoicing) andSales Department (S.O).How To ApplyHow to Apply:Email: career@ctn.com.khTel: 017 333 250Address: National Road 5, Phum Krolko, Sangkat Kilomet Nº 6, Khan Russey Keo, Phnom PenhCompany DescriptionCambodian Broadcasting Service (CBS) operates 4 stations CTN, MYTV CNC, and CTN International delivering high-quality international and locally produced programming to every Cambodian household. CTN has currently rated the best Cambodia television station with the largest audience base and also delivers service to the Khmer community living in the United States via DTH TV as well as Australia and Canada.Currently, we are looking for young and dynamic individual to fulfill the following position.Tagsaccount accountant accounting accountrecive Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368338406/",
    "job_id": "4368338406",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368327642/",
    "job_id": "4368327642",
    "source": "linkedin",
    "company_name": "Kanadevia Inova",
    "job_title": "Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionWelcome to Kanadevia Inova, a global innovation leader in the waste infrastructure space, where we believe in creating a sustainable future through technology and innovation.Transforming Waste into ValueAt Kanadevia Inova, we pride ourselves on being at the forefront of waste-to-X technology. We are not just waste managers; we are creators of value from what communities discard. Your role at Kanadevia Inova directly contributes to turning something once considered useless - waste - into something invaluable: energy, heat, hydrogen, fertilizer, and beyond..Find out more about Kanadevia Inova at www.kanadevia-inova.com.Job DescriptionProcess invoices, prepare payments, and maintain accurate records in the accounting system.Reconcile vendor statements, resolve discrepancies, and maintain positive vendor relationships.Review and process employee expense reports, ensuring compliance with company policies.Assist in month-end closing procedures and generate accounts payable reports.Ensure compliance with accounting regulations and identify process improvements while working efficiently in a fast-paced environment.QualificationsBachelor’s degree Economics, Finance, Accounting or related field (Master’s preferred).3+ years of experience in finance, with at least 2 years in a similar role in international environment (Shared Services Center experience advantage)Experience with ERP systems and in accounting software, intermediate proficiency in Microsoft Excel and WordStrong accuracy in data entry, with the ability to spot and resolve discrepanciesExcellent organizational skills and effective communication with internal and external customers (vendors)Proficiency in English at B2 level, with strong written and verbal communication.Additional InformationEmployee perks, benefitsEmployment contract for an indefinite period+ 13th SalaryAnnual BonusFlexible working time (core time 9-3:00)Home Office possible 2 days a weekExtra days of leaveSick DaysRecreation allowanceReferral ProgramTravel allowanceThe third pillar of the pension schemeSupport for professional and career growth, education and trainingFor HR agencies: Please note that we do not accept applications coming from agencies. Thank you.For HR agencies: Please note that we do not accept applications coming from agencies. Thank you. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358872028/",
    "job_id": "4358872028",
    "source": "linkedin",
    "company_name": "MIS s. r. o.",
    "job_title": "Accountant",
    "location": "Petržalka, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4291867461/",
    "job_id": "4291867461",
    "source": "linkedin",
    "company_name": "Covestro",
    "job_title": "Fixed Assets Accountant (Maternity Leave Replacement)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321539918/",
    "job_id": "4321539918",
    "source": "linkedin",
    "company_name": "Clarios",
    "job_title": "AP Travel & Expense Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Join the world leader in advanced energy storage solutions and be part of the success story of VARTA®!At Clarios, we’re powering today, into tomorrow. Do you want to join a company that cares about your future development and wellbeing? This is not just a statement. Do you know why?Here are 10+1 things we guarantee:Professional development opportunities and language coursesFlexible working hours, home office and extra vacation daysMonthly bonus after 6 months of employment and annual bonusExtra contribution to meal cardSpecial bonus for important life events (wedding, new baby)Complex onsite care – workplace massages, workshops, individual medical examinations, and consultations tailored to your needsRegular onsite exercisesModern private canteenEmployee events, volunteering, and team-buildingsRelocation package and housing allowance if you are relocating to Bratislava to join our teamOn top of that, you will receive a flexible benefits allowance so you can tailor the rest of the benefits to suit your individual needs - ProCare, Vas Lekar, 3rd Pillar investment, Multisport card, Golem one pass etc. Your contribution:We are seeking a highly organized and detail-oriented Travel and Expenses Analyst to join our Finance team. This vital role is responsible for the timely and accurate processing, auditing, and compliance of all employee travel and expense reports, ensuring adherence to company policy and regulatory requirements.Credit Card and Expense DutiesProcess and audit all incoming employee expense reports for completeness, accuracy, and adherence to the Clarios T&E policy and ethical standardsManage the workflow and disbursement of payments for approved expense reports, cultivating trust and transparencyAdminister and maintain the corporate credit card program, including account setup, limits, and reconciliationServe as the primary point of contact for employee inquiries regarding T&E policy, expense report submission, and system usagePrepare T&E related reports and analyze spending trends to identify cost-saving opportunitiesAssist in month-end closing procedures related to expense accruals and reportingIdentify opportunities for process improvement and efficiency within the T&E functionProactive application of Continuous Improvement (CI) cultureTravel Support FunctionSupport procurement and travel-related activities, e.g. Conduct Annual Hotel RFPRespond to inquiries submitted to Travel Support InboxAirlines main point of contactProvide travel related reports as requestedSupport Administrative role for NAVAN travel management toolOther travel duties as assignedKnowledge, Skills and Abilities:Highschool or a Degree in Finance, Accounting, or related fieldUnderstanding of accounting principles, particularly in expense management and reconciliationDesirable 2+ years of experience in T&E or Accounts PayableFluent in English, knowledge of other languages is beneficialFamiliarity with expense management systems (e.g. Workday, SAP Concur, NAVAN,) is a plusExperience with corporate card programs and global travel policies - preferredAgility and adaptability to changesExcellent communication, problem-solving and customer service skills, with the ability to interact effectively with employees at all levelsAbility to handle confidential information with integrityAttention to detail and a commitment to accuracyCollaborative mindsetAbility to work under pressure and meet deadlinesThe starting salary is at min 1400 EUR/month gross for candidates who meet our minimum criteria.This amount is our minimal offered salary. Clarios values each and every candidate and we ensure our compensation package aligns with your professional experience and your expectation.About Clarios: Clarios is the global leader in advanced, low-voltage battery technologies for mobility. Our batteries and smart solutions power nearly every type of vehicle and are found in 1 of 3 cars on the road today. With around 18,000 employees in over 100 countries, we bring deep expertise to our Aftermarket and OEM partners, and reliability, safety and comfort to everyday lives. We answer to the planet with a rigorous sustainability focus – advancing best-in-class sustainability practices and advocating for them across our industry. We work to ensure 100% of our products sold are recyclable, and we recycle 8,000 batteries an hour in our network. You can find more information here (PDF).To all recruitment agencies: Clarios does not accept unsolicited agency resumes/CVs. Please do not forward resumes/CVs to our careers email addresses, Clarios employees or any other company location. Clarios is not responsible for any fees related to unsolicited resumes/CVs.Clarios, LLC is an equal employment opportunity and affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, status as a qualified individual with a disability, or any other ",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362040962/",
    "job_id": "4362040962",
    "source": "linkedin",
    "company_name": "LANDGARTEN GmbH & Co. KG",
    "job_title": "Buchhalter:in",
    "location": "Bruck An Der Leitha, Lower Austria, Austria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4324386554/",
    "job_id": "4324386554",
    "source": "linkedin",
    "company_name": "Swiss Re",
    "job_title": "General Ledger Subject Matter Expert (Hybrid)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363655349/",
    "job_id": "4363655349",
    "source": "linkedin",
    "company_name": "STRABAG",
    "job_title": "Účtovník na oddelení bilancií m/ž",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329875623/",
    "job_id": "4329875623",
    "source": "linkedin",
    "company_name": "Colliers",
    "job_title": "Senior Finance and Administration Specialist",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4331000844/",
    "job_id": "4331000844",
    "source": "linkedin",
    "company_name": "PwC Slovakia",
    "job_title": "Accountant with German Language – International Projects (m/f)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359078789/",
    "job_id": "4359078789",
    "source": "linkedin",
    "company_name": "PwC Slovakia",
    "job_title": "AP Accountant (m/f)",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354913096/",
    "job_id": "4354913096",
    "source": "linkedin",
    "company_name": "P3 Logistic Parks",
    "job_title": "Junior Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366530633/",
    "job_id": "4366530633",
    "source": "linkedin",
    "company_name": "Clarios",
    "job_title": "AP Accountant",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323653274/",
    "job_id": "4323653274",
    "source": "linkedin",
    "company_name": "Kyndryl",
    "job_title": "Statutory Financial Statement Preparer – Romania Focus",
    "location": "Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4320229263/",
    "job_id": "4320229263",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "TAX Intern",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4294002974/",
    "job_id": "4294002974",
    "source": "linkedin",
    "company_name": "Dentsply Sirona",
    "job_title": "Accounts Receivable Cash Applications Specialist I US shift",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Dentsply Sirona is the world’s largest manufacturer of professional dental products and technologies, with a 130-year history of innovation and service to the dental industry and patients worldwide. Dentsply Sirona develops, manufactures, and markets a comprehensive solutions offering including dental and oral health products as well as other consumable medical devices under a strong portfolio of world class brands. Dentsply Sirona’s products provide innovative, high-quality and effective solutions to advance patient care and deliver better and safer dentistry. Dentsply Sirona’s global headquarters is located in Charlotte, North Carolina, USA. The company’s shares are listed in the United States on NASDAQ under the symbol XRAY.Accounts Receivable Cash Applications Specialist I US ShiftAs AR Cash Applications Specialist you will manage cash received from Dentsply Sirona customers and apply to the open invoices as per the remittance advices timely and accurately, with consistent, measurable compliance with the corporate policies governing Accounts Receivable. You will ensure that all unapplied and unidentified cash items are regularly monitored and resolved accurately and timely. You will also ensure that all customer open balances for assigned business units are regularly monitored, payments are received accurately and timely and invoice disputes are resolved within defined deadlinesResponsibilitiesControl and post incoming payments received from customers through various payment methods (bank transfers, checks, direct debits, credit cards) to the Accounts Receivable ledger and allocate them to the relevant customer accounts and invoices in accordance with customer remittance advice details Identify and process short payments/ deductions made by the customer based on remittancesProduce unapplied cash reports and unidentified cash reports, in cooperation with the Accounts Receivable Collection team investigate and resolve unapplied and unidentified cash items where remittance details are missingProcess approved refund requests, write-off requests and adjustment journals to the bad debt provisionReconcile Accounts Receivable ledger accounts with sub-ledger accountsAnalyze customer accounts and monitor list of open balances, delayed payments and other divergencesPrepare and distribute customer account statements and dunning letters in coordination with established Account Receivable schedules in accordance with policies and procedures as assigned by specific role definitionInteract with division personnel (finance, sales, customer care, department heads, etc.) to receive payment advice for unallocated incoming payments, resolve invoice discrepancies and discuss other routine customer process-related matters.Answer Customer inquiries within one business day whenever possible, or make allowance to refer caller to another associate.Provide Open Accounts Receivable reports as of month-end to General Accountant for account reconciliation.Cross-train with personnel in other functional areas, as required.Notify Accounts Receivable Manager of any unusual Accounts Receivable activity.Other special projects as assigned. Working time is from 13:30-22:00RequirementsEnglish (B2), any other languages will be considered a plusHigh School diploma or bachelor’s degreeAccounts Receivable experience and knowledge of accounting practices directly related to Accounts Receivable processing is a plusWorking knowledge of current versions of Windows, Word, Excel and OutlookAbility to meet deadlinesMotivated self-starter with strong organization and multi-tasking abilities Working time is from 13:30-22:00BenefitsProfessional development and possibility to grow within a newly established Shared Service Center based in Einpark Fully paid meal vouchers 7,70 Eur per working day 3 Health and Wellness days per yearFully paid sick leave up to one monthContribution to dental care up to 150 Eur per yearPension Contribution after 1 yearClasses of foreign languagesAccess to Multisport cardReferral Programe Bonus up to 1200 EurEmployee Assistance ProgrameSocial eventsRefreshment in the office – coffee, tea, water, fruit on WednesdaysYearly performance-based bonus Dentsply Sirona is an Equal Opportunity/ Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, sexual orientation, disability, or protected Veteran status. We appreciate your interest in Dentsply Sirona.If you need assistance with completing the online application due to a disability, please send an accommodation request to careers@dentsplysirona.com. Please be sure to include “Accommodation Request” in the subject. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360792928/",
    "job_id": "4360792928",
    "source": "linkedin",
    "company_name": "Amazon Web Services (AWS)",
    "job_title": "Senior Finance Analyst - HE, AWS Accounts Receivables",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Description\"Amazon Finance Operations is looking for an Accounts Receivables Analyst to support our continued EU expansion within cloud infrastructure services (AWS). A successful candidate will be responsible for resolving billing issues, reconcile accounts and drive monthly collection targets in cooperation with our local sales and finance management.Key job responsibilities Follow-up with customers via emails and phone calls to ensure timely collection of payments for assigned portfolio Research, analyze and resolve the Customer’s inquiries and payment blockers Reconcile AR balances, manage and resolve every financial discrepancy between our and Customers’ accounts Earn customers’ and peers’ trust and build long-lasting relationship. Participate to cross functional and process improvement projects Create and implement standard operating procedures and process workflows. Analyze, recommend and implement process improvements Collaborate with the Global Finance Operations team, stakeholders and internal business partners in other world’s regions Timely report via weekly metrics and provide status updates on customers’ accounts and projects Participate in operational excellence activities Continually look at ways to improve the customer experienceBase pay for this position starts from EUR 1,700+ gross per month and salary depends on the skills and requirements, there will be further pay components such as a sign on bonus and the eligibility to participate in a restricted stock unit scheme operated independently by Amazon.com Inc. in USA. Company benefits apply subject to further terms, including annual membership in medical clinic, life insurance, retirement pension, meal voucher card, career developmentA day in the life Prepare daily aging report Strategize the portfolio Fix the root cause and collect Work with internal and external stake holders for better resolution Provide visibility to the leadershipBasic Qualifications \" Fluent Hebrew & English Previous Account Receivables, Account Payable, Customer Care, or other customer facing work experience Extensive knowledge of Finance and Accounting Direct and concise communication skills Strong record of managing customers’ disputes. High level of punctuality and attention detail. Ability to stay focused while performing repetitive tasks for extended period Ability to take initiative, meet tight deadlines and prioritize workload Proficient in Excel \"Preferred Qualifications Preferred qualifications Degree in Finance, Accounting, Business Studies or other directly related areas SQL and Business Intelligence tools Additional European Language (German)\" Experience with AI \" Preferred qualifications - Degree in Finance, Accounting, Business Studies or other directly related areas - SQL and Business Intelligence tools - Additional European Language (German)\" - Experience with AIAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Company - Amazon /Slovakia/ s.r.o. - C18Job ID: A3152503 Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4291858414/",
    "job_id": "4291858414",
    "source": "linkedin",
    "company_name": "TotalEnergies",
    "job_title": "Invoicing Executive",
    "location": "Doun Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Contexte et environnement Activités Daily post goods issue for white products and lubricants from COCOs stations Create sales orders for Credit sales for transporters Internal use of lubricants and white products Process invoicing Monitor and manage credit notes and debit notes Record and manage approvals of credit notes and debit notes Issue credit notes/debit notes in SAP Consolidate the month-end closing process, ensure all SAP and other closing tasks are properly conducted by the SD team Act as a key user for MM and SD modules in SAP Perform other duties as assigned by the Invoicing & Complaint Supervisor Profil du candidat Educational & Professional Background : Bachelor’s degree, preferably in Business Management, Finance and Accounting Professional experience: at least 1 year of experience in logistics operations Language & Technical Skills: Good command of English (oral and written), basic understanding of the logistics chain Proficiency in SAP, Microsoft Excel Work Ethic & Personal Attributes : Willing to work extended hours, holidays, and variable shifts, high regard for integrity with zero tolerance for any form of corruption, ability to work under pressure and agility in problem-solving. Informations supplémentaires TotalEnergies valorise la diversité, promeut le développement individuel et offre des opportunités d'emploi égales à tous les candidats. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362802111/",
    "job_id": "4362802111",
    "source": "linkedin",
    "company_name": "Amazon",
    "job_title": "Senior Finance Analyst with French, FinOps",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DescriptionWe are looking for a finance analyst who wants to have a complex job, and help us structure our rapidly growing company. We are encouraged and driven to improve processes and look for better solutions every day.Sounds great? What will you be working on? Fix issues in cooperation with Amazon Suppliers for the entities in France in order to facilitate on-time payments; Be a center point of contact for Suppliers for all their Finance queries; Cooperate with various internal departments in France and finance teams in order to ensure timely and accurate payments; Dive deep into the daily queries and resolve them in a timely fashion;What else do we offer? You can participate in projects and show ownership on initiatives that will improve the status quo! You can develop your career by joining Finance Academy trainings and many other available trainings! You can become creative and come up with your own ideas!Base pay for this position starts from EUR 1.700+ gross per month and salary depends on the skills and requirements. Company benefits apply subject to further terms, including annual membership in medical clinic, life insurance, retirement pension, meal voucher card.Basic Qualifications Fluent French and English (+ Italian or Spanish is an advantage) Very good communication and analytical skills Positive attitude towards issue resolution Good MS Office skillsPreferred Qualifications Finance background or previous experience with financeAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Company - Amazon /Slovakia/ s.r.o.Job ID: A3159507 Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371248187/",
    "job_id": "4371248187",
    "source": "linkedin",
    "company_name": "Amazon",
    "job_title": "Senior Finance Analyst with Italian, FinOps",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DescriptionWe are looking for a finance analyst who wants to have a complex job, and help us structure our rapidly growing company. We are encouraged and driven to improve processes and look for better solutions every day.Sounds great? What will you be working on? Fix issues in cooperation with Amazon Suppliers for the entities in Italy in order to facilitate on-time payments; Be a center point of contact for Suppliers for all their Finance queries; Cooperate with various internal departments in Italy and finance teams in order to ensure timely and accurate payments; Dive deep into the daily queries and resolve them in a timely fashion;What else do we offer? You can participate in projects and show ownership on initiatives that will improve the status quo! You can develop your career by joining Finance Academy trainings and many other available trainings! You can become creative and come up with your own ideas!Base pay for this position starts from EUR 1.700+ gross per month and salary depends on the skills and requirements. Company benefits apply subject to further terms, including annual membership in medical clinic, life insurance, retirement pension, meal voucher card.Basic Qualifications Fluent Italian and English (+ French or Spanish is an advantage) Very good communication and analytical skills Positive attitude towards issue resolution Good MS Office skillsPreferred Qualifications Finance background or previous experience with financeAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Company - Amazon /Slovakia/ s.r.o.Job ID: A3178054 Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361192891/",
    "job_id": "4361192891",
    "source": "linkedin",
    "company_name": "Amazon Web Services (AWS)",
    "job_title": "Senior Finance Analyst - HE, AWS Accounts Receivables",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DescriptionAmazon Finance Operations is looking for an Accounts Receivables Analyst to support our continued EU expansion within cloud infrastructure services (AWS). A successful candidate will be responsible for resolving billing issues, reconcile accounts and drive monthly collection targets in cooperation with our local sales and finance management.Key job responsibilities Follow-up with customers via emails and phone calls to ensure timely collection of payments for assigned portfolio Research, analyze and resolve the Customer’s inquiries and payment blockers Reconcile AR balances, manage and resolve every financial discrepancy between our and Customers’ accounts Earn customers’ and peers’ trust and build long-lasting relationship. Participate to cross functional and process improvement projects Create and implement standard operating procedures and process workflows. Analyze, recommend and implement process improvements Collaborate with the Global Finance Operations team, stakeholders and internal business partners in other world’s regions Timely report via weekly metrics and provide status updates on customers’ accounts and projects Participate in operational excellence activities Continually look at ways to improve the customer experienceBase pay for this position starts from EUR 1,700+ gross per month and salary depends on the skills and requirements, there will be further pay components such as a sign on bonus and the eligibility to participate in a restricted stock unit scheme operated independently by Amazon.com Inc. in USA. Company benefits apply subject to further terms, including annual membership in medical clinic, life insurance, retirement pension, meal voucher card, career developmentA day in the life Prepare daily aging report Strategize the portfolio Fix the root cause and collect Work with internal and external stake holders for better resolution Provide visibility to the leadershipBasic Qualifications Fluent Hebrew & English Previous Account Receivables, Account Payable, Customer Care, or other customer facing work experience Extensive knowledge of Finance and Accounting Direct and concise communication skills Strong record of managing customers’ disputes. High level of punctuality and attention detail. Ability to stay focused while performing repetitive tasks for extended period Ability to take initiative, meet tight deadlines and prioritize workload Proficient in ExcelPreferred Qualifications Degree in Finance, Accounting, Business Studies or other directly related areas SQL and Business Intelligence tools Additional European Language (German) - Degree in Finance, Accounting, Business Studies or other directly related areas - SQL and Business Intelligence tools - Additional European Language (German)\"Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Company - Amazon /Slovakia/ s.r.o. - C18Job ID: A3152504 Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356092833/",
    "job_id": "4356092833",
    "source": "linkedin",
    "company_name": "Adient",
    "job_title": "Part-Time Student RTR Travel & Expenses",
    "location": "Bratislava Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionPart-Time Student RTR Travel & ExpensesWhat can you expect?Adient is a global leader in automotive seating. With approximately 77,000 employees in 32 countries, Adient operates 202 manufacturing/assembly plants worldwide, we produce and deliver automotive seating for all vehicle classes and all major OEMs. From complete seating systems to individual components, our expertise spans every step of the automotive seat-making process. Our integrated, in-house skills allow us to take our products from research and design all the way to engineering and manufacturing – and into more than 25 million cars every year.At Adient we are proud to offer hybrid working to our employees which involves being able to work remotely for up to 3 days per week.What will your responsibilities be?Providing support to team members in daily operational tasksReviewing travel expense submissions for compliance with company policy, legal requirements, and country-specific rulesWorking in the Navan expense management system to view and approve selected types of transactionsAssisting with digital workflows and ensuring timely processing of expense-related tasksWhich qualifications are we looking for in potential employees?University student with a focus on Finance or AccountingSolid command of English (minimum level B2)Confident user of Microsoft ExcelResponsible, detail-oriented, and quick to learnAvailability to work at least 20 hours per week over a longer periodOn-site work only (no remote option)Which benefits do we offer?Salary 6 €/hourThe opportunity to make a difference together with the team in a successful companyWork-life balance with flexible working hoursCareer planning and development opportunities, including ongoing trainingHealth, safety and ergonomics eventsModern relax areas and game roomCoffee/Tea on the workplaceAdient is committed to equal employment opportunity, diversity and inclusion in the workplace. As a true global company, our leaders and employees come from various cultures across the world. Our diversity is a source of inspiration enabling us to achieve our goals and build an inclusive company culture.We are looking forward to receiving your application including your earliest availability date. If you have additional questions, please do not hesitate to contact Nina Kolarikova at nina.kolarikova-ext@adient.com .PRIMARY LOCATIONBratislava Business Centre Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318461036/",
    "job_id": "4318461036",
    "source": "linkedin",
    "company_name": "CAMMA Corporate Learning and Development Center",
    "job_title": "Finance Assistant",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Roles & ResponsibilitiesTimely and accurate prepare and process cash advance request and payment voucherFollow-up all advance request for settlementEnsure that all necessary supporting documents are attached to every voucherDo Weekly petty cash forecasting report for replenishmentDo Monthly and weekly cash count reportsDo Monthly cash reconciliationAmortizations for all productions have to be made timely to move production costAccrued own production at month-end and reconciliation of Prepaid Own ProductionJob RequirementsGood knowledge of AccountingGood computer literacy : SUN System, and Ms. OfficeGood interpersonal skillDetail oriented, Hardworking, Able to work under pressurePay attention in detail, Fast learningHow To ApplyHow to Apply:If you interest the above position, you should submit your CV and Cover letter to career@ctn.com.kh with the position that you apply for.For more information TEL: 017 333 250The only shortlist applicant will be contacted for interview.Address: National Road 5, Phum Krolko, Sangkat Kilomet Nº 6, Khan Russey Keo, Phnom Penh.Company DescriptionCambodian Broadcasting Service (CBS) operates 4 stations CTN, MYTV CNC, and CTN International delivering high-quality international and locally produced programming to every Cambodian household. CTN has currently rated the best Cambodia television station with the largest audience base and also delivers service to the Khmer community living in the United States via DTH TV as well as Australia and Canada.Currently, we are looking for young and dynamic individual to fulfill the following position.Tagsfinance financeassistant financeofficer Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368627400/",
    "job_id": "4368627400",
    "source": "linkedin",
    "company_name": "YIT - Urban developer and construction company",
    "job_title": "Študentská brigáda asistent účtovníka",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Vo YIT budujeme lepšie prostredie pre život. V spolupráci s našimi zamestnancami, partnermi a mestom budujeme domovy, kde sa plnia sny a kancelárie, v ktorých sa ľudia cítia ako doma. Staviame udržateľné mestské štvrte s ohľadom na meniace sa klimatické podmienky a životné prostredie. V práci sa riadime hodnotami: rešpekt, spolupráca, kreativita a nadšenie. Máme voči sebe vzájomnú dôveru, a preto sa môžeme spoľahnúť jeden na druhého. Vďaka inšpiratívnemu prostrediu a kolegom robíme prácu, ktorá dáva zmysel a nebojíme sa zdolávať aj tie najväčšie výzvy. Naše jedinečné projekty nám dávajú priestor pracovať na sebe a zdokonaľovať sa. Viac ako sto rokov sme významný európsky hráč s fínskymi koreňmi a veľkým srdcom. Od roku 2010 prinášame aj na Slovensko kvalitný štandard bývania, kde sme vytvorili domov pre viac ako 2500 ľudí.Popis pracovného miestaTrainee program dáva šancu študentom vysokých škôl položiť základy svojej kariéry a premeniť získané vedomosti do trvalo udržateľných projektov. U nás je každý trainee cenným členom silného a ambiciózneho tímu. Študenti spolupracujú s tými najlepšími odborníkmi na významných projektoch a zdolávajú nové výzvy. Našim záujmom je, aby sa tí najlepší stážisti stali súčasťou YIT a dostali priestor niečo po sebe zanechať.Momentálne hľadáme traineeho do nášho účtovného tímu, ktorého náplňou práce bude:archivácia dokumentovfyzická inventúrakomunikácia s klientmi ohľadom faktúradministratívna podpora účtovného oddelenia vyúčtovaniaKvalifikáciePozícii vyhovujú uchádzači so vzdelaním:študent vysokej školyvysokoškolské I. stupňaVzdelanie v odbore:financie, účtovníctvo, manažmentJazykové znalosti:anglický jazyk- pokročilý (B2)Odborné zručnosti:Microsoft Excel- pokročilýMicrosoft PowerPoint- pokročilýMicrosof Outlook- pokročilýOsobnostné predpoklady:zmysel pre detail, precíznosťkomunikačné schopnostisamostatnosť pri plnení úlohkreatívny prístup pri hľadaní nových riešeníDodatočné informácieTrainee program je otvorený pre denných študentov VŠ, ktorí by chceli chodiť do práce cca na 20/hod za týždeň. Sme otvorení v našom rozhodovaní sa o najvhodnejšom kandidátovi. Informujeme Vás priebežne o vývoji výberového procesu. Váš životopis posúdime do 10 pracovných dní. Najvhodnejších kandidátov, ktorí majú požadované skúsenosti a zručnosti, pozveme na pohovor. Chceme vytvoriť atmosféru, kde sa budete cítiť príjemne a kde môžete ukázať to najlepšie z Vás. Okrem Vašich zručností a potenciálu je pre nás dôležité, aby ste zapadli do tímu a mali blízko k našim hodnotám.Aj pre našich trainees ponúkame širokú škálu benefitov:Čerstvé ovocie, kávaMultisport kartaKnižnica YITYIT EDU – odborné vzdelávanie a konferencie, inšpiratívne workshopy na sebarozvoj, interní lektoriMožnosť kariérneho rozvoja a internej rotáciePružný pracovný časObčasný home officeSpoločné tímbuildingy a firemné podujatiaZľavy u našich partnerovMzdové rozpätie:7,50 EUR/ hod.Druh pracovného pomeru:na dohodu/ brigádastáž/ internship Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367153875/",
    "job_id": "4367153875",
    "source": "linkedin",
    "company_name": "Peek & Cloppenburg CEE",
    "job_title": "Zástupca vedúceho oddelenia pokladní",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "PRACOVNÝ POMER Plný úväzokZAČIATOK OkamžiteSPOLOČNOSŤ Peek & Cloppenburg s.r.o.KONTAKTNÁ OSOBA Corina StanciuMIESTO VÝKONU PRÁCE AVION Shopping Park Bratislava Viac než 160 obchodov, 16 000 zamestnancov a 120 rokov skúseností: V medzinárodnej módnej spoločnosti Peek & Cloppenburg* s centrálami vo Viedni a v Düsseldorfe sa snúbia hodnoty tradičného rodinného podniku s dynamickým odvetvím. Pre nás móda nie je iba produkt - je to náš spoločný jazyk. U nás to nie je iba o práci, u nás sa stávaš súčasťou našej komunity. Módnej komunity, v ktorej môžeš žiť tým, čo miluješ. Let's create the future of retail. Together.*V Nemecku existujú dve nezávislé spoločnosti Peek & Cloppenburg so sídlom v Düsseldorfe a Hamburgu. Táto reklama sa týka skupiny spoločností so sídlom v Düsseldorfe, ktorej predajne nájdete tu: peek-cloppenburg.de/de/stores. ČO ŤA ČAKÁPodpora vedúceho oddelenia pri vedení tímu a zabezpečení silnej výkonnosti prostredníctvom úzkej spolupráceDohľad nad pokladničnými účtovnými úlohami vrátane spracovania a evidencie denných tržieb a podpora pri pokladni podľa potrebyRiadenie administratívnych nástupných procesov vrátane distribúcie prístupových kariet a koordinácie školení o bezpečnostiAdministratívna podpora vedúceho oddelenia vrátane správy osobných záznamov a prípravy reportovRiešenie sťažností zákazníkov s cieľom zabezpečiť plynulý a pozitívny nákupný zážitok ČO POŽADUJEMEMáš aspoň 1 rok skúseností s vedením predajne, ideálne s čiastočnou zodpovednosťou za administratívu predajne alebo finančné operácieSi organizovaný/á a analytický/á, nerobí ti problém práca s číslami na udržanie plynulého choduSkutočne ti záleží na poskytovaní kvalitného servisu a vytváraní pozitívnych zážitkov pre zákazníkovSi oddaný/á, proaktívny/á a pripravený/á aktívne dotiahnuť veci do koncaHovoríš plynule po anglicky - znalosť nemčiny je výhodou, ale nie je podmienkou ČO PONÚKAMEPrémia viazaná na úspešnosť oddeleniaBonus za prácu cez víkendProgram odmien za odporúčanie nových zamestnancov25% zľava pre zamestnancov v našich predajniachVianočný bonusStravné lístkyOdborový príplatokStabilita úspešnej rodinnej firmy s viac ako 120-ročnou históriouDynamické pracovné prostredie založené na tímovej práci a individuálnej zodpovednostiPríležitosti na osobnostný a profesijný rozvoj2 dni dovolenky navyše Pre pozíciu Assistant Department Manager - Main Cash Administration ponúkame mesačnú hrubú mzdu vo výške 1.515 EUR, pričom v závislosti od konkrétnej kvalifikácie a skúseností je možná aj vyššia mzda. Viac informácií nájdete na našej kariérnej webovej stránke: career.peek-cloppenburg.com Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4325652847/",
    "job_id": "4325652847",
    "source": "linkedin",
    "company_name": "Dentsply Sirona",
    "job_title": "Student Support with German Language in AR Collections Team",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4121685387/",
    "job_id": "4121685387",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ShopUp নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3782852734/",
    "job_id": "3782852734",
    "source": "linkedin",
    "company_name": "Mridha law associated নিয়োগ",
    "job_title": "Tax Specialist",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370530745/",
    "job_id": "4370530745",
    "source": "linkedin",
    "company_name": "Philip Morris International",
    "job_title": "Key Account Analyst",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4044647912/",
    "job_id": "4044647912",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "MetLife Bangladesh hiring Manager, Tax in Dhaka ...",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295865803/",
    "job_id": "4295865803",
    "source": "linkedin",
    "company_name": "For N. Ahmed & Co.",
    "job_title": "Tax & VAT Officer",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4331439095/",
    "job_id": "4331439095",
    "source": "linkedin",
    "company_name": "For Topstar Cargo Systems Limited",
    "job_title": "VAT/TAX Consultant",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4259318328/",
    "job_id": "4259318328",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Finance & Tax Manager (For Toppay Services Limited)-Job ID",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4280667432/",
    "job_id": "4280667432",
    "source": "linkedin",
    "company_name": "(For ...",
    "job_title": "Tax & Compliance Executive (or Accounts Officer Taxation)",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4347355236/",
    "job_id": "4347355236",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "Accounts & Audit",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3202470263/",
    "job_id": "3202470263",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Algorithm Generation hiring Accounts Analyst in Gulshan, Dhaka ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4171559668/",
    "job_id": "4171559668",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "ACCA Trainee / Finance Associate (For OTG Bangladesh)",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350596779/",
    "job_id": "4350596779",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Chief Accountant (For Gulshan Club Limited)-Job ID: 1443301",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265970210/",
    "job_id": "4265970210",
    "source": "linkedin",
    "company_name": "Job ID ...",
    "job_title": "Finance & Accounts (For A Reputed Conglomerates)",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4036736753/",
    "job_id": "4036736753",
    "source": "linkedin",
    "company_name": "WeGro Global নিয়োগ",
    "job_title": "Assistant Manager, Accounts",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4234980042/",
    "job_id": "4234980042",
    "source": "linkedin",
    "company_name": "Finance and Accounts (For Silver Line Group)",
    "job_title": "Manager",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4280615173/",
    "job_id": "4280615173",
    "source": "linkedin",
    "company_name": "(For A. Wahab & Co)-Job ...",
    "job_title": "Chartered Accountant (Assistant Director)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4159770520/",
    "job_id": "4159770520",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Join Our CA Articleship Program Dhaka, Bangladesh LinkedIn",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4306345815/",
    "job_id": "4306345815",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Hanif & Arif, Chartered Accountants নিয়োগ",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4036999030/",
    "job_id": "4036999030",
    "source": "linkedin",
    "company_name": "Augmedix নিয়োগ",
    "job_title": "Senior Accountant",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3294470709/",
    "job_id": "3294470709",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Rahman Mostafa Alam & Co. (Chartered Accountants)",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4083329837/",
    "job_id": "4083329837",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Sr. Accountant / Accountant (For Capital Market/Stock Brokerage ...",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353098277/",
    "job_id": "4353098277",
    "source": "linkedin",
    "company_name": "For South Asian Tea International",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Gulshan, Dhaka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  }
]