[
  {
    "url": "https://www.linkedin.com/jobs/view/4366187463/",
    "job_id": "4366187463",
    "source": "linkedin",
    "company_name": "Europ Assistance Canada",
    "job_title": "Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355887298/",
    "job_id": "4355887298",
    "source": "linkedin",
    "company_name": "Confidential Careers",
    "job_title": "Senior Accountant",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321474201/",
    "job_id": "4321474201",
    "source": "linkedin",
    "company_name": "Raize ONE",
    "job_title": "Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365789790/",
    "job_id": "4365789790",
    "source": "linkedin",
    "company_name": "Deutsche BekleidungsWerke Company Limited",
    "job_title": "Costing Accountant",
    "location": "Huyện Cần Giuộc, Long An, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366108195/",
    "job_id": "4366108195",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284085035/",
    "job_id": "4284085035",
    "source": "linkedin",
    "company_name": "Linah Farms",
    "job_title": "Accountant Intern",
    "location": "Ad-Duqqi, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366103224/",
    "job_id": "4366103224",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355735515/",
    "job_id": "4355735515",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accountant (Costing & Finance Expert) - For Sharif Industrial Company Limited - Job ID: 1453401",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355696219/",
    "job_id": "4355696219",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts (For Green View Golf Resort) - Job ID : 1453339",
    "location": "Sreepur Upazila, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367691326/",
    "job_id": "4367691326",
    "source": "linkedin",
    "company_name": "Beyond Cloud Consulting",
    "job_title": "Account Executive",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321414383/",
    "job_id": "4321414383",
    "source": "linkedin",
    "company_name": "The Metub Company",
    "job_title": "Key Account Executive (Tiktok Operation)",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355727755/",
    "job_id": "4355727755",
    "source": "linkedin",
    "company_name": "ZTE Corporation",
    "job_title": "Key Account Director for Ooredoo Account",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Purpose of roleResponsible for identifying news Business Opportunities and with the clear target to becoming a trusted advisor / partner to the clientResponsibility for overall pipeline, forecasting and demand generation, to agreed personal KPI’s and financial targets.ThroughAchievement of a mix of strategic, consultative and relationship selling, the successful candidate will be expected to create, nurture and grow relationships within their assigned areas to deliver new business.Have an understanding of client’s needs and by developing a range of strategies to address both customer proposition and broader competitive environment requirements.Leverage relationships across ZTE to ensure its propositions are presented pro-actively to the client and drive incremental business opportunitiesDetail Description:Minimum of 5 years’ experience in Telco sector and experiences with Ooredoo, would be a plus and with proven demonstrable successFluent in English and Arabic Speaking, reading and writingA clear stakeholder engagement approach supported when necessary with a clear communication planStrong technical understanding of mobile networks technologies: Wireless Network, CN/IN/IT. Expertise in at least one of them; cross-area expertise an added advantageSelf-reliant and self starting / proactiveAbility to translate technical solutions into business and financial benefits to a customer – what the solution does for the customer rather than what the technology containsBe able to travel globally Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338733295/",
    "job_id": "4338733295",
    "source": "linkedin",
    "company_name": "Foodics",
    "job_title": "Senior Sales Entreprise Account Manager",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355886642/",
    "job_id": "4355886642",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Office Executive - For SRS Trade Int. - Job ID - 1453664",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355757522/",
    "job_id": "4355757522",
    "source": "linkedin",
    "company_name": "ZTE Corporation",
    "job_title": "行政经理",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355211896/",
    "job_id": "4355211896",
    "source": "linkedin",
    "company_name": "Veem",
    "job_title": "Contract Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365772995/",
    "job_id": "4365772995",
    "source": "linkedin",
    "company_name": "Mandarin Oriental",
    "job_title": "Director of Finance",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Mandarin Oriental Downtown, Dubai is looking for a Director of Finance to join our Executive Committee team.Are you a master of craft? Do you thrive in a team that succeeds together, demonstrating integrity and respect while acting responsibly? Do you embrace a growth mindset? We invite you to become a fan of the exceptional.Mandarin Oriental is the award-winning owner and operator of some of the most luxurious hotels, resorts and residences located in prime destinations around the world, with a strong development pipeline. Increasingly recognised for creating some of the world’s most sought-after properties, the Group provides legendary service inspired by Asian heritage whilst representing the very cutting-edge of luxury experiences.Nestled in the city's heart, Mandarin Oriental Downtown, Dubai offers a stunning fusion of modern design with a touch of oriental flair, redefining hospitality standards. With unparalleled views of Dubai's skyline, the iconic Burj Khalifa, and the sparkling Arabian Sea, this urban retreat offers 224 luxury Residences and 259 Rooms & Suites. Going beyond traditional hospitality, Mandarin Oriental Downtown, Dubai is not just a hotel but a lifestyle destination, offering relaxation, luxury, and memorable experiences.About The JobBased at the Mandarin Oriental Downtown, Dubai within the Finance department in Dubai, the Director of Finance is responsible for the determination of optimum control objectives and for the installation and maintenance of appropriate internal control systems over income, expenditure, assets and liabilities within the hotel. Director of Finance reports to the General Manager.As a Director of Finance, you will be responsible for the following duties:Oversees the development, implementation and maintenance of all financial controls, accounting procedures and internal control systems in alignment with corporate policies, GAAP and the hotel’s management contract.Acts as a key member of the hotel’s leadership team, supporting the General Manager, ensuring contract compliance and escalating discrepancies to corporate management when required.Drives profitability by identifying improvement opportunities, encouraging analytical reporting, and supervising teams to enhance both financial performance and guest experience.Leads employee development through structured training, evaluation programs and succession planning to maintain high professional standards and operational continuity.Manages treasury functions, working capital, cash flow, receivables, inventories and data‑processing operations to ensure liquidity, efficiency and adherence to corporate guidelines.Ensures accurate and timely financial reporting, robust asset protection, adequate insurance coverage, proper cash control and the establishment of strong credit and collection policies.As a Director Of Finance, We Expect From YouStrong educational foundation, including a Degree in Finance.Extensive accounting background with at least 8 years of experience, including a minimum of two years in a comparable leadership role.Proficiency with hotel POS and PMS platforms such as HMS, Infrasys, Opera, PSMS, Info Genesis and Micros.Excellent working knowledge of financial and accounting software, particularly SUN System.Excellent communication abilities in English, both written and verbal, with the capacity to convey financial information clearly.High-level analytical capability supported by advanced MS Office skills, especially Excel and Word.Our commitment to you Learning & Development. Your success is our success. We craft unique learning and development programmes for various stages in your career so that you grow, continuously.MOstay. When you work as hard as our colleagues do, it’s important to take time off. As a member of the #MOfamily, you can stay with us wherever you go in the world. The MOstay programme offers complimentary nights and additionally attractive rates on rooms for you and your loved ones.Heath & Colleague Wellness. Finding the right work-life balance is important. Your wellbeing matters to us. A variety of health benefits and wellness programmes are offered to all our colleagues, globally.Colleague Comfort and Convenience: Benefit from comfortable accommodation, a duty transportation, and duty meals to ensure your work experience is both enjoyable and hassle-free.Competitive Salary and Benefits: We offer a competitive salary and an attractive benefits package, fully aligned with UAE industry standards, to ensure your financial well-being and stability.We’re Fans. Are you? Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355707059/",
    "job_id": "4355707059",
    "source": "linkedin",
    "company_name": "Aventus",
    "job_title": "Finance Operations Manager",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Title: Finance Operations Manager Location: United Arab Emirates Our client a leading Financial Institution operating within capital markets and is looking hire a Finance Operations Manager to join their growing team. The role focuses on back-office operations, ensuring accurate processing of front-office transactions, client account movements, and settlements in line with internal policies and controls.Key responsibilitiesOversee financial operations, transaction processing, and reconciliationsSupport daily trading activity through back-office and client account oversightReview documentation and ensure appropriate operational and compliance controlsPrepare MIS, commissions, and periodic management reportsMonitor credit usage against approved limitsManage settlement payments and daily net broker positionsLiaise with brokers, customer care teams, and internal stakeholdersRequirementsBachelor’s degree in Finance, Banking, Economics, Statistics, or related fieldACCA / CPA preferred5+ years’ experience in finance operations, back office, or settlements within brokerage or capital marketsStrong understanding of financial markets and trading operationsFluent in English and Arabic is mandatoryStrong analytical and problem-solving skills Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366341312/",
    "job_id": "4366341312",
    "source": "linkedin",
    "company_name": "Ariston",
    "job_title": "Financial Manager",
    "location": "Bryanston, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366215052/",
    "job_id": "4366215052",
    "source": "linkedin",
    "company_name": "Allan Gray Orbis Foundation",
    "job_title": "Association Officer",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355867137/",
    "job_id": "4355867137",
    "source": "linkedin",
    "company_name": "DP World",
    "job_title": "Clerk: POD",
    "location": "Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321434231/",
    "job_id": "4321434231",
    "source": "linkedin",
    "company_name": "LPBank",
    "job_title": "[Hà Nội] Chuyên viên cao cấp Thẩm định Khách hàng doanh nghiệp lớn",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365805783/",
    "job_id": "4365805783",
    "source": "linkedin",
    "company_name": "LPBank",
    "job_title": "[Ha Noi] Internal Auditor",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job Description1. Perform professional work on financial market audits- Plan and conduct audits of business areas related to:Capital management (deposits, valuable papers, tier 2 capital, etc.)Interbank market transactions (deposits, loans, repos, etc.)Financial investment (bonds, stocks, derivatives, etc.)Asset-liability management (ALM), liquidity management, interest rates and exchange rates.Foreign currency and derivatives trading.- Identify, assess risks and check internal control systems at financial market business units- Participate in drafting audit minutes, audit reports and make recommendations and advise on operational improvements to enhance risk management and compliance.- Participate in developing annual audit programs and periodic risk assessments for the Financial Market sector.- Perform general professional tasks of the Headquarters and System Audit Department- Be responsible for auditing policies, processes and risk management activities at the Business Support Divisions/Departments at LPBank's Headquarters;- Develop and update annual audit plans for the assigned areas based on risk orientation.- Coordinate with functional departments in the Internal Audit Division to develop audit tools.2. TrainingParticipate in training courses organized by LPBank/or outside parties according to job requirements;Self-training, researching and updating internal regulations and legal regulations to ensure mastery and understanding of regulations related to assigned operations;Participate in training, share audit experiences for each operation, train skills and audit methods in training programs of the Internal Audit Division.3. Monitor post-audit corrections and rectifications and remotely monitor audit subjects/business units as assigned by management;4. Review and archive audit records.Job requirements1. Qualifications- University degree in Economics, Accounting, Finance, Statistics, Banking- 02 years of experience in internal audit/internal control at the Bank or 04 years of experience working in the Departments at the Head Office, working directly at the Capital Business, ALM, and Banking Financial Investment departments- Computer skills: Proficient in using office software- Priority is given to candidates with practice certificates in some fields such as auditing, CIA, CFA, CPA, ACCA, Securities, accounting, SQL certificates, Power BI.2. Knowledge- Have knowledge and understanding of economics, the activities of commercial banks and the fields of economics and banking law, economics, civil law, and commerce.- Have knowledge and understanding of the operations of commercial banks;- Understand the regulations of the State Bank related to capital management, liquidity, safety ratios, and financial market transactions.- Understand ALM activities, market risk measurement models, liquidity, and financial instrument valuation.- Understanding of Basel II/III, IFRS, and ICAAP is an advantage3. SkillsCommunication skills;Teamwork;Time management;Setting and achieving goals;Ability to work independently;Critical thinking, independence, creativity, and analytical ability;Presentation, communication, and report writing skills;Basic skills in managing partnerships and customer orientationMastering the methods of inspection and auditingHaving the qualities of honesty, objectivity, confidentiality and a sense of discipline, complying with professional ethics standards.4. Other requirements:Willing to travel for work.Committed to long-term association with LPBankMô tả công việc1. Thực hiện các công việc chuyên môn về kiểm toán nghiệp vụ thị trường tài chính- Lập kế hoạch và thực hiện kiểm toán các mảng nghiệp vụ liên quan đến:Quản lý nguồn vốn (tiền gửi, giấy tờ có giá, vốn cấp 2…)Giao dịch thị trường liên ngân hàng (tiền gửi, vay mượn, repo…)Đầu tư tài chính (trái phiếu, cổ phiếu, chứng khoán phái sinh…)Quản trị tài sản – nợ (ALM), quản lý thanh khoản, lãi suất và tỷ giá.Kinh doanh ngoại tệ và phái sinh.- Nhận diện, đánh giá rủi ro và kiểm tra hệ thống kiểm soát nội bộ tại các đơn vị hoạt động nghiệp vụ thị trường tài chính- Tham gia soạn thảo biên bản kiểm toán, báo cáo kiểm toán và đưa ra các kiến nghị, tư vấn cải tiến hoạt động nhằm nâng cao hiệu quả quản trị rủi ro và tuân thủ.- Tham gia xây dựng chương trình kiểm toán hàng năm, đánh giá rủi ro định kỳ đối với mảng Thị trường tài chính.- Thực hiện các công việc chuyên môn chung của Phòng Kiểm toán Hội sở và hệ thống- Chịu trách nhiệm thực hiện kiểm toán các chính sách, quy trình và hoạt động quản trị rủi ro tại các Khối/Ban Hỗ trợ kinh doanh tại Hội sở chính của LPBank;- Thực hiện lập và cập nhật kế hoạch kiểm toán hàng năm cho lĩnh vực phụ trách trên cơ sở định hướng rủi ro.- Phối hợp với các Phòng nghiệp vụ trong Khối KTNB xây dựng các công cụ kiểm toán.2. Công tác đào tạoTham gia các khóa đào tạo do LPBank/hoặc bên ngoài tổ chức theo yêu cầu công việc;Tự đào tạo, nghiên cứu cập nhật các quy định nội bộ, quy định pháp luật đảm bảo nắm vững, hiểu rõ quy định",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355723025/",
    "job_id": "4355723025",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager (HR, Admin & Compliance) - For A Reputed Knit Composite Factory - Job ID : 1453153",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321505930/",
    "job_id": "4321505930",
    "source": "linkedin",
    "company_name": "Yapı Kredi",
    "job_title": "KVKK Uyum Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355775755/",
    "job_id": "4355775755",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Technical Executive (For Argil NE Bangladesh)-Job ID: 1453378",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369374903/",
    "job_id": "4369374903",
    "source": "linkedin",
    "company_name": "FPT Software",
    "job_title": "Business Analyst",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "JOB OVERVIEWBusiness Analyst Department of FPT Software Hanoi is looking for new talents to reinforce our team with the challenging missions:Provide the BA Service to many projects of FPT Software Hanoi,Build a strong team at world-class level to provide consultant services to our customers of many business domains (Logistics, Healthcare, Finance and Banking, Retail and Commerce…) in America, Europe, APAC…RESPONSIBILITIESAnalyze the requirements from customers’ material/transfer from senior BA in business view.Document functional and business requirements documents: create wireframes, user stories, activity diagrams and use cases.Communicate with customers to clarify business and support if there are any change requirements from customers.Communicate with the development team to ensure correct requirement understanding during implementation.Support development team to communicate with the customers regarding implementation QA/Issue.Compose related documents, such as: Requirement Traceability, User Manual, UAT Training… *** FOR SENIOR LEVEL:Define the requirement approach for each project. Plan for the requirement phase at the beginning of the project.Assign tasks and manage teams to make sure that the project runs smoothlyConduct requirement elicitation workshop.Analyze business flow and user requirements.Document the client's business requirements in detail.Participate in peer reviews and inspections of requirements documents.Prepare training material for team membersREQUIREMENTSAbility to research documents and analyze requirements.Fluent in English/Japanese/Korean (both oral & written).Have good skills at: Teamwork, Analysis, Design, Communication and Presentation.Responsible, accurate and able to work under high pressure and to strict deadlines.Be proactive, Self-Study abilities and Positive attitude at work.Good command of Microsoft Office.Proficiency in UML, Design and Modelling tools is an advantage.Good Domain Knowledge (any of Logistics, Healthcare, Finance and Banking, Retail and Commerce…) is an advantage.*** FOR SENIOR LEVEL:Have at least 3 years of BA experience in the IT industry.Logical thinking and problem solving, ability to articulate and translate ideas and concepts into solid business requirementsEnthusiastic, responsible, willing to learn new technologies and ability to work under pressure, available to work at anytimeExperience in working on projects abroad is an advantage.WHAT COMPANY OFFERSJoin BA Training course with a clear promotion path, lots of positions and promotion opportunities for employees.Continuous development of hard and soft skills through work and professional training.Attractive salary, performance based award.Fully pay social insurance and give FPT health insurance package to employeesCompany's labor policy completely pursuant to Vietnamese labor legislation plus other benefits offered by the company (Company trip, Holiday, etc.)Young and dynamic working environment. Exciting leisure: sport and art events (running club, badminton club, family day...) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352146887/",
    "job_id": "4352146887",
    "source": "linkedin",
    "company_name": "Viettel High Tech",
    "job_title": "Kỹ sư Phân tích nghiệp vụ (Business Analyst)",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369143240/",
    "job_id": "4369143240",
    "source": "linkedin",
    "company_name": "Fusion Software",
    "job_title": "Client Success Administrator",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366163344/",
    "job_id": "4366163344",
    "source": "linkedin",
    "company_name": "Munich Re",
    "job_title": "Business Support Specialist",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355940798/",
    "job_id": "4355940798",
    "source": "linkedin",
    "company_name": "Şans Girişim",
    "job_title": "Backoffice Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365805371/",
    "job_id": "4365805371",
    "source": "linkedin",
    "company_name": "Assan Gayrimenkul",
    "job_title": "İdari İşler Yöneticisi",
    "location": "Tuzla, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321389282/",
    "job_id": "4321389282",
    "source": "linkedin",
    "company_name": "XTransfer",
    "job_title": "Senior Risk and Compliance Specialist",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366186796/",
    "job_id": "4366186796",
    "source": "linkedin",
    "company_name": "PUMA Group",
    "job_title": "Junior Manager Treasury",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361340452/",
    "job_id": "4361340452",
    "source": "linkedin",
    "company_name": "Homey",
    "job_title": "Accounts Executive",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Handle accounts payable (AP) and accounts receivable (AR) process invoices, payments, credit notes and debit notesBank reconciliations and cash flow monitoringMaintain financial records, ledgers and general accounting journalsSupport month - end and year end closing processesPerform other ad hoc finance and administrative duties as assignedRequirementsEducational Requirements:Currently following: CASL , ACCA , CIMA , AAT andGraduates/ undergraduates in Accounting / FinanceFluency in Spoken and Written EnglishExperience:Minimum experience: 1 -2 years in a similar accounting role (accounts payable / receivable, general accounting)Experience in BPO will be an added advantage Technical Skills: Proficiency in accounting software (e.g. QuickBooks ,XERO , Zoho , MYOB )Advanced skills in Microsoft Excel and other Office Suite applicationsBenefitsRole to be paid in GBP with a UK ContractCompetitive salary commensurate with experience: Salary range from Rs. 80,000 - Rs. 110,000/month, paid in GBP, depending on experience levelWe're open to discussing salaries outside this range for candidates with exceptional skills or those with less experience who show great potentialOpportunities for professional development and career progressionSupportive work environment with a focus on work-life balancePost-3 months, option to work from home one day a week, per manager discretionUK work hours apply Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366101411/",
    "job_id": "4366101411",
    "source": "linkedin",
    "company_name": "BitFuFu",
    "job_title": "Treasury Specialist",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Position OverviewWe are seeking a detail-oriented Treasury Specialist to support the company’s daily cash management and banking operations. This role plays a key part in ensuring efficient use of funds, accurate cash reporting, and smooth coordination with banking partners across multiple jurisdictions.The position offers hands-on exposure to treasury operations, liquidity management, internal controls, and cross-border banking activities within an international business environment.Key ResponsibilitiesCash Management & ReportingManage day-to-day cash operations, including payment processing, fund transfers, and cash ledger maintenance.Prepare daily cash position reports and weekly cash flow summaries to support liquidity monitoring and management decision-making.Assist in cash forecasting and monitor short-term funding requirements.Banking & Treasury OperationsLiaise with local and overseas banks on account opening, activation, and ongoing account administration.Support periodic KYC reviews, documentation updates, and routine communication with banking partners.Ensure bank accounts operate efficiently and in compliance with internal policies and regulatory requirements.Treasury Controls & Risk ManagementAssist in developing and maintaining treasury-related internal controls and standard operating procedures.Monitor treasury processes to identify operational risks and recommend improvements to strengthen fund security.Liquidity & Yield ManagementSupport cash allocation and fund movements based on operational and business needs.Assist in managing fixed deposits or other low-risk cash management instruments to optimize liquidity and returns in line with internal guidelines.Corporate & Administrative SupportCoordinate with company secretarial service providers and external advisors to support statutory filings and annual compliance requirements for overseas entities.Provide general treasury and finance operations support as required.QualificationsEducationBachelor’s degree or above in Finance, Accounting, Economics, or a related discipline.Experience & SkillsPrior experience in treasury, cash management, finance operations, or accounting is preferred; candidates with 1–3 years of relevant experience will have an advantage.Solid understanding of cash management, payments, and basic treasury processes.Strong attention to detail, accuracy, and a structured approach to work.Proficiency in Microsoft Excel and other common finance or reporting tools.Ability to handle multiple tasks and meet deadlines in a fast-paced environment.Communication & Work StyleGood communication and coordination skills, with the ability to work effectively with internal teams and external banking partners.Proficiency in English is required for daily work communication. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321542800/",
    "job_id": "4321542800",
    "source": "linkedin",
    "company_name": "Jefferies",
    "job_title": "Investment Banking Analyst",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365920121/",
    "job_id": "4365920121",
    "source": "linkedin",
    "company_name": "Klay",
    "job_title": "Investment Analyst",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "The Investment Advisory Team is at the heart of Klay Capital’s investment solution and portfolio construction ecosystem that brings together investment experience, execution capability, strategy and research to meet and deliver outcomes our clients seek whilst prioritizing clientengagement. The role involves client portfolio management, preparing pitch decks for clients, active trading, market analysis, execution, and risk monitoring.Responsibilities include the following:— Price and execute derivatives trades across FX, equity ETD, OTC, and structured derivatives / products across multiple custodian banks while ensuring turnaround time thresholds are met— Provide timely support, pricing support and market insights to internal teams and/or clients— Analyze large data sets to generate trading activity reports for clients, client advisors, and internal stakeholders— Partner with advisors and provide support in preparing and maintaining investment solutions for clients— Assist in the day to day activities with respect to portfolio and investment management— Support in maintaining investment lists in line with compliance and regulations— Enhance execution efficiency through model development and process improvements— Ensure strict adherence to operational, regulatory, and compliance requirements, including both pre-trade and post-trade procedures— Additional responsibilities apply from time to time Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365824547/",
    "job_id": "4365824547",
    "source": "linkedin",
    "company_name": "Xtend",
    "job_title": "Finance Controller",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367459233/",
    "job_id": "4367459233",
    "source": "linkedin",
    "company_name": "AUMOVIO",
    "job_title": "Controller",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company DescriptionSince its spin-off in September 2025 AUMOVIO continues the business of the former Continental group sector Automotive as an independent company. The technology and electronics company offers a wide-ranging portfolio that makes mobility safe, exciting, connected, and autonomous. This includes sensor solutions, displays, braking and comfort systems as well as comprehensive expertise in software, architecture platforms, and assistance systems for software-defined vehicles. In the fiscal year 2024 the business areas, which now belong to AUMOVIO, generated sales of 19.6 billion Euro. The company is headquartered in Frankfurt, Germany and has about 87.000 employees in more than 100 locations worldwide.Job DescriptionYOUR RESPONSIBILITIES WILL INCLUDE:Managing operative Controlling activities in related Central departments with focus on fixed costs analysis;Supporting Department managers to achieve the fixed cost goals and targets; Developing and implementing action plans to meet the operational targets, strategic goals and stakeholders’ requirements;Ensuring measures implementation and tracking in the respective Central Areas;Ensuring and applying AUMOVIO Controlling, Finance and Accounting guidelines, furthermore assure high data quality and transparency;Preparing budgets and forecast for the respective Central Function Areas, and performing budget and forecasts review meetings with Departments and BU's;Providing Month End Reporting, regular KPI reviews and Forecast vs. Budget with explanation of deviations on time with high quality without errors;Close cooperation and communication with the Managers, Executives and Business Units representatives;Handling of the intercompany- and other related invoices;Creation of internal and external provisions;Providing decision supporting analysis for all stakeholders.QualificationsWE ARE LOOKING FOR YOU IF:you have a finished higher education/ university degree in economics / financeyou have an advanced level knowledge of O365 especially Excel and Power BI as well as advanced knowledge of SAP (CO/FI)you have an analytical mindset;you are confident, assertive, communicative, goal oriented and can speak English fluently;you have 2-5 years of professional experience in a similar field;you can take decisive action and have strong communication skills.Additional InformationReady to take your career to the next level? The future of mobility isn’t just anyone’s job. Make it yours! Join AUMOVIO. Own What’s Next. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366484813/",
    "job_id": "4366484813",
    "source": "linkedin",
    "company_name": "SYNERGY CONSTRUCT",
    "job_title": "Accounting Manager",
    "location": "Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365827996/",
    "job_id": "4365827996",
    "source": "linkedin",
    "company_name": "Givaudan",
    "job_title": "Accounts Payable Accountant (Fixed Term)",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366101694/",
    "job_id": "4366101694",
    "source": "linkedin",
    "company_name": "Peek & Cloppenburg CEE",
    "job_title": "Assistant Department Manager Main Cash Administration (m/f/d)",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361739154/",
    "job_id": "4361739154",
    "source": "linkedin",
    "company_name": "AJYAL HR Solutions & Services",
    "job_title": "Financial Investment Analyst",
    "location": "Muscat, Masqaţ, Oman",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370921724/",
    "job_id": "4370921724",
    "source": "linkedin",
    "company_name": "ReliefWeb",
    "job_title": "Manager, Grants, Humanitarian Crisis Management Programme (HCMP)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366212697/",
    "job_id": "4366212697",
    "source": "linkedin",
    "company_name": "RBC",
    "job_title": "Summer 2026 - Relationship Manager Student Intern, Commercial Financial Markets- EN",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366268803/",
    "job_id": "4366268803",
    "source": "linkedin",
    "company_name": "LOGISCO",
    "job_title": "Analyste d'affaire",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370772675/",
    "job_id": "4370772675",
    "source": "linkedin",
    "company_name": "Mega Asset Management Co., Ltd.",
    "job_title": "Senior Internal Auditor",
    "location": "Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363185211/",
    "job_id": "4363185211",
    "source": "linkedin",
    "company_name": "Royal Ontario Museum",
    "job_title": "Executive Coordinator",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "WHO WE ARE Opened in 1914 and welcoming over 1.3 million visitors annually, the Royal Ontario Museum (ROM) is Canada's most-visited museum, ranking among the top 10 cultural institutions in North America. At ROM, we are dedicated to building and sharing global collections, sharing knowledge, inspiring learning, and fostering community engagement. As a globally recognized field research institute, ROM houses an impressive collection of over 18 million artworks, cultural objects, and natural history specimens, showcased in over 40 galleries and exhibition spaces. We are committed to creating a space where art, culture, and nature intersect, connecting people and communities to the past, present and shared future.As we continue to work toward our goals to transform and evolve as one of the world’s foremost 21st-century museums, we seek passionate and dynamic team members who embody our mission and values. WHO WE NEED We are looking for a highly organized, thoughtful, and proactive Executive Coordinator who thrives in a fast-paced executive environment and brings strong judgment, discretion, and attention to detail to everything they do.This role is ideal for someone who anticipates needs before they arise, takes pride in producing clear, accurate, and well-crafted work, and is comfortable supporting complex schedules, priorities, and executive decision-making. You are calm under pressure, adaptable when priorities shift, and confident navigating competing demands with professionalism and care.You bring strong interpersonal effectiveness and cultural awareness, and you are comfortable working with colleagues, partners, and stakeholders from diverse backgrounds and communities. Collaboration comes naturally to you, and you enjoy working closely with other executive coordinators and administrative professionals to ensure seamless support across the organization.Above all, you are motivated by enabling others to do their best work. You value trust, accountability, and excellence, and you approach your role with curiosity, initiative, and commitment to high standards. HOW YOU WILL MAKE AN IMPACT Enable the Deputy Director, Engagement, to operate effectively by anticipating needs, managing priorities, and ensuring their time, information, and materials are well organized and ready for decision-makingCoordinate complex executive calendars, meetings, and logistics, ensuring seamless preparation, follow-through, and communication across internal teams and external partnersPrepare, edit, and produce high-quality correspondence, briefing materials, presentations, and reports that reflect sound judgment, clarity, and attention to detailSupport projects and initiatives across the Engagement portfolio by tracking actions, coordinating inputs, and helping ensure deadlines and commitments are metServe as a key point of contact for internal and external inquiries, exercising sound discretion and professionalism while navigating sensitive or confidential mattersCoordinate executive travel, visits, and special events, often in collaboration with other departments, to ensure positive and well-managed experiencesMonitor and support assigned budgets, expenses, and administrative processes, contributing to effective and accountable operations WHAT YOU BRING A minimum of five (5) years of progressively responsible experience providing senior-level administrative or executive coordination support in a complex, fast-paced environmentPost-secondary education in business, administration, arts, culture, or a related field, or an equivalent combination of education and experienceAdvanced proficiency with Microsoft Outlook, Word, PowerPoint, Excel, and Adobe, with the ability to produce polished, accurate, and well-structured materialsExceptional written and oral communication skills, with a strong eye for detail and the ability to tailor messaging for different audiencesDemonstrated ability to produce clear, well-structured written materials, including correspondence, briefing notes, and presentation contentDemonstrated ability to exercise sound judgment, discretion, and professionalism when handling confidential or sensitive informationStrong organizational and prioritization skills, with the ability to manage shifting priorities, competing deadlines, and complex schedules with confidenceExperience working effectively with individuals from diverse backgrounds and perspectives, bringing cultural awareness and respect to all interactionsA collaborative mindset, initiative, and a genuine interest in supporting executive leadership and contributing to a positive, high-functioning team environment WHAT WE OFFER Comprehensive benefits coverage: For permanent and full-time contract positions (conditions apply), enjoy 100 percent premium-free benefits for individuals and families, a health spending account, flexible working options (varies by position), and an Employee Assistance ProgramWorry-free retirement savings: With our pension plan, you be",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364742741/",
    "job_id": "4364742741",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager-Admin (Factory) (For PRAN Group) - Job ID: 1458805",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "PRAN Group is looking for Assistant Manager-Admin (Factory)Job Description / ResponsibilityOversee day-to-day administrative functions including front desk, housekeeping, security, and canteen servicesEnsure compliance with company policies and statutory requirements related to factory administrationMaintain and manage factory documentation, records, and reportsSupervise the maintenance of factory buildings, offices, utilities (power, water), and other infrastructureCoordinate with the technical/maintenance department for facility upkeep and repairsManage inventory and procurement of administrative supplies, stationery, and other non-production materialsOversee the factory transport system (employee buses/vehicles) and parking managementEnsure a safe, clean, and productive work environment for all employeesImplement and monitor security protocols in coordination with security agenciesAssist in organizing employee welfare activities and eventsLiaise with government authorities for licenses, inspections, and renewals related to factory administrationSupport the implementation of safety standards and protocols across the facilityManage documentation for audits and ensure all administrative areas are audit-readyLead, train, and motivate the administrative support staffAssign duties and monitor performance to ensure high standards of serviceEducational RequirementsBachelor/HonorsBachelor’s degree in Business Administration, Management, or a related field. An MBA will be an added advantageSkills Required: Administration, Factory HR Administration, Compliance ManagementExperience Requirements3 to 7 year(s)The applicants should have experience in the following business area(s): Manufacturing (FMCG),Manufacturing (Light Engineering and Heavy Industry),Retail Store,Garments,Textile,Food (Packaged)/Beverage,Agro based firms (incl. Agro Processing/Seed/GM),Group of Companies,Beverage,DairyAdditional RequirementsStrong knowledge of factory administrative processes and facility managementExcellent understanding of statutory compliance related to factory operationsProficient in MS Office (Word, Excel, PowerPoint)Outstanding communication, interpersonal, and negotiation skillsProven ability to handle multiple tasks, prioritize effectively, and work under pressureStrong leadership qualities with a proactive and solution-oriented approachJob LocationAnywhere in Bangladesh",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364556672/",
    "job_id": "4364556672",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Internal Audit (For AKIJBASHIR GROUP) - Job ID : 1459019",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "AKIJBASHIR GROUP is looking for Executive - Internal AuditKey PointsBe part of a growing business conglomerateWork with industry leaders and business insidersAttractive compensation & benefit packageOpportunity for growth and learningJob Description / ResponsibilityConduct process, functional, and compliance audits across SBUs to evaluate internal control effectiveness and operational efficiencyPerform pre- and post-audit reviews of payments, party bills, internal bills, vouchers, and expense claims to ensure accuracy, policy compliance, and detect errors or potential fraudCarry out market visits and physical verifications to confirm compliance with AkijBashir Group policies and proceduresReview vendor quotations and market rates to ensure fairness, transparency, and cost-effectivenessIdentify process gaps, control weaknesses, and non-compliance issues, and recommend practical corrective and preventive actionsPrepare structured internal audit reports highlighting observations, risks, root causes, and actionable recommendationsFollow up on audit observations and coordinate with concerned departments to ensure timely implementation and closure of audit issuesMaintain confidentiality, objectivity, and professional ethics while performing all audit activitiesEducational RequirementsBachelor of Business Administration (BBA) in AccountingMaster of Business Administration (MBA) in AccountingCA (CC) completed from a recognized CA FirmSkills Required: ERP Software, Compliance Audit, Accounts and audit, Microsoft Excel, Audit SoftwareExperience Requirements2 to 5 year(s)The applicants should have experience in the following business area(s):Group of Companies,Plastic/ Polymer Industry,Sanitary ware,Tiles/Ceramic,SteelAdditional RequirementsExcellent communication and interpersonal skills.Strong analytical and problem-solving abilities.Effective time management and organizational skills.Ability to work independently and as part of a team.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371842217/",
    "job_id": "4371842217",
    "source": "linkedin",
    "company_name": "EnduroSat",
    "job_title": "Financial Planning and Analysis Specialist",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370864529/",
    "job_id": "4370864529",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Payment Processing Assistant (Hybrid)",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "wherewework.bg on behalf of:Астреа Рикрутмънт ЕООДAt Astrea Recruitment, we’ve been turning job searches into exciting new beginnings for 18years! With offices in Bulgaria and Serbia, we connect top talent with leading Bulgarian andinternational companies. We believe in helping people grow into their best selves, and ourever-growing network of happy candidates and clients is what drives us forward. Let’s shapethe future together!For one of our clients – a key player in the field of sustainable freight and logistics solutions,we are on a lookout for confident and energetic people for the role - Payment Processing Assistant.Essential Responsibilities:Perform transactional activities in the Invoice-to-Pay process with minimal supervision;Verify and reconcile invoices with purchase orders and receipts;Assist with invoice review and approval, and resolve discrepancies;Ensure compliance with procedures and accurate documentation;Maintain data accuracy in company systems;Complete other tasks as assigned by the line manager. Requirements:Bachelor’s degree in finance or business (completed or in progress);Previous experience in the Invoice-to-Pay (ItP) area;Proficiency in English (written and spoken);Experience with handling queries;Strong interpersonal skills;Attention to detail and analytical abilities;Experience with ERP/Cloud systems is a plus;Proficient in Google Workspace or Microsoft Office;Professional communication skills and strong work ethic. Our client offers:Competitive compensation and rewards for your expertise;Comprehensive health benefits, including medical and dental insurance, plus an EmployeeAssistance Program;Food vouchers for convenient meals;25 days of paid vacation and team-building company events;Transportation allowance to ease your commute;Modern office near Paradise Center;Easy access to metro and bus stations;Opportunities for career development through an internal learning platform;Access to various online courses. If you feel excited and confident that you’re the perfect fit, we encourage you to take the nextstep. Kindly share your detailed resume in English when you get a chance. (and don’t forgetto include the reference number TT_).Rest assured that we will reach out promptly to the candidates whose profiles closely matchour requirements. Your privacy is of utmost importance to us, and all your information issafeguarded in compliance with the regulations of the Commission for the Protection ofPersonal Data (Astrea Recruitment, license No 1809).",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355888501/",
    "job_id": "4355888501",
    "source": "linkedin",
    "company_name": "PHOENIX group - Integrated Healthcare Provider",
    "job_title": "Business Assistant to the Managing Director",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "We are PHOENIX, a leading integrated healthcare provider in Europe, and we're excited to invite you to be part of our journey. With a team of approximately 48,000 dedicated professionals, we make a significant impact on healthcare across the continent. Operating in 29 countries, we supply essential pharmaceuticals and health products to pharmacies, doctors, and medical institutions through our 224 distribution centers, serving millions of people every day.Our international IT Hub in Sofia, Bulgaria, is growing, and we are looking for a Business Assistant to the Managing Director. You’ll be part of an international team, working in a vibrant environment that encourages the exchange of knowledge and ideas both onsite and offsite.This is a great opportunity for someone who enjoys a fast‑paced environment, communicates confidently, and wants to be close to strategic decision-making in an international environment.What You’ll Do:Manage the Managing Director’s schedule, meetings, and travel.Prepare presentations, reports, meeting minutes, and follow-ups.Act as a key communication link between the MD and internal/external stakeholders.Support ongoing projects, track deadlines, and assist with executive tasks.Help organize events, workshops, and leadership meetings.Handle confidential information with professionalism and discretion.Assist with coordination of office vendors (facilities, maintenance, catering, etc.) What We’re Looking For:University degree in Business, Administration, Communications, or related field.Previous experience as an Business Assistant, Office Manager or similar administrative role.Strong organizational and communication skills, with the ability to effectively prioritize tasks and manage multiple responsibilities simultaneously.High level of professionalism, reliability, and ability to work independently with a strong sense of accountability and confidentiality.Excellent command of English (both written and spoken), with the ability to communicate effectively in a business environment.Proficiency in MS Office / M365.Positive attitude, problem‑solving mindset and ability to thrive in a fast-paced environment. What We Offer:26 days paid annual leave + 1 additional day for your Birthday.Health insurance.Food vouchers.Free parking.Sports venue pass fully covered.Learning and development.Employee discounts for company products and services. With passion about our product vision in delivering health: creating a health platform that brings together all health services—pharmacies, doctors, and medical supply stores—under one roof. We look for people with the same drive as us. If you recognize this role as a career opportunity where you can make a real difference and be part of an innovative project, we’d love to hear from you! Only short-listed candidates will be contacted. All applications will be treated with strict confidentiality",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370692125/",
    "job_id": "4370692125",
    "source": "linkedin",
    "company_name": "KNAV Canada",
    "job_title": "Senior Tax Manager",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366777486/",
    "job_id": "4366777486",
    "source": "linkedin",
    "company_name": "Vantage",
    "job_title": "Social Media and Content Officer",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Company BackgroundVantage is globally recognized multi-asset brokerage firm headquartered in Sydney, operating under the oversight of reputable regulatory authorities. With a workforce of over 1,000 employees spread across more than 30 offices worldwide, we bring over 15 years of industry experience to our clients. We offer trading opportunities in CFDs for Forex, Commodities, Indices, Shares, and Cryptocurrencies. Our commitment is to provide a robust trading environment, complemented by a fast and user-friendly trading platform, enabling our clients to capitalize on trading opportunities efficiency.To learn more about our company, please visit our websites: https://www.vantagemarkets.io/en/Location: Bangladesh, RemoteWhat You'll Be DoingDeveloped end-to-end content strategy for Vantage Markets across all social media platforms with a strong focus on the Bangladesh marketResearch, plan, and create high-quality educational, promotional, and brand content related to trading, forex, finance, and market insightsCreate engaging storytelling-based content that aligns with Vantage Markets’ global brand voice and local audience preferencesCreate platform-specific content for Instagram, Facebook, X (Twitter), YouTube and TikTokManage content planning and promotion for webinars and live sessions, coordinate with influencers and partners, and support creative teams in developing engaging promotional creatives and marketing assets.Write compelling captions, post copy, scripts, and short-form video ideas that drive engagement and brand recallPlan and manage monthly and campaign-based content calendars aligned with marketing objectivesWork closely with creative team and agency to ensure visually strong and on-brand contentAdapt global marketing content into localized Pakistan-relevant messagingIdentify trending topics, market news, and social media trends to create timely and relevant contentManage community engagement, including responding to comments, messages, and inquiries professionallyEnsure all content complies with financial marketing and regulatory guidelinesTrack content performance using analytics tools and optimize content based on insights and KPIsPrepare weekly/monthly content performance reports suggesting improvements and growth opportunitiesSupport influencer collaborations, partnerships, and campaign launch with content direction and executionWhat we offer:Learn from the Best: Our global marketing team is composed of seasoned professionals with deep expertise from top-tier financial and tech companies. You'll work alongside industry veterans and gain invaluable insights.Invested in Your Impact: You'll be part of a team with a substantial budget and a clear mandate to make a global impact. Our significant investment in a high- profile sports and luxury brand partnership demonstrates our commitment to providing the resources necessary to drive a large-scale marketing campaign.Gain a Competitive Edge: Work on a portfolio of products in the high-growth cryptocurrency sector. This offers a unique opportunity to build your skills and gain a competitive edge in one of the most dynamic and exciting markets today.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4347584216/",
    "job_id": "4347584216",
    "source": "linkedin",
    "company_name": "Flutter Entertainment",
    "job_title": "Finance Lead - Treasury Financial Reporting",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Title – Finance Lead – Treasury Financial ReportingLocation – London/DublinHybrid - 2 days per week (Dublin only)PermanentFlutter consists of two commercial divisions (FanDuel and International) and our central Flutter Functions; COO, Finance & Legal. Here in Flutter Functions we work with colleagues across all our divisions and regions to deliver something we call the Flutter Edge. It’s our competitive advantage, our ‘secret sauce’ which plays a key part in our ongoing success and powers our brands and divisions, through Product, Tech, Expertise and Scale.In Flutter Finance we pride ourselves in providing global expertise to ensure Flutter is financially healthy. Utilising our Flutter Edge to turbo-charge our capabilities.About the role:Reporting to the Director of External Reporting and Technical Accounting, this role is a key part of the Group Reporting team. The Finance Lead - Treasury Financial Reporting oversees financial instruments under US GAAP and IFRS, including hedge accounting.This role manages all treasury financial instrument reporting and controls, including derivatives, hedge accounting, funding, and external financial reporting. Lead routine activities, ensure accuracy, compliance, and efficient control framework.The ideal candidate will show excellent decision-making skills and effectively assist the Director of External Reporting & Technical Accounting in identifying and addressing issues early.What you’ll do Support the Group Treasurer, Group Director Tax, and Director of External Reporting & Technical Accounting by advising on treasury accounting, financial reporting, and controlling activities, assisting with funding and restructuring efforts, and formulating debt servicing strategies and policies, including transfer pricing considerations.Take charge of all accounting matters associated with the Group's financing activities, overseeing all technical accounting issues, including hedge accounting and debt issuance (Term Loan A, Term Loan B, and Senior Notes issued under rule 144A) in close partnership with the Head of External Reporting.Take a vital part in building in-house financial tools for a robust finance function and collaborative relationships with other departments.Lead change activities for treasury accounting, advancing risk identification and developing mitigation plans promptly for desired outcomesSupervise the preparation and assessment of all financial reports related to treasury, encompassing activities like month-end closures, quarterly and yearly reporting, and regulatory document submissions. This involves reporting on derivatives, hedge accounting, internal and external debt, and financing cash flows.Support the Deputy Group Treasurer with budgeting of interest expense and incomeSupport the Tax advisory team in understanding the accounting for financing transactions to facilitate transfer pricing of internal loansOffer perceptive analysis of budget versus actual treasury activities to senior managementCollaborate with an external service provider to assist with the record-keeping and booking of Dutch special purpose financing entities. Evaluate and question the outcomes to guarantee accuracy and thoroughness.Supervise the hedge accounting process, guaranteeing adherence to US GAAP and reporting standards. This encompasses hedge categorization, paperwork, effectiveness evaluation, and disclosures.Partner with external contractor(s) to secure accurate and timely valuations and reporting. Evaluate and scrutinize deliverables, ensuring they are complete and precise.Develop and uphold a strong control structure for treasury financial reporting, ensuring SOX compliance and other regulations, addressing control gaps, and managing treasury systems and their control environments.Streamline Treasury Finance operations through process improvement, role clarity, and better inter-team communication.Lead reporting on projects impacting treasury activities & SOX controls, incl. tax restructurings, new treasury instruments, group transactions, & tech/process changes.Develop and maintain treasury reporting policies and procedures, ensuring alignment with guidelines and regulatory requirements.Develop and nurture connections with essential collaborators in Group Finance and Global Finance.Support the Director of External Reporting & Technical Accounting as needed, with functional or other senior Flutter collaborators on matters related to strategicLead a small treasury financial reporting team, offering support and training, while evaluating team growth needs based on business changes.How you’ll do it Qualified Accountant with 7 – 10+ years of progressive experience, preferably gained in a multi-national / plc environment or a Big-4 accounting firmIFRS and US GAAP experienceConfident and assertive, capable of working effectively with high-level collaboratorsDemonstrated history crafting robust internal control structures (SOX or similar in highly regulated field) and enhancing op",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355798145/",
    "job_id": "4355798145",
    "source": "linkedin",
    "company_name": "Flutter Entertainment",
    "job_title": "Finance Lead - Treasury Financial Reporting",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Title – Finance Lead – Treasury Financial ReportingLocation – London/DublinHybrid - 2 days per week (Dublin only)PermanentFlutter consists of two commercial divisions (FanDuel and International) and our central Flutter Functions; COO, Finance & Legal. Here in Flutter Functions we work with colleagues across all our divisions and regions to deliver something we call the Flutter Edge. It’s our competitive advantage, our ‘secret sauce’ which plays a key part in our ongoing success and powers our brands and divisions, through Product, Tech, Expertise and Scale.In Flutter Finance we pride ourselves in providing global expertise to ensure Flutter is financially healthy. Utilising our Flutter Edge to turbo-charge our capabilities.About the role:Reporting to the Director of External Reporting and Technical Accounting, this role is a key part of the Group Reporting team. The Finance Lead - Treasury Financial Reporting oversees financial instruments under US GAAP and IFRS, including hedge accounting.This role manages all treasury financial instrument reporting and controls, including derivatives, hedge accounting, funding, and external financial reporting. Lead routine activities, ensure accuracy, compliance, and efficient control framework.The ideal candidate will show excellent decision-making skills and effectively assist the Director of External Reporting & Technical Accounting in identifying and addressing issues early.What you’ll do Support the Group Treasurer, Group Director Tax, and Director of External Reporting & Technical Accounting by advising on treasury accounting, financial reporting, and controlling activities, assisting with funding and restructuring efforts, and formulating debt servicing strategies and policies, including transfer pricing considerations.Take charge of all accounting matters associated with the Group's financing activities, overseeing all technical accounting issues, including hedge accounting and debt issuance (Term Loan A, Term Loan B, and Senior Notes issued under rule 144A) in close partnership with the Head of External Reporting.Take a vital part in building in-house financial tools for a robust finance function and collaborative relationships with other departments.Lead change activities for treasury accounting, advancing risk identification and developing mitigation plans promptly for desired outcomesSupervise the preparation and assessment of all financial reports related to treasury, encompassing activities like month-end closures, quarterly and yearly reporting, and regulatory document submissions. This involves reporting on derivatives, hedge accounting, internal and external debt, and financing cash flows.Support the Deputy Group Treasurer with budgeting of interest expense and incomeSupport the Tax advisory team in understanding the accounting for financing transactions to facilitate transfer pricing of internal loansOffer perceptive analysis of budget versus actual treasury activities to senior managementCollaborate with an external service provider to assist with the record-keeping and booking of Dutch special purpose financing entities. Evaluate and question the outcomes to guarantee accuracy and thoroughness.Supervise the hedge accounting process, guaranteeing adherence to US GAAP and reporting standards. This encompasses hedge categorization, paperwork, effectiveness evaluation, and disclosures.Partner with external contractor(s) to secure accurate and timely valuations and reporting. Evaluate and scrutinize deliverables, ensuring they are complete and precise.Develop and uphold a strong control structure for treasury financial reporting, ensuring SOX compliance and other regulations, addressing control gaps, and managing treasury systems and their control environments.Streamline Treasury Finance operations through process improvement, role clarity, and better inter-team communication.Lead reporting on projects impacting treasury activities & SOX controls, incl. tax restructurings, new treasury instruments, group transactions, & tech/process changes.Develop and maintain treasury reporting policies and procedures, ensuring alignment with guidelines and regulatory requirements.Develop and nurture connections with essential collaborators in Group Finance and Global Finance.Support the Director of External Reporting & Technical Accounting as needed, with functional or other senior Flutter collaborators on matters related to strategicLead a small treasury financial reporting team, offering support and training, while evaluating team growth needs based on business changes.How you’ll do it Qualified Accountant with 7 – 10+ years of progressive experience, preferably gained in a multi-national / plc environment or a Big-4 accounting firmIFRS and US GAAP experienceConfident and assertive, capable of working effectively with high-level collaboratorsDemonstrated history crafting robust internal control structures (SOX or similar in highly regulated field) and enhancing op",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318102190/",
    "job_id": "4318102190",
    "source": "linkedin",
    "company_name": "PwC Canada",
    "job_title": "PwC Private, Manager Bilingual (EN/FR)",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "of the CPA In-depth Tax Course is necessary Experience in an accounting firmA proven leader with strong business development and entrepreneurial skillsAbility to work effectively under pressure and manage multiple assignments in an organized mannerAn interest in upskilling for a digital world and technology trends, an openness to learning new tools and adapting how you workA demonstrated commitment to valuing differences, developing and coaching diverse teams, and ensuring diverse perspectives are heard Strong interpersonal skills and communication skillsSuperior problem solving skills, excellent verbal, written and presentation skillsStrong analytical capability, sound business sense and creative mind that have earned you a reputation of providing excellence in client serviceAbility to manage, develop, retain and mentor junior tax professionalsThe successful candidate requires fluency in English, in addition to French as they will be required to support or collaborate with English-speaking clients, colleagues and/or stakeholders during the course of their employment with PwC CanadaPwC Canada is committed to cultivating an inclusive, hybrid work environment. Exact expectations for your team can be discussed with your interviewer This position ensures continuity and upholds our standards of excellence following the departure of a valued team member. The salary range for this position is $77,400 - $127,400. The posted salary range represents the expected hiring range for PwC locations in major city centres. Given our national recruiting approach, ranges may vary for positions in other locations. At PwC Canada, base salary is determined by your skills, experience, qualifications and work location. In addition to base salary, eligible employees may have opportunities to participate in variable incentive pay programs which are designed to reward individual and firm-wide achievements. We are committed to offering competitive compensation and adhere to all relevant pay transparency legislation. During the hiring process, our Talent Acquisition team will provide details about our comprehensive total rewards package. Why you’ll love PwC We’re inspiring and empowering our people to change the world. Powered by the latest technology, you’ll be a part of diverse teams helping public and private clients build trust and deliver sustained outcomes. This meaningful work, and our continuous development environment, will take your career to the next level. We reward your impact, and support your wellbeing, through a competitive compensation package, inclusive benefits and flexibility programs that will help you thrive in work and life. Learn more about our Application Process and Total Rewards Package at: https://jobs-ca.pwc.com/ca/en/life-at-pwc PwC Canada acknowledges that we work and live across Turtle Island, on the land that is now known as Canada, which are the lands of the ancestral, treaty and unceded territories of the First Nations, Métis and Inuit Peoples. We recognize the systemic racism, colonialism and oppression that Indigenous Peoples have experienced and still go through, and we commit to allyship and solidarity. Required SkillsOptional SkillsAccepting Feedback, Accepting Feedback, Account Reconciliation, Active Listening, Analytical Thinking, Business Tax, Calculating Tax, Capital Gains Tax, Coaching and Feedback, Communication, Compliance Oversight, Compliance Support, Corporate Tax Planning, Corporate Tax Self Assessment, Creativity, Direct Tax, Domestic Restructuring (Taxes), Drafting Tax Documents, Embracing Change, Emotional Regulation, Empathy, Financial Statement Analysis, Inclusion, Income Tax Provisions, Information Gathering {+ 35 more}Desired Languages (If blank, desired languages not specified)Travel RequirementsNot SpecifiedAvailable for Work Visa Sponsorship?NoGovernment Clearance Required?NoJob Posting End DateWe’re committed to providing accommodation throughout the application, interview, and employment process. If you require accommodation to be at your best, please let us know during the application process.The use of artificial intelligence (AI) in recruiting is just getting started, so we know you have questions about how and why we use it. At certain points during our recruiting process, we rely on AI to improve your experience. This could be during resume review or curating personalized job recommendations, asking you clarifying questions via a chatbot or during our interview scheduling to improve your experience. Our use of AI helps ensure we combat bias by evaluating candidates equally and fairly, without seeing identity information, such as your name, or gender for example). AI also helps us better predict successful hires by reviewing all applicants for a role and the relationship between your skills, experience and likely success at PwC Canada. While AI supports parts of our recruitment process, final hiring decisions always involve human review. For more information about our us",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4376803545/",
    "job_id": "4376803545",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "bout Turing:Based in San Francisco, California, Turing is the world’s leading research accelerator for frontier AI labs and a trusted partner for global enterprises deploying advanced AI systems.Turing supports customers in two ways: first, by accelerating frontier research with high-quality data, advanced training pipelines, plus top AI researchers who specialize in coding, reasoning, STEM, multilinguality, multimodality, and agents; and second, by applying that expertise to help enterprises transform AI from proof of concept into proprietary intelligence with systems that perform reliably, deliver measurable impact, and drive lasting results on the P&LAbout the Role:We are looking for a detail-oriented Business Analyst to support evaluation and annotation workflows focused on quality, accuracy, and structured reasoning. This role is ideal for someone who is comfortable working with digital tools, performing side-by-side evaluations, and providing clear, well-supported justifications based on fact-checking.Responsibilities:Perform side-by-side (SxS) evaluations on GHD, comparing outputs and assessing quality, accuracy, and relevance.Conduct fact-checking to validate information and identify inconsistencies or inaccuracies.Provide detailed, well-structured justifications to support evaluation decisions.Follow established evaluation guidelines and quality standards consistently.Use browser-based tools and extensions to support analysis and review tasks.Execute simple command-line instructions when required to support evaluation workflows.Document findings clearly and communicate insights to stakeholders when needed.Requirements:Solid comfort using a computer in a professional setting.Experience working with browser extensions and online tools.Ability to run basic command-line commands (no advanced programming required).Strong analytical and critical thinking skills.High attention to detail and ability to justify decisions clearly and objectively.Comfortable working with evaluation frameworks, comparisons, and structured analysis.Good written communication skills in English.Nice to Have:Previous experience with evaluation, annotation, QA, or audit-type work.Familiarity with data quality, content evaluation, or model/output assessments.Background in business analysis, operations, or process improvement.Perks of Freelancing With Turing:Competitive compensation based on experience and expertise.Flexible working hours and a fully remote environment.Opportunity to contribute to impactful research initiatives.Potential for contract extension based on performance and project needs.Offer Details:Commitment Required: 30 hours per week minimum.Engagement Type: Contractor/Freelancer (no medical or paid leave).Time Overlap: Some overlap with UTC-8:00 (2–5 hrs/day) America/Los_Angeles.Application Process:Shortlisted candidates will be invited to complete an analytical challenge.Once the assessment is cleared, you’re ready to start contributing!After applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.Know amazing talent? Refer them at turing.com/referrals, and earn money from your network.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373490412/",
    "job_id": "4373490412",
    "source": "linkedin",
    "company_name": "Desjardins",
    "job_title": "Business analyst, Business strategies",
    "location": "Lévis, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "RequiredAs a business strategy analyst, you help develop plans and business intelligence; monitor business plans and performance; set targets; identify opportunities to improve service delivery; and develop and deliver business strategies and solutions aligned with the business architecture of various initiatives, including the organizational shift and transformation. You analyze the organization’s business needs and business context on large-scale, innovative projects and initiatives. You formalize business objectives and their value to the organization. You help identify, clarify the scope of, assess and recommend business solutions. From needs assessment to rollout, you analyze the impact of solutions on the organization and ensure they are integrated. Your projects and initiatives require extensive, in-depth knowledge of your field. You make recommendations on the planning and execution of operationally and conceptually complex projects and initiatives that require comprehensive analysis and understanding of the organization and line of business and the ability to manage uncertainty and ambiguity. Coordination is critical, so you frequently interact with stakeholders working in many other fields. Interpersonal savvy and the ability to balance the interests of multiple parties are therefore essential. You lead and serve as specialist to teams and decision-making bodies. More specifically, you will be required to:Analyze costs, benefits, risks, constraints, business opportunities and stakeholder needs in terms of project scope, and identify, formalize and communicate needs and requirements Formalize objectives, help identify value for the organization and model business processesWork with users to develop solutions that are aligned with the business objectives, analyze impacts on the various stakeholders, identify prerequisites and internal dependencies, ensure a cross-sector vision of the solution and perform end-to-end requirements traceabilityHelp develop testing strategies and acceptance testing plans, and support the business sector during solution rolloutHelp develop change management strategies and carry out related activitiesWhat we offer*Competitive salary and annual bonus4 weeks of flexible vacation starting in the first yearDefined benefit pension plan that provides predictable, stable income throughout retirementGroup insurance including telemedicineReimbursement of health and wellness expenses and telework equipment Benefits apply based on eligibility criteria.What You Bring To The TableBachelor's degree in a related fieldA minimum of six years of relevant experiencePlease note that other combinations of qualifications and relevant experience may be consideredKnowledge of French is requiredAction oriented, Ambiguity, Customer Focus, Differences, Interpersonal Savvy, Nimble learning, StakeholdersTrade Union (If applicable)At Desjardins, we believe in equity, diversity and inclusion. We're committed to welcoming, respecting and valuing people for who they are as individuals, learning from their differences, embracing their uniqueness, and providing a positive workplace for all. At Desjardins, we have zero tolerance for discrimination of any kind. We believe our teams should reflect the diversity of the members, clients and communities we serve.If there's something we can do to help make the recruitment process or the job you're applying for more accessible, let us know. We can provide accommodations at any stage in the recruitment process. Just ask!Job FamilyAdministration (FG)Unposting Date2026-03-6",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374974966/",
    "job_id": "4374974966",
    "source": "linkedin",
    "company_name": "Recruitment Mantra HR Consultancy & Recruitment Agency",
    "job_title": "Senior Accountant",
    "location": "Greater Kolkata Area",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4374279794/",
    "job_id": "4374279794",
    "source": "linkedin",
    "company_name": "EY",
    "job_title": "Consultant - Business Consulting Risk - AMI - CNS - Risk - Process & Controls - Kolkata",
    "location": "Kolkata, West Bengal, India",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Req id -1688008The opportunityThe objective of our advisory risk services is to provide clients with a candid and reliable overview of their risk landscape. Our solutions can be used by our clients to build confidence and trust with their customers, the overall market and when required by regulation or contract. You will be responsible for executing client related engagements in the areas of governance, risk & compliance (GRC), internal audits, process reviews, standard operating procedures,enterprise risk management, revenue assurance.Your key responsibilitiesExecution on client engagement – Ensure quality delivery as per client requirements. Review of working papers and client folders. Suggest ideas on improving engagement productivity and identify opportunities for improving client service.Understand business & industry issues / trends. Identify areas requiring improvement in the client's business processes to enable preparation of recommendations.Handling data analytics - Access, ACL etc. Ensure compliance with engagement plans and internal quality & risk management procedures.Awareness of internal auditing standards issued by IIA and ICAI. Demonstrate an application & solution-based approach to problem solving technique. Manage the engagement budgets and support superiors in developing marketing collaterals, business proposals and new solution / methodology development.Develop strong working relationships with client (process owner/functional heads). Attention to detail and mentor young interns and analysts within the practice. Contribute to knowledge management sessions within the practice. Skills and attributes for successDetermine that the work delivered is of high quality. Anticipate and identify engagement related risks and escalate issues as appropriate. Actively establish client (process owner/functional heads) and internal relationships. Assist and share knowledge with team members, Seniors and Managers in developing new methodologies and internal initiatives and participate in performing procedures especially focusing on complex, judgmental and/or specialized issues.Work with the team and the client to create plans for accomplishing engagementobjectives and a strategy that complies with professional standards and advise clientsto understand and manage their business risks and verify the validity of their business informationBrief the engagement team on the client's IA environment and industry IA trends. Maintain relationships with client management to manage expectations of service, including work products, timing, and deliverables. Demonstrate a thoroughunderstanding of compliance, financial, and operational risks along with performinginternal control testing, develop internal audit plans, and provide internal audit services on an outsourcing basis. Assess internal controls and SOX framework in order to mitigate risk and apply it to client situationsAcon – Internal Audit 2Bring and utilize extensive knowledge of the client's business/industry to identify technological developments and evaluate impacts on the client's business.Demonstrate excellent project management skills, inspire teamwork and responsibility with engagement team members, and use current technology/tools to enhance theeffectiveness of deliverables and services.Understand EY and its service lines and actively assess what the firm can deliver to serve clients.To qualify for the role you must haveChartered Accountant / Certified Internal Auditor or have a Master’s degree in Business Administration0-1 year of post-qualification experience in risk advisory, related internal audit experience or external audit experienceWe would expect for you to be available to travel outside of their assigned office location at least 50% of the time, plus commute within the region (where publictransportation often is not available). Successful candidates must work in excess of standard hours when necessary. A valid passport is required.Ideally, you’ll also have Good communication skills What we look forWe’re looking for passionate leaders with strong vision and a desire to stay on top of trends in the risk industry. If you have a genuine passion for helping businesses achieve their fullpotential, this role is for you.What working at EY offers EY is committed to being an inclusive employer and we are happy to consider flexible working arrangements. We strive to achieve the right balance for our people, enabling us to deliver excellent client service whilst allowing you to build your career without sacrificing your personal priorities. While our client-facing professionals can be required to travel regularly, and at times be based at client sites, our flexible working arrangements can help you to achieve a lifestyle balance.About EYAs a global leader in assurance, tax, transaction and advisory services, we hire and developthe most passionate people in their field to help build a better working world. This starts with a culture that believes in givin",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3339408668/",
    "job_id": "3339408668",
    "source": "linkedin",
    "company_name": "Citi নিয়োগ",
    "job_title": "Officer, Treasury Operations",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4150642413/",
    "job_id": "4150642413",
    "source": "linkedin",
    "company_name": "Latif & Associates নিয়োগ",
    "job_title": "Tax Consultant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4302305515/",
    "job_id": "4302305515",
    "source": "linkedin",
    "company_name": "Jule",
    "job_title": "Senior Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Senior AccountantWhat It Feels Like To Work At JuleJule has maintained its flat management structure and start-up culture, despite its steady growth in the industry for the past ten years. The Senior Accountant will be a part of a rapidly growing Accounting and Finance team with opportunities to collaborate with various department’s including, Engineering, Purchasing, Product Design, Sales, Project Management and more! Join a close-knit, high-energy team that rewards those who are naturally curious and exceptionally driven, to reach their growth potential.Our CompanyJule is a Toronto-based all-in-one solution provider of Battery Energy Storage Systems (BESS) and Electric Vehicle Fast Charging (EVFC). Using its patented battery & power/energy management technologies, Jule has been delivering successful projects over a wide range of industries, including community energy storage, electric vehicle charging infrastructure and microgrid development.Our website: https://www.julepower.com/Jule Company HighlightsCurrently listed as the Top 9 EVFC awarded companies.Rapidly expanding client base in North America.A product on the cutting edge of transportation, energy, and infrastructure with the potential to take its impact to a global scale.Well-developed partner and supplier network across North America.Fun, collaborative environment that supports you to be creative, productive and achieve mastery of your domain.Jule has been awarded over 200 projects and over $140M in funding since 2023 OverviewThe Senior Accountant is responsible for ensuring that accounts and financial records meet established standards and criteria. Senior Accountant duties include analyzing financial documents, recording, and verifying transactions, as well as producing payroll. The Senior Accountant will be reporting to the Director of Finance.Key ResponsibilitiesUse QuickBooks to prepare and record assets, liability, revenue, and expenses entries by compiling and analyzing account information.Monitors Inventory and COGS status monthly.Produce monthly inventory control reports – Inventory valuation and count, BOM, WIP Analysis, and COGS.Maintain and balance subsidiary accounts by verifying, allocating, posting, reconciling bank transactions, resolving discrepancies.Verify, allocate, post, and reconcile accounts payables and receivables.Assists in the preparation of Monthly Financial Statements.Produce error-free accounting reports and present their results.Maintain general ledger by transferring subsidiary accounts; preparing a trial balance; reconciling entries.Summarize financial status by collecting information, preparing balance sheets, profit and loss, and other statements.Protect the organization's value by keeping information confidential.Enters monthly adjusting journal entries.Accounting for intercompany transactions.GST/HST, WSIB, EHT Reporting.Maintains effective filing system.Additional responsibilities and special projects to be provided on an ongoing basis.Knowledge And SkillsThorough knowledge of basic accounting procedures and GAAP.Familiarity with financial accounting statements.Advanced MS Excel skills including pivot tables.Accuracy and attention to detail.Aptitude for numbers and quantitative skills.Working under tight timelines.Fast paced, changing environment.Education/ExperienceMinimum of 3 years of relevant experience with at least 1 year of experience in manufacturing.1 year experience working with inventory management systems and QuickBooks Online.BSc or BComm degree in Accounting, Finance or related field.CPA Designation or working towards would be considered an asset. Experience with general ledger functions and the month-end/year-end close process.Previous experience with supporting the implementation of an ERP is an asset.We thank all applicants for their interest, however, only candidates selected for an interview will be contacted.Department: Accounting and FinanceThis is a full time position Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366101248/",
    "job_id": "4366101248",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Nairobi, Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366108198/",
    "job_id": "4366108198",
    "source": "linkedin",
    "company_name": "Canonical",
    "job_title": "Accountant",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346722903/",
    "job_id": "4346722903",
    "source": "linkedin",
    "company_name": "Homzmart",
    "job_title": "Senior Accountant",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366280354/",
    "job_id": "4366280354",
    "source": "linkedin",
    "company_name": "Four Seasons Hotels and Resorts",
    "job_title": "Staff Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355962917/",
    "job_id": "4355962917",
    "source": "linkedin",
    "company_name": "Gordian Staffing Careers",
    "job_title": "Staff Accountant - REMOTE",
    "location": "Muntinlupa City, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4334331903/",
    "job_id": "4334331903",
    "source": "linkedin",
    "company_name": "Saviynt",
    "job_title": "Enterprise Account Executive",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Saviynt's AI-powered identity platform manages and governs human and non-human access to all of an organization's applications, data, and business processes. Customers trust Saviynt to safeguard their digital assets, drive operational efficiency, and reduce compliance costs. Built for the AI age, Saviynt is today helping organizations safely accelerate their deployment and usage of AI. Saviynt is recognized as the leader in identity security, with solutions that protect and empower the world’s leading brands, Fortune 500 companies and government institutions. We are looking for a professional, highly motivated Account Executive to drive regional enterprise sales for our disruptive IaaS Cloud Security, Access Governance & Privileged Access Management solutions in Quebec. The AE will combine good working knowledge of (IaaS & SaaS) Identity, Cloud Security or PAM technology with prospecting and sales skills. This person is ultimately responsible for the entire enterprise sales cycle within their territory and meeting or exceeding territory quota. At Saviynt, Account Executives are the primary interface to both Prospects and Customers and responsible for actively driving and managing day to day prospecting & selling activity in the region. This activity includes opportunity Discovery, Demo, RFP/RFI, Evaluation & POC stages of the sales process, working in conjunction with SE & Product Management Teams to identify & close new deals.WHAT YOU WILL BE DOING:Effectively interact with VP, SVP, CxO levels, Cloud Teams, and Line of Business decision-makers & Resellers, SI’s, and AdvisoriesLearn and maintain knowledge of Saviynt’s solutions, focused on Cloud Security, Cloud Access Governance & PAMAggressively identify qualified sales opportunities across all assigned accounts/ territoryDevelop and leverage all lead sources (personal and partner contacts, inbound leads, events, and outbound prospecting) to generate meaningful pipelineMaintain disciplined, detailed, and up-to-date records on Lead & Opportunity activity in SFDC to ensure effective lead development, proper team communication, and executive visibilityBe diligent in timely follow-up and provide quality work productsAttend and assist with corporate and field sales & marketing eventsAchieve monthly and quarterly revenue objectivesWHAT YOU BRING:7+ years experience in enterprise Identity, PAM, or Enterprise Saas SalesFluent in FrenchMust be located in the greater Montreal areaSolid cybersecurity territory contacts at VP, SVP, CxO levelsSuccessful history of working with Resellers, SI’s, and AdvisoriesStrong Customer Service orientation, persistence, and ability to follow throughProven ability and skill to navigate through all levels of an enterprise organization to drive salesProfessional, ambitious, determined, and results-oriented mindsetPositive attitude, team-oriented, self-starter who can work alone and in a collaborative manner to achieve regional goalsKnowledge of Cloud Identity Management, Cloud Privileged Access Management and/or Cloud Security Governance technology a plus If required for this role, you will:- Complete security & privacy literacy and awareness training during onboarding and annually thereafter- Review (initially and annually thereafter), understand, and adhere to Information Security/Privacy Policies and Procedures such as (but not limited to):> Data Classification, Retention & Handling Policy> Incident Response Policy/Procedures> Business Continuity/Disaster Recovery Policy/Procedures> Mobile Device Policy> Account Management Policy> Access Control Policy> Personnel Security Policy> Privacy PolicySaviynt is an amazing place to work. We are a high-growth, Platform as a Service company focused on Identity Authority to power and protect the world at work. You will experience tremendous growth and learning opportunities through challenging yet rewarding work which directly impacts our customers, all within a welcoming and positive work environment. If you're resilient and enjoy working in a dynamic environment you belong with us!Saviynt is an equal opportunity employer and we welcome everyone to our team. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356452256/",
    "job_id": "4356452256",
    "source": "linkedin",
    "company_name": "Zanchin Automotive Group",
    "job_title": "Finance and Insurance Manager - Maple Honda - 25495",
    "location": "Vaughan, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355712639/",
    "job_id": "4355712639",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Branch Accountant- For Shiropa Development Society- Job ID: 1452500",
    "location": "Chuadanga, Khulna, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366536230/",
    "job_id": "4366536230",
    "source": "linkedin",
    "company_name": "Inter-Co Division 10 Inc.",
    "job_title": "Credit Manager",
    "location": "North York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365798242/",
    "job_id": "4365798242",
    "source": "linkedin",
    "company_name": "Gildan",
    "job_title": "Analyst, IT Governance, Risk and Compliance (GRC)",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365810706/",
    "job_id": "4365810706",
    "source": "linkedin",
    "company_name": "QNB Egypt",
    "job_title": "Corporate Credit Acquisition Senior Relationship Manager/ Corporate Credit Acquisition Relationship Manager",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355675817/",
    "job_id": "4355675817",
    "source": "linkedin",
    "company_name": "Monjasa",
    "job_title": "Accountant",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366362046/",
    "job_id": "4366362046",
    "source": "linkedin",
    "company_name": "Dubai Holding",
    "job_title": "Senior Manager – Risk and Compliance (11 month contract)",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355970234/",
    "job_id": "4355970234",
    "source": "linkedin",
    "company_name": "Hayhay",
    "job_title": "İç Kontrol ve Uyum Uzmanı",
    "location": "Greater Istanbul",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Hayhay Finansal Hizmetler Grubu, dijital ödeme teknolojileri ve bireysel finansman çözümleriyle kullanıcıların finansal ihtiyaçlarına hızlı, güvenli ve yenilikçi yanıtlar sunan bir finansal teknoloji grubudur.Büyüyen organizasyonumuzda Finansman şirketimiz için İç Kontrol ve Uyum Uzmanı arayışımız mevcuttur. Dinamik ekibimize katılmak isterseniz başvurularınızı bekliyoruz.Aranan Nitelikler;Üniversitelerin İşletme, İktisat, Finans, Maliye, İstatistik, Matematik veya ilgili bölümlerinden mezun,Finansal kuruluşların iç kontrol veya teftiş alanlarında 5-7 yıl deneyimli,Bankacılık veya finansman şirketlerinde tecrübeli,İç kontrol ve denetim süreçleri hakkında deneyimli,Yasal mevzuatlar ve düzenlemeler konusunda bilgi sahibi,6361 ve 5549 Sayılı Kanun, finansman mevzuatına ve bağlı ikincil düzenlemelere hakim,Detaylara önem veren, analitik düşünme ve problem çözme yetenekleri gelişmiş,Raporlama ve sunum becerisi yüksek,İletişim becerileri güçlü,Ekip çalışmasına yatkın ve liderlik becerilerine sahip,MS Office programlarını çok iyi derecede kullanabilen,İstanbul'da ikamet eden adaylar aramaktayız.İş Tanımı;İç kontrol sistemlerinin tasarımı, uygulanması ve sürekliliğinin sağlanması,Finansal ve operasyonel süreçlerin etkinliğini, verimliliğini ve güvenilirliğini değerlendirmek için düzenli olarak iç denetimlerin planlanması ve yürütülmesi,Yasal düzenlemeler ve şirket politikaları çerçevesinde iç kontrol prosedürlerinin güncellenmesi ve iyileştirilmesi,İç kontrol süreçleri ile ilgili raporların hazırlanması ve üst yönetime sunulması,İç ve dış denetçilerle koordinasyonun sağlanması,Yeni projeler ve süreç değişikliklerinde iç kontrol perspektifinden değerlendirme yapılması,Finansman mevzuatı kapsamında iç kontrol faaliyetlerini yürütülmesi,Periyodik ve yerinde/uzaktan izleme, inceleme ve kontrol çalışmalarını yürütülmesi,6361 Sayılı Kanun ve bağlı ikincil düzenlemeler, kurum içi politika ve prosedürlere ilişkin tespit edilen hata ve eksikliklerin düzeltilmesini ve tamamlanmasının sağlanması,Operasyonel riskin azaltılması, kurum politika ve prosedürlerinin geliştirilmesi vb. iç kontrol ile ilgili tüm görevlerin yerine getirilmesi,5549 sayılı Kanun ve ilgili mevzuat kapsamındaki Şirket yükümlülüklerinin yerine getirilmesine ilişkin sürecin tasarlanması, müşteri edinim (KYC) sürecinin tasarlanması, ilgili mevzuat kapsamındaki gerekli yükümlülüklerin sağlanması. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355685761/",
    "job_id": "4355685761",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager/ Asst. Manager - Quality Assurance - For BIOCURE PHARMACEUTICAL- Job ID: 1453663",
    "location": "Narsingdi District, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355735614/",
    "job_id": "4355735614",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Customer Care Support Executive - For Gowell Global Sourcing- Job ID: 1453631",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369309889/",
    "job_id": "4369309889",
    "source": "linkedin",
    "company_name": "PULSE",
    "job_title": "Junior Administrative Assistant – Support (Remote)",
    "location": "Ajman, Ajman Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366561789/",
    "job_id": "4366561789",
    "source": "linkedin",
    "company_name": "Pan Pacific Hotels Group",
    "job_title": "Accounts Executive",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Pan Pacific Hotels Group is a young and dynamic company comprising three well-established and trusted brands; Pan Pacific®, PARKROYAL COLLECTION® and PARKROYAL®. We have aggressive expansion plans and as such, we are looking for motivated and energetic people to be part of our growing team. If you have a passion for the industry and are driven by the desire to create Service Excellence Culture, Pan Pacific Hotels Group is able to offer you great opportunities as we continue to strengthen our global footprint.Based in our Shared Services Centre in Singapore, we are looking for a passionate and energetic individual to join us as an Accounts Executive.Job Responsibilities:The candidate is responsible for the Accounts Payable function for accounts under the care of Shared Services Centre. The primary responsibilities include the entry and payment of vendors’ invoices, and preparation of month end reports. The Role:To perform the AP functions of one or more entities by validating and entering all invoices into the accounting system.Ensure timeliness of payment to vendors in accordance to the agreed payment terms.Assist on the preparation of month end reports and audit schedules.Attend to internal and external audit queries.To relieve or extend assistance to other colleagues in their absence, and to undertake any other related tasks that may be assigned by the supervisor.Requirements:Proficiency in MS Office (Excel) and SAP accounting system will be an advantage.Proactive and independent. Good interpersonal and communication skills.Good analytical and problem-solving skills.High level of accuracy with an eye for details.Pan Pacific Hotels Group is dedicated to providing equal employment opportunities, including individuals with disabilities. We regret that only shortlisted candidates will be notified. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360292063/",
    "job_id": "4360292063",
    "source": "linkedin",
    "company_name": "PKO Bank Polski",
    "job_title": "Stażystka/Stażysta w zespole wsparcia oddziałów zagranicznych",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321457199/",
    "job_id": "4321457199",
    "source": "linkedin",
    "company_name": "MyBestPharm",
    "job_title": "Financial Controller",
    "location": "Warsaw Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365925044/",
    "job_id": "4365925044",
    "source": "linkedin",
    "company_name": "Elm Company",
    "job_title": "Elm Co-op Training Program (March 2026 Intake) - Management Information Systems Job",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352595459/",
    "job_id": "4352595459",
    "source": "linkedin",
    "company_name": "RLDatix North America",
    "job_title": "Application Specialist",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Application Specialist | Professional Services | Saudi Arabia | HybridRLDatix (RLD) is on a mission to help raise the standard of care…everywhere. Trusted by over 10,000 healthcare organizations around the world, our solutions help improve health and care. Our applications ensure that patients receive the best and safest care while supporting the providers who deliver it.Joining TeamRLD means being part of a global effort of over 2,000 team members in making a difference in healthcare…every day.We’re searching for an Application Specialist in Saudi Arabia to join our Professional Services team, so that we can support the growing number of projects and the increasing complexity of customer requirements within the Professional Services function. The Application Specialist will support the delivery and deployment of software solutions to ensure timely project turnaround, enhance customer satisfaction, and strengthen our ability to manage global implementations effectively.How You’ll Spend Your TimeAnalyze business and technical requirements to ensure project solutions align with client needs.Facilitate communication between stakeholders and vendors in order to keep all parties aligned on project status. Develop detailed process flows and user guides to maintain accessible and accurate project documentation. Configure system software and specifications in order to deliver customized solutions that meet technical goals. Coordinate user acceptance testing (UAT) and quality assurance to validate that the final product meets all requirements. Deliver client training and support in order to drive seamless system adoption and user proficiency. What Kind of Things We’re Most Interested in You Having3-4 years of experience in software implementation, health informatics, or a similar healthcare IT role. Proven success in managing multiple concurrent projects and implementations within a fast-paced environment. In-depth knowledge on how to use SQL, data analysis tools, and software implementation methodologies (Agile/Waterfall). Ability to commute to Riyadh office. Sincere interest in healthcare technology and improving the standard of care through digital transformation. A knack for working collaboratively within a global team to solve complex technical challenges and build positive stakeholder relationships. By enabling flexibility in how we work and prioritizing employee wellness, we empower our team to do and be their best. Key benefits include private health and group accident insurance, an Employee Assistance Program (EAP) for confidential support, and Loyalty Awards for long-service employees.RLDatix is an equal opportunity employer, and our employment decisions are made without regard to race, color, religion, age, gender, national origin, disability, handicap, marital status or any other status or condition protected by law.As part of RLDatix’s commitment to the inclusion of all qualified individuals, we ensure that persons with disabilities are provided reasonable accommodation in the job application and interview process. If reasonable accommodation is needed to participate in either step, please don’t hesitate to send a note to accessibility@rldatix.com.Salary offers are based on a wide range of factors including location, relevant skills, training, experience, education, and, where applicable, licensure or certifications obtained. Market and organizational factors are also taken into consideration. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369339179/",
    "job_id": "4369339179",
    "source": "linkedin",
    "company_name": "FINN APP",
    "job_title": "Senior Credit Risk Manager",
    "location": "Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We’re seeking a Credit Risk Manager to shape our ML-driven underwriting strategy and strengthen our risk decisioning globally. In this role, you’ll combine analytical depth with hands-on model development to drive smarter, fairer decisions. From monitoring portfolio health to designing and deploying robust credit risk models, you’ll help us balance growth with prudent risk management. Working closely with data, engineering, and product teams, you’ll turn insights into business impact and improve approval funnels, refining policies, and expanding access to credit responsibly. In this role, you’ll combine analytical depth with hands-on model development to drive smarter, fairer decisions.ResponsibilitiesMonitor key risk metrics (e.g., default rates, approval rates) and investigate significant changes.Analyze large datasets to identify trends, anomalies, and areas for improvement in risk management processes.Simulate the impact of credit policy or model changes, support A/B tests, and help guide rollouts to improve approval funnel performance.Track performance post-implementation and refine strategies using feedback loops and business KPIs.Develop, test, and deploy risk models in an iterative, agile manner.Monitor the performance of risk models, tracking feature stability, accuracy, and drift over time.Understand country-specific factors such as onboarding processes, customer limit management, and local alternative data sources.Collaborate with internal and external data vendors to evaluate and integrate new data sources.Contribute to the setup of early warning signals for portfolio deterioration, using a mix of quantitative and qualitative data.QualificationsAt least 5 years of experience in consumer credit risk analysisBachelor's degree in business, finance, economics, actuarial studies, computer science or another relevant fieldRequired SkillsDemonstrated proficiency in consumer credit risk assessment and how it relates to other business units (marketing, engineering, finance, and legal)Hands-on experience building, testing, deploying, and monitoring credit risk models (e.g., logistic regression, XGBoost, scorecards)Good statistical and mathematical skillsGood working knowledge of SQL and PythonStrong written and verbal communication skills in EnglishAble to communicate complex credit risk concepts clearly to non-technical stakeholdersIndependent, creative, and proactive problem-solving mindsetPreferred SkillsPrevious experience in a fintech, neobank, or digital lending environmentAble to design and deploy data marts and alertsFamiliarity with credit data sources or regulatory environments in Southeast Asia (e.g., Thailand, Philippines, Indonesia)Previous experience with cloud platforms, AWS and GCPExperience in the design and automation of credit portfolios or financial reportsFamiliar with model deployment frameworks like Flask/FastAPI or MLflowFamiliarity with MLOps tooling (e.g., Airflow, dbt, or feature stores)Pay range and compensation packageA competitive salary and benefits packageEqual Opportunity StatementWe are committed to diversity and inclusivity. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352406491/",
    "job_id": "4352406491",
    "source": "linkedin",
    "company_name": "KPMG Hungary",
    "job_title": "Entity Controller",
    "location": "Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321368148/",
    "job_id": "4321368148",
    "source": "linkedin",
    "company_name": "IDLC Finance PLC",
    "job_title": "Data Analyst",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321455765/",
    "job_id": "4321455765",
    "source": "linkedin",
    "company_name": "Sygnia Asset Management",
    "job_title": "Junior Accountant",
    "location": "City of Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369046473/",
    "job_id": "4369046473",
    "source": "linkedin",
    "company_name": "Skilld by eJobs",
    "job_title": "Financial Controller",
    "location": "Bucharest Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368280536/",
    "job_id": "4368280536",
    "source": "linkedin",
    "company_name": "Vaco by Highspring",
    "job_title": "Senior Financial Analyst",
    "location": "Vaughan, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355729393/",
    "job_id": "4355729393",
    "source": "linkedin",
    "company_name": "NADG",
    "job_title": "Financial Analyst",
    "location": "North York, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370926712/",
    "job_id": "4370926712",
    "source": "linkedin",
    "company_name": "ReliefWeb",
    "job_title": "Sr. Manager/ Manager, Grants and Compliance, Humanitarian Crisis Management Programme (HCMP)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363038857/",
    "job_id": "4363038857",
    "source": "linkedin",
    "company_name": "QNB Türkiye",
    "job_title": "DÖVİZ VE TÜREV PİYASALAR UZMANI",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "DÖVİZ VE TÜREV PİYASALAR UZMANIHAZİNENİN GELECEĞİ BURADASeni Türkiye’nin en büyük ve öncü bankalarından birinde, bankacılığın kalbinde yer alan ve dünyanı genişletecek bir pozisyonda çalışmaya davet ediyoruz.QNB bünyesinde, Hazine iş birimi Döviz ve Türev Piyasalar bölümünde İstanbul’daki genel merkezimizde görevlendirilmek üzere takım arkadaşı arayışındayız.Döviz ve Türev piyasalar birimi, bankamızın tezgâh üstü veya organize piyasalarda, spot döviz ve kıymetli maden alım satımını ve döviz veya emtia üzerine yapılan türev ürün işlemlerini gerçekleştirmektedir.Seni Bekleyen Fırsatlar:En güvenilir ve gelişmekte olan sektörlerden birinde yer alarak geleceğe değer katmaKendi gelişimini destekleyecek ilham verici bir çalışma ortamı ve geliştirici kariyer araçlarına erişimBüyümeni destekleyen bir yapıda konforlu bir çalışma ortamı ve ilerleme fırsatlarıEğer bu niteliklere sahipsen:•Ekonomi, işletme veya mühendislik alanlarında lisans mezunu olmak,•Minimum 2 yıl ilgili iş tecrübesine sahip olmak,•Finansal piyasalara ilgi duyarak analiz ve risk yönetimi alanlarında beceri geliştirmeye istekli olmak,•Türev ürünlerdeki teknik modelleme ve nicel hesaplamalara ilgi duymak,•Güçlü analitik düşünme, problem çözme ve karar verme yeteneklerine sahip olmak,•İleri derecede Microsoft Excel bilmek,•Visual Basic ve Python gibi programlama dillerine başlangıç seviyesinde hâkim olmak ve geliştirmeye açık olmak,•İleri düzeyde İngilizce bilmek,•Sermaye piyasası faaliyetleri düzey 3 ve Türev araçlar lisanslarına sahip olmak,Sorumlulukların şunlar olacak:•Spot döviz, vadeli döviz işlemleri, döviz opsiyonları ve emtialara bağlı türev ürünlerin fiyatlamasını gerçekleştirmek,•Elektronik döviz işlem platformunda sürekli olarak fiyat sağlamak, bankalar arası piyasada fiyat vermek,•Döviz piyasaları ile ilgili TCMB ile irtibatta olmak, günlük piyasa yorumu vermek,•Döviz piyasalarında oluşacak fırsatları değerlendirerek risk limitleri dahilinde kar amaçlı alım-satım yapmak,•Borsa İstanbul Kıymetli Madenler ve Taşlar Piyasası ve Vadeli İşlem ve Opsiyon Piyasasında alım-satım yapmak,•Pozisyonları ve günlük işleri özetleyen raporları hazırlanmak,•Finansal piyasalardaki gelişmeleri yakından takip ederek birim stratejisine katkıda bulunmak,•İşlem ve risk limitlerine çerçevesinde alım satım stratejileri oluşturarak, döviz ve türev pozisyonlarını yönetmek,Haydi ekibimizin bir parçası ol ve güçlü bir gelecek inşa etmek için ilk adımı at! Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368627400/",
    "job_id": "4368627400",
    "source": "linkedin",
    "company_name": "YIT - Urban developer and construction company",
    "job_title": "Študentská brigáda asistent účtovníka",
    "location": "Bratislava, Bratislava, Slovakia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Vo YIT budujeme lepšie prostredie pre život. V spolupráci s našimi zamestnancami, partnermi a mestom budujeme domovy, kde sa plnia sny a kancelárie, v ktorých sa ľudia cítia ako doma. Staviame udržateľné mestské štvrte s ohľadom na meniace sa klimatické podmienky a životné prostredie. V práci sa riadime hodnotami: rešpekt, spolupráca, kreativita a nadšenie. Máme voči sebe vzájomnú dôveru, a preto sa môžeme spoľahnúť jeden na druhého. Vďaka inšpiratívnemu prostrediu a kolegom robíme prácu, ktorá dáva zmysel a nebojíme sa zdolávať aj tie najväčšie výzvy. Naše jedinečné projekty nám dávajú priestor pracovať na sebe a zdokonaľovať sa. Viac ako sto rokov sme významný európsky hráč s fínskymi koreňmi a veľkým srdcom. Od roku 2010 prinášame aj na Slovensko kvalitný štandard bývania, kde sme vytvorili domov pre viac ako 2500 ľudí.Popis pracovného miestaTrainee program dáva šancu študentom vysokých škôl položiť základy svojej kariéry a premeniť získané vedomosti do trvalo udržateľných projektov. U nás je každý trainee cenným členom silného a ambiciózneho tímu. Študenti spolupracujú s tými najlepšími odborníkmi na významných projektoch a zdolávajú nové výzvy. Našim záujmom je, aby sa tí najlepší stážisti stali súčasťou YIT a dostali priestor niečo po sebe zanechať.Momentálne hľadáme traineeho do nášho účtovného tímu, ktorého náplňou práce bude:archivácia dokumentovfyzická inventúrakomunikácia s klientmi ohľadom faktúradministratívna podpora účtovného oddelenia vyúčtovaniaKvalifikáciePozícii vyhovujú uchádzači so vzdelaním:študent vysokej školyvysokoškolské I. stupňaVzdelanie v odbore:financie, účtovníctvo, manažmentJazykové znalosti:anglický jazyk- pokročilý (B2)Odborné zručnosti:Microsoft Excel- pokročilýMicrosoft PowerPoint- pokročilýMicrosof Outlook- pokročilýOsobnostné predpoklady:zmysel pre detail, precíznosťkomunikačné schopnostisamostatnosť pri plnení úlohkreatívny prístup pri hľadaní nových riešeníDodatočné informácieTrainee program je otvorený pre denných študentov VŠ, ktorí by chceli chodiť do práce cca na 20/hod za týždeň. Sme otvorení v našom rozhodovaní sa o najvhodnejšom kandidátovi. Informujeme Vás priebežne o vývoji výberového procesu. Váš životopis posúdime do 10 pracovných dní. Najvhodnejších kandidátov, ktorí majú požadované skúsenosti a zručnosti, pozveme na pohovor. Chceme vytvoriť atmosféru, kde sa budete cítiť príjemne a kde môžete ukázať to najlepšie z Vás. Okrem Vašich zručností a potenciálu je pre nás dôležité, aby ste zapadli do tímu a mali blízko k našim hodnotám.Aj pre našich trainees ponúkame širokú škálu benefitov:Čerstvé ovocie, kávaMultisport kartaKnižnica YITYIT EDU – odborné vzdelávanie a konferencie, inšpiratívne workshopy na sebarozvoj, interní lektoriMožnosť kariérneho rozvoja a internej rotáciePružný pracovný časObčasný home officeSpoločné tímbuildingy a firemné podujatiaZľavy u našich partnerovMzdové rozpätie:7,50 EUR/ hod.Druh pracovného pomeru:na dohodu/ brigádastáž/ internship Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364594179/",
    "job_id": "4364594179",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Executive - For Rio Trip Limited- Job ID: 1459139",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Rio Trip Limited is looking for Accounts ExecutiveJob Description / ResponsibilityJob Context: Rio Group is a diversified business group operating The Cafe Rio, RioTrip, RioShop, Rio Slice, and Rizik Agro. We are seeking a competent and detail-oriented Accounts Executive to support and manage accounting operations across multiple business units. The candidate must ensure financial accuracy, compliance, and timely reporting while coordinating with internal departments and external stakeholders.Job Responsibilities:Maintain accurate accounting records, journal entries, vouchers, and ledgersPrepare bank reconciliation statements and monitor daily cash flowHandle accounts payable and receivable activitiesVerify vendor bills, GRN/MRR, and support payment processingMonitor customer and supplier account reconciliationAssist in preparing monthly, quarterly, and annual financial reportsGenerate MIS reports and assist management with financial analysisEnsure VAT, Tax, and NBR complianceSupport L/C documentation and banking-related transactionsAssist in inventory reconciliation and cost monitoringCoordinate with Operations, Procurement, Commercial, and HR teamsSupport internal and external audit requirementsEducational RequirementsBachelor of Business Administration (BBA) in AccountingBachelor of Business Administration (BBA)Bachelor of Commerce (Pass) in AccountingProfessional Certification / Training / OthersCA (CC) / ACCA (Part-qualified) will get preferenceTraining on VAT, Tax & NBR complianceCertification or training on Tally / ERP accounting softwareAdvanced MS Excel training (Financial Reporting, Pivot Table, MIS)Training on Banking & L/C operations will be an advantageKnowledge of IFRS standards will be preferredSkills Required: MS Office, Accounting, Accounting Software, Accounts and Finance, ERP Software, Tally Software, VAT and Tax, Tally ERP 9, MS ExcelExperience Requirements1 to 5 year(s)Job LocationDhaka (Gulshan, GULSHAN 2)",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370675994/",
    "job_id": "4370675994",
    "source": "linkedin",
    "company_name": "Combined Metal Industries",
    "job_title": "Senior Accountant",
    "location": "Vaughan, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Founded in Toronto, ON, Canada in 1996, Combined Metal Industries (CMI) has quickly grown into a successful full-service metal recycling corporation servicing a strong core customer base in Canada with a presence in all Ferrous and Non-Ferrous markets across North America. As a leading partner to the Canadian manufacturing industry, CMI is transforming the Canadian marketplace with best environmental and quality management practices in all our processes and facilities.CMI is looking for a driven and committed candidate who exhibits enthusiasm for performing accounting activities and can elevate the role to the next level by thinking out of the box and applying analytical and strategic thinking. This position will be integral to a passionate and dynamic team that values growth, innovation, and collaboration.Key Responsibilities:Responsible for the preparation of accurate and timely monthly financial statements and reporting package for CMI or Group Companies.Assist Controller in month end review of general ledger account reconciliations and ensure proper support is provided.Lead month end monitoring for completion of tasks and month end close meetings.Assist Controller to provide oversight and guidance to junior accounting team members by reviewing their work and ensuring accuracy and compliance with established standards.Support the Controller in establishing accounting processes and controls, such as account reconciliations and process documentation.Support a strong internal control environment to ensure that accounting activities are in accordance with accounting standards and legal, regulatory and company policies and procedures.Ensure all HST filings and tax installments are completed in accordance with the statutory requirements and conduct monthly HST internal review.Prepare Audit Schedules for the year end and support the audit process. Assist the Controller in the review of external audit reports and tax returns.Develop strong understanding of the financial systems towards becoming subject matter expert. Support Chart of Accounts.Identify and implement process improvements for the accounting function.Serve as the main point of contact in all matters related to CMI accountingAssist with payable and receivable tasks.Respond to tight deadlines during regular and peak periods and to last-minute demands and requirements.Provide year-end support.Additional tasks as requested.Qualifications:Bachelor’s degree in accounting and CPA designation.2 years of previous experience in Senior accountant role.Experience in the Manufacturing Industry is required.Experience in reviewing junior team member’s tasks.Excellent English communication skills (written and verbal).Advanced computer skills with Microsoft Excel.Customer service oriented, possess tact and judgment in dealing with complex and demanding customers.Ability to multi-task, organize, detail-oriented, and prioritize tasks.Strong judgment and decision-making ability.Possess analysis and problem-solving skills.Work Location: This position would be 5 days, In-Office.CMI is committed to providing reasonable accommodation for people with disabilities. If you require accommodation, we will work with you to meet your needs in all stages of the hiring process.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366378537/",
    "job_id": "4366378537",
    "source": "linkedin",
    "company_name": "Delasport",
    "job_title": "Global Procurement Director",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "About us:Delasport is where technology meets the excitement of sports and gaming! As a leading powerhouse in iGaming software, we provide everything from platform development to player account management. Our platform is designed to make every player feel like the star of the show, with personalized experiences and cutting-edge technology at its heart.Since our founding in 2010, we have won multiple international awards and have established a proven track record of excellence, stability, and overall success. This achievement only drives us to reach even greater heights.Currently, we are proud to have over 500 experts across various business fields and several offices in Bulgaria (Sofia and Plovdiv), Ukraine, and Malta.Your Role:The Global Procurement Director will be responsible for building and leading the Group’s procurement function, hands on, from the ground up. This role will define the global procurement strategy, establish processes and policies, and ensure efficient, transparent, and cost‑effective purchasing. The Director will work closely with internal stakeholders, negotiate key international supplier agreements, and oversee procurement for hardware, software, and other critical business services. This position is reporting directly to the Chief Financial Officer (CFO).Key ResponsibilitiesProcurement Strategy & Process DevelopmentDesign and implement a global procurement strategy aligned with Group goals.Build procurement processes, policies, and governance frameworks from scratch.Establish category management, vendor evaluation, and contract lifecycle standards.Implement tools, systems, and KPIs to ensure transparency and efficiency.Stakeholder CollaborationPartner with leaders across Finance, IT, Operations, Legal, and other departments to understand business needs and ensure alignment.Act as a trusted advisor to senior leadership on procurement best practices and cost‑optimization opportunities.Facilitate cross‑functional decision‑making and ensure smooth procurement workflows.Supplier & Contract ManagementLead negotiations for global (international) contracts covering hardware, software, SaaS, cloud services, and other technology‑related categories.Develop and maintain strong supplier relationships to ensure quality, reliability, and competitive pricing.Oversee the full contract lifecycle, including drafting, negotiation, execution, and renewal.Mitigate risks through effective vendor management and compliance oversight.Operational LeadershipDrive continuous improvement initiatives to enhance procurement efficiency and value creation.Ensure compliance with internal controls, financial policies, and regulatory requirements.Qualifications & ExperienceMinimum 10 years of procurement experience, with at least 5 years in a leadership role.Proven experience in an IT or technology‑driven company, ideally with global operations.Strong track record of setting up procurement processes from scratch.Deep expertise in IT procurement, including hardware, software, SaaS, and cloud services.Exceptional international negotiation and contract management skills.Fluent English (written and spoken).Strong analytical, strategic thinking, and stakeholder‑management capabilities.Ability to thrive in a fast‑paced, scaling environment.MS Office various toolsWhat We Offer to Make You Smile:We’re not just about work, we’re about perks, too! Here’s what’s in it for you:Competitive Salary Package: We value your expertise and hard work.Time Off: 20+ vacation days to relax and recharge.Perks & Vouchers: From celebrating birthdays to welcoming newborns, we’ve got you covered.Health & Wellness: Comprehensive health insurance and a Multisport card.Continuous Learning: Budget for courses, certifications, and self-development.Central Office Locations: Work in a fantastic pet friendly, accessible spot.Wait, there's more:Birthday Bash: Let’s celebrate YOU! Join our birthday parties to bring the team together and make everyone feel special!Multicultural Days: Explore flavors and traditions! Experience the vibrant cultures of your colleagues through food, music, and fun activities!Massages at the Office: Treat yourself! Enjoy on-site massages to melt away stress and tension right at your desk.Chess Lessons: Checkmate your boredom! Join our chess lessons to sharpen your mind and have fun with friends!Bulgarian for Foreigners Lessons: Level up your language skills! Our classes help you master Bulgarian for smoother communication!Ready to Be Part of Something Big? If you're excited to join a team that's revolutionizing the iGaming world and want to make a real impact, apply today. We can't wait to meet you!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366176240/",
    "job_id": "4366176240",
    "source": "linkedin",
    "company_name": "translate plus",
    "job_title": "Billing Manager",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "translate plus, an award-winning Top 10 international Language Services Provider, including, Top 3 in the EU and Top 2 in the UK, is a Publicis Groupe company, one of the most well-established advertising corporations globally. translate plus sits within the network’s cross-media production platform, Publicis Production. This brings together production specialists who are experts in: video, digital media, and print, to produce award-winning content for leading global brands.OverviewThe Finance Billing Manager will be managing day-to-day finance activities for global production clients, with a particular focus on new client onboarding and cross-market finance transitions. This role provides exposure to global clients, cross-market billing processes, and operational best practices, offering hands-on experience in complex, international finance operations.Key Responsibilities1. New Client Onboarding & TransitionsAssist in onboarding new global clients from a finance perspective, ensuring smooth setup in systems and processes.Support documentation and process handovers during client transitions.Coordinate with internal stakeholders (production hubs, local markets, account teams) to collect required finance information.Ensure compliance with global financial policies and procedures during transitions.2. Day-to-Day Finance OperationsAssist in managing POs, invoices, and billing processes for global production during client onboarding.Support global clients with tracking budgets, actual spend, and financial reporting processes.Help monitor outstanding invoices and resolve issues if agencies or markets encounter problems with client invoicing, ensuring processes are followed correctly.Communicate effectively with internal teams and client contacts regarding financial information.Support ad-hoc finance operations projects as required.Assist the CFO with all ad-hoc tasks, including coordination of transitions, and other operational priorities, ensuring smooth execution of global finance operations activities.Skills & ExperienceBachelor’s degree in Finance, Accounting, Business, or related field (or equivalent experience).7+ years’ experience in finance, operations, or accounting, preferably in marketing/production or agency environment.Proficiency in English.Strong numerical and analytical skills.Proficiency in Excel; familiarity with financial systems is a plus (SAP, or similar).Highly organized with strong attention to detail.Ability to work independently and as part of a global team.Excellent communication and stakeholder management skills.Personal AttributesProactive and eager to learn.Adaptable to a fast-paced, dynamic global environment.Curious and solution-oriented, with a collaborative mindset.Comfortable managing multiple priorities and deadlines.We offer the following:Hybrid working model for Sofia‑based employees and fully remote opportunities for colleagues outside SofiaFlexible working hoursAdditional health insurance (with dental plan)Service Recognition Plan, which means that every year at translate plus there are additional rewards for employees such as extra holidays, dental insurance, bonus payments, treats & vouchers, etc.Career development and progression possibilities. Access to worldwide job/gigs opportunities within the Publicis GroupeHigh quality trainings (via in-house and external trainers) and access to thousands of on-line/e-learning courses to develop essential, functional, and industry skills (via Publicis Marcel, LinkedIn Learning, etc.)Work your world – As part of the Publicis Groupe policy, up to 6 weeks of working from a different country after a year of employment.Café Marcel- Networking opportunities with fellow colleagues in the Publicis Groupe all around the worldtranslate plus is an equal opportunities employer and welcomes applications from all sections of society and do not discriminate on grounds of race, religion, or belief, ethnic or national origin, disability, age citizenship, marital, domestic, or civil partnership status, sexual orientation, or gender identity.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370306971/",
    "job_id": "4370306971",
    "source": "linkedin",
    "company_name": "wherewework Bulgaria",
    "job_title": "Administrative Assistant",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "wherewework.bg on behalf of:Employers from SofiaInterested in this role? You’re in the right place.To move forward, simply upload your CV to wherewework, and we’ll help connect you with real job openings from real companies, including the position you’re viewing right now.Here’s how it works: Upload your CV onceYou can do it instantly by clicking the \"Apply\" button in this window. It only takes a moment, and it allows us to match your profile with relevant opportunities. We match you with real roles that fit your experienceWhen companies open positions aligned with your skills, we’ll identify the best opportunities for you. You stay fully in controlBefore your CV is ever shared, we’ll notify you with the exact job title and company name, and ask for your confirmation. Only confirmed applications are sent to employersOnce you approve, the employer will receive your application and may contact you directly to continue the hiring process.While you're here, explore wherewework to discover what it’s really like to work at different companies, through interview experiences, employee reviews, and community feedback.Thanks for being part of wherewework!",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4372535866/",
    "job_id": "4372535866",
    "source": "linkedin",
    "company_name": "Barreau du Québec",
    "job_title": "Adjoint/Adjointe à la formation professionnelle",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Au Barreau du Québec, on met tout en place pour faciliter la recherche d’un juste équilibre chez nos talents. Que ce soit entre vie personnelle et professionnelle, entre mission et passion, entre nouveaux défis et paix d’esprit. Travailler au Barreau du Québec, c’est évoluer dans un environnement sain tout en contribuant à la mission de protection du public du Barreau : Conciliation travail-vie personnelleTravail hybrideAvantages sociaux compétitifs Trouvez votre juste équilibre. Postulez et rejoignez une équipe humaine, dynamique et engagée. Envie de rejoindre une équipe chaleureuse et dynamique ? D’intégrer une organisation qui a votre bien-être à coeur ? Rejoignez-nous !Le Barreau du Québec cherche son futur adjoint ou sa future adjointe à la formation professionnelle pour un (1) poste temporaire non syndiqué (estimé à (1) un an)Horaire de travail :33.75 heures/semaineLieu de travail :Centre de QuébecDate d’entrée en poste :Dès que possibleÉchelle salariale annuelle :De 42 654 $ à 60 935 $L’École du Barreau est la première institution d’enseignement postuniversitaire en Amérique du Nord qui se porte garante de la préparation et de l’insertion professionnelle des jeunes avocats dans une perspective de protection du public. Pour ce faire, l’École du Barreau assure la formation professionnelle des futurs avocats en vue de les préparer aux premières années de la pratique et à l’obtention du permis d’exercice.Agissant au sein d’une équipe polyvalente, l’adjoint ou l’adjointe à la formation professionnelle s’occupe principalement des tâches administratives et opérationnelles du Centre de formation professionnelle. Il ou elle assure le service à la clientèle auprès des étudiants et étudiantes, des professionnels enseignants et professionnelles enseignantes, des surveillants et surveillantes et des clients et clientes de la Clinique juridique. Il ou elle assiste le superviseur ou la superviseure du Centre dans ses fonctions. Au besoin, il ou elle assure la réception de l’École et de la Clinique juridique.QUEL SERA VOTRE RÔLE?Dans le cadre de vos fonctions, vous effectuerez les tâches et responsabilités suivantes :Assurer le service à la clientèle, le support administratif, la logistique et l’ensemble des suivis nécessaires auprès des étudiants et étudiantes du Centre de formation professionnelle, et ce, dès la période d’admission et d’inscription jusqu’à la fin du programme, y compris la tenue des cours, des examens, de l’évaluation continue en apprentissage expérientiel ainsi que des cliniques juridiques et techniques;Effectuer diverses tâches liées aux plateformes d’apprentissage et de gestion des dossiers, dont le suivi des dossiers des étudiants et étudiantes et le soutien technique auprès des étudiants et étudiantes et des professionnels enseignants et professionnelles enseignantes;Assister le superviseur ou la superviseure du Centre de formation professionnelle dans ses fonctions, notamment au niveau des tâches de secrétariat et de la préparation, du bon déroulement, de la tenue ainsi que des suivis des examens et des évaluations des étudiants et étudiantes, de même qu’en ce qui a trait aux aspects logistiques et cléricaux liés à l’embauche des professionnels enseignants et professionnelles enseignantes;Assurer le service à la clientèle, le support administratif, la logistique et l’ensemble des suivis nécessaires auprès des professionnels enseignants et professionnelles enseignantes ainsi que des surveillants et surveillantes, quant à toutes les activités du programme de formation professionnelle;Assurer le support administratif et le service à la clientèle de la Clinique juridique au niveau local;Recevoir divers paiements et émettre des reçus;Procéder aux réquisitions de paiement, produire les relevés de temps, les compilations et les transferts à la comptabilité pour le paiement des honoraires des professionnels enseignants et professionnelles enseignantes et surveillants et surveillantes;En rotation avec les autres employés et employées du Centre de formation professionnelle, assurer la réception du Centre de formation professionnelle de l’École et de la Clinique juridique;Voir à la bonne organisation matérielle des lieux (suffisance du matériel et commandes nécessaires, bon fonctionnement des équipements, disponibilité des locaux, etc.);Collaborer au bon déroulement de l’ensemble des opérations du Centre de formation professionnelle en assurant notamment le suivi des tâches des autres membres de l’équipe en leur absence;Effectuer toute autre tâche demandée par ses supérieurs ou supérieures.QUALIFICATIONS REQUISESCe poste est fait pour vous si : Vous possédez :Un diplôme d’études collégiales;Deux (2) années d’expérience pertinente.Vous êtes reconnu ou reconnue pour :Votre habileté au travail d’équipeVotre communication interpersonnelle et votre service à la clientèleVotre gestion du stressVotre flexibilitéVotre organisation et votre gestion des prioritésVotre rigueurVotre maîtrise intermédiaire de la",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368298513/",
    "job_id": "4368298513",
    "source": "linkedin",
    "company_name": "Grupo Puntacana",
    "job_title": "Ingeniero Supervisor Senior",
    "location": "La Altagracia, Dominican Republic",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Misión del Puesto:Supervisar la planificación, calidad, tiempo y costo de los proyectos asignados por la Dirección de Ingeniería, para las obras civiles, viales hidráulicas, sanitarias y del litoral marino de acuerdo a las normas generales de construcción.Responsabilidades:Planificar la ejecución de los proyectos antes y durante su ejecución.Supervisar la obra continuamente manteniendo el contacto con el contratista, apoyando y tomando decisiones en consenso con los Ingenieros Supervisores Junior, Eléctrico e Hidrosanitario, para mantener el control de los trabajos realizados por los contratistas.Asegurar el cumplimiento en calidad, tiempo y costo de los proyectos, verificando que la construcción cumpla con los estándares establecidos y lo acordado con el cliente.Documentar la información, redactando informes de las actividades realizadas por los contratistas en la obra, manteniendo un registro de los acontecimientos ocurridos durante su ejecución.Cuantificar los volúmenes ejecutados por los contratistas para el control de los pagos de los proyectos.Implementar nuevas formas de fiscalización de las obras para mejoras en las mediciones.Implementar mejores prácticas en cuanto a los trabajos marinos, para el acondicionamiento de las playas. Perfil Técnico:Ingeniero CivilExperiencia mínima de 3 años en el puesto.Dominio Avanzado de Officce.Disponibilidad para residir en Punta Cana.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363202120/",
    "job_id": "4363202120",
    "source": "linkedin",
    "company_name": "Quintas Capital",
    "job_title": "Investment Associate / Investment Manager – EIIS",
    "location": "Dublin, County Dublin, Ireland",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4377030247/",
    "job_id": "4377030247",
    "source": "linkedin",
    "company_name": "Russell Tobin",
    "job_title": "Business Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Job Title: Business Analyst - AI Product Roadmap & Service StrategyDuration: 12 MonthsPay Rate: CAD$75/Hr - CAD$85/HrRole OverviewSeeking a senior Business Analyst with a strong AI and technical background to support the development and execution of an enterprise AI product roadmap and service strategy. The role focuses on translating strategic AI initiatives into clear, actionable business requirements, service improvements, and measurable outcomes while ensuring compliance, governance, and operational readiness.Key Responsibilities1. Business Analysis & Requirements ManagementLead end-to-end business analysis for complex, multi-stakeholder initiatives.Elicit, analyze, validate, and prioritize requirements for AI use cases (e.g., search/RAG, document extraction, anomaly detection, virtual assistants).Define current and future state processes and assess impacts to policy, privacy, governance, and operations.Produce BRDs, user stories, process maps, acceptance criteria, and traceability matrices in Agile or hybrid environments.2. AI, Data & Cloud AlignmentTranslate AI product roadmaps and operating models into structured business and service requirements.Support AI solutions within cloud environments (IaaS, PaaS, SaaS).Identify AI-specific considerations including data quality, model lifecycle, explainability, risk, security, privacy, cost, and reliability.3. Service Design & DocumentationDevelop and maintain service definitions, onboarding guides, and operational runbooks.Map end-to-end service delivery flows including intake, review, approval, deployment, and support.Define KPIs, OKRs, and benefit metrics (adoption, efficiency, cost, reliability, accuracy).4. Stakeholder Engagement & Change ManagementFacilitate workshops and cross-functional sessions to gather requirements and drive alignment.Prepare decision briefs, options analysis, and governance materials for leadership review.Support organizational change, communication, and AI literacy initiatives.Required ExperienceProven experience leading full lifecycle business analysis activities.Strong understanding of AI-enabled services, governance, and cloud-based architectures.Experience translating strategic roadmaps into executable requirements and measurable outcomes.Ability to collaborate with technical, business, security, and governance stakeholders.If this opportunity matches your experience and career goals, please share your most updated resume for consideration.As a certified minority-owned business, Pride Global and its affiliates - including Russell Tobin, Pride Health, and Pride Now - are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics.Russell Tobin is a leading minority-owned professional and technical recruitment and staffing advisory organization. We are comprised of specialized practices focusing on a variety of skill sets and industries. Having a depth and breadth of industry expertise, our subject matter experts are able to provide tailored and swift sourcing solutions to fulfill client hiring needs. In other words, we connect top talent with companies. We are the staffing arm of the Pride Global network, a minority-owned integrated human capital solutions firm, with additional offerings in vendor management, payroll programs, and business process optimization.#RTA",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3522834589/",
    "job_id": "3522834589",
    "source": "linkedin",
    "company_name": "Electronics in Dhaka ...",
    "job_title": "Daraz hiring Senior Key Account Executive",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3926635947/",
    "job_id": "3926635947",
    "source": "linkedin",
    "company_name": "BRAC International",
    "job_title": "Financial Analyst",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]