[
  {
    "url": "https://www.linkedin.com/jobs/view/4336838869/",
    "job_id": "4336838869",
    "source": "linkedin",
    "company_name": "Lesaffre",
    "job_title": "Senior Payable Accountant",
    "location": "Qesm El Sheikh Zaid, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355680332/",
    "job_id": "4355680332",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Sr. Officer to Assistant Manager - SME (Dhaka City) - For Alliance Finance PLC - Job ID: 1452670",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357446903/",
    "job_id": "4357446903",
    "source": "linkedin",
    "company_name": "BRAC",
    "job_title": "Assistant General Manager/ Deputy General Manager, Finance and Accounts (BRAC Enterprises)",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360522999/",
    "job_id": "4360522999",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Branch Manager - For Islamic Finance and Investment PLC. - Job ID: 1456551",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362040614/",
    "job_id": "4362040614",
    "source": "linkedin",
    "company_name": "FairMoney",
    "job_title": "Finance Manager",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356057895/",
    "job_id": "4356057895",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive/ Sr Executive (Accounts & Audit Dept.) (For Lubnan Trade Consortium Limited) - Job ID: 1454481",
    "location": "Gulshan, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Lubnan Trade Consortium Limited is looking for Executive/ Sr Executive (Accounts & Audit Dept.)Job Description / ResponsibilityMaintain daily banking operations, including cash/bank book management and bank reconciliation.Verify and check sales transactions, invoices, collections, and supporting documents.Prepare and review various reconciliations (bank, sales, inventory, ledger, inter-company, etc.).Ensure compliance with company policies, internal control systems, and statutory requirements.Assist in internal audit activities, including process review, documentation, and follow-up of findings.Identify, monitor, and report control weaknesses, irregularities, and potential fraud risks.Prepare periodic reports and provide support to management as required.Educational RequirementsMaster of Business Administration (MBA) in AccountingSkills Required: Tally Software, Microsoft Office, Microsoft Excel, FLUENCY IN ENGLISH LANGUAGEExperience Requirements2 to 3 year(s)The applicants should have experience in the following business area(s): Retail Store,Garments,Buying House,Boutique/ FashionSalaryTk. 20000 - 25000 (Monthly) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4329149526/",
    "job_id": "4329149526",
    "source": "linkedin",
    "company_name": "Al Sahraa Group",
    "job_title": "ACCOUNT MANAGER",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342180065/",
    "job_id": "4342180065",
    "source": "linkedin",
    "company_name": "Bayut Egypt",
    "job_title": "Sales Account Manager- Sheikh Zayed",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353480180/",
    "job_id": "4353480180",
    "source": "linkedin",
    "company_name": "Loynova",
    "job_title": "Account Supervisor",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359546756/",
    "job_id": "4359546756",
    "source": "linkedin",
    "company_name": "Daftra - دفترة",
    "job_title": "Senior General Accountant",
    "location": "Giza, Al Jizah, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359154564/",
    "job_id": "4359154564",
    "source": "linkedin",
    "company_name": "Vancity",
    "job_title": "Director, Treasury Risk Management",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354042039/",
    "job_id": "4354042039",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Corporate Sales Manager (For Shanta Life Insurance PLC)-Job ID: 1451509",
    "location": "Tejgaon Thana, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355906116/",
    "job_id": "4355906116",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Head of Branch - For Southeast Bank PLC - Job ID: 1453981",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4285843288/",
    "job_id": "4285843288",
    "source": "linkedin",
    "company_name": "Tasaheel تساهيل",
    "job_title": "SMEs Team Leader- El Obour",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4285836601/",
    "job_id": "4285836601",
    "source": "linkedin",
    "company_name": "Tasaheel تساهيل",
    "job_title": "SMEs Team Leader- Kafr ElShekh",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About UsTasaheel is one of Egypt’s leading microfinance institutions, committed to empowering individuals and communities through accessible and responsible financial solutions. Since our establishment, we have played a pivotal role in expanding financial inclusion by offering tailored lending products that support small to medium-sized businesses across the country.Driven by a mission to unlock economic opportunities for underserved populations, Tasaheel provides fast, reliable, and transparent financing options that enable entrepreneurs—particularly women and youth—to grow their businesses, improve their livelihoods, and contribute to sustainable local development.With a wide network of branches spanning urban and rural Egypt, we combine deep market knowledge with cutting-edge technology to deliver high-impact services with efficiency and care. Our team is dedicated to building long-term relationships with our clients based on trust, accountability, and mutual growth.OverviewThe SMEs Team Leader will be responsible for managing and expanding a portfolio of SME clients while leading and developing a team of SME officers. The role focuses on meeting clients’ financial needs—including deposits, transactions, trade finance, and borrowing—while ensuring strong customer relationships, portfolio growth, and high team performance.What You’ll DoLead, supervise, and mentor a team of SME officers to achieve business objectives.Set clear performance targets for the team and ensure consistent achievement.Support team members with training, coaching, and guidance to enhance skills and productivity.Manage and grow a portfolio of SME customers while ensuring high levels of client satisfaction and retention.Build strong relationships with decision-makers within client organizations.Handle escalated client concerns and ensure timely, professional resolution.Identify and execute cross-selling and upselling opportunities across financial products.Drive client acquisition strategies to expand the SME portfolio.Ensure team compliance with customer service standards, policies, and procedures.Monitor market trends and competitor activities to identify growth opportunities.Collaborate with internal departments to ensure efficient and seamless customer service delivery.What Makes You a Good FitMinimum 3 years of experience in banking with a focus on SME banking.Proven team leadership/people management experience.Successful completion of a credit course (mandatory).Strong leadership, communication, and negotiation skills.Demonstrated success in portfolio growth and client relationship management.Ability to motivate and guide a team toward achieving ambitious targets.Excellent problem-solving and decision-making skills.At Tasaheel, we believe that access to finance is not just a service—it’s a catalyst for transformation. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353854702/",
    "job_id": "4353854702",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive, Admin Department (For NAC No Chinta Home Healthcare Ltd.)-Job ID: 1451207",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353454291/",
    "job_id": "4353454291",
    "source": "linkedin",
    "company_name": "Nabat",
    "job_title": "Business Operations Specialist",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Nabat is a climate-tech startup based in the UAE using advanced technology to protect and restore natural ecosystems with precision and scale! We operate at the intersection of ecological & environmental sciences, GIS, AI, and robotics. Our mission is to enable data-driven, science-backed ecosystem management and restoration at the speed and scale necessary to address the critical challenges of climate change, deforestation, land erosion, and biodiversity loss. Our comprehensive solution - consisting of ecosystem management software, precision aerial seeding drones, AI & ecological models, and restoration services - is already being used to plant millions of mangroves in the UAE. But we’re just getting started, as we build our platform to serve the needs of coastal, marine and arid ecosystems around the world.If this mission resonates with you, let’s talk!The Business Operations Specialist plays a central role in supporting Nabat’s day-to-day operations. This hybrid position combines contracts and procurement administration, office management, and financial coordination support, ensuring smooth internal processes, strong vendor relationships, and well-run office operations.This role is hands-on, highly collaborative, and suited to someone who enjoys bringing structure, follow-up, and clarity across multiple operational areas. Key ResponsibilitiesContracts & Agreement Management Prepare, review, and coordinate contracts, NDAs, and service agreements with suppliers, clients, and partners.Ensure contracts are complete, compliant, and aligned with internal standards.Coordinate with Legal on terms, approvals, and final execution.Maintain contract records, renewals, amendments, and documentation tracking. Procurement Administration Create and process Purchase Requisitions (PRs) and coordinate Purchase Orders (POs).Support supplier onboarding and registration in SAP or equivalent systems.Register Nabat as a supplier in customer procurement portals and ensure required documentation is accurately submitted and maintained.Collect quotations, ensure approval workflows, and maintain procurement documentation.Liaise with vendors on deliveries, timelines, and order-related queries.Invoicing & Payment Coordination Receive, review, and organize supplier invoices.Validate invoices against POs and contracts before submission for approval.Prepare Goods Receipt Notes (GRNs) where required.Track invoice status and follow up with suppliers and internal stakeholders to ensure timely payment.Financial & Administrative Coordination Consolidate invoices and supporting documentation to support monthly and quarterly financial close.Maintain invoice trackers and provide operational inputs to the Finance team.Follow up on missing or incorrect documentation with vendors and internal teams.Coordinate with internal Finance and/or external accountants on required operational documentation.Support audits, reviews, and internal control activities by providing accurate records and reports. Office Management & Facilities Coordination Act as the main point of contact for daily office operations.Manage office supplies, equipment, and inventory.Coordinate with external vendors (cleaning, maintenance, IT support, security, etc.).Ensure office readiness, safety, and smooth day-to-day functioning.Support onboarding logistics in collaboration with HR. General Administrative & Business Support Support meeting logistics, calendar coordination, travel arrangements, and visitor hosting.Assist teams with operational and office-related requests as needed.Provide support across additional operational, compliance, or process-related activities as required by the business. Minimum Qualifications Bachelor’s degree in Business Administration, Operations, Supply Chain, Finance, or a related field.At least 7 years of experience in contracts administration, procurement operations, office management, or similar operational roles.Proficiency in Microsoft Office and SAP Strong experience coordinating vendors, documentation, and internal approvals.Comfortable working with PR/PO processes and invoice coordination.Highly organized, detail-oriented, and proactive.Strong communication and stakeholder management skills.Why join Nabat?A once-in-a-lifetime opportunity to:Join a well-funded early-stage tech startup at the intersection of some of the most exciting, disruptive and innovative technologies in the world - geospatial AI, remote sensing, drone robotics, ecology & agricultural science.Relocate to Abu Dhabi – one of the safest, most livable, expat-friendly cities in the world - with an “all inclusive” relocation package for you and your family, that includes work & residence visa sponsorship, business class flights, orientation tour, school and house search, and luxury hotel stay until you find your new home.Make a real and direct impact to solving the most critical challenges of our time – climate change and ecosystem loss.Build partnerships that matter!What is the hi",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366791858/",
    "job_id": "4366791858",
    "source": "linkedin",
    "company_name": "Inside Higher Ed",
    "job_title": "On-Call Administrative Assistant",
    "location": "Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Georgetown University in Qatar (GU-Q) is dedicated to fulfilling Georgetown University's mission of promoting intellectual, ethical and spiritual understanding through serious and sustained discourse among people of different faiths, cultures, and beliefs. Embodying this spirit of the University, Georgetown's Qatar campus undertakes education, research, and service in order to advance knowledge and provide students and the community with a holistic educational experience that produces global citizens committed to the service of humankind. We demonstrate the values of Georgetown University; seek to build upon the world-class reputation of the Edmund A. Walsh School of Foreign Service; and work with our partner, Qatar Foundation, in its endeavors to achieve the Qatar National Vision 2030.RequirementsGU-Q is seeking On-call Administrative Assistants to join our pool. The assistants will support a variety of administrative tasks across multiple departments on an as-needed basis. This part-time role offers flexibility and provides valuable exposure to a wide range of tasks and departments within the organization.Work will be available primarily during standard business hours (8:00 a.m. - 5:00 p.m.), and on-call employees will receive advance notice when their services are needed. The anticipated start date is in February.As this position is based in Doha, Qatar and offers no relocation assistance, GU-Q is looking for locally based candidates only. This is a part-time (up to 20 hours per week), non-sponsored position that requires all applicants to already have the necessary sponsorship to live and work in Qatar. Interested candidates should submit a CV and indicate the hours for which they are available in their application.Key AccountabilitiesThe list below describes the general nature of the responsibilities that may be assigned during employment but it is not exhaustive. Tasks may vary depending on the assignment.Provide flexible and responsive assistance across various functions within the organization during peak periods, staffing gaps, or special projects, including managing incoming communications, maintaining organized filing systems, and assisting with scheduling appointments and meetings for team members.Perform data entry, manage databases or spreadsheets, and assist with travel arrangements as needed.Coordinate logistics for internal and external events and prepare meeting agendas, minutes, and materials.Address and resolve general administrative issues promptly and effectively, collaborating with team members to find solutions to challenges and understanding specific support needs of various departments within the organization.Key ActivitiesManage incoming communications, including phone calls, emails, and other messages.Assist in maintaining organized filing systems, both electronic and physical.Perform data entry and manage databases or spreadsheets as needed.Schedule appointments, meetings, and conference calls for team members.Assist with travel arrangements and create detailed itineraries when required.Coordinate logistics for internal and external events.Assist with Human Resources activities.Prepare meeting agendas, take minutes, and distribute materials.Address and resolve general administrative issues promptly and effectively.Collaborate with team members to find solutions to challenges.Collaborate with various departments to understand specific support needs.Other similar duties as assigned.Knowledge And SkillsExcellent written and verbal communication skills.Proficiency with Microsoft Office Suite and other relevant software.Strong organizational abilities.Attention to detail and accuracy in completing tasks.Ability to maintain confidentiality and handle sensitive information.Capacity to adjust to varying work hours based on organizational requirements.QualificationsBachelor degree or equivalent combination of education and work experience.ExperiencePrior relevant work experience in higher education or non-profit organizations is preferred.Current Georgetown EmployeesIf you currently work at Georgetown University, please exit this website and login to GMS (gms.georgetown.edu) using your Net ID and password. Then select the Career worklet on your GMS Home dashboard to view Jobs at Georgetown.Submission GuidelinesPlease note that in order to be considered an applicant for any position at Georgetown University in Qatar, you must submit a resume/CV for each position of interest. Documents are not kept on file for future positions.Need AssistanceNeed some assistance with the application process? Contact us at guqhr@georgetown.edu.EEO StatementGU is an Equal Opportunity Employer. All qualified applicants are encouraged to apply, and will receive consideration for employment without regard to age, citizenship, color, disability, family responsibilities, gender identity and expression, genetic information, marital status, matriculation, national origin, race, religion, personal appearance, politi",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355752981/",
    "job_id": "4355752981",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager- Revenue Assurance/ Credit Recovery - For ABC Corporation - Job ID: 1453234",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4288903791/",
    "job_id": "4288903791",
    "source": "linkedin",
    "company_name": "SSC HR Solutions",
    "job_title": "HSE Administrator (Corporate)",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354867783/",
    "job_id": "4354867783",
    "source": "linkedin",
    "company_name": "Emirates NBD",
    "job_title": "Cyber Risk Manager",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359862234/",
    "job_id": "4359862234",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Officer, MIS - For Grameen Telecom Trust - Job ID: 1456385",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369994647/",
    "job_id": "4369994647",
    "source": "linkedin",
    "company_name": "TALENTMATE",
    "job_title": "Finance and Administration Officer 07F25",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369431447/",
    "job_id": "4369431447",
    "source": "linkedin",
    "company_name": "Yatas Grup",
    "job_title": "Finans Yöneticisi",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364241126/",
    "job_id": "4364241126",
    "source": "linkedin",
    "company_name": "Bajaj General Insurance",
    "job_title": "Executive-Execution",
    "location": "Patna, Bihar, India",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Drafting and pleading skills will be considered as added advantage.The candidate should be conversant with mail culture and must know basic computer knowledge like Excel, word, Power point etc., with typing speedKnowledge on Motor vehicle act or exposure in MV act will be considered as added advantage.Tracking of each Matter from Claims DairyCo-ordination with other department of mandatory requirements - ILM, Operation, Underwriting etc. Smooth Processing of Claim Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368200709/",
    "job_id": "4368200709",
    "source": "linkedin",
    "company_name": "Recruitment Matters Africa (Pvt) Ltd",
    "job_title": "Technical Administrator",
    "location": "City of Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369989961/",
    "job_id": "4369989961",
    "source": "linkedin",
    "company_name": "TALENTMATE",
    "job_title": "Accountant 07F25",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368221025/",
    "job_id": "4368221025",
    "source": "linkedin",
    "company_name": "Office Beacon South Africa",
    "job_title": "Staff Accountant",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366149601/",
    "job_id": "4366149601",
    "source": "linkedin",
    "company_name": "Vouch SA",
    "job_title": "Junior Accountant ( Vouch SA )",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355291086/",
    "job_id": "4355291086",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Officer - Internal Audit (For Lyric Industries (Pvt) Ltd.) - Job ID - 1452076",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363865240/",
    "job_id": "4363865240",
    "source": "linkedin",
    "company_name": "CNM LLP",
    "job_title": "Senior Associate - Internal Audit",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366319087/",
    "job_id": "4366319087",
    "source": "linkedin",
    "company_name": "ATALIAN GLOBAL SERVICES TÜRKİYE",
    "job_title": "Eğitim Denetim Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363554499/",
    "job_id": "4363554499",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Audit Associate",
    "location": "Taman Wilayah, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353112662/",
    "job_id": "4353112662",
    "source": "linkedin",
    "company_name": "Charles & Darwish Associates",
    "job_title": "Accounting Manager",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369630385/",
    "job_id": "4369630385",
    "source": "linkedin",
    "company_name": "UNICEF",
    "job_title": "Education Officer, (NO-2), Temporary Appointment (364 days), Chittagong, Bangladesh #134679 (Open to Bangladeshi Nationals only)",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360583825/",
    "job_id": "4360583825",
    "source": "linkedin",
    "company_name": "Unicef CHAD",
    "job_title": "Education Officer, (NO-2), Temporary Appointment (364 days), Chittagong, Bangladesh #134679 (Open to Bangladeshi Nationals only)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Apply now Job no: 590838Contract type: Temporary AppointmentLevel: NO-2Location: BangladeshCategories: EducationUNICEF works in over 190 countries and territories to save children’s lives, defend their rights, and help them fulfill their potential, from early childhood through adolescence.At UNICEF, we are committed, passionate, and proud of what we do for as long as we are needed. Promoting the rights of every child is not just a job – it is a calling.UNICEF is a place where careers are built: we offer our staff diverse opportunities for professional and personal development that will help them reinforce a sense of purpose while serving children and communities across the world. We welcome everyone who wants to belong and grow in a diverse and passionate culture, coupled with an attractive compensation and benefits package.Visit our website to learn more about what we do at UNICEF.For every child, the right to education,The fundamental mission of UNICEF is to promote the rights of every child, everywhere, in everything the Organization does — in programmes, in advocacy and in operations. The equity strategy, emphasizing the most disadvantaged and excluded children and families, translates this commitment to children’s rights into action. For UNICEF, equity means that all children have an opportunity to survive, develop and reach their full potential, without discrimination, bias or favoritism. To the degree that any child has an unequal chance in life — in its social, political, economic, civic and cultural dimensions — her or his rights are violated. There is growing evidence that investing in the health, education and protection of a society’s most disadvantaged citizens — addressing inequity — not only will give more children the opportunity to fulfill their potential but also will lead to sustained growth and stability of countries. This is why the focus on equity is so vital. It accelerates progress towards realizing the human rights of all children, which is the universal mandate of UNICEF, as outlined by the Convention on the Rights of the Child, while also supporting the equitable development of nations.How can you make a difference?Purpose Of The JobUnder the supervision of the Chief, Field Office and technical guidance of Chief of Education/Education Manager, the Education Officer (NOB) provides technical, operational, and coordination support to the planning, implementation, monitoring, and reporting of UNICEF-supported education programmes and projects in collaboration with government counterparts and implementing partners. The position will contribute to evidence-based programme development, quality implementation and results-based management to improve equitable access to quality education and skills for children and adolescents. The assignment focuses on strengthening national and sub-national capacity for programme delivery through situation analysis, data collection and analysis, implementation, field monitoring, and support to programme reviews and evaluations. The Education Officer will support effective implementation of education policies and programmes (including projects) by providing technical assistance, operational follow-up, and coordination with government institutions, UN agencies, civil society organizations, and development partners. The officer will further provide coordination support in education sector’s implementation research and evidence generation in partnership with UNICEF Innocenti, ensuring high-quality data collection and compliance with research protocols.This role will also support partnership management, resource tracking, compliance with UNICEF policies and accountability requirements, and contribute to innovation, knowledge management, and capacity-building initiatives. Through inter-sectoral collaboration and promotion of good practices, the Education Officer (NOB) will help ensure that education programmes and projects (i.e., EMDC, EQUIP-B, GPE, CPB, GPECM, etc.) are implemented efficiently, equitably, and sustainably, particularly for the most vulnerable children and adolescents.Summary Of The Key Functions/accountabilitiesSupport to Programme Development and Planning.Programme Management, Monitoring and Delivery of Results.Technical and Operational Support to Programme Implementation.Networking and Partnership Building.Innovation, Knowledge Management and Capacity Building.If you would like to know more about this position, please review the complete Job Description here: TOR_ Education Officer NOB-TA Field Office_31Jan 2026.pdfTo qualify as an advocate for every child you will have…EducationMinimum requirements:A university degree in one of the following fields is required: education, social sciences, development studies, or other relevant technical fields.Work ExperienceA minimum of two years of professional experience in planning and managing education program implementation in collaboration with government agency is required.General understanding of t",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368318206/",
    "job_id": "4368318206",
    "source": "linkedin",
    "company_name": "SSL Wireless",
    "job_title": "Business Analyst",
    "location": "Dhaka, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365798435/",
    "job_id": "4365798435",
    "source": "linkedin",
    "company_name": "Binghatti",
    "job_title": "Business Analyst",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Join Binghatti – Redefining Real Estate Excellence in DubaiAbout UsBinghatti is one of the UAE’s most dynamic and fast-growing property brands, headquartered in Dubai. We’re known for bold architecture, visionary design and partnerships with global luxury icons such as Bugatti, Mercedes-Benz and Jacob & Co. With a portfolio exceeding AED 15 billion across Dubai’s most prestigious developments, Binghatti continues to transform the city’s skyline and set new standards for innovation and excellence in real estate.About the roleThe Business Analyst is responsible for developing, maintaining, and governing functional and technical documentation supporting the enterprise HRMS implementation. The role ensures system designs, business requirements, operating procedures, and knowledge assets are accurate, structured, and audit-ready, working closely with HR stakeholders, HRMS product owners, and implementation partners, the role supports requirements clarification, and post–go-live stabilization while ensuring alignment with business needs and governance standards.Key ResponsibilitiesDocumentation & Solution DesignDevelop, maintain, and govern HRMS High-Level Design (HLD) and Low-Level Design (LLD) documentation.Prepare Functional Requirement Documents (FRDs), solution design documents, and requirements traceability matrices.Document end-to-end HRMS processes covering Core HR, Attendance, Leave, Payroll, Recruitment, Onboarding, Employee Self-Service (ESS), and Performance Management.Document system workflows, approval hierarchies, business rules, validations, integrations, and automation logic.Process & Operational DocumentationDevelop Standard Operating Procedures (SOPs) for HR operations and IT support teams.Maintain documentation governance, version control, and centralized repositories in accordance with IMS and organizational standards.Prepare release notes, change logs, and system knowledge assets to support system updates and enhancements.Testing & Go-Live SupportPrepare User Acceptance Testing (UAT) scenarios, test cases, acceptance criteria, and UAT sign-off documentation.Support business users during UAT and go-live through documentation support, requirement clarifications, and defect analysis.Assist with post–go-live documentation updates and system stabilization activities.Training & Knowledge EnablementDevelop end-user manuals, administrator guides, and quick reference materials.Prepare training presentations, troubleshooting guides, and knowledge base articles to support user adoption.Other Tasks and Accountabilities Perform additional tasks relevant to the role / area of expertise as requested by the management to be able to achieve the objectives/commitments. Ensure compliance with all relevant health, safety, quality and environmental management procedures and controls to guarantee employee safety, legislative compliance, delivery of high-quality products/services and a responsible environmental attitude as per IMS available standards.Work ContactInternal Stakeholder:HR Leadership and HR OperationsHRMS Product OwnersHRMS SpecialistsIT Infrastructure and Applications TeamsPosition RequirementsEducation, Experience & Professional Certifications:Education: Bachelor’s degree in Information Systems, Computer Science, Human Resources, Business Administration, or related fields.Experience: 2 years of experience in enterprise system documentation or business analysis.Professional Certification: Certification in Business Analysis, Documentation, Process Management is a plus.Why Work for UsAt Binghatti, we don’t just build properties – we build legacies. You’ll join a team driven by ambition, creativity and excellence, where ideas move fast and every project makes a statement. Here, you’ll work alongside some of the brightest minds in real estate, contributing to iconic developments that define Dubai’s future. If you’re ready to be part of a company that’s shaping history, Binghatti is where your story begins. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359056056/",
    "job_id": "4359056056",
    "source": "linkedin",
    "company_name": "VISEO",
    "job_title": "Business Analyst - Stablecoin Web3",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About the RoleWe are seeking an experienced Business Analyst to lead a proof-of-concept (POC) and project delivery initiative with a major financial institution in Malaysia, focused on stablecoin integration and web3 infrastructure. This role requires a unique blend of traditional financial services knowledge, blockchain expertise, and the ability to bridge technical and business stakeholders in a regulated environment.Key ResponsibilitiesLead the end-to-end delivery of a stablecoin project with a major Malaysian financial institution, from requirements gathering through implementation and evaluationDefine project scope, objectives, success metrics, and deliverables in collaboration with stakeholdersDevelop and maintain project documentation including business requirements, functional specifications, user stories, and process flowsCoordinate with cross-functional teams including blockchain developers, compliance officers, legal advisors, and banking operations personnelAnalyze current banking processes and identify opportunities for web3 integration and optimizationTranslate complex blockchain concepts into clear business terms for non-technical stakeholdersDocument compliance considerations and risk mitigation strategies for stablecoin operationsRequired Qualifications5+ years of business analysis experience, with at least 2 years in blockchain, cryptocurrency, or web3 projectsProven track record of leading pilot projects with financial institutions or enterprise clientsStrong understanding of stablecoins, blockchain technology, smart contracts, and decentralized finance conceptsSolid understanding of blockchain architecture, consensus mechanisms, and cryptocurrency walletsFamiliarity with Ethereum and other major blockchain platforms used for stablecoinsUnderstanding of APIs, integration patterns, and financial messaging standards (SWIFT, ISO 20022)Experience with data modeling, system design, and technical documentationCompetitive compensation packageProfessional development opportunities in blockchain and fintech Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327866278/",
    "job_id": "4327866278",
    "source": "linkedin",
    "company_name": "SHEIN",
    "job_title": "Business Analyst",
    "location": "Bahçelievler, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4340957789/",
    "job_id": "4340957789",
    "source": "linkedin",
    "company_name": "DenizBank",
    "job_title": "Executive Assistant",
    "location": "Istanbul, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360740762/",
    "job_id": "4360740762",
    "source": "linkedin",
    "company_name": "Madi International",
    "job_title": "General Accountant",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "MADI International is a leading distributor of professional beauty and personal care brands across the Middle East. With a strong regional presence and a commitment to excellence, we support salons, professionals, and retail partners through innovation, quality, and operational excellence.Job SummaryWe are looking for a detail-oriented and reliable General Accountant to join our Finance team. The role is responsible for maintaining accurate financial records, preparing financial reports, supporting audits, and ensuring compliance with accounting standards and regulatory requirements. The ideal candidate will play a key role in supporting the company's financial health and day-to-day accounting operations.Key ResponsibilitiesMaintain and update general ledger accounts, ensuring accuracy and completeness.Prepare monthly, quarterly, and annual financial statements (Balance Sheet, P&L, Cash Flow).Reconcile bank statements, accounts payable, accounts receivable, and other financial accounts.Record and process journal entries, accruals, and adjustments.Assist in budget preparation, forecasting, and financial planning activities.Monitor financial transactions and ensure compliance with internal controls and accounting standards (IFRS/local standards).Support internal and external audits by providing required documentation and explanations.Analyze financial data and prepare reports for management review.Ensure timely filing of tax returns, VAT, and other regulatory submissions.Coordinate with internal departments to resolve discrepancies and improve financial processes.Qualifications & SkillsBachelor's degree in Accounting, Finance, or a related field.Professional certification (CPA, ACCA, or equivalent) is an advantage.Proven experience as a General Accountant or similar role.Strong understanding of accounting principles, standards, and procedures.Proficiency in accounting software (e.g., SAP, Oracle, QuickBooks, Tally) and MS Excel.High attention to detail with strong analytical skills.Excellent organizational and time-management abilities.Strong communication and teamwork skills. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4287923018/",
    "job_id": "4287923018",
    "source": "linkedin",
    "company_name": "BPiON Group",
    "job_title": "Specjalista ds. kadr i płac",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353722560/",
    "job_id": "4353722560",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts And Finance - For Arkay Multimedia Limited - Job ID: 1450196",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Arkay Multimedia Limited is looking for Executive - Accounts And FinanceJob Description / ResponsibilityMaintain daily accounts, vouchers, and ledger entries.Ensure accurate and timely bookkeeping.Handle accounts payable/receivable & bank reconciliation.Ensure compliance with Income Tax, VAT, and company financial policies.Maintain accurate documentation and support internal control systems.Assist in budgeting, cash flow management, and auditing procedures.Assist in Prepare financial statements and monthly closing reports.Coordinate with auditors and support internal/external audits.Any other task assigned by Management.Educational RequirementsBachelor of Business Administration (BBA) in Accounting/FinanceMaster of Business Administration (MBA) in Accounting/FinanceProfessional qualification like CA (CC) will be get preference.Skills Required: Accounting Data Entry, Microsoft Office, Bank Reconciliation, Accounts Ledger reconciliationExperience Requirements1 to 2 year(s)The applicants should have experience in the following business area(s):Advertising AgencyFreshers are also encouraged to apply.Additional RequirementsMust have proficiency in Microsoft Word, Microsoft Excel.Job LocationDhakaSalaryTk. 18000 - 25000 (Monthly) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346427840/",
    "job_id": "4346427840",
    "source": "linkedin",
    "company_name": "Awtad",
    "job_title": "Accountant",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323171431/",
    "job_id": "4323171431",
    "source": "linkedin",
    "company_name": "Zuellig Pharma",
    "job_title": "Senior Accounts Officer",
    "location": "Changi, East Region, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367722610/",
    "job_id": "4367722610",
    "source": "linkedin",
    "company_name": "Achieve Group",
    "job_title": "Business Process Control Officer (AR/AP)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353671972/",
    "job_id": "4353671972",
    "source": "linkedin",
    "company_name": "Arini",
    "job_title": "Treasury Tech Specialist",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369536195/",
    "job_id": "4369536195",
    "source": "linkedin",
    "company_name": "Talent Express Recruitments",
    "job_title": "Chief Financial Officer",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Chief Financial Officer🏦 Leading Financial institute in Sri Lanka Our client is seeking a dynamic and highly experienced Chief Financial Officer (CFO) to join the senior leadership team of a leading bank in Sri Lanka. The CFO will play a critical role in driving financial strategy, ensuring regulatory compliance, and supporting sustainable growth aligned with the bank’s long-term vision.Responsibilities Provide strategic leadership in financial planning, budgeting, forecasting, and capital managementOversee financial reporting, management accounts, and statutory financial statements in line with SLFRS and CBSL regulationsEnsure full compliance with Central Bank of Sri Lanka (CBSL) requirements, prudential guidelines, and regulatory reportingManage treasury, liquidity, ALM, and capital adequacy in line with regulatory and business requirementsLead relationships with regulators, auditors, investors, and other key stakeholdersDrive cost optimization, profitability analysis, and performance management across business unitsOversee tax planning, compliance, and risk management frameworksProvide strategic input on mergers, acquisitions, new products, and digital transformation initiativesLead, mentor, and develop a high-performing finance and treasury teamExpected Profile Bachelor’s degree in Finance, Accounting, Economics, or a related fieldProfessional qualification such as CA Sri Lanka / ACA / ACCA / CIMA (MBA preferred)Minimum 15 – 20 years of experience in finance, with significant senior leadership exposure in the banking or financial services sectorStrong knowledge of CBSL regulations, Basel III/IV, ALM, IFRS/SLFRS, and banking risk frameworksProven experience in strategic financial management and board-level reportingExcellent leadership, stakeholder management, and decision-making skillsHigh level of integrity, professionalism, and commercial acumenShare your updated CV to careers@talentexpress.lkFollow our LinkedIn page for upcoming vacancies WhatsApp – 0779 391 791 Web - www.talentexpress.lk Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367115098/",
    "job_id": "4367115098",
    "source": "linkedin",
    "company_name": "Redstone Search Group",
    "job_title": "Chief Operating Officer",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363624113/",
    "job_id": "4363624113",
    "source": "linkedin",
    "company_name": "ERGO Technology & Services",
    "job_title": "Global IT Financial Controller | f/m/d",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361978053/",
    "job_id": "4361978053",
    "source": "linkedin",
    "company_name": "Knowit",
    "job_title": "System Analyst",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369923457/",
    "job_id": "4369923457",
    "source": "linkedin",
    "company_name": "Ascendion",
    "job_title": "Asset Control Specialist",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Join Us as Developer Specialist – Gresham Asset ControlWe are looking for an experienced Developer Specialist with strong expertise in Gresham Asset Control to support a mission-critical reconciliation and financial data controls platform within a leading global banking environment.The role involves end-to-end ownership across analysis, requirements gathering, solution design, development, testing, and release deployment of Asset Control-based solutions.You will work closely with Business, Operations, and IT teams in an Agile delivery model supporting Capital Markets and Finance control functions.Key ResponsibilitiesDevelop and enhance solutions within Gresham Asset ControlBuild and maintain expert-level logic using Formula EnginePerform analysis, requirements gathering, and technical solution designSupport development, testing, and deployment across DEV / PRE / PROD environmentsIntegrate Asset Control with enterprise systems using APIs and middlewareWork with SQL/Oracle databases for reconciliation and control workflowsContribute to microservices-based architecture (OpenShift exposure)Manage scheduling and automation using Control-M Job-as-CodeSupport production releases, troubleshooting, and continuous improvementsCollaborate with global teams in Agile/Scrum environmentsMust-Have RequirementsStrong hands-on experience with Gresham Asset ControlExpert knowledge of Formula Engine (Asset Control-specific)Advanced programming experience in JavaStrong SQL / Oracle database skillsExperience in solution design and development lifecycle ownershipRelease management and deployment experience across environmentsGood communication skills and ability to work in international teamsNice to HaveIntermediate Python experienceIBM API Connect expertiseMicroservices exposure on OpenShift / KubernetesControl-M automation and schedulingExperience in Banking, Capital Markets, or Financial ServicesKnowledge of reconciliation, exception management, or data controls platforms (SmartStream TLM, Duco, IntelliMatch)Why Join Us?Competitive salary or contract rates on UoP or B2B (B2B range: PLN 130-170/hour) - open for discussionHybrid working model – Warsaw (2 days office visit every 2 weeks)Opportunity to work on high-impact financial control and reconciliation platformsLong-term project with global banking exposureCollaborative, international delivery environmentStrong growth opportunities in niche Asset Control expertiseAbout Us:Ascendion is a global, leading provider of AI-first software engineering services, delivering transformative solutions across North America, APAC, and Europe. We are headquartered in New Jersey. We combine technology and talent to deliver tech debt relief, improve engineering productivity solutions, and accelerate time to value, driving our clients’ digital journeys with efficiency and velocity. Guided by our “Engineering to the power of AI” [EngineeringAI] methodology, we integrate AI into software engineering, enterprise operations, and talent orchestration, to address critical challenges of trust, speed, and capital. For more information, please go to www.ascendion.comWith Ascendion (www.ascendion.com), you:Will get to work on numerous challenging and exciting projects on our various offerings including Salesforce, AI/Data Science, Generative AI/ML, Automation, Cloud Enterprise and Product/Platform Engineering.At Ascendion you have high chances of project extension or redeployment to other clients.Additionally, you can also share CV of anyone you know. We have a referral policy in place. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367401685/",
    "job_id": "4367401685",
    "source": "linkedin",
    "company_name": "Hays",
    "job_title": "APAC Finance Manager - Central (Up to $9,500 per month)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365362950/",
    "job_id": "4365362950",
    "source": "linkedin",
    "company_name": "bp Launchpad",
    "job_title": "ARC SME",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368992318/",
    "job_id": "4368992318",
    "source": "linkedin",
    "company_name": "Language Talent Solutions Sdn Bhd",
    "job_title": "Accounts Payable Accountant",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369376892/",
    "job_id": "4369376892",
    "source": "linkedin",
    "company_name": "CNGR Indonesia",
    "job_title": "Tax Specialist",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327890967/",
    "job_id": "4327890967",
    "source": "linkedin",
    "company_name": "Permata Bank",
    "job_title": "Commercial Credit Analyst",
    "location": "Jakarta Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357432243/",
    "job_id": "4357432243",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accounts Officer - For Christian Service Society (CSS)- Job ID : 1455755",
    "location": "Khulna, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Christian Service Society (CSS) is looking for Accounts OfficerJob Description / ResponsibilityChristian Service Society (CSS), a renowned national non-governmental organization, has been serving the needs of underprivileged and marginalized communities since 1972. CSS has been working towards creating sustainable change in Bangladesh, implementing a number of projects and programs focusing on areas such as education, healthcare, women`s empowerment, disaster relief and rehabilitation, economic (microfinance) and enterprise development, etc. We are looking for an experienced and qualified “Accounts Officer” who will be responsible for carrying out all accounts-related activities of the organization.Job Responsibilities:Prepare and check bills/vouchers, and register the daily vouchers.Perform activities related to the FDR, Provident Fund, gratuity, leave pay, etc.Prepare monthly requisition, annual budget, monthly and yearly accounts, etc.Prepare the final accounting of the institute, including its individual section/trade/lab, when needed.Oversee staff monthly salary adjusting Leave Without Pay (LWP) or any deduction.Look after advanced payment, adjust the advanced payment in time, and inform the authority of any inconsistency.Check the daily expenditures for accuracy and authenticity and inform the authority if needed.Prepare journal vouchers as per office rules; register the daily incomes and expenditures in the cash book and account for the daily cash at the end of the day. In case of any mismatch of cash with the final account, inform the authority.Carry out all banking transactions, including money withdrawals and deposits.Prepare an annual account statement and submit the same for audits.Face internal and external audits, and give explanations to the auditor’s queries for account-related activities.Inform the authority when the expenditures exceed the annual budget and prepare an extra budget.Take necessary actions for approval when any fixed expenditure exceeds the monthly requisition.Check whether the products or goods mentioned in the purchase requisition are in line with the budget.Any other work assigned by the Supervisor and/or higher authority.Educational RequirementsMaster of Commerce (MCom)Academic qualification will be relaxed for experienced candidate.Experience RequirementsAt least 3 year(s)The applicants should have experience in the following business area(s):NGOAdditional RequirementsAt least 3 years Practical experience in the field of Accounting and Finance;Age restriction will be relaxed for experienced candidate;The candidate should have a good working knowledge of finance/accounting policies, including VAT and Tax.Job LocationKhulna Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327915353/",
    "job_id": "4327915353",
    "source": "linkedin",
    "company_name": "OCBC Indonesia",
    "job_title": "Senior Internal Auditor",
    "location": "Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356101296/",
    "job_id": "4356101296",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "EO / SEO for ICCD - For Southeast Bank PLC - Job ID: 1453827",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365252518/",
    "job_id": "4365252518",
    "source": "linkedin",
    "company_name": "Chemelco International",
    "job_title": "Accountant",
    "location": "Stellenbosch, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361475813/",
    "job_id": "4361475813",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Fire Safety Officer - Factory Complex - For Meghna Group of Industries. - Job ID: 1455445",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Meghna Group of Industries. is looking for Fire Safety Officer - Factory ComplexJob Description / ResponsibilityJob Context:Meghna Group of Industries (MGI) is one of the leading conglomerates in Bangladesh with diversified manufacturing units. To ensure a safe, compliant, and fire-risk-free factory environment, MGI is looking for Fire Safety Officer for its Factory Fire & Safety Department. This role will support factory management in preventing fire incidents, ensuring system readiness, and strengthening emergency preparedness through effective inspection, coordination, and training.Job Responsibilities:Coordinate with MGI central fire department to ensure fire safety for workplace areas and ensure all fire safety equipment in an establishment are in good shape and in working condition always.Inspect and prepare the updated list and internal report on their current effectiveness of fire & safety equipment which are already present in the factoryFollow up that the factory have their updated list of fire fighting team (shift and floor wise) (e.g. Who will act as the alternative for each of these personnel, and what will be their specific role during any emergency – ensure that this briefing has been conducted.Ensure that the number of assigned (shift & zone wise) Fireman, Fire Tender Operator, Fire Supervisor deployed by the Fire Department is adequate or not.Follow up the availability of the current and most updated report on the factory overall housekeeping and anti-smoking initiatives.Follow up that 18% workforce (floor & shift wise) has been identified and trained on fire fighting, rescue & first aidFollow up that Raw materials, finished goods, chemical and other combustible material segregation, safe storage, and clear from obstruction to fire fighting equipmentRegularly inspect all type of fire equipment such as Smoke detectors, fire hydrants, fire doors, fire fighting apparatus, etc.Coordinate with central fire department to conduct regular fire drills and emergency evacuation drills to aware employees of any emergency incident. This includes the preparedness during the vulnerable hour’s e.g. late night shift, lunch break.Identify probable fire hazard areas and make recommendations to take preventive measures on an urgent basis.Maintain liaison with local fire service authority and prepare all safety standards, policy, reports, and documentation regarding fire safety issues including fire evacuation for all employees.Train up all workers/staff/employees on fire safety, protection, fighting and First Aid on demonstration basis to make the mission successful. Ensure that each and every employee (daily basis, regular, irregular) is trained on basic safety training & fire extinguisher use.Review the Fire Safety Master Plan for the unit and work closely with the Project department and Fire consultant to ensure that construction of these systems has been carried out and maintained in accordance with the accepted design.Educational RequirementsBachelor of Science (BSc)Skills Required: Health Safety and Environment, Fire safety ManagementExperience RequirementsAt least 4 year(s)The applicants should have experience in the following business area(s):Manufacturing (FMCG),Manufacturing (Light Engineering and Heavy Industry),Group of Companies,Cement Industry,LPG Gas/Cylinder Gas,Fuel/PetroleumAdditional RequirementsCertification of the “Fire Safety Manager (6 monthly) course” from BFSCD or Alliance / Accord / Nirapon or equivalent is preferred.Must have the knowledge to organize the installation and maintenance of panel board systems, fire alarms, smoke detectors, and addressable and fire hydrant systems.The applicants should have experience in the following area(s): (Fire safety Management, Health Safety Environment, Occupational Health)Job LocationNarayanganj Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370392746/",
    "job_id": "4370392746",
    "source": "linkedin",
    "company_name": "Samsung Electronics",
    "job_title": "Key Account Manager",
    "location": "Casablanca Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367124961/",
    "job_id": "4367124961",
    "source": "linkedin",
    "company_name": "OSHEE",
    "job_title": "Senior Key Account Manager",
    "location": "Bucharest, Romania",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356195889/",
    "job_id": "4356195889",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Accounts and Finance - (For BDA’s Building Solutions Ltd. (BBSL)) - Job ID - 1454311",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4350700484/",
    "job_id": "4350700484",
    "source": "linkedin",
    "company_name": "Intertech Information Technology and Marketing Inc.",
    "job_title": "Treasury Software Engineer (Hybrid)",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351742143/",
    "job_id": "4351742143",
    "source": "linkedin",
    "company_name": "Turkish Securities",
    "job_title": "Açık Yatırım Müdür/Grup Müdürleri",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "AÇIK YATIRIM olarak Bankacılık ve Sermaye Piyasaları dünyasına yepyeni pencereler açmaya devam ediyoruz. Bu heyecan verici dünyada gücümüzü artırarak büyütmeye devam ediyoruz…Eğer;Dönüşen dünyanın gidiş yönüne ve hızına dayanıklı bir ekosistemin parçası olmak istiyorsanız,Bankacılık ve yatırım sektöründeki tecrübemi yeni nesil ve benzersiz bir hizmet modeli ile buluşturmak isterim,Özel Bankacılık (UHNW) müşterilerinin beklentilerini çok iyi anlar ve buna uygun benzersiz deneyimler yaratabilirim,Yeni bir ekip ile yeni bir portföy oluşturmak beni mutlu ediyor ,Başarma arzusu yüksek ve yenilikçi biriyim,Yeniliğe açık, vizyoner, meraklı ve geleceğe hazırlanan birisiyim diyorsanız,Değerlere önem veren ve değer yaratan bir profiliniz var ise,Burası Tam Size Göre !Aranan özellikler ;Minimum 10 yıl ve üstü Bankacılık ya da yatırım deneyimli,Şube / Bölge gibi müşteri ile direkt temas kuran mesleki deneyimSPK Düzey (1-2-3) ve/veya Türev lisans sahibiyim, Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356549629/",
    "job_id": "4356549629",
    "source": "linkedin",
    "company_name": "Stellantis Middle East & Africa",
    "job_title": "Business Development Manager - Free2Move",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362225589/",
    "job_id": "4362225589",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Additional Managing Director (Contractual) - For Islamic Finance and Investment PLC. - Job ID: 1458271",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361426756/",
    "job_id": "4361426756",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Manager / Manager - Credit & Recovery - For Fareast Finance & Investment Limited - Job ID: 1457205",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330493984/",
    "job_id": "4330493984",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Financial Planning & Analysis",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job SummaryResponsible for financial planning, budgeting, forecasting, and performance analysis to drive business growth. Acts as a strategic finance partner with strong focus on working capital, cash flow, cost control, and margin optimization within an FMCG environment.Key ResponsibilitiesLead budgeting, forecasting, and variance analysis Manage working capital and cash flow forecasting Drive cost control and margin improvement initiatives Analyze business, product, and channel profitability Partner with sales and operations for decision support Prepare management reports and financial dashboards Lead and develop FP&A team RequirementsBachelor’s degree in Finance/Accounting (MBA/CA/CMA preferred) 5–8 years FP&A or commercial finance experience Mandatory FMCG background Strong knowledge of working capital, cash flow, cost control Advanced Excel; ERP/BI tools preferred Strong analytical and leadership skills Skills: sql,financial modeling,power bi,fmcg,budgeting & forecasting,erp systems,variance analysis Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361776829/",
    "job_id": "4361776829",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Deputy Manager, IT Infrastructure- For Evercare Hospital Dhaka- Job ID: 1458075",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Evercare Hospital Dhaka is looking for Deputy Manager, IT InfrastructureJob Description / ResponsibilityPerform System, Network and Security design and capacity planning, Install and maintain ICT environments.Provide second/third level technical support to users concerning network and Security system operations.Install, configure, and maintain multi-user software in the network environment.Administer and maintain end user accounts, permissions, and access rights, if neededOversee installation, configuration, maintenance, and troubleshooting of network connected end-user hardware, software, and peripheral devices.Oversee all local and wide area network, security compliance and implement security standard.Manage security solutions, including firewalls, anti-virus, and intrusion detection systems etc.Ability to organize, prioritize and multitask Hands-on experience in system, security, networking, routing, and switching.Strong understanding of computer network infrastructure including IP Camera and NVR and storage.Good analytical and critical thinking skillsInstall, configuration and troubleshooting of the entire Network infrastructure.continuously monitors the network for security breaches, carries out simulated attacks to identify vulnerabilities, and develops security protocols to prevent potential threats.Educational RequirementsBachelor of Science (BSc) in Computer Science & EngineeringExperience Requirements5 to 7 year(s)The applicants should have experience in the following business area(s):HospitalAdditional RequirementsHands-on experience on Enterprise grade Cisco and Juniper Switch -Expert levelHands-on experience on Fortinet, Palo Alto and Checkpoint devices - Expert levelHands-on experience on Wireless Device and controller (Fortinet and Ruckus) - Expert levelHands-on experience on monitoring the network and security infrastructure - Expert level. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4178261641/",
    "job_id": "4178261641",
    "source": "linkedin",
    "company_name": "Recover নিয়োগ",
    "job_title": "Finance Director",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4348520395/",
    "job_id": "4348520395",
    "source": "linkedin",
    "company_name": "(For A Renowned MNC)",
    "job_title": "Executive-Accounts & Finance",
    "location": "Narayanganj, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4373271208/",
    "job_id": "4373271208",
    "source": "linkedin",
    "company_name": "DULCEDO Management",
    "job_title": "Financial Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Nous sommes DulcedoCe qui distingue Dulcedo, c’est que pour nous, la gestion de talents n’est pas une question de chiffres, mais de stratégie, de structure et de vision à long terme. Nous sommes une agence de gestion de talents full service, spécialisée en représentation de créateurs, influenceurs, athlètes, mannequins et talents du divertissement.Notre mission : bâtir de vraies marques autour de nos talents, soutenir leur croissance durable et offrir un service haut de gamme aux marques qui collaborent avec eux. Nous croyons en des processus solides, une approche structurée du recrutement et une croissance réfléchie, bien au-delà des victoires à court terme.Aujourd’hui, Dulcedo est le plus grand groupe multidisciplinaire de gestion de talents au Canada et un leader en Amérique du Nord. Nous gérons les carrières internationales de plus de 500 mannequins, de centaines d’athlètes olympiques et professionnels, ainsi que de créateurs de contenu, influenceurs et streamers de premier plan. Avec des bureaux à Montréal et Toronto, et un réseau international, Dulcedo est devenue une référence incontournable dans l’industrie du divertissement et de la création.Mais avant tout, Dulcedo est une communauté. Une équipe de personnes ambitieuses, bienveillantes et engagées, qui travaillent fort sans jamais se prendre trop au sérieux. Certifiés Great Place to Work deux années consécutives, nous plaçons la culture, le plaisir et le sens au cœur de notre environnement de travail.L'Opportunité: On recrute un·e Analyste financier pour bâtir, structurer et faire évoluer notre reporting financier dans un contexte d’hypercroissance. En collaboration étroite avec notre Assistant Controller et l’équipe finance, tu joueras un rôle clé dans la création de nos outils d’analyse interne - et tu contribueras directement à rendre nos données plus claires, plus fiables et plus actionnables au fil du temps.Ton mandat : transformer des données parfois imparfaites en analyses structurées, pertinentes et utiles, afin de soutenir la prise de décision et d’aider l’entreprise à grandir avec une base financière solide. Ce rôle est idéal pour quelqu’un qui aime la logique, les états financiers, la gestion de projets, et qui veut évoluer graduellement vers un rôle de type FP&A / business performance avec une réelle visibilité et un impact concret sur le long terme. C’est aussi une opportunité parfaite pour une personne curieuse, proactive et ambitieuse, qui a soif d’apprendre, qui veut embarquer dans un projet en construction, et qui souhaite contribuer à bâtir quelque chose de durable au sein d’une équipe finance supportive et humaine.We are DulcedoAt Dulcedo, talent management is not about volume - it’s about strategy, structure, and long-term vision. We are a full-service talent management agency specializing in the representation of creators, influencers, athletes, models, and entertainment talent across North America and internationally.Our mission is to build scalable, sustainable careers for our talent while delivering white-glove service to the brands and partners who collaborate with them. We believe in strong systems, thoughtful recruitment, and intentional growth, not short-term wins or reactive hiring.Dulcedo is the largest multidisciplinary talent management group in Canada and a recognized leader across the US and North American markets. We manage the global careers of 500+ models, hundreds of Olympic and professional athletes, and a growing roster of top-tier digital creators, influencers, and streamers. With offices in Montreal and Toronto and an extensive network across Los Angeles, New York, Miami, and beyond, Dulcedo operates at the intersection of talent, culture, and entertainment.Above all, Dulcedo is a people-first organization. Our team is made up of ambitious, collaborative, and high-performing individuals who care deeply about culture, integrity, and impact. Proudly certified as a Great Place to Work, we foster an environment where people are empowered to grow, challenge themselves, and do meaningful work alongside industry-leading talent.The Opportunity: We’re hiring a Financial Analyst to help build, structure, and scale our financial reporting in a high-growth environment. Working closely with our Assistant Controller and Finance team, you’ll play a key role in developing the internal reporting tools and analysis frameworks that will help make our data clearer, more reliable, and more actionable over time.Your mission: turn imperfect or evolving data into structured, meaningful insights that support smart decision-making and help the business grow on a strong financial foundation. This role is ideal for someone who loves logic, financial statements, and project-based work - and who is excited to progressively evolve into a FP&A / business performance type of position, with real visibility and long-term impact. This is also the perfect opportunity for someone who is curious, proactive, and ambitious - someone who wants to ",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371411799/",
    "job_id": "4371411799",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "bout Turing:Based in San Francisco, California, Turing is the world’s leading research accelerator for frontier AI labs and a trusted partner for global enterprises deploying advanced AI systems.Turing supports customers in two ways: first, by accelerating frontier research with high-quality data, advanced training pipelines, plus top AI researchers who specialize in coding, reasoning, STEM, multilinguality, multimodality, and agents; and second, by applying that expertise to help enterprises transform AI from proof of concept into proprietary intelligence with systems that perform reliably, deliver measurable impact, and drive lasting results on the P&LAbout the Role:We are looking for a detail-oriented Business Analyst to support evaluation and annotation workflows focused on quality, accuracy, and structured reasoning. This role is ideal for someone who is comfortable working with digital tools, performing side-by-side evaluations, and providing clear, well-supported justifications based on fact-checking.Responsibilities:Perform side-by-side (SxS) evaluations on GHD, comparing outputs and assessing quality, accuracy, and relevance.Conduct fact-checking to validate information and identify inconsistencies or inaccuracies.Provide detailed, well-structured justifications to support evaluation decisions.Follow established evaluation guidelines and quality standards consistently.Use browser-based tools and extensions to support analysis and review tasks.Execute simple command-line instructions when required to support evaluation workflows.Document findings clearly and communicate insights to stakeholders when needed.Requirements:Solid comfort using a computer in a professional setting.Experience working with browser extensions and online tools.Ability to run basic command-line commands (no advanced programming required).Strong analytical and critical thinking skills.High attention to detail and ability to justify decisions clearly and objectively.Comfortable working with evaluation frameworks, comparisons, and structured analysis.Good written communication skills in English.Nice to Have:Previous experience with evaluation, annotation, QA, or audit-type work.Familiarity with data quality, content evaluation, or model/output assessments.Background in business analysis, operations, or process improvement.Perks of Freelancing With Turing:Competitive compensation based on experience and expertise.Flexible working hours and a fully remote environment.Opportunity to contribute to impactful research initiatives.Potential for contract extension based on performance and project needs.Offer Details:Commitment Required: 30 hours per week minimum.Engagement Type: Contractor/Freelancer (no medical or paid leave).Time Overlap: Some overlap with UTC-8:00 (2–5 hrs/day) America/Los_Angeles.Application Process:Shortlisted candidates will be invited to complete an analytical challenge.Once the assessment is cleared, you’re ready to start contributing!After applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.Know amazing talent? Refer them at turing.com/referrals, and earn money from your network.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366135585/",
    "job_id": "4366135585",
    "source": "linkedin",
    "company_name": "LEM",
    "job_title": "Junior Costing Controller",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "LEM – Life Energy MotionAt LEM, we help our customers and society accelerate the transition to a sustainable future.Our global team of 1,700 professionals which spans over 15 countries is dedicated to converting technology potential into powerful solutions, which enable the decarbonization of the world.A leading company in electrical measurement, LEM engineers the best solutions for energy efficiency and electrical mobility, ensuring our customers’ systems are optimized, reliable and safe.LEM is listed on the SIX Swiss Exchange since 1986, with the ticker symbol LEHN.The future needs our ingenuity, we need your Spark.Junior Costing ControllerWe are seeking a detail driven Junior Costing Controller to join our team in Bulgaria. In this role, you will help ensure the accuracy of ERP costing transactions, perform cost roll up, maintain item master data, support transfer price calculations, and conduct inventory reconciliations across multiple sites. You will work closely with senior team members and cross-functional partners, with training provided.Your role:Maintain and validate costing master dataCollaborate with the Engineering and Supply Chain Teams to ensure accurate master data set upApply costing methodology and execute standard cost roll-up within the ERP system, ensuring accurate and timely updateCalculate and maintain transfer prices in line with internal policy and tax guidelinesPerform inventory subledger-to-GL reconciliationsAssist with month end close tasksTrack and report KPIs.Your Profile:Bachelor’s degree in Accounting, Finance, or Economics (final year students are welcome)Fluent in English (written and spoken)Microsoft office skillsDetail-oriented and eager to learn1 year experience in Finance, Accounting or a related field will be considered an advantage, including internships or academic projects.What We OfferHybrid working model and flexible working timeAdditional health insurance, including:- Dental & Optical care- Hospital & Pregnancy careMultisport card (fitness & wellness access)Food vouchers & Transport allowanceEmployee referral program25 paid holiday daysFree unlimited access to LinkedIn Learning Platform",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361402562/",
    "job_id": "4361402562",
    "source": "linkedin",
    "company_name": "LEV INS Insurance Company",
    "job_title": "Junior Accountant",
    "location": "Sofia, Sofia City, Bulgaria",
    "employment_type": "",
    "date_posted": "",
    "job_description": "With 30 years of experience, LEV INS is the undisputed leader in the Bulgarian insurance market, providing reliable security solutions for both individuals and businesses. Our mission is to offer protection, inspire trust, and build sustainable partnerships based on transparency, active communication, and social responsibility.In addition to our strong presence in Bulgaria, the company successfully operates in seven European countries. LEV INS employs over 1,000 highly qualified professionals, whose dedication and expertise drive our continuous growth and success.We are expanding our team and, due to the increased workload, we are looking for a motivated and experienced Junior Accountant to become part of our organization.Key Responsibilities:Oversee daily accounting operations—including AP/AR, cash receipts, general ledger, and revenue/expense analysis—ensuring accurate and timely transaction recording in line with BAS;Prepare reports and statements for management and stakeholders, including English-language reporting;Process payments, manage supplier/customer relationships, and oversee contract-related accounting tasks;Ensure regulatory compliance, maintain internal controls, and support internal audit activities;Requirements:Bachelor's degree in Economics, with a focus on Accounting, Audit, or Finance;At least 1 year of experience in accounting (experience in the insurance sector is an advantage);Good command of English (B2) - written and spoken;Computer literacy proficiency in Excel and Word;Ability to work effectively in a team;Excellent analytical and organizational skills.What We Offer:A dynamic environment where your ideas and expertise have real impact on brand development;A supportive and collaborative team culture;Opportunities for professional growth, learning, and international exposure;Competitive remuneration;Cards for sports at preferential prices;25 days annual paid leave.Send us your CV in English, and we will be happy to tell you more.The information you provide will be used solely for the purposes of this recruitment process.Only shortlisted applicants will be contacted.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360580609/",
    "job_id": "4360580609",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Data / Operations Analyst (Garments Manufacturing - Formal Wear Export)- For A leading export-oriented ready-made garments (RMG) manufacturer in Bangladesh - Job ID: 1456122",
    "location": "Dhaka, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "A leading export-oriented ready-made garments (RMG) manufacturer in Bangladesh is looking for Data / Operations Analyst (Garments Manufacturing - Formal Wear Export)Job Description / ResponsibilityWe are looking for a Data / Operations Analyst to support senior leadership by collecting, consolidating, and structuring operational and business data from multiple sources. The role will focus on identifying data gaps, building meaningful KPIs/dashboards, and translating garment manufacturing workflows into measurable systems to improve decision-making, governance, and operational clarity.Key Responsibilities:Collect, consolidate, and clean data from multiple sources (Excel, ERP/MIS, production reports, quality reports, planning sheets, etc.).Visit factory periodically to gather primary data, verify reporting accuracy, and align data definitions with operations teams.Identify data gaps, inconsistencies, duplication, and reliability issues; recommend corrective actions and controls.Develop and maintain KPIs and dashboards (e.g., output, efficiency, WIP, DHU/alteration, lead time, OTIF shipment readiness).Understand end-to-end factory workflows (cutting–sewing–finishing–packing; warehouse flow; order-to-ship) and convert them into measurable reporting systems.Prepare weekly/monthly management reporting packs with insights, trends, and key observations.Create and maintain documentation: KPI definitions, reporting logic, SOPs, process maps, and data dictionaries.Educational RequirementsBachelor/HonorsBachelor’s degree in Textile Engineering, Business Analytics, MIS, Data Science or a related discipline.Training/certification in Excel / Power BI / SQL / Data Analytics will be an advantage.Skills Required: Production/ Operation Management, SQL, Management Information System, Reporting and Documentation, Data analysis, PowerBI, Problem solving and analytical skill, Cross Functional Collaboration, Advanced Data AnalysisExperience Requirements2 to 3 year(s)The applicants should have experience in the following business area(s):GarmentsAdditional RequirementsHead Office (Dhaka) role with regular factory visits (Gazipur) to collect/validate dataBuild KPIs & dashboards for RMG formal-wear operationsStrong Excel/SQL/BI exposureHigh visibility with leadershipExcellent Communication and Presentation (English & Bangla)Strong inter-departmental collaboration skills to work effectivelyJob LocationDhaka (Tejgaon Industrial Area)Salary",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4029773193/",
    "job_id": "4029773193",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "uniter নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4272721840/",
    "job_id": "4272721840",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Citisun Watch Company Limited নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4107857952/",
    "job_id": "4107857952",
    "source": "linkedin",
    "company_name": "(For SAIC GROUP)-Job ID",
    "job_title": "Executive- Accounts (Dhaka , Rangpur)",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4150642413/",
    "job_id": "4150642413",
    "source": "linkedin",
    "company_name": "Latif & Associates নিয়োগ",
    "job_title": "Tax Consultant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4283082129/",
    "job_id": "4283082129",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "OakBridge CPAs & Advisors hiring Offshore Accounting Contractor ...",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4265065295/",
    "job_id": "4265065295",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Not নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3966569065/",
    "job_id": "3966569065",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3974115153/",
    "job_id": "3974115153",
    "source": "linkedin",
    "company_name": "(For RDRS Bangladesh)",
    "job_title": "Finance and Admin Officer",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318019508/",
    "job_id": "4318019508",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4318510137/",
    "job_id": "4318510137",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Athelas নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4349876761/",
    "job_id": "4349876761",
    "source": "linkedin",
    "company_name": "(For Pure Medical Group)",
    "job_title": "Senior Accountant",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360515587/",
    "job_id": "4360515587",
    "source": "linkedin",
    "company_name": "Sia",
    "job_title": "Accountant – US Entities (Toronto or Montreal)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Sia Partners is a next-generation management consulting firm and pioneer of Consulting 4.0. We offer a unique blend of AI and design capabilities, augmenting traditional consulting to deliver superior value to our clients. With expertise in more than 40 sectors and services, we optimize client projects worldwide. Through our Consulting for Good approach, we strive for next-level impact by developing innovative CSR solutions for our clients, making sustainability a lever for profitable transformation.Our continued success and expansion are primarily due to the quality of our team members. Our consultants work closely with the C-suite at our clients to accelerate and de-risk business growth while improving their customer and employee experience.Job DescriptionWe are looking for a reliable and detail-driven accountant to support our US entities. This role is critical to ensure accurate, timely, and compliant transactional accounting, and to stabilize the AP and general ledger environment.You will be responsible for executing and controlling daily accounting activities, supporting month-end close, and ensuring that vendors, internal teams, and financial data are handled with rigor and consistency.Key responsibilitiesProcess vendor invoices, payments and expense reports accurately and on timeManage vendor setup, W-9 collection, and payment inquiries Perform AP and bank reconciliations Support month-end close activities (journal entries, accruals, reconciliations) Maintain accurate records in the general ledger Identify discrepancies and resolve issues proactively Support audits and compliance requirements for US entities Collaborate with Finance and Operations teams to improve processes and controls Other accounting duties as assigned Qualifications2–5 years of experience in accountingVerify vendor accounts by reconciling monthly statements and related transactionsUnderstanding of US accounting processes, payroll and state taxes highly desirableExperience working with ERP systems is mandatory (Sage Intacct strong preference)Strong Excel skills (lookups, pivot tables, reconciliations)High attention to detail and strong sense of ownershipAbility to work in a fast-paced environment with minimal supervision Additional InformationWHAT DO WE OFFER? This is an opportunity to join a rapidly growing team to serve some of the most exciting and highly respected companies in the world. You will have the opportunity to provide clients with pioneer mind-set thinking, customized solutions, and you will often have the satisfaction of seeing the impact of your work on their business. We are committed to a healthy work-life integration.BenefitsCompetitive salary with a clear and structured yearly salary increase and bonusesHealthcare that includes dental, vision, life insurance, and RRSP contributionsCareer advocacy program that supports achieving personal development goals through coaching, collaboration, and real-time feedbackRobust learning and development platform through the Sia Institute, Working Groups and TrainingReimbursement for continuing education and certificationsYour team will consist of highly educated, specialised and entrepreneurial consultants within a company which is a successful player in the global consulting marketWorking in an environment which creates opportunities to share knowledge and work together on international projects with colleagues all over the worldDEIBDiversity, equity, inclusion, and belonging (DEIB) are part of Sia Partners’ DNA. Thanks to our expertise in several sectors and our international growth, our teams include a variety of experiences and cultures. We’re confident that promoting DEIB creates an environment in which everyone can reach their full potential.Our global network, DEIB@Sia Partners, brings together our people worldwide to facilitate local and global progress, focused on the following areas:Gender equality (global Gender Equality Index score of 91/100 for FY19-20)LGBTQ+Race & EthnicityWorking ParentsDisabilitiesTo learn more about Sia Partners, please visit:https://www.sia-partners.com/en/join-usSia Partners is an equal opportunity employer. All aspects of employment, including hiring, promotion, remuneration, or discipline, are based solely on performance, competence, conduct, or business needs.Sia is an equal opportunity employer. All aspects of employment, including hiring, promotion, remuneration, or discipline, are based solely on performance, competence, conduct, or business needs.Applications are reviewed by our Talent Acquisition team. AI is only used at a later stage of the process and solely for specific aspects of the evaluation.Sia is an equal opportunity employer. All aspects of employment, including hiring, promotion, remuneration, or discipline, are based solely on performance, competence, conduct, or business needs. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369659262/",
    "job_id": "4369659262",
    "source": "linkedin",
    "company_name": "Sia",
    "job_title": "Accountant – US Entities (Toronto or Montreal)",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356692115/",
    "job_id": "4356692115",
    "source": "linkedin",
    "company_name": "ANCIA",
    "job_title": "Technicien(ne) à la paie et à la comptabilité",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330933475/",
    "job_id": "4330933475",
    "source": "linkedin",
    "company_name": "Sigma Consulting Group",
    "job_title": "Junior Accountant",
    "location": "Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364046331/",
    "job_id": "4364046331",
    "source": "linkedin",
    "company_name": "SSC HR Solutions",
    "job_title": "Social Media Account Executive",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362833227/",
    "job_id": "4362833227",
    "source": "linkedin",
    "company_name": "BAP Energy Limited",
    "job_title": "Project Planning & Cost Controller",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Project Planning & Schedule Management Review project budgets and deadlines with Project Managers to ensure alignment with operational and financial objectives. Develop, maintain, and manage project schedules, budgets, and progress cost reports, including forecasting and earned value analysis. Create and adjust project budgets, cash flow projections, and resource plans to support field development and production projects. Develop and manage the company’s project master schedule and resource allocation plans. Project Monitoring, Reporting & Performance Analysis Prepare and present monthly schedule and cost status reports to management using MS Excel, MS Project, Primavera, and related tools, including S-curves, revenue recognition, and contract status updates. Monitor project progress, productivity, and contractor performance, tracking monthly progress costs and project change orders. Analyze project performance data to establish key performance metrics and identify areas for improvement. Compare ongoing project activities against the project management plan and performance baseline to ensure alignment. Financial Control & Contract Management Ensure all projects meet budgetary guidelines and financial performance targets. Control work-in-progress and ensure accurate client billing for related projects. Coordinate payments to subcontractors and vendors in line with project plans. Develop risk mitigation strategies to minimize schedule delays, cost overruns, and operational disruptions. Team Leadership & Stakeholder Coordination Contribute to the selection, training, and oversight of project controls team members, providing coaching and guidance to junior staff. Work closely with engineering, drilling, facilities, and project teams to ensure effective collaboration and execution. Liaise with contractors, vendors, and internal stakeholders to ensure seamless project delivery. Governance, Compliance & Continuous Improvement Ensure all project planning and controls activities comply with BAP Energy’s internal policies, regulatory requirements, and industry best practices. Implement continuous improvement initiatives in project controls processes, reporting systems, and resource management. Drive adoption of project management software and tools to enhance accuracy, transparency, and real-time monitoring of project performance. RequirementsBachelor’s degree in engineering, Quantity Surveying, Project Management, or a related science field. Professional certifications such as: Prince2 – for structured project management methodology. PMP (Project Management Professional) – for project planning and execution expertise. Minimum of 10 years of project controls experience, with at least 5 years in upstream oil & gas field operations, including exposure to exploration, drilling, production, and facilities projects. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363853297/",
    "job_id": "4363853297",
    "source": "linkedin",
    "company_name": "Chubb",
    "job_title": "Tax Analyst/Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323052317/",
    "job_id": "4323052317",
    "source": "linkedin",
    "company_name": "AboitizPower",
    "job_title": "Corporate Finance Manager",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356204577/",
    "job_id": "4356204577",
    "source": "linkedin",
    "company_name": "IBM",
    "job_title": "Senior Architect SAP S/4 Development",
    "location": "Québec, Quebec, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359292747/",
    "job_id": "4359292747",
    "source": "linkedin",
    "company_name": "KPMG Philippines",
    "job_title": "SAP Group Reporting",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4285839347/",
    "job_id": "4285839347",
    "source": "linkedin",
    "company_name": "Tasaheel تساهيل",
    "job_title": "SMEs Team Leader- Giza",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4304562704/",
    "job_id": "4304562704",
    "source": "linkedin",
    "company_name": "Vendeur Afrique",
    "job_title": "Executive Assistant to the CEO",
    "location": "Nairobi, Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4345373790/",
    "job_id": "4345373790",
    "source": "linkedin",
    "company_name": "Dkhoon Emirates",
    "job_title": "Archive Officer",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356205373/",
    "job_id": "4356205373",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Branch Accountant - For Centre for Community Development Assistance (CCDA) - Job ID: 1454559",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361025091/",
    "job_id": "4361025091",
    "source": "linkedin",
    "company_name": "ETRA Talent",
    "job_title": "Compliance Officer (Asset Management)",
    "location": "Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370114151/",
    "job_id": "4370114151",
    "source": "linkedin",
    "company_name": "Grant Thornton - UAE",
    "job_title": "Assistant Manager IT Audit Risk Advisory",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359298209/",
    "job_id": "4359298209",
    "source": "linkedin",
    "company_name": "Telekom Malaysia",
    "job_title": "Special Officer to the GCFO",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359608698/",
    "job_id": "4359608698",
    "source": "linkedin",
    "company_name": "ĐÚNG NGƯỜI ĐÚNG VIỆC Community",
    "job_title": "Trưởng nhóm Kế toán Quản trị",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357683575/",
    "job_id": "4357683575",
    "source": "linkedin",
    "company_name": "Solutino Pte Ltd",
    "job_title": "Group Finance Manager",
    "location": "Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionOversee the daily works of 3 Accounts Executives to ensure accuracies of the accounting entries for the group's entities.Review monthly management reports and financial highlights, ensure reports are sent out on time.Prepare consolidated financial reports.Review of AP from subsidiaries from regional offices (Indonesia, Vietnam and Malaysia), ensure they comply with the finance SOP.Ensure timely submission of accounts by subsidiary companies.Co-ordinate year-end audit process & check audited financial statements for Singapore and Malaysia entities.Reconcile intercompany balances between subsidiary companies.Review and restructure loan agreement between subsidiariesImprove policies & procedures to streamline accounting processes.Prepare Annual Budgets & Forecasts and assist in reviewing of tax returns.Review & enhance financial processes where key information and analysis are produced, making recommendations for improvements where necessary.Support the group in financial project assignments related to investments, tax and legal compliance.Perform other ad-hoc assignments as and when required.RequirementsMinimum Bachelor’s Degree in AccountingPreferably Certified Public Accountant (CPA)Minimum 5 years’ experience as an Accountant or at least 2 years’ experience in similar industries (trading, management consultancy, investment management, private equity).Fast paced team player that is able to work independently with tight datelines, self-motivated.Meticulous, initiative, with strong interpersonal and analytical skillsProficient in MS Office applicationsHas good leadership qualities, good communication skills, meticulous.Additional Information:Applicant must be willing to work in our JB Office (Mount Austin Perdana) / KL Office (Equatorial Plaza).Shortlisted applicant will be required to attempt some assessment tests as part of our recruitment process.Candidates are hereby informed that they will be offered on yearly renewable contract for 2 years before conversion to permanent role Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369409883/",
    "job_id": "4369409883",
    "source": "linkedin",
    "company_name": "iqbusiness",
    "job_title": "Payroll Manager",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367413855/",
    "job_id": "4367413855",
    "source": "linkedin",
    "company_name": "Floward",
    "job_title": "Senior Accountant",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363683973/",
    "job_id": "4363683973",
    "source": "linkedin",
    "company_name": "Özyeğin University",
    "job_title": "Bütçe, Raporlama & Kontrol Uzmanı",
    "location": "Çekmeköy, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "GENEL NİTELİKLER Üniversitelerin İşletme, İktisat, Ekonometri vb. ilgili bölümlerinden lisans derecesi ile mezun,Bütçe raporlama ve kontrol alanlarında en az 5 yıl deneyimli,Tercihen denetim tecrübesi edinmiş,İleri düzeyde Excel ve ERP bilen,İyi seviyede İngilizce bilen,Detaylara önem veren, araştırmacı, analitik yönü kuvvetli ve zaman yönetimine önem veren, Sözlü ve yazılı iletişim becerisi kuvvetli, takım çalışmasına yatkın,Erkek adaylar için askerlik hizmetini tamamlamış. İŞ TANIMIKurum politika ve hedefleri doğrultusunda yıllık bütçenin hazırlanmasına destek olunması,İlgili iş birimleriyle koordinasyonun sağlanması, bütçe taleplerinin alınması,Departmanlardan gelen taleplerin; kurum politika ve kurallarına uygunluk, geçmiş yıllar gerçekleşenlerine göre seyri, vb diğer kontrollerinin sağlanarak konsolide edilmesi, üst yönetime onaya sunulması ve bütçenin yayınlanmasına kadarki tüm aşamalarda departman yöneticisine destek sağlanması,Muhasebe kayıtlarının doğruluğunun kontrol edilmesi, gerekli görülen yerlerde revizyonlar verilmesi ve aylık periyotlarda hazırlanan kapanış raporlarına dayanak teşkil eden verilerin sağlıklı olmasının sağlanması,Bütçe-gerçekleşen sapmalarının düzenli olarak takip ve analiz edilmesi, gerekli görülen yerlerde açıklamalarının yapılarak üst yönetime raporlanması,Üniversite’nin bağlı bulunduğu üst kurum olan Yüksek Öğretim Kurumu (YÖK)’nun raporlama ve denetim süreçlerinde yer alınması, Çeşitli ad-hoc raporlama süreçlerine destek verilmesi,Gerekli görülmesi hallerinde, iş süreçleri ve raporlama düzeninde iyileştirmelerin yapılmasına destek verilmesi.Kişisel Verilerin Korunması Kanunu (KVKK) HakkındaÖzyeğin Üniversitesi olarak tarafımıza ilettiğiniz kişisel verilerinizi korumayı görev ediniyoruz. Paylaştığınız kişisel verilerin işlenme amacı, toplanma yöntemi, hukuki sebebi gibi bilgilere, aşağıdaki adreste yer alan KVKK Aydınlatma Metni içerisinde ulaşabilirsiniz. Başvurunuzu değerlendirebilmemiz için yine aynı adreste bulunan KVKK Aday Çalışan Muvafakatnamesi'ni doldurmanızı rica ederiz. https://docs.google.com/forms/d/e/1FAIpQLSf0XveDKzag81sStSwmLZ6sgh7HRSx1vSNFDkdXct0Bk4c2sA/viewform Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353752503/",
    "job_id": "4353752503",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - Internal Audit (for Head Office) - For Evince Group - Job ID : 1450499",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368943528/",
    "job_id": "4368943528",
    "source": "linkedin",
    "company_name": "THELYX MALAYSIA PLT",
    "job_title": "Audit Associate",
    "location": "WP. Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "📍 Location: Malaysia (Only applicants based in Malaysia will be considered)Job DescriptionYou will play an important role to:Committed to completing audit engagements given within a specific time frame.Ability to communicate professionally within the team and with external parties, including audit clients and authoritative bodies.Take initiative in reading and understanding Accounting Standards (MPERS and MFRS) and other related laws and regulations.Travel to different states within Malaysia and overseas for audit engagements.Perform daily ad-hoc tasks when necessary To be successful in this role, you will need to have:At least Bachelor's Degree/Post Graduate Diploma/Professional Degree in Finance/Accountancy/Banking or equivalent.Fresh grads are encouraged to applyRequired language(s): English Preferably Junior Executive specialized in Finance - Audit/Taxation or equivalentStrong communication skillsPassionate, positive, and keen to learnStrong analytical thinking and problem-solving skills Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4338293169/",
    "job_id": "4338293169",
    "source": "linkedin",
    "company_name": "Mplus",
    "job_title": "İç Denetim ve Uyum Uzman Yardımcısı",
    "location": "Kâğıthane, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4323210950/",
    "job_id": "4323210950",
    "source": "linkedin",
    "company_name": "AIA Malaysia",
    "job_title": "Senior Manager, Shariah Audit",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366322261/",
    "job_id": "4366322261",
    "source": "linkedin",
    "company_name": "Forsyth Barnes",
    "job_title": "Business Analyst (Merchandising & Planning) (Ref: 195161)",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369048605/",
    "job_id": "4369048605",
    "source": "linkedin",
    "company_name": "Allianz Services",
    "job_title": "Business Analyst",
    "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358070950/",
    "job_id": "4358070950",
    "source": "linkedin",
    "company_name": "PetroKnowledge",
    "job_title": "Registration Coordinator - Billing & Invoicing",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370112125/",
    "job_id": "4370112125",
    "source": "linkedin",
    "company_name": "TALENTMATE",
    "job_title": "Administration Coordinator 12 Month Temporary Contract - HR Projects",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358010930/",
    "job_id": "4358010930",
    "source": "linkedin",
    "company_name": "PetroKnowledge",
    "job_title": "General Accountant with Corporate Background (Mid-Level)",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "***PLEASE READ THE BELOW CAREFULLY***Company Background:Join a leading training company dedicated to providing high-quality, short training programmes tailored to the needs of working professionals. Our commitment to excellence and innovation sets us apart in the industry, and we're looking for talented individuals to join our team.Work Location:Dubai Media CityInterview:In-Person in Dubai Media City (Near Dubai Internet City Metro Station)Position / Department:General Accountant at the Accounts & Finance DepartmentJob Overview:We are seeking a highly skilled and experienced General Accountant (Mid-Level) to join our dynamic team. The ideal candidate will have a strong background in accounting, finance, and a proven track record of success in a training company or similar educational setting.Key Responsibilities:Manage the day-to-day financial operations of the company, including accounts payable, accounts receivable, etc.Prepare monthly financial statements, budget reports, and forecasts.Conduct regular financial analysis to identify trends, variances, and opportunities for improvement.Coordinate with external auditors to ensure compliance with regulatory requirements and industry standards.Develop and implement internal controls to safeguard company assets and mitigate financial risks.Collaborate with cross-functional teams to support strategic initiatives and business objectives.Qualifications:Bachelor's degree in Accounting, Finance, or a related field; CPA or equivalent certification preferred.Minimum of 5 years of progressive experience in accounting or finance roles.Prior experience in a training company or educational organization strongly preferred.Proficient in accounting software and Microsoft Office Suite; experience with ERP systems is a plus.Strong analytical skills and attention to detail, with the ability to interpret financial data and provide strategic recommendations.Excellent communication and interpersonal skills, with the ability to collaborate effectively across all organizational levels.Demonstrated leadership qualities and a proactive approach to problem-solving and process improvement.**MANDATORY REQUIREMENTS**You must be in the UAE to attend an in-person interview, an online interview will not be arranged.Must be willing to complete an online assessment through TestGorilla.We kindly request that only applicants who meet the above requirements submit their applications. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354904489/",
    "job_id": "4354904489",
    "source": "linkedin",
    "company_name": "BLUEMINT",
    "job_title": "Muhasebe Uzmanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361161716/",
    "job_id": "4361161716",
    "source": "linkedin",
    "company_name": "ACCA Careers",
    "job_title": "Executive, Accounts Payable",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Job DescriptionThe Finance Department is responsible for the financial aspects of the firm. It records operating transactions, provides essential financial and accounting information necessary to make various decisions; and prepares financial statements that inform management and regulators about the firm's financial results and position.The Finance team also assists to ensure that transactions recorded comply with the internal controls and policies of the firm.We are looking for a dynamic and motivated individual to join our team as an Accounts Payable Executive.ResponsibilitiesEnsure invoices from suppliers/inter-companies/staff claims are recorded accurately and timely into the financial systemCheck that invoices/expenses are properly authorised and process payment when dueRecognise expenses in a timely, consistent basis in-line with accounting treatment and tax complianceAssist to streamline Accounts Payable processesAssist with all periodical financial closing and auditsPerform other ad-hoc tasks as assignedYou Should Possess The FollowingDiploma/degree holder 2 - 3 years finance experience, preferably in similar position Good knowledge and strong analytical skills of numerical dataProficient in Microsoft applications and SAP accounting softwareProactive team player who is meticulous and self-motivatedPositive attitude and willingness to learnAbility to communicate articulately and efficientlyAbility to work independentlyA keen eye for details & excellent follow ups Only shortlisted candidates will be contacted by KPMG Talent Acquisition team, personal data collected will be used for recruitment purposes only. At KPMG in Singapore we are committed to creating a diverse and inclusive workplace. We believe that diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients and communities. As an equal opportunity employer, all qualified applicants will receive consideration for employment regardless of age, race, gender identity or expression, colour, marital status, religion, sexual orientation, disability, or other non-merit factors. We celebrate the different talents that our people bring and support every staff member in their journey to achieve personal and professional growth. One of the ways we do this is through Take Charge: Flexi-work, our flexible working framework which enables agile and innovative teams to help deliver our business goals.Only shortlisted candidates will be contacted by KPMG Talent Acquisition team, personal data collected will be used for recruitment purposes only.At KPMG in Singapore we are committed to creating a diverse and inclusive workplace. We believe that diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients and communities. As an equal opportunity employer, all qualified applicants will receive consideration for employment regardless of age, race, gender identity or expression, colour, marital status, religion, sexual orientation, disability, or other non-merit factors. We celebrate the different talents that our people bring and support every staff member in their journey to achieve personal and professional growth. One of the ways we do this is through Take Charge: Flexi-work, our flexible working framework which enables agile and innovative teams to help deliver our business goals. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369363925/",
    "job_id": "4369363925",
    "source": "linkedin",
    "company_name": "Quasar Medical | Medical Device Manufacturer",
    "job_title": "Accountant",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354105842/",
    "job_id": "4354105842",
    "source": "linkedin",
    "company_name": "Lion Global Investors",
    "job_title": "Investment Research Analyst",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Reporting to the Head of ASEAN, your primary responsibilities will include conducting fundamental and industry research for the ASEAN equities' team. Translating the analyses into actionable recommendations at the Macro (Investment Strategy) and Micro (stock selection) level, you will need to proactively communicate your thesis/ ideas to the portfolio managers and other team members through discussions.Job Responsibilities:Meet with public company management teams, as well as cross-check with competitors, suppliers, customers and industry contacts to reach an informed investment recommendation, ideas which form the basis for financial services sector investments for the Asian Equities' teamMaintain coverage of good quality stocks with investment ratings, target prices and reports; and maintain 'shadow coverage' of stocks, i.e. monitor without producing reportsAs part of the ASEAN team, you will be called upon to provide general market views and views of major sectors or segments if required, as well as answer to specific requestsAttend the various investment-related meetings and present if required, and support marketing activities through participation in client meetings, joint marketing trips and presentations when requestedMaintain all necessary systems and processes to support Asian Equity team. Job Requirements:Recognized and relevant Degree/CFA is preferred (fresh graduates are welcome to apply)Internship experience in a relevant field within asset management or a financial institution is an added advantageSelf-starter and independentPro-active with initiativeProficient in MS OfficeGood communication and interpersonal skillsFast learner who is self-motivated and an excellent team player with a “can-do” attitudeOther Information:Lion Global Investors Limited is committed to equal employment opportunity. Our employment decisions are made based on job requirements and qualifications, and regardless of age, race, gender, religion, marital status, family responsibilities, or disability.Please refer to our Data Protection Policy Statement on how we may collect, use and disclose your personal information. https://www.lionglobalinvestors.com/en/data-protection-policy-statement.htmlPlease be informed that only shortlisted candidates will be notified. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357192139/",
    "job_id": "4357192139",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive - IT - For Bangladesh Knitwear Manufacturers & Exporters Association (BKMEA) - Job ID : 1455443",
    "location": "Narayanganj District, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Bangladesh Knitwear Manufacturers & Exporters Association (BKMEA) is looking for Executive - ITJob Description / ResponsibilityInstallation, configuration, monitoring, and maintenance of Windows and Linux ServersManagement of Virtual Machines (VMs) and optimization of server resourcesConfiguration, monitoring, and troubleshooting of MikroTik Routers, Mesh Routers, switches, and related network devicesManagement and troubleshooting of LAN/WAN networks, including internet connectivity and internal networkingInstallation, configuration, and maintenance of IP Phones (VoIP) and CCTV Camera systemsManagement and support of Network Printers, shared devices, and peripheral hardwareImplementation and maintenance of IT security measures for all systems, including server security, network security, user access control, antivirus, firewall, and malware protectionRegular system updates, patch management, data backup monitoring, and recovery support to ensure system stability and data protectionMonitoring system logs and identifying, reporting, and resolving security vulnerabilities or operational risksOperational and technical support for BKMEA’s automation software, including Worker Biometric Software, UD Software, Membership Management Software, and other in-house or third-party applicationsProviding IT troubleshooting and desk support to users and resolving day-to-day technical issuesCoordinating with software, hardware, and service vendors for support, maintenance, and upgradesSupporting overall IT operations and ensuring uninterrupted IT services across officesEducational RequirementsMinimum B.Sc. Engineering in Computer Science & Engineering (CSE) / Information Technology (IT) or any other relevant discipline from a recognized university.Experience RequirementsAt least 1 year(s)The applicants should have experience in the following business area(s):GarmentsJob LocationNarayanganj Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360491300/",
    "job_id": "4360491300",
    "source": "linkedin",
    "company_name": "Golden Agri-Resources (GAR)",
    "job_title": "Financial Controller",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "*This position is assigned to SJE Management Pte Ltd, which is an affiliated entity to Golden Agri Resources. SJE Management Pte Ltd is a Singapore registered company involved in investment and management services. Key Responsibilities:Review of operation + Report generationReview payment lists and expense records (in excel templates)Upload records to accounting systemBank reconciliation for expense and cash balances against reports in accounting systemMaintain records in accounting systemGenerating various expense report, Expense budget variance reports, Cashflow reports, weekly cash reportsAccounting for financial, tax and statutory reportingPreparing financial statements for entitiesPreparing GST assessments for payments to / refunds from IRASPreparing financials for statutory reportsEnsure that all statutory and internal deadlines are met for reporting purposesAssisting with yearly budget forecast and periodic budget updatesCollaboration with other partiesMeeting info requestsManaging and reviewing operations processes as part of internal controlsLiaise with tax agents and external service providersJob Requirements:Experience from Fund admin service provider or inhouse investment company (PE, VC, Hedge funds) and/or Family OfficeBachelors in AccountingGood communication and interpersonal skills to liaise with different partiesWell versed using MS Office and accounting systems Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361793990/",
    "job_id": "4361793990",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "PHP / Laravel Developer (On-Site) (For Orfactor) - Job ID: 1457162",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370200963/",
    "job_id": "4370200963",
    "source": "linkedin",
    "company_name": "BRAC Bank PLC",
    "job_title": "Manager & Unit Head, R&D (AI and ML), Process Automation and R&D",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353816587/",
    "job_id": "4353816587",
    "source": "linkedin",
    "company_name": "E.ON Hungária Csoport",
    "job_title": "Senior Business Controller",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361497888/",
    "job_id": "4361497888",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Assistant Executive (Accounts) (For Synapse Medical Academy) - Job ID : 1457599",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361447939/",
    "job_id": "4361447939",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Manager, VAT & TAX - For A Reputed Company - Job ID: 1456940",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360532105/",
    "job_id": "4360532105",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "HR Manager- For Civic Real Estate Ltd - Job ID: 1456293",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354019770/",
    "job_id": "4354019770",
    "source": "linkedin",
    "company_name": "Alcon",
    "job_title": "Senior Számviteli és Adózási Szakértő (IFRS, Statutory Reporting, Tax Compliance)",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361841203/",
    "job_id": "4361841203",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "In-Charge, Credit Recovery - (For Walton Hi-Tech Industries PLC.) - Job ID - 1457368",
    "location": "Mirpur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358103873/",
    "job_id": "4358103873",
    "source": "linkedin",
    "company_name": "Morgan Stanley",
    "job_title": "Quantitative Analyst - Model Risk Management",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356007021/",
    "job_id": "4356007021",
    "source": "linkedin",
    "company_name": "bp Launchpad",
    "job_title": "Credit and Trade Loan Analyst",
    "location": "Budapest, Budapest, Hungary",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Full timeCredit and Trade Loan AnalystHungary, Budapest2026-01-2714 days agoFinanceApply Facebook Linkedin Twitter Instagram Email Copy Link Full timeRQ104514Credit and Trade Loan AnalystHungary, BudapestSave job iconSave JobYou have successfully copied the job URL to clipboard!Job categoryFinanceExperience levelIntermediateRelocation availableRelocation may be negotiable for this roleJob typeProfessionalsTravel requiredNo travel is expected with this roleJob codeRQ104514Job categoryFinanceJob typeProfessionalsExperience levelIntermediateTravel requiredNo travel is expected with this roleRelocation availableRelocation may be negotiable for this roleJob codeRQ104514Job DescriptionOur purpose is to deliver energy to the world, today and tomorrow. For over 100 years, bp has focused on discovering, developing and producing oil and gas in the nations where we operate. We are one of the few companies globally that can provide governments and customers with an integrated energy offering. Delivering our strategy sustainably in is fundamental to achieving our ambition to be a net zero company by 2050 or sooner.About The RoleThe Credit and Trade Loan Analyst is accountable to perform credit assessment and trade loan activities by calculating and evaluating trade loans, preparing and submitting credit and trade loan evaluations for authorizations, evaluating, monitoring and reporting trade finance performance. Credit and Trade loan Analyst is also accountable to perform credit analyzes for the designated customers portfolio to ensure trade debtor balances are tightly controlled and credit risk appraisal of new and existing customers is carried out adhering to the Credit Policy. The job holder should have a deep understanding of Castrol Credit Policy & Trade Loan policies and of the relevant systems and tools and manage/balance diverse demands from Partners within multiple countries. The Credit and Trade Loan Analyst has a strong influence to enable business with the customers at all and/or to reach strategic goals in trade investments.Key AccountabilitiesPerform regular and event driven Credit Assessments and Trade Loan evaluations based on the Credit Policy, Trade Loan Policy, and BP DoA by:Perform Customer Due Diligence to understand the financial and commercial prospects of the customerWork together with sales to collect the vital financial documents from the customer for a timely evaluation of their creditworthinessPrepare, validate & submit trade loan proposals with credit appraisal for approval and ensure that they are aligned with BP financial guidelines (eg IRR, Credit Risk, DoA)Prepare high quality Credit Assessments, Authority to Negotiate (ATN) and Financial Memorandum (FM), submit for approval and ensure documentation in an appropriate mannerReview and ensure that Trade Loan and Credit Risk data in local ERP and other relevant systems is accurately set upUse personal judgement and initiative to develop effective and constructive solutions to challenges in trade loan evaluation, credit risk and performance managementInvestigate, plan and implement strategically effective and relevant methods to improve the deals and meet customer expectationsDefine the overall need and type of securities, coordinate with sales, verify customer and/or banks details on securitiesTake decision to block/ unblock customers from deliveryMonitor customer’s portfolio regarding alerts, take the vital actions to avoid bad debtsProactively lead calls across different functions to ensure risk taken is counterbalanced by profitable returnRegular meetings with the business to be involved in the developments on the market, the business strategies, customer needs etc.Trade Loan and Credit Exposure Management, Monitoring, Forecastingbe able to identify key, strategic or high risks related to trade investments and take actions together with the relevant partners.Evaluate and articulate the underlying delivery of actuals vs. the target (volume and Gross Margin) on a monthly basis and take action as per the Contract.Monitoring of credit exposure versus credit limit, delivery of KPI’sTake full ownership of the assigned Trade Loan and Credit portfolio, take part in decision making from commercial point of view together with partners (Sales, Finance & Credit management).Understand the business and drive execution bykeep close contact to sales by attending and/or organizing regular meetings on Trade Loan and Credit Assessment reviews and be a business partner to balance the risk and enable the businessResolve internal & external queries and issuesReporting byPerform various regular reporting activities and ad hoc reporting’s in an accurate and timely manner; Reconcile and validate Trade Loan accounts and be able to analyze and explain Trade Loan P&L impact.Partner management with all relevant people inside or outside of Credit cross FBT and cross businessCompliance with the relevant Trade Loan and Credit Policy, and QMS/EMS systems in FBT.Identify",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366680001/",
    "job_id": "4366680001",
    "source": "linkedin",
    "company_name": "Suzuki Finance Indonesia",
    "job_title": "BUSINESS RELATIONSHIP OFFICER (BRO) - Jakarta Selatan",
    "location": "Jakarta, Jakarta, Indonesia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362220303/",
    "job_id": "4362220303",
    "source": "linkedin",
    "company_name": "365 Digital",
    "job_title": "Commerce Media Intern (Junior Talent Program)",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359888925/",
    "job_id": "4359888925",
    "source": "linkedin",
    "company_name": "Houst",
    "job_title": "Interim Head of Finance",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Houst is hiring an Interim Head of Finance to take ownership of group wide financial management during a period of change and scale. You will lead reporting, compliance, forecasting, and financial discipline across multiple jurisdictions, while staying hands on in the detail.This is a player/manager role, and suited to candidates with prior people management experience in a hands-on operational environment.This role provides financial backbone and credibility while the wider finance leadership structure is rebuilt. You will have visibility, influence, and real ownership, without carrying the entire strategic burden alone.Candidates must have a degree in Finance, Accounting, or a related field, and hold a recognised professional qualification such as CIMA, ACA, ACCA, CCMA, or an MBA. We are looking for individuals with client-side experience in a management capacity, ideally in a global, tech-enabled startup or scaleup environment. Practice-only experience will not be considered; this role requires hands-on operational and strategic exposure to running finance in a growing business.What You Will Be DoingOwn monthly management accounts, reporting packs, and variance analysis for the groupManage multi entity consolidation and intercompany accountingOversee statutory reporting, audits, and tax compliance across jurisdictionsMaintain strong financial controls, policies, and documentationLead budgeting and forecasting cycles in collaboration with leadershipProvide clear financial insight to support decision making, pricing, and cost controlManage and mentor junior finance team members where applicableAct as the main finance point of contact for senior stakeholdersPartner closely with Operations and Commercial teams to improve margins and performanceStep into operational finance work when needed, no ivory tower behaviour hereRequirementsDegree in Accounting or FinanceProfessional qualification such as SAICA, SAIPA, ACCA, CIMA, or similarExposure to FP&A, unit economics, and commercial finance5 plus years experience in financial management or group reporting rolesStrong knowledge of IFRS and compliance requirementsExperience with multi entity and multi currency businessesAdvanced Excel or Google Sheets capabilityXero experience requiredComfortable operating in fast growth, high change environmentsClear communicator who can explain numbers to non finance humans Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360100992/",
    "job_id": "4360100992",
    "source": "linkedin",
    "company_name": "TestHiring",
    "job_title": "Require an accountant in Dibba, Fujairah",
    "location": "Dibba Al Bayah, Musandam Governorate, Oman",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357456257/",
    "job_id": "4357456257",
    "source": "linkedin",
    "company_name": "Capitec",
    "job_title": "Credit Intelligence Analyst I",
    "location": "Stellenbosch, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Apply ByWe're on the lookout for energetic, self-motivated individuals who share our passion for service in the banking industry. To be part of the journey, follow the steps below: To see what life at Capitec is all about and complete a short assessment, please click here! Once you have completed the above finalize your application by clicking apply below.Purpose StatementTo optimise credit intelligence performance, and minimise credit risk through: Independently conducting complex quantitative data analysis and delivering analytical output that will enable insights and inform business decision making. Proposing and executing solutions based on analytical outputs.Proposing and working with senior team members to build new statistical models informing credit decisions. ExperienceMinimum:2-4 years’ experience in retail credit analysis (including SQL programming, diagnostic analytics, statistical modelling and data visualisation). In case of Honours degree: 1 - 3 years’ experience in retail credit analysis (including SQL programming and descriptive analytics). IdealPortfolio specific experienceCapitec Bank experienceQualifications (Minimum)Bachelor's Degree in Finance or Statistics Qualifications (Ideal Or Preferred)A relevant post-graduate qualification in Finance or Statistics KnowledgeN/ASkillsCommunications Skills Presentation Skills Reporting Skills Conditions of EmploymentClear criminal and credit record Capitec is committed to diversity, applications to this position will strictly be considered in support of our employment equity goals. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363866867/",
    "job_id": "4363866867",
    "source": "linkedin",
    "company_name": "Datonomy Solutions",
    "job_title": "Finance Business Analyst at Datonomy Solutions",
    "location": "Cape Town, Western Cape, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355772714/",
    "job_id": "4355772714",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Executive-Accounts & Finance (For Capita Group) - Job ID : 1453102",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371141673/",
    "job_id": "4371141673",
    "source": "linkedin",
    "company_name": "Uplift People Consulting",
    "job_title": "Finance Executive",
    "location": "Maltepe, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368980199/",
    "job_id": "4368980199",
    "source": "linkedin",
    "company_name": "Realestate.com.kh",
    "job_title": "Finance & Transaction Manager",
    "location": "Phnom Penh, Phnom Penh, Cambodia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357011649/",
    "job_id": "4357011649",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Business Development Officer - Personal Loan (Third Party Employment) (For IPDC Finance PLC) - Job ID : 1455258",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "IPDC Finance PLC is looking for Business Development Officer - Personal Loan (Third Party Employment)Key PointsResponsible to achieve set target in terms of new business acquisition, portfolio growth and NPL management of the personal loan. The incumbent will be recruited through outsource company.Job Description / ResponsibilityAchieve set target in terms of new business acquisition for personal loan.Solicit potential customers by visiting multinational, local large companies, doctors’ segment and other valued potential customers.Increase the clients base and build strong relationships with the employees of different corporates, doctor segment and other professionals.Manage NPL of personal loan within the budgetary threshold.Capitalize on cross sell opportunities and organize sales promotion in different corporate organizations mainly multinational and local large companies.Educational RequirementsBachelor/HonorsExperience RequirementsAt least 2 year(s)The applicants should have experience in the following business area(s): Banks,LeasingJob LocationDhaka, Khulna, Chattogram (Chattogram Sadar) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371767263/",
    "job_id": "4371767263",
    "source": "linkedin",
    "company_name": "Rewa Soft Pvt. Ltd.",
    "job_title": "Operations & Administration Associate (Trainee)",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Rewa Soft Pvt. Ltd. is seeking a highly organized, detail-oriented, and proactive Operations & Administration Associate (Trainee) to support client coordination, operational workflows, and internal processes.This role is ideal for someone who enjoys managing communication, streamlining operations, and ensuring smooth execution across teams, and who is motivated to grow into a leadership role in operations over time.Key ResponsibilitiesClient CoordinationManage client communication through WhatsApp, calls, and email professionally and timelySend updates, invoices, receipts, and payment-related communicationsEnsure records of client interactions are properly maintainedOperational SupportConduct, coordinate, and document daily stand-up meetingsMaintain organized document management systems for easy retrieval and trackingAssist teams in executing projects efficiently by providing structured operational supportAdministrative & Financial SupportMaintain records of day-to-day transactions, receivables, and payablesCoordinate internal and external documentation for smooth workflowSupport HR and administrative activities as requiredWho We’re Looking ForGraduate in Commerce, IT, or related fieldStrong written and verbal communication skillsHighly organized, detail-oriented, and punctualProactive, fast learner, and able to manage multiple tasks effectivelyProfessional, calm, and reliable in client and team interactionsWhat You’ll GainHands-on experience in operations management and client coordinationExposure to professional workflows, documentation standards, and project processesOpportunity to grow into an Operations Coordinator / Operations Manager role based on performanceWhy Rewa SoftStructured, process-driven work cultureOpportunity to contribute to real projects and client engagementsMentorship and growth pathway for high-performing team membersCollaborative environment with clarity and professional standards﻿Interested?Send your CV and a brief note highlighting why operations and professional coordination excites you to hr@rewasoft.com.np.#OperationsAssociate,#AdministrationJobs, #OperationsJobs, #ProfessionalGrowth, #ClientCoordination, #TeamOperations, #NepalJobs, #GraduateJobsNepal, #TraineePosition, #RewaSoft, #ITandOperationsCareers Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321226100/",
    "job_id": "4321226100",
    "source": "linkedin",
    "company_name": "WeFlow Agency",
    "job_title": "Office Secretary - Political Staff",
    "location": "Kathmandu, Bāgmatī, Nepal",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346583375/",
    "job_id": "4346583375",
    "source": "linkedin",
    "company_name": "Eurofins EnvironeX",
    "job_title": "Assistant(e), ressources humaines",
    "location": "Québec, Quebec, Canada",
    "employment_type": "",
    "date_posted": "",
    "job_description": "Eurofins : où la science devient un superpouvoir ! En tant que leader mondial des sciences de la vie, nous offrons une gamme unique de services d’essais analytiques pour garantir la sécurité alimentaire, environnementale et pharmaceutique. Avec notre équipe de plus de 63 000 héros répartis dans 60 pays, nous transformons votre environnement en un endroit plus sûr, plus sain et plus durable.Rejoignez l’équipe en tant qu’Assistant(e), ressources humaines ! Relevant de la Directrice, Ressources humaines - Opérations, vous fournirez un soutien continu à l’ensemble de l’équipe RH et serez un acteur clé dans le processus de recrutement et d’intégration. Il/Elle devra maintenir et mettre en place les bonnes pratiques en matière d’accueil et intégration des nouveaux employés et assurer une gestion optimale des dossiers d’employés. Il/Elle apporte un support administratif général à l’équipe des ressources humaines, lorsque requis.Vos responsabilités :Assurer l’intégration physique des nouvelles recrues (présentation de l’entreprise, de ses valeurs, des principales politiques RH etc.);Assurer l’intégration administrative des nouvelles recrues (vérifier la complétude et la validité des documents d’embauche, les transmettre au service paie et les classer dans le dossier employé);Effectuer, dans les délais impartis, l’ensemble des demandes d’accès informatiques et de matériel informatique et en assurer le suivi durant tout le cycle de vie de l’employé en entreprise ;Piloter et déployer le plan de formations corporatives obligatoires (Assurance qualité, Eurofins, Simdut) pour tous les employés en assurant l’assistance technique au besoin;Assurer la gestion de différents programmes RH corporatifs (anniversaires d’employés, programmes de reconnaissance, etc.);Administrer la plateforme d’évaluation de rendement;Contribuer à l'amélioration continue des processus administratifs et des pratiques RH de l'entreprise;Gérer les commandes des vêtements corporatifs;Gestion de la section RH dans l’Intranet;Rédiger diverses communications internes et en assurer la transmission aux employés;Créer divers sondages RH et préparer l’analyse des résultats;Apporter un support à l’équipe recrutement (peut être appelé à faire des préqualifications téléphonique);Participer activement à l’organisation d’évènements corporatifs;Point de contact principal dans le cadre de divers partenariats (transport, vaccination, traiteurs…);Réaliser des entrevues de départ au besoin.Ce que nous offrons :Possibilité d’adhérer au régime d’assurance collective après 3 moisPossibilité de cotiser à un REER collectif et participation de l’employeur selon le % préétabli;2 semaines de vacances par année;5 jours de congés personnels;Cellulaire fourni par l’entreprise ou allocation pour cellulaire personnel, au choix de l’employé;Programme d’aide aux employés;Possibilité d’effectuer du télétravail en fonction des besoins opérationnels, équipement fourni par l’entreprise (ordinateur portable, écran supplémentaire, souris, clavier);Les horaires peuvent être flexibles, selon les besoins opérationnels;Programme de reconnaissance des années de serviceExigences :Diplôme ou attestation d’études collégiales en gestion des ressources humaines ou l’équivalent;1 à 2 ans d’expérience reliée à la fonctionMaîtrise du français et de l’anglais (oral et écrit) en raison des communications régulières avec des employés situés à l’extérieur du QuébecBonne connaissance de la suite Microsoft OfficeHabileté à utiliser un SIRH (connaissance de la plateforme Talentsoft, un atout) Compétences demandées :Habiletés de communications;Rigueur, sens de l’organisation, de l’urgence et des priorités;Grand souci du détail;Possède un haut niveau d’intégrité, de discrétion et de réactivité;Démontre une approche collaborative;Projette une image professionnelle;",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4371414696/",
    "job_id": "4371414696",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "bout Turing:Based in San Francisco, California, Turing is the world’s leading research accelerator for frontier AI labs and a trusted partner for global enterprises deploying advanced AI systems.Turing supports customers in two ways: first, by accelerating frontier research with high-quality data, advanced training pipelines, plus top AI researchers who specialize in coding, reasoning, STEM, multilinguality, multimodality, and agents; and second, by applying that expertise to help enterprises transform AI from proof of concept into proprietary intelligence with systems that perform reliably, deliver measurable impact, and drive lasting results on the P&LAbout the Role:We are looking for a detail-oriented Business Analyst to support evaluation and annotation workflows focused on quality, accuracy, and structured reasoning. This role is ideal for someone who is comfortable working with digital tools, performing side-by-side evaluations, and providing clear, well-supported justifications based on fact-checking.Responsibilities:Perform side-by-side (SxS) evaluations on GHD, comparing outputs and assessing quality, accuracy, and relevance.Conduct fact-checking to validate information and identify inconsistencies or inaccuracies.Provide detailed, well-structured justifications to support evaluation decisions.Follow established evaluation guidelines and quality standards consistently.Use browser-based tools and extensions to support analysis and review tasks.Execute simple command-line instructions when required to support evaluation workflows.Document findings clearly and communicate insights to stakeholders when needed.Requirements:Solid comfort using a computer in a professional setting.Experience working with browser extensions and online tools.Ability to run basic command-line commands (no advanced programming required).Strong analytical and critical thinking skills.High attention to detail and ability to justify decisions clearly and objectively.Comfortable working with evaluation frameworks, comparisons, and structured analysis.Good written communication skills in English.Nice to Have:Previous experience with evaluation, annotation, QA, or audit-type work.Familiarity with data quality, content evaluation, or model/output assessments.Background in business analysis, operations, or process improvement.Perks of Freelancing With Turing:Competitive compensation based on experience and expertise.Flexible working hours and a fully remote environment.Opportunity to contribute to impactful research initiatives.Potential for contract extension based on performance and project needs.Offer Details:Commitment Required: 30 hours per week minimum.Engagement Type: Contractor/Freelancer (no medical or paid leave).Time Overlap: Some overlap with UTC-8:00 (2–5 hrs/day) America/Los_Angeles.Application Process:Shortlisted candidates will be invited to complete an analytical challenge.Once the assessment is cleared, you’re ready to start contributing!After applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.Know amazing talent? Refer them at turing.com/referrals, and earn money from your network.",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4137383121/",
    "job_id": "4137383121",
    "source": "linkedin",
    "company_name": "For LAMB (Job ID",
    "job_title": "Finance Coordinator (Re-advertisement)",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4208658880/",
    "job_id": "4208658880",
    "source": "linkedin",
    "company_name": "LinkedIn",
    "job_title": "Accountant- For Agrigate Network Limited- Job ID : 1357187",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4305323249/",
    "job_id": "4305323249",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Assistant Manager, Accounts & Admin (For Eon Group of Industries ...",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352414940/",
    "job_id": "4352414940",
    "source": "linkedin",
    "company_name": "For Sinha Agrobased Industries- Job ID ...",
    "job_title": "Agricultural Accountant",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4295663088/",
    "job_id": "4295663088",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Bdjobs.com নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4086289589/",
    "job_id": "4086289589",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "City Bank নিয়োগ",
    "location": "Rangpur, Bangladesh",
    "employment_type": "",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-fallback"
  }
]