[
  {
    "url": "https://bdjobs.com/h/details/1456828?ln=1",
    "company_name": "SEBPO",
    "job_title": "Analyst - Data Solutions",
    "location": "Dhaka (Mohakhali)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Analyst - Data Solutions : SEBPO Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SEBPO Analyst - Data Solutions Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 40 Age: 22 to 35 years Location: Dhaka (Mohakhali) Salary: Tk. 16000 - 18000 (Monthly) Published: 03 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 22 to 35 years Basic computer skills with good command of English reading and understanding. Ability to summarize and analyze English articles effectively. Attention to detail with a focus on accuracy. This is NOT a technical role related to Data Science, Programming, Statistics, or Database Management. Responsibilities & Context 09 hours per day. Weekly 02 days holiday + 05 working days on a roster basis (03 Shifts). The role primarily involves research, reading, reviewing, and summarizing content. Applicants with strong English comprehension and analytical abilities are encouraged to apply. Analyzing English news articles and aggregating relevant information. Reviewing and cross-matching demographic information from various sources and identifying potential matches. Conduct online research and due diligence tasks. This role requires flexibility to work in rotational shifts (Morning: 7:00 AM – 4:00 PM, Evening: 1:00 PM – 10:00 PM, Night: 10:00 PM – 7:00 AM). Skills & Expertise Communication in English Computer Literacy Content Research Data analysis Data Management Statistical Data Analysis Suggested by Content Research Data analysis Data Management Statistical Data Analysis Compensation & Other Benefits Weekly 2 holidays,Insurance Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Training period 03 months. Training allowance BDT. 11,000 per month (for 03 months). Scope for overtime and holiday duty allowance. Life insurance, medical insurance, and discounts on diagnostics. Unlock an additional BDT. 3,000 after confirmation as a performance bonus for achieving targets. Workplace Work at office Employment Status Full Time Job Location Dhaka (Mohakhali) Job Highlights SEBPO is a global outsourcing partner specializing in Ad Operations, Data Solutions, Creative and Software services. Recognized among the USA`s 5000 Fastest Growing Private Companies and named a Top Global Outsourcing Company by IAOP. Read Before Apply This role requires flexibility to work in rotational shifts ( Morning: 7:00 AM - 4:00 PM, Evening: 1:00 PM - 10:00 PM, Night: 10:00 PM - 7:00 AM ). Candidates applying must have completed their undergraduate degree, honors, or bachelor`s program . Company Information SEBPO Follow More jobs from this company Address: SEBPO, Level 7, Monem Business District, 111, Bir Uttam C.R. Dutta Road, Karwan Bazar, Dhaka-1205. Website: https://sebpo.com Business: SEBPO i"
  },
  {
    "url": "https://bdjobs.com/h/details/1455170?ln=1",
    "company_name": "Bdjobs.com Limited",
    "job_title": "Corporate Sales Executive - e Learning",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Corporate Sales Executive - e Learning : Bdjobs.com Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bdjobs.com Limited Corporate Sales Executive - e Learning Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 23 to 28 years Location: Dhaka Salary: Negotiable Published: 29 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 23 to 28 years Responsibilities & Context This role requires a strong understanding of the sales process, excellent communication skills, and the ability to build and maintain relationships with clients. The successful candidate will be able to identify new business opportunities and develop strategies to increase revenue. Develop and execute sales strategies to meet revenue targets Identify new business opportunities and build relationships with potential clients Manage and grow existing client accounts Collaborate with internal teams to ensure client satisfaction Prepare and deliver sales presentations to clients The candidates will have to work in the E-Learning Sales & Marketing team of the company. The job will require lots of Corporate client visits. Additional responsibilities include key-account management, Event management, fair participation etc. Skills & Expertise Corporate Sales and Marketing Marketing Sales & Marketing Sales Training Compensation & Other Benefits Conveyance Bill Mobile Bill Lunch Allowance Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights Corporate sales job Field Job Sales Material - Training National Universities , Public Universities- Dhaka University, Jagannath university, Jahangirnagar University candidates will get high preference. Read Before Apply It`s a core field job , If any candidate is not interested in field visit no need to apply. Job Platform experienced Candidates will get high preference . Job Area - Dhaka City Company Information Bdjobs.com Limited Follow More jobs from this company Address: 8th Floor (West), BDBL Building (Old BSRS) 12, C/A, Dhaka 1215 Website: https://bdjobs.com/ Business: Established in 2000, Bdjobs.com Limited has been operating the largest online employment exchange of Bangladesh for the last 25 years. www.bdjobs.com is one of the most visited web sites in the country. It is also among the top five (5) most visited job portals in South Asia. Currently the company offers the following position for immediate recruitment. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাক"
  },
  {
    "url": "https://bdjobs.com/h/details/1453714?ln=1",
    "company_name": "Wener Trading Co.",
    "job_title": "Executive Graphics & Digital Marketing",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Executive Graphics & Digital Marketing : Wener Trading Co. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Wener Trading Co. Executive Graphics & Digital Marketing Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At least 25 years Location: Dhaka Salary: Negotiable Published: 26 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years The applicants should have experience in the following business area(s): Electrical Accessories / Equipment Strong expertise in print packaging design, creating 3D visualizations, and developing realistic product mockups for marketing and production purposes Responsibilities & Context Design and develop retail-ready packaging (cartons, blister packs, pouches, and boxes) for switches, sockets, extension cords, and lighting products. Create realistic 3D product renders and animations for use in packaging, e-commerce listings, and marketing materials. Develop, implement, and manage digital marketing campaigns across Facebook, Google, YouTube, and other social media platforms. Plan and execute SEO, SEM, and PPC campaigns to improve website visibility and traffic. Create engaging content for social media, ad campaigns aligned with brand strategy. Manage and optimize company websites and landing pages for better user experience and lead conversion. Monitor and analyze performance metrics (CTR, CPC, conversion rate, engagement rate, etc.) and prepare performance reports. Coordinate with creative, design, and content teams to ensure timely delivery campaigns. Handle online reputation management (ORM) through feedback tracking and response on digital channels. Collaborate with sales and management teams to align marketing activities with business objectives. Stay updated on the latest digital marketing trends, tools, and best practices. Create high-quality brochures, leaflets, catalogs, posters, POSM, and trade marketing materials Ensure all designs strictly follow brand guidelines and standards Prepare print-ready files, ensuring accuracy in dielines, bleed, resolution, and color profiles Coordinate with printers and vendors to maintain output quality and cost efficiency Revise and refine designs based on stakeholder feedback and market requirements Maintain visual consistency across all offline and online brand materials Stay updated with print trends, packaging innovations, materials, and finishing techniques Stay updated on design trends, AI-generated visuals, 3D animation tools, and emerging technologies to enhance creative execution. Motion Contents Maintain consistency brand identity across all platforms Skills & Expertise Adobe Illustrator Adobe Photoshop Advertising & Promotion Brand Promotion Digital Marketing (Social Media Marketing) Email"
  },
  {
    "url": "https://bdjobs.com/h/details/1457482?ln=1",
    "company_name": "Shekhabo Ltd",
    "job_title": "Video Editor Intern",
    "location": "Dhaka (DOHS Mohakhali)",
    "salary": "Tk. 25000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Video Editor Intern : Shekhabo Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shekhabo Ltd Video Editor Intern Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 18 to 30 years Location: Dhaka (DOHS Mohakhali) Salary: Tk. 25000 - 30000 (Monthly) Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 30 years Responsibilities & Context Edit educational course videos featuring industry experts , ensuring clarity, pacing, and high production quality suitable for an edtech learning environment. Create engaging learning content by editing course modules and lessons with appropriate motion graphics, visual hierarchy, and on-screen design. Produce short-form marketing and social media videos using creative concepts, dynamic cuts, and motion design aligned with current edtech trends. Perform quick-turnaround edits for promotional campaigns, announcements, and course launches. Apply basic motion graphics and animations to enhance learning outcomes and viewer engagement. Handle audio editing and sound engineering , including noise reduction, voice clarity, and audio balancing. Collaborate with the content, marketing, and academic teams to maintain consistent visual and brand standards across all video content. Skills & Expertise Adobe After Effects Adobe Illustrator Adobe Photoshop Adobe Premiere Pro DaVinci Resolve Suggested by Adobe After Effects Adobe Photoshop DaVinci Resolve Adobe Premiere Pro Workplace Work at office Employment Status Full Time Job Location Dhaka (DOHS Mohakhali) Company Information Shekhabo Ltd Follow Address: 3A, House 468, Road 31, Mohakhali DOHS, Dhaka-1206 Website: https://shekhabo.com/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE"
  },
  {
    "url": "https://bdjobs.com/h/details/1457789?ln=1",
    "company_name": "Wener Trading Co.",
    "job_title": "Sr. Executive (HR & Admin)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Sr. Executive (HR & Admin) : Wener Trading Co. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Wener Trading Co. Sr. Executive (HR & Admin) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 25 years Location: Dhaka Salary: Tk. 30000 - 40000 (Monthly) Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Preferably seeking candidates to work in the HR and Administration department of the electrical industry (e.g., switch sockets, LED lights, fans, circuit breakers, exhaust fans, etc.). Must have strong IT skills: operating sales software, HR software, email communication, and proficiency in Microsoft Office. Must have drafting skills in both Bangla and English. Responsibilities & Context Maintain daily records of attendance and leave for all employees. Manage the recruitment process, including handling the joining and departure procedures of employees. Maintain various files, including employee personal files, recruitment files, and other benefits-related documents. Oversee day-to-day office operations, ensuring a clean, organized, and efficient work environment. Coordinate meeting and event arrangements. Handle incoming and outgoing correspondence, including emails, phone calls, and mail. Assist in preparing attendance and leave reports, presentations, appraisals, and other documents. Perform day-to-day administrative and HR tasks as instructed. Demonstrate strong attention to detail and the ability to maintain accurate records. Exhibit a strong work ethic, reliability, and a high level of integrity. Implement core HR practices in accordance with company policy to ensure professional HR services and continuously review best practices. Maintain HRIS software, enter employee personal, attendance, and leave data, and generate reports. Manage payroll administration. Prepare and draft various types of official correspondence in both Bangla and English. Possess sound knowledge of Bangladesh Labor Law. Skills & Expertise Labor Law Leadership and Good Communication skill. letter drafting bangla English Microsoft Office Recruitment & Selection Working under pressure crisis management ERP Software HRIS/ HR Database Management Interpersonal Skill Suggested by Human Resource Management HRIS/ HR Database Management Compensation & Other Benefits Yearly performance wise rewards as per company policy. Daily lunch allowance. Mobile bill allowance. Yearly 02 festival bonuses. Provident Fund, Gratuity, Omrah Haj. Yearly Earn Leave Encashment. Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Wener Trading Co. Follow More jobs from this company Address: House-6, Road"
  },
  {
    "url": "https://bdjobs.com/h/details/1458086?ln=1",
    "company_name": "ZNRF University of Management Sciences",
    "job_title": "University Admission Counselor",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "University Admission Counselor : ZNRF University of Management Sciences Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ZNRF University of Management Sciences University Admission Counselor Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 3 Age: 23 to 30 years Location: Dhaka Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 23 to 30 years Responsibilities & Context Student Recruitment & Enrollment Proactively counsel prospective students and parents on academic programs, admission requirements, and career pathways to achieve enrollment targets. Lead Management & Follow-up Manage inquiries from multiple channels (walk-ins, phone, email, social media) and ensure timely follow-up to convert prospects into enrolled students. Admission Counseling & Guidance Provide accurate information regarding programs, fees, scholarships, policies, and application procedures in a professional and student-friendly manner. Application Processing Support Assist students with application completion, document verification, and admission formalities to ensure a smooth enrollment experience. Marketing & Outreach Activities Participate in college visits, education fairs, seminars, open days, and promotional campaigns to generate leads and increase brand visibility. Relationship Building Build strong relationships with students, parents, schools, and internal departments to enhance trust and long-term engagement. Target Achievement & Reporting Meet or exceed monthly and semester enrollment targets and prepare regular reports on leads, conversions, and student feedback. Data Management Maintain accurate student records, inquiry logs, and follow-up status in the admission management system. Student Experience Enhancement Ensure a positive counseling experience that reflects the university’s values and supports student retention. Process Improvement Provide insights to management on market trends, competitor activities, and student preferences to improve recruitment strategies. Skills & Expertise Friendly and responsive Good comunication skill Proactive and Positive attitude Should have capability to work under pressure Suggested by admission consultancy Data Management Relationship Marketing Sales & Marketing Student Counseling Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Friendly working environment High career growth opportunity Candidates from following areas will get preference: Badda, Rampura, Banasree, Aftabnagar, Malibag, Hatirjheel, Shahjadpur. Read Before Apply Interested candidates may apply at bdjobs.com or may mail their CVs at info@zums.edu.bd Company Information ZNRF University of Management Sciences Follow Address: F-15, Pragati Sarani, Middle Badda, Dhaka-12"
  },
  {
    "url": "https://bdjobs.com/h/details/1459055?ln=1",
    "company_name": "RGR Sweater Ltd.",
    "job_title": "Medical Assistant",
    "location": "Gazipur (Sreepur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Medical Assistant : RGR Sweater Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List RGR Sweater Ltd. Medical Assistant Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur (Sreepur) Salary: Negotiable Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Good communication skills Basic computer literacy Ability to handle emergency situations effectively Responsible, disciplined, and reliable Must be willing to work in the night shift Immediate joining is required This position is open to male candidates only Responsibilities & Context Provide immediate first aid treatment and basic healthcare support to workers and staff as needed. Assist the factory doctor/nurse in delivering medical services and implementing workplace health programs. Monitor and maintain accurate employee health records. Assist in organizing health check-ups and medical camps. Manage and maintain medicine stock, first aid supplies, and medical equipment. Handle medical emergencies and coordinate with nearby hospitals when required. Ensure workplace health and safety compliance in accordance with company policy and labor law. Prepare and submit daily medical reports to management. Compensation & Other Benefits as per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Sreepur) Company Information RGR Sweater Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project "
  },
  {
    "url": "https://bdjobs.com/h/details/1459592?ln=1",
    "company_name": "TechPater",
    "job_title": "International Call Center Executive (Night Shift /Day shift)",
    "location": "Rajshahi (Rajshahi Sadar)",
    "salary": null,
    "experience": "At most 1 year",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "International Call Center Executive (Night Shift /Day shift) : TechPater Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List TechPater International Call Center Executive (Night Shift /Day shift) Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At most 35 years Location: Rajshahi (Rajshahi Sadar) Salary: Tk. 10000 - 20000 (Monthly) Experience: At most 1 year Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education O Level A Level Experience At most 1 year The applicants should have experience in the following business area(s): Direct Selling/Marketing Service Company, IT Enabled Service, Call Center Freshers are also encouraged to apply. Additional Requirements Age At most 35 years Responsibilities & Context Make outbound calls for US-based clients Communicate clearly and professionally in English Follow call scripts and company instructions Update call status and basic information in Excel/CRM Maintain call quality and meet daily targets Work according to US time zone schedules Skills & Expertise Call Center Operation Client Relationship Management Customer Service Fluent in English Speaking Suggested by Client Service/ Marketing Customer Support Compensation & Other Benefits Performance bonus Festival Bonus: 2 Salary Review: Half Yearly Employment Status Full Time Job Location Rajshahi (Rajshahi Sadar) Company Information TechPater Follow Address: Holding 111/2, Notun Bilsimla, Rajshahi Website: https://TechPater.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) f"
  },
  {
    "url": "https://bdjobs.com/h/details/1459776?ln=1",
    "company_name": "Bdjobs.com Limited",
    "job_title": "Corporate Sales Executive, Chattogram (Urgent Basis)",
    "location": "Chattogram (Chattogram Sadar)",
    "salary": null,
    "experience": "At most 1 year",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Corporate Sales Executive, Chattogram (Urgent Basis) : Bdjobs.com Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bdjobs.com Limited Corporate Sales Executive, Chattogram (Urgent Basis) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 28 years Location: Chattogram (Chattogram Sa... Chattogram (Chattogram Sadar) Salary: Negotiable Experience: At most 1 year Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Business Administration (BBA) in Marketing Master of Business Administration (MBA) in Marketing Experience At most 1 year The applicants should have experience in the following business area(s): Business-to-Business (B2B) Software and Services Startup, E-commerce, IT Enabled Service, Software Company, Training Institutes Additional Requirements Age 22 to 28 years Responsibilities & Context This role requires a strong understanding of the sales process, excellent communication skills, and the ability to build and maintain relationships with clients. The successful candidate will be able to identify new business opportunities and develop strategies to increase revenue. The candidates will have to work in the Sales & Marketing team of the company. The job will require lots of client visits Corporate office, Shop , Restaurants etc. Manage and grow existing client accounts Collaborate with internal teams to ensure client satisfaction. Prepare and deliver sales presentations to clients Additional responsibilities include key-account management, fair participation etc. Skills & Expertise Marketing Sales & Marketing Sales Executive Sales target Customer Service Compensation & Other Benefits Conveyance Bill Mobile Bill Lunch Allowance Sales Incentive Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Chattogram (Chattogram Sadar) Job Highlights Sales job Field Job Job Posting Chattogram City Read Before Apply Must be a resident of Chattogram City Job Platform experienced Candidates will get high preference . It`s a core field job , If any candidate is not interested in field visit or frequent client visits no need to apply. Male are allowed to apply Company Information Bdjobs.com Limited Follow More jobs from this company Address: 8th Floor (West), BDBL Building (Old BSRS) 12, C/A, Dhaka 1215 Website: https://bdjobs.com/ Business: Established in 2000, Bdjobs.com Limited has been operating the largest online employment exchange of Bangladesh for the last 25 years. www.bdjobs.com is one of the most visited web sites in the country. It is also among the top five (5) most visited job portals in South Asia. Currently the company offers the following position for immediate recruitment. Report thi"
  },
  {
    "url": "https://bdjobs.com/h/details/1459109?ln=1",
    "company_name": "Contrivance Technology",
    "job_title": "ফিল্ড অফিসার (এমক্যাশ সার্ভিস)",
    "location": "Dinajpur, Nilphamari, Panchagarh, Thakurgaon",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "ফিল্ড অফিসার (এমক্যাশ সার্ভিস) : Contrivance Technology Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Contrivance Technology ফিল্ড অফিসার (এমক্যাশ সার্ভিস) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Location: Dinajpur, Nilphamari, Pan... Dinajpur, Nilphamari, Panchagarh, Thakurgaon Salary: Tk. 20000 - 30000 (Monthly) Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements নুন্যতম সংশ্লিষ্ট কাজে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে।শক্তিশালী যোগাযোগ দক্ষতা এবং মানুষের সাথে ভালো সম্পর্ক স্থাপনের ক্ষমতা।স্মাটফোন ব্যবহারে সক্ষম হতে হবে। বিশেষ দ্রষ্টব্য: নারী ও পুরুষ উভয়েই এই পদের জন্য আবেদন করতে পারবেন। চাকুরির জন্য কোনো ধরনের সিকিউরিটি টাকা বা চেক জমা দেওয়ার প্রয়োজন নেই। Responsibilities & Context কনট্রিভেন্স টেকনোলজি আওতায় ইসলামী ব্যাংক বাংলাদেশ পিএলসি-এর অনুমোদিত এমক্যাশ (mCash) পরিবেশকের তত্ত্বাবধানে, নিজ এলাকায় চাকরির সুযোগ দেওয়া হচ্ছে। আগ্রহী, উদ্যমী এবং যোগ্যতাসম্পন্ন প্রার্থীদের নিম্নলিখিত পদে আবেদনের জন্য আহ্বান করা হচ্ছে। কাজের স্থান: নিজ এলাকা দায়িত্ব ও কর্তব্য: নিজ এলাকায় এমক্যাশ (mCash) সেবা প্রদান করে প্রয়োজনীয় প্রচার ও প্রসার করা। নতুন এমক্যাশ গ্রাহক তৈরি এবং এজেন্ট নিয়োগে সহায়তা করা। গ্রাহকদের মোবাইল ব্যাংকিং সুবিধা, যেমন: টাকা জমা ও উত্তোলন, ফান্ড ট্রান্সফার, বিল পেমেন্ট ইত্যাদি সম্পর্কে অবহিত করা। ঊর্ধ্বতন কর্তৃপক্ষের নির্দেশনা অনুযায়ী লক্ষ্যমাত্রা অর্জন করা। Skills & Expertise Suggested by Field Work Sales & Marketing Client Service/ Marketing Compensation & Other Benefits বেতন ও সুযোগ-সুবিধা:মাসিক বেতন: বেসিক ও টিএ/ডিএ (TA/DA) সহ মোট ২৩,০০০/- টাকা মাসিক ফিক্সড বেতন (টার্গেট পূরণ সাপেক্ষে)। টার্গেট অর্জনের ভিত্তিতে আকর্ষণীয় ইনসেনটিভ বা কমিশন পাওয়ার সুযোগ রয়েছে। পরিবেশকের  নিয়ম অনুযায়ী অন্যান্য সুবিধা প্রদান করা হবে। Workplace Work at office Employment Status Full Time Job Location Dinajpur, Nilphamari, Panchagarh, Thakurgaon Read Before Apply আবেদন প্রক্রিয়া:\nআগ্রহী প্রার্থীদের তাদের জীবনবৃত্তান্ত (CV) এবং প্রয়োজনীয় কাগজপত্র সহ সরাসরি পরিবেশকের সাথে যোগাযোগ করতে এই ফরমটি পুরন করতে হবে।\nhttps://forms.gle/4Rpc1Whw5DZ6HiRA9\nসতর্কতা:\nএই নিয়োগ বিজ্ঞপ্তিটি একটি অনুমোদিত পরিবেশকের মাধ্যমে পরিচালিত হচ্ছে। কোনো প্রকার আর্থিক লেনদেন থেকে বিরত থাকুন। Company Information Contrivance Technology Follow More jobs from this company Address: Ambari Bazar (bus-stand) Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 0189"
  },
  {
    "url": "https://bdjobs.com/h/details/1460852?ln=1",
    "company_name": "Square Toiletries Ltd.",
    "job_title": "Officer - Quality Operations",
    "location": "Narayanganj (Rupganj), Pabna",
    "salary": "",
    "experience": "2 to 3 years",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Officer - Quality Operations : Square Toiletries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Square Toiletries Ltd. Officer - Quality Operations Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: At most 30 years Location: Narayanganj (Rupganj), Pa... Narayanganj (Rupganj), Pabna Experience: 2 to 3 years Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Master of Science (MSc) Bachelor of Science (BSc) M.Sc. / B.Sc. in Chemistry/Applied Chemistry/Biochemistry from reputed University Experience 2 to 3 years The applicants should have experience in the following business area(s): Cosmetics/Toiletries/Personal Care Additional Requirements Age At most 30 years 2-3 years` experience in relevant field will get preference. Responsibilities & Context Square Toiletries Limited (STL), a sister concern of Square Group is the leading local FMCG company having multiple leading brands in its portfolio. We manufacture and market 20 brands that deliver the highest standards to the stakeholders. Wellbeing of consumer, employee and society are the three foundation pillars of the values and principles of Square Toiletries Ltd. Currently STL is looking for dynamic, hardworking, intelligent and self-driven candidates for the mentioned position: Work Station: Pabna Plant/Rupshi Plant (Narayanganj) Core Responsibilities: Monitor manufacturing and packaging activities to ensure compliance with GMP, approved procedures, and specifications Conduct line clearance activities for bulk, filling, and packaging operations Review, issue, collect and archive batch manufacturing and packaging records, ensuring accuracy and data integrity Ensure proper personnel hygiene, sanitation, and adherence to ISO 22716 GMP practices on the shop floor Participate in investigations and support implementation of CAPA for deviations, complaints and audit observations Perform in-process testing, documentation and reporting Skills & Expertise Suggested by GMP Quality Inspection Employment Status Full Time Job Location Narayanganj (Rupganj), Pabna Read Before Apply If you think you are the right person we are looking for, please submit your resume with cover letter and a recent passport size color photograph (not more than 6 months old) through e-mail at rupshi.hrd@ squaregroup.com The position and department must be mentioned in the subject line of your mail Square Toiletries Ltd. is an Equal Employment Opportunity provider Apply Procedure Email Your CV Send your CV to the given email rupshi.hrd@squaregroup.com Company Information Square Toiletries Ltd. Follow More jobs from this company Address: Samson Centre, 43 South Avenue, Road-126, Plot-CES(G) 5A, Gulshan-1, Dhaka-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদ"
  },
  {
    "url": "https://bdjobs.com/h/details/1460524?ln=1",
    "company_name": "Fashion Comfort Limited",
    "job_title": "Head of Quality Control",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Head of Quality Control : Fashion Comfort Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fashion Comfort Limited Head of Quality Control Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 30 to 45 years Location: Dhaka Salary: Negotiable Published: 18 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 30 to 45 years Responsibilities & Context The person will be required to manage the overall production, merchandising, development, marketing and other relevant aspects of a buying house in Bangladesh. Below are the main responsibilities - Sample Approval & Technical Evaluation: Evaluating development, fitting, size set, and pre-production (PP) samples to ensure they meet, buyer specifications and construction standards. Production Monitoring (Inline/Final Inspection): Conducting regular in-line, end-line, and final audits (based on AQL) to check, workmanship, measurements, and finishing quality. Corrective Actions & Reporting: Identifying, documenting, and communicating quality issues to factory management and buying house merchants to implement immediate, corrective actions. Factory Compliance & Support: Ensuring factories follow, quality SOPs and safety regulations. Supplier Quality Management: Training factory staff (GPQ) and, evaluating vendor performance to maintain high standards. Skills & Expertise Quality assurance and control Suggested by Quality Assurance Quality Control Compensation & Other Benefits Medical allowance Festival Bonus: 2 As per company policy. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Fashion Comfort Limited Follow Address: House # 198/A (3rd Floor), Eastern Road # 01, Mohakhali, Dhaka-1206, Bangladesh. Business: FCBL is a leading garments exporter that represents style and quality since 2002. We work on design supplied by the customer as well as we also provide our own design to many internationally reputable customers. Ours aspiration is to provide the best quality product to our valued customers. For every garment, we pays maximum attention to yarn/ material selection, fitting and perfect quality. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das R"
  },
  {
    "url": "https://bdjobs.com/h/details/1461017?ln=1",
    "company_name": "Confidence Power and Energy PLC. (Concern of Confidence Group)",
    "job_title": "Engineer, Operations",
    "location": "Chattogram",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Engineer, Operations : Confidence Power and Energy PLC. (Concern of Confidence Group) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Confidence Power and Energy PLC. (Concern of Confidence Group) Engineer, Operations Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Chattogram Salary: Negotiable Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Competency Requirements Technical Competencies Strong knowledge of HFO-based power plant operations. Hands-on experience with engine sets, STG, WHRB, substations, and auxiliary systems. Ability to analyse operational data and equipment performance trends. Knowledge of electrical systems including HV/MV/LV operations. Behavioural & Professional Competencies Strong sense of responsibility and accountability. Honest, hardworking, and dependable. Team-oriented with a friendly and cooperative attitude. Ability to work under pressure and during shift duties. Communication Competencies Effective verbal and written communication skills in Bangla and English. Ability to coordinate clearly with internal teams and external stakeholders (e.g., NLDC). IT & Reporting Competencies Proficient in Microsoft Office tools (MS Word, MS Excel, MS PowerPoint). Familiar with Google Docs, Sheets, and digital reporting tools. Capable of preparing structured operational and MIS reports. Responsibilities & Context Job Purpose To ensure the safe, reliable, and economical operation of the power plant by efficiently managing shift operations, operating plant equipment, maintaining accurate records, and ensuring strict compliance with safety and operational standards. Key Responsibilities Operational Excellence Ensure safe, reliable, and economical operation of the power plant, including proper shift handover and takeover. Manage and oversee shift operations effectively in the absence of the Shift In-Charge. Execute start-up, shutdown, and normal operations of engine sets, Steam Turbine Generator (STG), WHRB, auxiliaries, and associated plant systems. Perform fault diagnosis and take corrective actions to improve plant availability and reliability. Monitor, control, and analyse operating parameters of all running equipment; identify trends and recommend corrective measures. Monitoring, Reporting & Documentation Maintain all control room logbooks accurately, including: Engine Log Energy Meter Log HV/MV/LV Logs Substation Log Alternator Log DC Distribution Log, etc. Prepare and submit daily MIS, generation reports, outage/contracted reports, demand vs. load reports, plant shutdown/trip reports, incident reports, hot work permit reports, and other required documentation. Coordinate and communicate with NLDC for energy reconciliation an"
  },
  {
    "url": "https://bdjobs.com/h/details/1461040?ln=1",
    "company_name": "Classic Education Group",
    "job_title": "Counsellor/ Senior Counsellor",
    "location": "Dhaka (DOHS Mohakhali)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Counsellor/ Senior Counsellor : Classic Education Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Classic Education Group Counsellor/ Senior Counsellor Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 32 years Location: Dhaka (DOHS Mohakhali) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 22 to 32 years Responsibilities & Context Classic Education Group is a leading student consultancy firm dedicated to guiding students through the complexities of university admissions. We pride ourselves on providing personalized support and expert advice to help students achieve their academic and career goals. Job Description: The Counsellor/senior counsellor is responsible for guiding students/clients through the overseas education or migration process. This role includes providing accurate program advice, assessing applicant eligibility, maintaining client communication, ensuring quality documentation, and achieving monthly conversion targets. The senior counsellor also supports junior counsellors through training, supervision, and performance guidance. Provide expert counselling to students regarding university options, course selection, and career pathways. Assist students in preparing and submitting university applications, scholarship applications, and visa documentation. Manage the end-to-end student journey: initial consultation, document assessment, SOP review, GTE, tests, interviews, personal statements & visa lodgement Guide students through the admission process, including application preparation, documentation, and submission. Conduct information sessions, seminars, and workshops for prospective students and parents. Respond to student inquiries through various communication channels, including in-person meetings, phone calls, and emails. Skills & Expertise Education Counseling Suggested by Immigration Consultant Student Counseling Student Visa Processing Compensation & Other Benefits Mobile bill,Tour allowance,Performance bonus Salary Review: Yearly Festival Bonus: 2 Competitive salary and benefits package. Opportunities for professional development and growth. Workplace Work at office Employment Status Full Time Job Location Dhaka (DOHS Mohakhali) Company Information Classic Education Group Follow Address: House-387, Road-29, Mohakhali DOHS, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকল"
  },
  {
    "url": "https://bdjobs.com/h/details/1461006?ln=1",
    "company_name": "MARS Steel Trading Corporation",
    "job_title": "Project Co-Ordinator",
    "location": "Dhaka (GULSHAN 1)",
    "salary": "Negotiable",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Project Co-Ordinator : MARS Steel Trading Corporation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MARS Steel Trading Corporation Project Co-Ordinator Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 20 to 30 years Location: Dhaka (GULSHAN 1) Salary: Negotiable Experience: 1 to 2 years Published: 18 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Diploma in Civil Bachelor of Science (BSc) in Civil Engineering Bachelor’s Degree/Diploma in Civil Engineering, Mechanical Engineering, or related field Experience 1 to 2 years The applicants should have experience in the following business area(s): Architecture Firm, Engineering Firms, Escalator/Elevator/Lift, Interior Design Freshers are also encouraged to apply. Additional Requirements Age 20 to 30 years Experience in steel fabrication or erection projects. Knowledge of project documentation and reporting. Strong organizational skills. Requirements Minimum 1-2 years experience in construction or steel structure projects Ability to read drawings and technical documents Strong communication and coordination skills Good knowledge of MS Office (Excel, Word, Project) Ability to work under pressure and manage multiple tasks Responsibilities & Context Coordinate project activities between design, fabrication, procurement, and site teams Monitor project progress and update schedules Maintain project documentation, drawings, and reports Arrange meetings and prepare meeting minutes Track material requirements and delivery status Assist site team in resolving coordination issues Prepare daily, weekly, and monthly progress reports Support project manager in project planning and execution Ensure compliance with project quality and safety requirements Skills & Expertise AutoCAD AutoCAD 2D MS Excel MS Word Suggested by AutoCAD 2D 3D Civil Construction MS Excel Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (GULSHAN 1) Company Information MARS Steel Trading Corporation Follow More jobs from this company Address: Century Park House-36, Road-117, Suite-301, Level-3, Gulshan-1 Dhaka-1212. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported"
  },
  {
    "url": "https://bdjobs.com/h/details/1459210?ln=1",
    "company_name": "Bongo Limited Company",
    "job_title": "Jr. Office Executive",
    "location": "Dhaka (Mohammadpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Jr. Office Executive : Bongo Limited Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bongo Limited Company Jr. Office Executive Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Location: Dhaka (Mohammadpur) Salary: Tk. 12000 - 16000 (Monthly) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Responsibilities & Context Customer Support: Handle customer queries and issues through phone calls, emails, and messages. Digital Sales Support: Provide product information to customers and assist in completing the sales process. System Management: Update product related information in the internal system. Coordination: Work with team members to ensure quick solutions to customer issues. Skills & Expertise Bangla typing Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Casual Dress Code Dedicated Prayer Space Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mohammadpur) Company Information Bongo Limited Company Follow Address: 10/01, Mohammadpur, Dhaka-1207 Business: We (Bongo Ltd. Co.) operate as a full-service provider with three key areas of expertise:\n\nDigital Product & Subscription: We simplify the process of obtaining essential digital tools, entertainment access, and software licenses securely and affordably.\n\nDigital Marketing Agency: We function as a strategic partner, offering digital marketing services to help brands grow their online presence and reach their target audience.\n\nCustom Software & Service Provider: We provide tailored technological solutions, developing custom software and specialized digital services to meet unique client requirements.\n\nNote: We explicitly declare that we have no affiliation, association, authorization, endorsement, or connection with Bongo OTT Platform, Bongo Academy & Bongo Tech by Jubayer Hossain. We are a separate company dedicated to serving our own client base. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Profession"
  },
  {
    "url": "https://bdjobs.com/h/details/1460844?ln=1",
    "company_name": "City Tech IT",
    "job_title": "Teaching Assistant (Aeronautical / BBA Aviation / English / Math/Mechanical)",
    "location": null,
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Teaching Assistant (Aeronautical / BBA Aviation / English / Math/Mechanical) : City Tech IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List City Tech IT Teaching Assistant (Aeronautical / BBA Aviation / English / Math/Mechanical) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 4 Location: Dhaka (Uttara Sector 3) Salary: Negotiable Published: 18 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context United College of Aviation Science and Management (UCASM) United College of Aviation Science and Management (UCASM) is seeking motivated and dedicated individuals to join as Teaching Assistants (TA) for the following departments: Department of Aeronautical Engineering Department of BBA in Aviation Management Department of English Department of Mathematics Vacancy Details Position: Teaching Assistant (TA) Employment Status: Full-time / Part-time Job Location: Uttara, Dhaka Educational Requirements Aeronautical Engineering: Bachelor’s degree in Aeronautical or Mechanical Engineering . BBA Aviation Management: Bachelor’s degree in BBA (Aviation Management) or Management . English: Bachelor’s (Honors) or Master’s degree in English . Mathematics: Bachelor’s (Honors) or Master’s degree in Mathematics . Common Requirements: Minimum CGPA 3.00 in Bachelor’s degree. Strong academic background preferred. Fresh graduates are highly encouraged to apply. Job Responsibilities Assist faculty members in conducting lectures, tutorials, and laboratory sessions. Support students in academic tasks and project work. Help prepare course materials, assignments, and examination scripts. Maintain lab equipment (for Engineering & Science departments). If needed Classes also. Perform departmental academic and administrative tasks as assigned. Skills & Requirements Subject Knowledge: Deep understanding of core subjects (e.g., Aerodynamics for AE; Management for BBA; Linguistics/Literature for English; Calculus/Linear Algebra for Math). Communication: Strong presentation and communication skills in English and Bengali. Technical Skills: Basic knowledge of relevant software (e.g., MATLAB/SolidWorks for AE) is an advantage. Teamwork: Ability to work effectively in a team environment. Salary & Benefits Salary: Negotiable Other Benefits: As per college policy. Career Opportunities & Growth By joining UCASM as a Teaching Assistant, you will have access to the following professional benefits and growth paths: Pathway to Faculty Roles: High-performing candidates with the required qualifications will have the opportunity for promotion to Lecturer positions. Academic Research: Opportunities to collaborate with senior faculty members on Research & Publications in your respective field. Professional Training: Gain hands-on training in Modern Teaching Methodologies and Higher Education Management. I"
  },
  {
    "url": "https://bdjobs.com/h/details/1461073?ln=1",
    "company_name": "Quadbit Technologies",
    "job_title": "Sales Executive",
    "location": "Dhaka (Basundhara RA)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Sales Executive : Quadbit Technologies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Quadbit Technologies Sales Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 50 Age: 18 to 25 years Location: Dhaka (Basundhara RA) Salary: Negotiable Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 25 years Responsibilities & Context International Tele sales Executive (US,UK,Canada) Talk with customers over phone and chat Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Basundhara RA) Company Information Quadbit Technologies Follow More jobs from this company Address: New Apollo Hospital Road,Bashundhara,Vatara,dhaka-1229 Website: https://quadbittech.com/ Business: QuadBit Technologies, established in 2020, is a global software development company that specializes in building innovative business software solutions. With a strong presence in the US and UK markets, QuadBit helps enterprises streamline operations, enhance customer experiences, and achieve digital transformation. Their expertise spans custom software development, web solutions, and enterprise applications, delivering reliable and scalable products that empower businesses to grow in the digital age. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Complianc"
  },
  {
    "url": "https://bdjobs.com/h/details/1461069?ln=1",
    "company_name": "Afser Group Bangladesh",
    "job_title": "Job Circular: Accounts Officer (School Finance & Digital Payment System)",
    "location": "Dhaka (Uttara Sector 5)",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Job Circular: Accounts Officer (School Finance & Digital Payment System) : Afser Group Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Afser Group Bangladesh Job Circular: Accounts Officer (School Finance & Digital Payment System) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Dhaka (Uttara Sector 5) Salary: Tk. 20000 - 25000 (Monthly) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Ability to work under pressure and meet deadlines Strong communication and coordination skills Commitment to transparency and accountability Responsibilities & Context Key Responsibilities Maintain daily accounts, ledgers, vouchers, and financial documentation Handle student fee collection through digital payment gateways and cashless platforms Implement and manage school finance software and ERP/accounting tools Prepare monthly salary sheets, expense reports, and budget summaries Ensure accurate record keeping using Microsoft Excel (Advanced Level) Coordinate with administration for audit, compliance, and reporting Support transition from manual accounting to a fully automated system Required Skills & Qualifications Bachelor’s degree in Accounting/Finance/Business (preferred) Minimum 2–3 years experience in accounts management (school/institution experience is a plus) Strong knowledge of: Accounting software (Tally, QuickBooks, ERP, or similar) Digital payment systems (bKash, Rocket, Bank Gateway, etc.) Excel reporting, formulas, salary sheets, and data analysis Must be capable of implementing a cashless accounting workflow Honest, detail-oriented, and highly organized Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara Sector 5) Company Information Afser Group Bangladesh Follow More jobs from this company Address: House # 392, Road # 29, Mohakhali DOHS, Dhaka-1206 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register No"
  },
  {
    "url": "https://bdjobs.com/h/details/1460450?ln=1",
    "company_name": "Powervision Group",
    "job_title": "Sales Executive - Heavy Equipment Machinery",
    "location": "Chattogram, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Sales Executive - Heavy Equipment Machinery : Powervision Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Powervision Group Sales Executive - Heavy Equipment Machinery Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 23 to 33 years Location: Chattogram, Dhaka Salary: Tk. 15000 - 25000 (Monthly) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 23 to 33 years Responsibilities & Context Promote and sell heavy equipment machinery such as excavators, cranes, forklifts, dump trucks, and other construction equipment to corporate and individual clients. Identify potential customers, including construction companies, contractors, industrial clients, and government organisations. Develop and maintain strong relationships with existing and new clients to ensure repeat business. Conduct market research to identify new business opportunities and monitor competitor activities. Prepare and deliver product presentations, demonstrations, and technical explanations to customers. Prepare quotations, negotiate prices, and finalise sales agreements in line with company policies. Achieve monthly and annual sales targets set by management. Coordinate with the technical/service team to ensure proper delivery, installation, and after-sales support. Follow up on customer payments and ensure timely collection. Maintain proper documentation of sales reports, client database, and sales forecasts. Participate in trade fairs, exhibitions, and promotional events to expand market presence. Provide regular feedback to management regarding market trends, customer requirements, and product improvements. Skills & Expertise Heavy Construction Equipment Heavy Equipment Sales & Marketing Suggested by Business Development Client Relationship Management Technical Sales Compensation & Other Benefits T/A,Tour allowance,Mobile bill Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Chattogram, Dhaka Company Information Powervision Group Follow Address: House# 06 (7th & 8th floor), Road# 16/A, Gulshan-1, Dhaka-1212 Business: Heavy Equipment Importer Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certi"
  }
]