[
  {
    "url": "https://bdjobs.com/h/details/1458083?ln=1",
    "company_name": "Getway Service Ltd.",
    "job_title": "Digital Marketing & Office Executive",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Digital Marketing & Office Executive : Getway Service Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Getway Service Ltd. Digital Marketing & Office Executive Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: At least 18 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age At least 18 years Must be able to work under Pressure. Need patience, polite, humble and honest person. Must need to have computer or laptop Responsibilities & Context As Executive Help students local and international students with their admission Process. Guiding students to do their enrolment. Prepare necessary documents, fill out forms and maintain files and records. Provide Counselling to the student who are willing to go to UK for Studies. Providing checklist to student and gather all files. Help Student to choose their desire path. Making ready Students file. Keep track of all updates of students. Communicate and coordinate with clients through call, message & mail. Preparing applicants for the interviews. Google tools. Content Creation for Digital Marketing. Skills & Expertise COMPUTER OFFICE MANAGEMENT Good English communication skills (verbal and Written) Google workspace Suggested by Visa Processing Education Counseling Social Media Marketing (SMM) Digital Marketing Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Getway Service Ltd. Follow Address: 46 Nelson Street, London, E1 2DE, United Kingdom Business: Getway Education is strategically committed towards the provision of best quality consultancy services to students and institutes thereby helping students in obtaining the best possible education in the UK, USA, Canada, Australia and other European countries, as per their needs and desires. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4"
  },
  {
    "url": "https://bdjobs.com/h/details/1460976?ln=1",
    "company_name": "Nasreen Zamir And Associates",
    "job_title": "AutoCAD Person",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "AutoCAD Person : Nasreen Zamir And Associates Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nasreen Zamir And Associates AutoCAD Person Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Drafts person with knowledge of AutoCAD and 3D drawing. Candidate must have experience in interior layout planning, producing 2D and 3D drawings. Experience in floor plan and furniture layout. Skills operate AutoCAD, 3D MAX, and relevant software etc. Responsibilities & Context Duty: Saturday to Thursday Time: 9:30 AM to 6:00 PM Skills & Expertise Suggested by 3ds max AutoCAD 2D 3D Interior Design Employment Status Full Time Job Location Anywhere in Bangladesh Read Before Apply Note: Send CV with passport size photo by e-mail Please mention JOB TITLE (AutoCAD person) Company: Nasreen Zamir And Associates - Interior Designers Telephone: +8802-55000498 Cell: 01314-447 797 / 01711-249 105 E-mail: nz.associates12@ gmail.com Website: https://nzadesigns.com/ Apply Procedure Email Your CV Send your CV to the given email nz.associates12@gmail.com Company Information Nasreen Zamir And Associates Follow Address: House # 50/1, Road# 11 A (2nd Floor),  Dhanmondi R/A Business: Interior Design Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhur"
  },
  {
    "url": "https://bdjobs.com/h/details/1461254?ln=1",
    "company_name": "Dominant International School",
    "job_title": "Accounts Officer - Cash",
    "location": "Dhaka (Mohakhali)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Accounts Officer - Cash : Dominant International School Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dominant International School Accounts Officer - Cash Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 32 years Location: Dhaka (Mohakhali) Salary: Tk. 16000 - 22000 (Monthly) Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 32 years Female are more encouraged to apply Microsoft Office 1-2 years expreienced must Responsibilities & Context Maintain accurate financial records of school income and expenditure. Manage student fee collection, receipts, refunds, and maintain fee registers. Prepare monthly and annual financial statements for the school management. Handle salary processing, allowances, and other payments for teachers and staff. Manage accounts payable and receivable, including vendor and utility payments. Prepare budgets and monitor expenses to ensure proper use of school funds. Reconcile bank statements and maintain cash and bank balances. Ensure compliance with school policies and relevant financial regulations. Assist in internal and external audits by providing necessary financial documents. Maintain confidentiality and transparency in all financial matters. Operate & manage the school’s bank accounts in accordance with approved authority prepare and process cheques, online transfers, and other bank payments. Assist in opening, closing or updating bank accounts as per management approval. Maintain proper records of bank transactions and supporting documents. Perform regular bank reconciliation and resolve any discrepancies. Managed distribution of payments/dividends among investors as per approved ratios. Ensured accurate and timely allocation of payments to investors. Prepare and processed investor payment distributions with proper documentation. Skills & Expertise Accounts and Finance Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 1 Workplace Work at office Employment Status Full Time Job Location Dhaka (Mohakhali) Company Information Dominant International School Follow Address: 49 Siddique tower. Gulshan avenue. Business: Education Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on IS"
  },
  {
    "url": "https://bdjobs.com/h/details/1463850?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464043?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463639?ln=1",
    "company_name": "Hena International Ltd.",
    "job_title": "Content Strategist / Creative Lead / Head of Content (Digital Marketing)",
    "location": "Bangladesh, Dhaka",
    "salary": null,
    "experience": "At least 4 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Content Strategist / Creative Lead / Head of Content (Digital Marketing) : Hena International Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hena International Ltd. Content Strategist / Creative Lead / Head of Content (Digital Marketing) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Location: Bangladesh, Dhaka Salary: Negotiable Experience: At least 4 years Published: 28 Feb 2026 Application Insights View Requirements Education Bachelor/Honors Bachelor’s degree in Marketing, Media, Communication, or related field (preferred) Experience At least 4 years The applicants should have experience in the following business area(s): Advertising Agency, Advertising Technology (AdTech) Startup, E-commerce, Film Production, Market Research Firms, Satellite TV, Software Company Additional Requirements Strong storytelling and creative writing skills. Hands-on experience with digital content creation tools (Canva, Photoshop, Illustrator, video editing tools). Knowledge of social media trends, SEO, and paid advertising campaigns. Leadership , team management, and coordination skills. Analytical mindset to evaluate content performance. Must be able to work from office in Dhaka. Responsibilities & Context Job Context We are seeking a creative and strategic Content Strategist / Content Planner / Creative Lead / Head of Content / Content Marketing Strategist to join our digital marketing team. In our small team, you will handle planning and executing content strategies, supervise content production across all channels (image, video, text), ensure brand consistency across campaigns, and provide team guidance—all in one role. Requirements 4/5 years of experience in content strategy, content planning, creative leadership, or agency content roles Ability to manage multiple projects and deadlines efficiently Strong understanding of copywriting, video editing, and graphic design processes Experience in digital media, content marketing, and digital advertising Key Responsibilities Develop content strategies aligned with client goals and business objectives. Lead and guide a team of content creators, designers, and video editors to execute tasks effectively. Create and maintain content plans, schedules, and campaign structures. Plan and oversee the production of social media, advertising, and website content. Generate, review, and refine creative ideas and concepts. Maintain consistent brand voice, tone, and style across all channels. Conduct market research , competitor analysis, and audience insights. Analyze content performance and optimize campaigns for engagement and conversions. Collaborate with Digital Marketing Strategists, Performance Teams, and Client Managers. Generate creative ideas for campaigns, video scripts, ad copy, and social media posts. Ensure content i"
  },
  {
    "url": "https://bdjobs.com/h/details/1464182?ln=1",
    "company_name": "Hena International Ltd.",
    "job_title": "Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist (Digital Marketing)",
    "location": "Bangladesh, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist (Digital Marketing) : Hena International Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hena International Ltd. Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist (Digital Marketing) Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Location: Bangladesh, Dhaka Salary: Negotiable Published: 28 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements 3–4 years of experience in sales, preferably in digital marketing, IT services, or related industries. Proven experience in sales, lead conversion, or client relationship management. Excellent communication and negotiation skills. Ability to understand client needs and provide tailored solutions. Target-driven with strong result orientation. Familiarity with CRM or sales tracking systems is a plus. Responsibilities & Context Job Context Hena Technology, a leading digital marketing service provider in Bangladesh, is seeking a results-driven Sales Closer / Deal Closer / Sales Specialist / Lead Conversion Specialist. The role focuses on converting incoming leads into paying clients by understanding client needs, preparing tailored proposals, sending quotations, and ensuring professional customer service while achieving sales targets. Key Responsibilities: Communicate with potential clients and follow up effectively on all inbound leads. Convert incoming leads into confirmed/paid clients efficiently. Understand client requirements and prepare suitable service/product proposals. Send customized proposals and quotations to close deals. Achieve assigned sales targets consistently. Record all client interactions in CRM or sales tracking systems. Provide high-quality customer service and build long-term client relationships. বুঝার সুবিধার্থে বাংলায় দায়িত্বসমূহ: কোম্পানিতে আসা সকল কাস্টমারের সঙ্গে প্রফেশনাল যোগাযোগ রাখা। ইনকামিং লিডকে দ্রুত এবং কার্যকরভাবে চুক্তিবদ্ধ/পেইড ক্লায়েন্টে রূপান্তর করা। কাস্টমারের চাহিদা অনুযায়ী উপযুক্ত সার্ভিস/প্রোডাক্ট প্রপোজাল তৈরি করা। কাস্টমাইজড প্রপোজাল এবং কোটেশন পাঠিয়ে ডিল ক্লোজ করা। নির্দিষ্ট সেলস টার্গেট অর্জন করা। CRM বা সেলস ট্র্যাকিং সিস্টেমে কাস্টমার ইন্টারেকশন রেকর্ড করা। উচ্চমানের কাস্টমার সার্ভিস বজায় রাখা এবং সম্পর্ক গড়ে তোলা। Skills & Expertise Client Acquisition Client Communication Client Relationships Deal Closing Sales Sales & Marketing sales closing Compensation & Other Benefits T/A,Performance bonus,Mobile bill Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Lunch , Tea, coffee & snacks provided Workplace Work at office Employment Status Full Time Job Location Bangladesh, Dhaka Company Information Hena International Ltd. Follow More jobs from this company Address: 3rd Floor, 6 Purana Paltan Lane (Nea"
  },
  {
    "url": "https://bdjobs.com/h/details/1464399?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464354?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464274?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464453?ln=1",
    "company_name": "Ishara Consultancies",
    "job_title": "Marketing Executive - Virtual Assistant & AI-Workflow",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": "Tk. 18000 - 20000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Marketing Executive - Virtual Assistant & AI-Workflow : Ishara Consultancies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ishara Consultancies Marketing Executive - Virtual Assistant & AI-Workflow Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Dhaka (DOHS Mirpur) Salary: Tk. 18000 - 20000 (Monthly) Published: 28 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Responsibilities & Context 📢 We’re Hiring: Marketing Executive - Virtual Assistant & AI-Workflow We are looking for a proactive and responsible Marketing Executive to lead executive operations, AI-driven workflow systems, and digital performance support within our organization. This role combines structured virtual assistance, AI workflow implementation, and hands-on involvement in Shopify store management and optimization. You will contribute to international projects, support Media Buying CAPI integrations, and help streamline operational and marketing processes through automation and data-driven systems. If you are organized, execution-focused, and ready to take ownership in a fast-growing digital environment, this position offers significant exposure and long-term growth potential. 🎯 Key Responsibilities 🔹 Automation & Virtual Assistance Manage and optimize executive email systems and communication flow Coordinate meetings, scheduling, and calendar management with precision Maintain structured task management and workflow systems Oversee documentation and operational processes Implement and manage AI automation workflows where applicable 🔹 Shopify & Media Buying CAPI Management Develop and manage Shopify stores, ensuring proper setup and functionality Handle product listings, backend management, and store maintenance Execute and optimize conversion rate strategies (CRO) Monitor store performance and implement improvements Assist in Media Buying CAPI integrations and tracking accuracy 🧠 Who We’re Looking For ✔ Strong sense of responsibility and ownership ✔ Ability to manage tasks independently with minimal supervision ✔ Structured, detail-oriented, and process-driven ✔ Coachable yet confident in execution ✔ Full-time commitment and professional work ethic ✔ Candidates residing in or near Mirpur DOHS will be preferred 🌍 What You’ll Gain Exposure to international client projects Practical experience with AI workflow systems Advanced knowledge in Shopify and performance optimization Opportunity to grow into a senior operational role 𝐋𝐨𝐜𝐚𝐭𝐢𝐨𝐧: Mirpur DOHS (Candidates residing nearby are preferred) 𝐌𝐨𝐝𝐚𝐥𝐢𝐭𝐲: Full-Time, On-site (6 Days/Week, 11:00am - 7:00pm) 𝐑𝐞𝐦𝐮𝐧𝐞𝐫𝐚𝐭𝐢𝐨𝐧: 20,000 BDT Skills & Expertise Communication and interpersonal skill Shopify Artificial intelligence (AI) Virtual Assistance Workplace Work at office Employment Status Full Time Job"
  }
]