[
  {
    "url": "https://bdjobs.com/h/details/1456531?ln=1",
    "company_name": "Systems & Services Limited",
    "job_title": "Junior System Engineer / Sub Assistant Engineer (Telecom & IT Solutions)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Junior System Engineer / Sub Assistant Engineer (Telecom & IT Solutions) : Systems & Services Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Systems & Services Limited Junior System Engineer / Sub Assistant Engineer (Telecom & IT Solutions) Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 22 to 28 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 28 years Basic understanding of telecommunications and network engineering principles Good analytical, problem-solving, and teamwork skills. Practical knowledge of electrical and network systems. Eager to learn and grow within the telecom engineering domain. Responsibilities & Context We are seeking dynamic, motivated, and technically sound individuals to join our engineering team as Junior System Engineers / Sub Assistant Engineers . These roles are tailored to candidates with a BSc in Electrical & Electronic Engineering (EEE) and Diploma in EEE respectively, and are designed to support our technical operations across design, implementation, installation, and support of telecommunications and IT solutions. This is an excellent opportunity for early-career engineers to grow in a professional environment working on real-world telecom, network, and IT infrastructure projects. Key Responsibilities Assist in site surveys, installation, commissioning, and testing of telecommunications and network solutions. Support in design and implementation of network systems and equipment following technical specifications. Troubleshoot, maintain, and optimize system performance of hardware and software components. Provide technical support and after-sales service for client systems, ensuring high uptime and quality performance. Prepare technical documentation, reports and assist with project coordination . Collaborate with senior engineers and cross-functional teams to ensure timely project delivery. Keep up-to-date with industry trends, new technologies, and best practices in telecom and IT solutions. Skills & Expertise communication and interpersonal skill. Computer Literacy Customer Support Design and Drawing Electrical and Electronic Engineering Hardware & Networking Hardware Troubleshooting IT Support Service and Network engineering. Network Troubleshooting Telecommunication Engineer Suggested by Hardware & Networking Design and Drawing Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Systems & Services Limited Follow Address: Tropical Cantt View (3rd floo"
  },
  {
    "url": "https://bdjobs.com/h/details/1458201?ln=1",
    "company_name": "Victoria Healthcare Ltd",
    "job_title": "Accountant",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Accountant : Victoria Healthcare Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Victoria Healthcare Ltd Accountant Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 3–5 years of professional experience as an Accountant in the education consultancy sector or any relevant agency/field. Responsibilities & Context Maintain accurate records of financial transactions. Prepare financial reports, statements, and bank reconciliations. Proficient in MS Office tools, especially Excel (formulas, data analysis, spreadsheets). Experience in data management and reporting tools. Manage accounts payable and receivable. Oversee payroll processes, budgeting, and expense tracking. Ensure compliance with financial regulations and internal policies. Assist in audits and financial forecasting. Collaborate with other departments to ensure financial clarity and reporting accuracy. Monitor daily financial operations such as invoicing, billing, and bank  transactions. Analyze financial data and provide insights to support business decisions. Strong command over accounting principles and financial reporting. Excellent written and verbal communication skills in English. Ability to work independently and as part of a team. Strong leadership and interpersonal skills. High attention to detail and excellent organizational abilities. Ability to work under pressure and manage multiple tasks with tight Skills & Expertise Suggested by Accounting Finance Tally Software Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Victoria Healthcare Ltd Follow Address: Cosmopolitan Center, 22/2, Babar Road, Block-B, Mohammadpur, Dhaka-1207. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul "
  },
  {
    "url": "https://bdjobs.com/h/details/1458197?ln=1",
    "company_name": "Victoria Healthcare Ltd",
    "job_title": "Graphic Designer",
    "location": "Dhaka (Mohammadpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Graphic Designer : Victoria Healthcare Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Victoria Healthcare Ltd Graphic Designer Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (Mohammadpur) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Proficiency in Photoshop & Illustrator (Canva is a plus) Basic knowledge of typography & color theory Creative mindset & attention to detail Prior experience preferred (Freshers can apply) Responsibilities & Context Are you creative, detail-oriented, and love turning ideas into visuals? We’re looking for a talented Graphic Designer to join our team. Responsibilities: Design social media posts, banners, posters & promotional materials Work with the marketing team to create engaging visuals Maintain brand consistency across all designs Skills & Expertise Adobe Illustrator Adobe Photoshop Suggested by Adobe Illustrator Adobe Photoshop Compensation & Other Benefits Salary: Negotiable (based on skills & experience) Performance bonus, Over time allowance Salary Review: Yearly Lunch Facilities: Full Subsidize Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mohammadpur) Read Before Apply Company Information Victoria Healthcare Ltd Follow Address: Cosmopolitan Center, 22/2, Babar Road, Block-B, Mohammadpur, Dhaka-1207. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job "
  },
  {
    "url": "https://bdjobs.com/h/details/1461186?ln=1",
    "company_name": "Classic Education Group",
    "job_title": "Counsellor/ Senior Counsellor",
    "location": "Dhaka (DOHS Mohakhali)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Counsellor/ Senior Counsellor : Classic Education Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Classic Education Group Counsellor/ Senior Counsellor Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (DOHS Mohakhali) Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Responsibilities & Context Classic Education Group is a leading student consultancy firm dedicated to guiding students through the complexities of university admissions. We pride ourselves on providing personalized support and expert advice to help students achieve their academic and career goals. Job Description: The Counsellor/senior counsellor is responsible for guiding students/clients through the overseas education or migration process. This role includes providing accurate program advice, assessing applicant eligibility, maintaining client communication, ensuring quality documentation, and achieving monthly conversion targets. The senior counsellor also supports junior counsellors through training, supervision, and performance guidance. Provide expert counselling to students regarding university options, course selection, and career pathways. Assist students in preparing and submitting university applications, scholarship applications, and visa documentation. Manage the end-to-end student journey: initial consultation, document assessment, SOP review, GTE, tests, interviews, personal statements & visa lodgement Guide students through the admission process, including application preparation, documentation, and submission. Conduct information sessions, seminars, and workshops for prospective students and parents. Respond to student inquiries through various communication channels, including in-person meetings, phone calls, and emails. Compensation & Other Benefits Mobile bill,Tour allowance,Performance bonus Salary Review: Yearly Festival Bonus: 2 Competitive salary and benefits package. \nOpportunities for professional development and growth. Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (DOHS Mohakhali) Company Information Classic Education Group Follow More jobs from this company Address: House-387, Road-29, Mohakhali DOHS, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627"
  },
  {
    "url": "https://bdjobs.com/h/details/1461259?ln=1",
    "company_name": "Jagoron Centre for Development",
    "job_title": "Brand & Event Promoter (Male & Female)",
    "location": "Dhaka (Uttara Sector 8)",
    "salary": "Tk. 7000 - 10000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Brand & Event Promoter (Male & Female) : Jagoron Centre for Development Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Jagoron Centre for Development Brand & Event Promoter (Male & Female) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 10 Age: 18 to 28 years Location: Dhaka (Uttara Sector 8) Salary: Tk. 7000 - 10000 (Monthly) Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 18 to 28 years Flexible part-time schedule – perfect for students or youth. Gain hands-on experience in marketing, event promotion & brand communication. Build professional networks with school & college authorities. Be part of a national educational mission impacting thousands of students. Earn valuable experience in student outreach, branding & promotion. Responsibilities & Context As a Brand & Event Promoter , you will be the face of our English Genius Program for students of Class 1–12 . Your mission is to reach students, inspire them, and help them join our educational movement. Key Responsibilities: Visit schools & colleges to promote the program. Meet Head Teachers & Principals to introduce the program and gain support. Distribute flyers, brochures & program materials to students. Ensure new student enrollment and active participation. Achieve part-time sales & recruitment targets . Submit daily reports and updates on your visits and activities. Skills & Expertise Brand Promotion Corporate Marketing Promotion and Branding Sales & Marketing Suggested by Brand Marketing Sales target Customer Service Workplace Work at office Employment Status Part Time Job Location Dhaka (Uttara Sector 8) Company Information Jagoron Centre for Development Follow Address: House - 16, Road - 03, Sector - 07, Uttara, Dhaka-1230 Website: https://jagoronedu.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree"
  },
  {
    "url": "https://bdjobs.com/h/details/1462082?ln=1",
    "company_name": "EQUE",
    "job_title": "রেস্টুরেন্ট ওয়েটার",
    "location": "Nilphamari (Saidpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "রেস্টুরেন্ট ওয়েটার : EQUE Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List EQUE রেস্টুরেন্ট ওয়েটার Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Location: Nilphamari (Saidpur) Salary: Negotiable Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements কমপক্ষে ১ বছরের কাজের অভিজ্ঞতা থাকতে হবে। অতিথিদের সাথে ভদ্র ও সুন্দর আচরণ করতে সক্ষম। দলগতভাবে কাজ করার মানসিকতা থাকতে হবে। পরিষ্কার-পরিচ্ছন্ন ও দায়িত্বশীল হতে হবে। কমপক্ষে ২ বছর কাজ করার মানসিকতা থাকতে হবে। Responsibilities & Context নিয়োগ বিজ্ঞপ্তি সৈয়দপুরের স্বনামধন্য ইকু হেরিটেজ হোটেল এবং রিসোর্ট এর জন্য জরুরী ভিত্তিতে রেস্টুরেন্ট ওয়েটার নিয়োগ দেওয়া হবে। Skills & Expertise Water Suggested by Restaurant Waiter Hospitality Management Customer Service Compensation & Other Benefits বেতন ও সুবিধা: ১. অভিজ্ঞতা অনুযায়ী বেতন আলোচনা সাপেক্ষে। ২. থাকা ও খাবারের সু-ব্যবস্থা। ৩. মাসিক ছুটি (৪টি) ও অন্যান্য সুযোগ-সুবিধা। ৪. কোম্পানির নীতিমালা অনুযায়ী উৎসব বোনাস Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Nilphamari (Saidpur) Company Information EQUE Follow More jobs from this company Address: Bimanbandor Road, Saidpur Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree "
  },
  {
    "url": "https://bdjobs.com/h/details/1461943?ln=1",
    "company_name": "Mokbul Air International Travels & Tourism",
    "job_title": "Computer Operator",
    "location": "Dhaka (Keraniganj)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "Computer Operator : Mokbul Air International Travels & Tourism Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mokbul Air International Travels & Tourism Computer Operator Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Skills & Expertise Company Information Summary Vacancy: 2 Location: Dhaka (Keraniganj) Salary: Negotiable Published: 23 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements কম্পিউটার অপারেটিং ও টাইপিং দক্ষতা (বাংলা ও ইংরেজি)। MS Office ও ইন্টারনেট ব্যবহারে পারদর্শিতা। ভদ্র ব্যবহার ও কাস্টমার সার্ভিস দক্ষতা। ভ্রমণ সংক্রান্ত সফটওয়্যার জানলে অগ্রাধিকার। Skills & Expertise COMPUTER OFFICE MANAGEMENT Suggested by Computer Literacy Microsoft Office Data Entry Workplace Work at office Employment Status Full Time Job Location Dhaka (Keraniganj) Company Information Mokbul Air International Travels & Tourism Follow Address: Abdullahpur, Keraniganj, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create"
  },
  {
    "url": "https://bdjobs.com/h/details/1463183?ln=1",
    "company_name": "Premium Holdings Ltd",
    "job_title": "Manager – Land & Legal",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Mar 2026",
    "job_description": "Manager – Land & Legal : Premium Holdings Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Premium Holdings Ltd Manager – Land & Legal Application Deadline : 26 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 35 to 45 years Location: Dhaka Salary: Negotiable Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 35 to 45 years Experience 8 to 10 years in relevant fields The applicants should have experiences in the following business area(s): Real Estate, Asset Development, etc. Additional Requirements Strong knowledge of Land Law, Civil Law, other related activities. Expert to land survey. Excellent interpersonal and communication skills. Good command of MS Word, Excel, PowerPoint & Internet. Deep knowledge of land law and registration process Excellent Negotiation skills Document analysis skills (invoices, forms, deeds, etc.) Fluency in both English & Bangla (written and verbal). Responsibilities & Context Workplace Work at office and projects Responsibilities & Context Prepare all land related documents properly. Supervise all land registration processes. Confirming mutation, name transfer, land development tax payment etc. Verifying land ownership (title verification). Verifying land records, parcels, mouza maps, dag numbers. Verifying ownership history, khatian, mutation, survey reports, and other necessary papers. Drafting various legal documents, including contracts, deeds, MoUs, affidavits, business agreements, wills and agreements with landowners, developers, & stakeholders etc. Ensuring agreements align with company policies and mitigate potential risks. Maintaining legal records, preparing periodic reports, and updating management on ongoing cases. Prepare reports and provide updates to management. Any other tasks as and when assigned by the management. Compensation & Other Benefits Performance bonus Yearly increments Two festival bonuses Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Premium Holdings Ltd Follow Address: Gulshan Grace (5th Floor), H# 08, R# South Avenue, Gulshan-1, Dhaka-1212 Business: PREMIUM HOLDINGS LTD. PREMIUM HOLDINGS LTD, one of the fastest growing conglomerates with significant presence in the real estate industry offering a wide range of real estate products and services PREMIUM HOLDINGS LTD. is a progressively growing organization provides every citizen of Bangladesh to own a housing destination within affordable capacity and reasonable price with all available facilities in its different projects. PREMIUM HOLDINGS LTD. pledge to create pleasant, enjoyable, safe and secured residential environment for the honorable customers. Premium Holdings ltd careful enough to keep the commitments made to the customers."
  },
  {
    "url": "https://bdjobs.com/h/details/1463180?ln=1",
    "company_name": "Premium Holdings Ltd",
    "job_title": "Sr. Executive / Asst. Manager - Sales & Marketing",
    "location": "Dhaka, Dhaka (GULSHAN 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Mar 2026",
    "job_description": "Sr. Executive / Asst. Manager - Sales & Marketing : Premium Holdings Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Premium Holdings Ltd Sr. Executive / Asst. Manager - Sales & Marketing Application Deadline : 26 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 35 years Location: Dhaka, Dhaka (GULSHAN 1) Salary: Negotiable Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 25 to 35 years Experience 2 to 3 years in relevant fields The applicants should have experiences in the following business area(s): Real Estate, Asset Development, etc. Additional Requirements Excellent communication and interpersonal skills. Proper time management skills. Mentality of taking challenges and thinking out of the box to meet the mission and vision of the organization Must be able to work under pressures. Ability to support both independently and in team work. Sales Capacity Responsibilities & Context Workplace Work at office and projects Responsibilities & Context Exploration of new sales opportunities and market potential for land projects Meeting the expectation to be target oriented relevant to ongoing & ready plot sales and ensuring reaching to the sales target Identify and pursue new business opportunities through prospecting, cold calling, and networking Creating relationship with new customer to meet the sales target Maintaining healthy relationship with existing client for repeat sales Build and maintain relationships with clients to understand their needs and preferences Follow up the given lead of the customers & bring results Perform other relevant duties as directed by the management Making regular and effective visit to public and private offices for marketing and sales promotion Active participation with the marketing team and supporting to the project visit of prospective clients Understand the values of Customer relationship and importance of their satisfaction and sharing the feedback to the team members. Supporting to the marketing campaign management. Tracking sales activities and preparing marketing reports and providing on a regular basis to the immediate supervisor Handling the client's queries in a professional manner. Compensation & Other Benefits Performance bonus Yearly increments & promotion Two festival bonuses Performance award Workplace Work at office Employment Status Full Time Job Location Dhaka, Dhaka (GULSHAN 1) Company Information Premium Holdings Ltd Follow Address: Gulshan Grace (5th Floor), H# 08, R# South Avenue, Gulshan-1, Dhaka-1212 Business: PREMIUM HOLDINGS LTD. PREMIUM HOLDINGS LTD, one of the fastest growing conglomerates with significant presence in the real estate industry offering a wide range of real estate products and services PREMIUM HOLDINGS L"
  },
  {
    "url": "https://bdjobs.com/h/details/1463012?ln=1",
    "company_name": "Smart Software Limited",
    "job_title": "PHP Laravel Developer",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "PHP Laravel Developer : Smart Software Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Smart Software Limited PHP Laravel Developer Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 20 to 30 years Location: Dhaka Salary: Negotiable Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 20 to 30 years Extensive knowledge of complex Structured Query Language (SQL) and a strong background in any RDBMS database like SQL Server, MySQL Must have in-depth knowledge of PHP Laravel programming language and related framework & development tools. React/Node js experience is a plus. Must have Software architectural knowledge and be able to design software from requirements. Responsibilities & Context Smart Software Ltd. is a leading Software Development Company having 12+ years of experience by providing the most comprehensive application suite to maximize industry-mandated compliance and corporate governance. The Company is looking for recruiting a number of Mid-level Application Developers having experience in PHP Laravel with having Knowledge on javascript framework. Responsibilities: Capable to Analyze, fully understand project requirements to formulate and implement object-oriented programmatic solutions that efficiently and effectively address said requirements. Develop RESTful API in Laravel to assist mobile application development and other third-party integration Clear Knowledge about Object-Oriented Programming and Design (OOAD), MVC pattern. Should be able to analyze existing coding for re-engineering. Integrate Third-Party REST API in Applications Skills & Expertise Node JS PHP PHP (OOP) PHP Laravel PHP MySql PHP Programming ReactJS Suggested by Laravel Framework MS Office MySQL PHP (Laravel) Compensation & Other Benefits Pension policy,Medical allowance,Provident fund,Over time allowance,Performance bonus Salary Review: Half Yearly Festival Bonus: 2 Lunch Facilities: Partially Subsidize Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Smart Software Limited Follow More jobs from this company Address: 152/2/N (4th F), Panthapath, Dhaka Website: https://www.smartsoftware.com.bd/ Business: Software Development, Mobile Apps Development, Website Development, Server & Hosting Provider, IT Solution Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থ"
  },
  {
    "url": "https://bdjobs.com/h/details/1463276?ln=1",
    "company_name": "HURDCO International School",
    "job_title": "Heaf of Administration & HR",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "27 Mar 2026",
    "job_description": "Heaf of Administration & HR : HURDCO International School Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List HURDCO International School Heaf of Administration & HR Application Deadline : 27 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 40 to 50 years Location: Dhaka Salary: Negotiable Published: 25 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 40 to 50 years The ideal candidate will have excellent communication and problem-solving skills, along with a solid understanding of HR best practices, labor laws, compliance requirements, and international school operations. Preference will be given to candidates from an English-medium educational background with outstanding spoken and written English skills. Responsibilities & Context The Head of Administration & HR will be responsible for long-term strategic planning, overseeing daily operations, delegating tasks to staff, and managing personnel through performance reports, development initiatives, and the full recruitment process. We are seeking a Head of Administration and HR, ideally with experience in educational institutions, who demonstrates strong leadership, strategic planning and a proven ability to support organizational growth. Skills & Expertise Suggested by Human Resource Management Administration Compensation & Other Benefits Provident fund Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka Company Information HURDCO International School Follow Address: Ka-19/1, Bashundhara Road, Bashundhara Main Gate, Dhaka-1229 Business: School Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT"
  },
  {
    "url": "https://bdjobs.com/h/details/1463660?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "SELLS  REPRESENTIVE /SR",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 15000 - 20000 (Monthly)",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "SELLS  REPRESENTIVE /SR : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD SELLS  REPRESENTIVE /SR Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 100 Age: 20 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 15000 - 20000 (Monthly) Experience: 1 to 2 years Published: 26 Feb 2026 Application Insights View Requirements Education HSC in ????? SSC in ????? Experience 1 to 2 years The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM), Farming, Science Laboratory, Dairy, Agro based Startup Freshers are also encouraged to apply. Additional Requirements Age 20 to 40 years Responsibilities & Context ডিলার ওপেন করা,অর্ডার কালেকশন ও ডেলিভারি নিশ্চিত করা,দোকানদারের সাথে সুসম্পর্ক স্থাপন করা। বিঃদ্রঃ নিজ উপজেলায় কাজের সুযোগ । Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Agro Farm BD Follow Address: Mirpur 6,Block D,Orchid Community Centere ,House 24, Lift 7. Dhaka 1216 Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? O"
  }
]