[
  {
    "url": "https://bdjobs.com/h/details/1457170?ln=1",
    "company_name": "Blue Creations Limited",
    "job_title": "Head of Washing R&D (Denim Experienced)",
    "location": "Gazipur (Kashimpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "Head of Washing R&D (Denim Experienced) : Blue Creations Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Blue Creations Limited Head of Washing R&D (Denim Experienced) Application Deadline : 07 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 32 to 50 years Location: Gazipur (Kashimpur) Salary: Negotiable Published: 07 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 32 to 50 years In-depth knowledge of chemical reactions on various fabrics (100% Cotton, Tencel, Corduroy, and Stretch Denim) Ability to predict upcoming wash trends (e.g., vintage fades, sustainable 3D effects). Deep expertise in fabric development, shade checking, garment construction, washing/dyeing, and CAD systems. Ability to fix shade variations, fabric strength loss (Tensile/Tear), back-staining issues, and recipes. Familiarity with ZDHC (Zero Discharge of Hazardous Chemicals) and MRSL/RSL compliance. Excellent communication and presentation skills in English (mandatory); other languages are a plus. Excellent problem-solving skills for handling technical issues and optimizing production. Responsibilities & Context Blue Creations Limited is a 100% Export-oriented woven top-bottom garments Washing plant, located at Kashimpur, Gazipur. The company is seeking to appoint a talent aspirant to the Head in Research & Development Department . The ideal candidate will drive innovation in dry and wet processing, including the development of high-end washes, improved sample turnaround time, and sustainable laundry technologies (Laser, Ozone, E-flow) to meet the requirements of premium global brands. Lead the R&D team to create seasonal collections and new developments for Denim and Non-Denim. Help the team to translate buyer tech-packs and inspiration garments into practical wash recipes. Develop cost-effective wash recipes without compromising the aesthetic of the garment. Oversee R&D activities for new washing techniques aligned with fashion trends and sustainability. Spearhead the use of eco-friendly technologies like Laser (Jeanologia/VAV), Ozone (G2), and Nano-bubble (E-flow). Present new developments directly to international buyers and designers during development meetings. Collaborate with production, merchandising, and quality teams to ensure buyer satisfaction and technical compliance. Ensure all wash recipes and chemical usage follow environmental and safety regulations. Conduct trial runs, analyze results, and optimize wash effects and garment quality. Maintain detailed documentation of processes, test reports, and innovation records. Work closely with chemical suppliers and external labs for innovation and compliance testing. Monitor daily production-related technical issues and provide immediate solutions. Skills & Expertise Buy"
  },
  {
    "url": "https://bdjobs.com/h/details/1457733?ln=1",
    "company_name": "Makka Eye Hospital.",
    "job_title": "Optometrist / Refractionist",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Optometrist / Refractionist : Makka Eye Hospital. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Makka Eye Hospital. Optometrist / Refractionist Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Age: 21 to 30 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 21 to 30 years Relevant experience will be preferred. Fresh candidates may also apply if competent and confident in refraction and patient handling. Strong communication skills, professionalism, and discipline are mandatory. Responsibilities & Context HR CIRCULAR Recruitment Notice – Optometrist (Dhaka & Outside Dhaka Posting) Al Noor & Makka Eye Hospital invites applications from qualified, skilled, and experienced candidates for the following position: Position Name: Optometrist Number of Vacancies: 03 Job Location: Dhaka (Only) Duty Schedule: 2 Shifts (As per duty roster) Job Responsibilities The selected candidate will be responsible for, but not limited to, the following duties: Conduct comprehensive eye examinations, refraction, and vision assessment. Perform both manual and auto-refraction accurately and maintain proper records. Assist Ophthalmologists in OPD by providing accurate optometric findings. Carry out necessary diagnostic tests as per hospital facility and requirement. Ensure proper documentation, patient counseling, and professional communication. Maintain optometry equipment and ensure cleanliness and safe handling. Follow organizational policies, professional ethics, and assigned duty schedules. Skills & Expertise Suggested by Health/ Medical Medication management Optometry patients Care Compensation & Other Benefits Salary will be determined based on qualifications and experience.\n3 (Three) Bonuses per year\nYearly Increment (as per policy)\nProvident Fund (PF)\nOther benefits and facilities as per organizational policy. Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Makka Eye Hospital. Follow Address: 1/9,Block-E,Satmasjid Road,Lalmatia,Dhaka-1207. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT "
  },
  {
    "url": "https://bdjobs.com/h/details/1457737?ln=1",
    "company_name": "Makka Eye Hospital.",
    "job_title": "Doctor (MBBS)",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Doctor (MBBS) : Makka Eye Hospital. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Makka Eye Hospital. Doctor (MBBS) Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 40 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 22 to 40 years Relevant clinical experience in Ophthalmology will be preferred. Strong professional attitude, patient-friendly behavior, and communication skills are mandatory. Responsibilities & Context Recruitment Notice – Ophthalmologist (DO,MS,PGT in Ophthalmology) Al Noor & Makka eye hospital invites applications from qualified, competent, and experienced candidates for the following position: Position Name: Ophthalmologist (Doctor) Number of Vacancies: As per requirement Job Location: Anynch in Al Basar International Foundation. Duty Schedule: 2 Shifts (As per duty roster) Job Responsibilities The selected candidate will be responsible for, but not limited to, the following duties: Provide comprehensive ophthalmic consultation and clinical management of eye patients. Diagnose and treat common and complex ophthalmic conditions as per standard protocols. Perform OPD examinations and prescribe appropriate medical treatment. Advise and manage pre-operative and post-operative patients. Support minor procedures and emergency eye care as required by the hospital. Maintain proper patient documentation, follow-up plans, and medical records. Coordinate with Optometrists, Nursing, OT staff, and other relevant departments to ensure quality patient care. Ensure compliance with hospital policies, medical ethics, and duty discipline. Participate in clinical meetings, quality improvement initiatives, and assigned responsibilities. Skills & Expertise Suggested by Health/ Medical patients Care Compensation & Other Benefits Salary will be determined based on qualifications and experience. 3 (Three) Bonuses per year Yearly Increment (as per policy) Provident Fund (PF) Other benefits and facilities as per organizational policy. Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Makka Eye Hospital. Follow Address: 1/9,Block-E,Satmasjid Road,Lalmatia,Dhaka-1207. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। "
  },
  {
    "url": "https://bdjobs.com/h/details/1457940?ln=1",
    "company_name": "Sakura Language School",
    "job_title": "Computer Operator",
    "location": "Cumilla (Cumilla Adarsha Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Computer Operator : Sakura Language School Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sakura Language School Computer Operator Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 30 years Location: Cumilla (Cumilla Adarsha ... Cumilla (Cumilla Adarsha Sadar) Salary: Tk. 10000 - 15000 (Monthly) Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 30 years Responsibilities & Context Processed and maintained student and office files with accuracy and confidentiality. Prepared, formatted, and edited official documents using Microsoft Word. Created and updated data sheets, reports, and trackers in Microsoft Excel. Managed digital record-keeping and document archiving systems. Designed and edited promotional materials, ID cards, and notices using Adobe Photoshop. Scanned, organized, and verified documents for consultancy and visa processing. Ensured proper file naming, version control, and document classification. Assisted in preparing application files and submission documents. Coordinated with admin and consultancy teams for document requirements. Maintained backup copies of important digital files. Skills & Expertise Microsoft Excel Microsoft Word Photoshop Suggested by Adobe Photoshop Computer Literacy Data Entry (Both English & Bengali) Good Ms office and Emailing skill Compensation & Other Benefits Over time allowance Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Cumilla (Cumilla Adarsha Sadar) Company Information Sakura Language School Follow Address: Khristanpara, Opposite side of moon hospital, Jhawtala, Cumilla. Business: It''s a Japanese Language agency. We teach Japanese Language & We do process Student Visa & Work permit Visa...... Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. M"
  },
  {
    "url": "https://bdjobs.com/h/details/1459096?ln=1",
    "company_name": "Community Development and Health Care Centre (CDHC)",
    "job_title": "একাউন্টস এন্ড এডমিন অফিসার",
    "location": "Patuakhali",
    "salary": null,
    "experience": "2 to 3 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "একাউন্টস এন্ড এডমিন অফিসার : Community Development and Health Care Centre (CDHC) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Community Development and Health Care Centre (CDHC) একাউন্টস এন্ড এডমিন অফিসার Application Deadline : 28 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 6 Age: At most 40 years Location: Patuakhali Salary: Tk. 29000 (Monthly) Experience: 2 to 3 years Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Commerce (BCom) Experience 2 to 3 years Additional Requirements Age At most 40 years বানিজ্য বিভাগে স্নাতক ডিগি। ক্ষুদ্রঋণ কর্মসূচিতে হিসাব ব্যবস্থাপনা কাজে ২/৩ বছরের অভিজ্ঞতা থাকতে হবে। Responsibilities & Context বেসরকারী উন্নয়ণ সংস্থা কমিউনিটি ডেভেলপমেন্ট এ্যান্ড হেল্থ কেয়ার সেন্টার (সিডিএইচসি) পিকেএসএফ এর সহযোগিতায় দীর্ঘদিন যাবৎ ক্ষুদ্রঋণ কর্মসূচি বাস্তাবয়ন করে আসছে। সংস্থার কর্মএলাকা পটুয়াখালী জেলায় ক্ষুদ্রঋণ কর্মসূচির লিখিত পদে জনবল নিয়োগ করার জন্য উপযুক্ত প্রার্থীদের থেকে দরখাস্ত আহবান করা হচ্ছে। বিস্তারিত জানার জন্য ভিজিট করুন www.cdhcbd.org Skills & Expertise microfinance Suggested by Accounts and Finance Compensation & Other Benefits শিক্ষানবিশকালে মাসিক ২৯,০০০/-টাকা প্রদান করা হবে। তবে অধিক যোগ্যতাসম্পন্ন প্রার্থীর ক্ষেত্রে আলোচনা সাপেক্ষে নির্ধারণ করা হবে। Workplace Work at office Employment Status Full Time Job Location Patuakhali Apply Procedure Hard Copy শর্তসমূহ: ১.চাকুরী স্থায়ী হলে বেতন-ভাতা ছাড়া সংস্থার পলিসি অনুসারে প্রভিডেন্ট ফান্ড, গ্রাচুইয়িটি, বৈশাখী ভাতা, উৎসব বোনাস, মোটর সাইকেলের জ্বালানী খরচ, মোবাইল বিল, লাঞ্চ ভাতা ইত্যাদি সুযোগ সুবিধা প্রদান করা হবে। ২.শুক্র ও শনিবার দুই দিন সাপ্তাহিক ছুটি। এছাড়া বছরে ২০ দিন নৈমিত্তিক ও ১২ দিন মেডিকেল ছুটি রয়েছে। ৩.প্রার্থীর বৈধ ড্রাইভিং লাইসেন্স থাকতে হবে এবং মোটর সাইকেল চালিয়ে মাঠ পর্যায়ে কাজ করতে হবে। নিজস্ব মোটর সাইকেল থাকা প্রার্থীদের অগ্রাধিকার দেওয়া হবে। ৪.শিক্ষানবিশকাল ০৪ (চার) মাস। তবে অধিকতর দক্ষতা সম্পন্ন প্রার্থীদের ক্ষেত্রে শিক্ষানবিশকাল শিথিলযোগ্য হতে পারে। ৫.কার্যক্রম বাস্তবায়নের স্বার্থে সংস্থার যেকোনো শাখা কার্যালয়ে কাজ করার মানসিকতা থাকতে হবে। আগ্রহী প্রার্থীদের আগামী ২৮/০২/২৬ খ্রিস্টাব্দে বিকাল ৫.০০ ঘটিকার মধ্যে এক কপি রঙ্গিন পাসপোর্ট সাইজ ছবি, সকল শিক্ষাগত যোগ্যতা, অভিজ্ঞতা ও জাতীয় পরিচয় পত্রের ফটোকপি সংযুক্ত করে কভার লেটারসহ সিভি হার্ডকপি ডাক যোগে নির্বাহী পরিচালক, সিডিএইচসি, দাস এন্ড ব্রাদার্স বিল্ডিং (৪র্থ তলা), আড়ৎপট্টি, খেয়াঘাট, গলাচিপা, পটুয়াখালী এই ঠিকানায় এবং সফ্ট কপি md.ramiz518@gmail.com এই ঠিকানায় পাঠানোর জন্য অনুরোধ করা হচ্ছে। Company Information Community Development and Health Care Centre (CDHC) Follow More jobs from this company Address: 306/2 Godaun Road, Golachipa, Potuakhali, Barishal Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচ"
  },
  {
    "url": "https://bdjobs.com/h/details/1459258?ln=1",
    "company_name": "National Green Environment",
    "job_title": "Manager/Sr. Executive/Executive Marketing",
    "location": "Dhaka",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "16 Mar 2026",
    "job_description": "Manager/Sr. Executive/Executive Marketing : National Green Environment Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List National Green Environment Manager/Sr. Executive/Executive Marketing Application Deadline : 16 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 25 to 40 years Location: Dhaka Salary: Negotiable Experience: 1 to 5 years Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Business Administration (BBA) in Marketing Master of Business Administration (MBA) in Marketing Experience 1 to 5 years The applicants should have experience in the following business area(s): Consulting Firms Freshers are also encouraged to apply. Additional Requirements Age 25 to 40 years Responsibilities & Context Develop and implement marketing and sales strategies to promote environmental consultancy and ETP-related services. Identify and generate new business leads from industrial, hospital, commercial, and infrastructure projects . Maintain strong relationships with clients and provide pre- and post-sales support . Conduct market visits and coordinate with technical teams for project understanding and proposal preparation . Prepare and submit marketing proposals, quotations, and follow-up reports . Achieve assigned sales targets and business growth objectives . Monitor market trends related to environmental compliance and DoE regulations . Submit regular activity and performance reports to management. Supervise junior marketing executives (for senior positions). Skills & Expertise Sales & Marketing Pharmaceutical/ Medical Marketing Hospital Marketing Compensation & Other Benefits Mobile bill,T/A,Performance bonus Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Job Location Dhaka Job Highlights Career opportunity at National Green Environment to work in the environmental and sustainability sector. Nationwide marketing exposure, performance-based growth, client interaction, leadership development, and long-term career advancement. Company Information National Green Environment Follow Address: Khan Vila, House# 14, Road# 7, Satmosjid Housing, Chad Uddan, Mohammadpur, Dhaka-1207. Website: www.nge.net.bd Business: Consultancy of Department of Environment (DoE) & Waste Water Treatment Plant like, ETP, STP, WTP, WWTP, RO, Drinking Water, Iron Removal, ZLD etc. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদে"
  },
  {
    "url": "https://bdjobs.com/h/details/1459038?ln=1",
    "company_name": "Visual Knitwears Ltd.",
    "job_title": "Payroll Executive",
    "location": "Chattogram",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Payroll Executive : Visual Knitwears Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Visual Knitwears Ltd. Payroll Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 35 years Location: Chattogram Salary: Negotiable Published: 14 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context Manage end-to-end payroll processing for factory employees (staff and workers). Collect, verify, and consolidate attendance, overtime, leave records, and production-based incentives. Ensure accurate calculation of gross salary, deductions (PF, ESI, tax, advances, etc.), and net pay. Process payroll in compliance with company policies and statutory regulations. Maintain confidentiality and accuracy in all payroll-related matters. Coordinate with the production/HR team to maintain and verify daily attendance, overtime, and shift records. Monitor biometric/attendance software and resolve discrepancies. Prepare reports on absenteeism, daily OT cost and unauthorised OT cost, late arrivals, and shift patterns. Coordinate with the accounts/finance department for salary disbursement via bank (Brac and Bkash) or cash. Prepare monthly salary sheet, payslips, and payroll reconciliation reports. Prepare Yearly annual leave encashment report. Provide cost centre or department-wise wage summaries to management. Maintain accurate employee records (personal details, wage structure, statutory details, etc.) in HRMS/payroll software (GTR). Update employee records on joining, resignation, increment, promotion, or transfer. Ensure proper documentation of full & final settlements for resigned employees. Support internal and external payroll audits with necessary reports and documentation. Implement and monitor payroll control procedures to minimize errors and fraud. Conduct periodic reconciliation of payroll with attendance and finance records. Liaise with HR, Accounts, Production, and Compliance teams for smooth payroll operations. Handle employee queries related to salary, deductions, and payslips. Assist management in preparing budgets and manpower cost analysis. Skills & Expertise Daily Report Employee Attendance HR and Administration HRIS/ HR Database Management Labor Law Microsoft Excel Payroll Preparing Salary Sheet Self-confident Suggested by MS Office Human Resource Management Compensation & Other Benefits Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Job Location Chattogram Company Information Visual Knitwears Ltd. Follow More jobs from this company Address: 295 Shafi Complex, Hathazari Road, Jalalabad, Chittagong-4214 Business: A 100% export oriented RMG and knit fabric manufacturer specialized in knit garments as"
  },
  {
    "url": "https://bdjobs.com/h/details/1459254?ln=1",
    "company_name": "Fish Vally",
    "job_title": "Head of Marketing",
    "location": "Dhaka (Jatrabari)",
    "salary": "Tk. 30000 - 40000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Head of Marketing : Fish Vally Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fish Vally Head of Marketing Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: At least 22 years Location: Dhaka (Jatrabari) Salary: Tk. 30000 - 40000 (Monthly) Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 22 years Responsibilities & Context Fish Vally is one of Bangladesh’s fastest-growing fresh fish e-commerce brands, delivering naturally sourced fish directly from fishermen to customers’ homes. As we continue to scale our operations and target aggressive growth, we are looking for a highly strategic and result-driven Head of Marketing to lead our marketing division and transform it into a powerful revenue engine. Key Responsibilities: Develop and execute a full-funnel marketing strategy focused on revenue growth. Plan and manage high-performing digital campaigns (Facebook, Instagram, Google, and other relevant platforms). Lead the performance marketing team to achieve monthly sales targets. Control Customer Acquisition Cost (CAC) and improve Return on Ad Spend (ROAS). Build strong customer retention and repeat purchase strategies. Analyze data, customer behavior, and campaign performance to make informed decisions. Collaborate with content, creative, and operations teams to ensure brand consistency and conversion-focused communication. Allocate and optimize marketing budgets for maximum profitability. Requirements: Proven experience in performance marketing and digital growth. Strong analytical mindset with the ability to make data-driven decisions. Leadership experience managing marketing teams. Experience in e-commerce or fast-scaling consumer brands will be highly preferred. Ability to work in a target-driven, fast-paced environment. Candidates who have previously worked in established e-commerce companies will be given strong priority. Compensation & Benefits: Performance-based bonuses tied to revenue growth Career growth opportunity in a rapidly expanding company Direct involvement in strategic business decisions If you are passionate about building brands, scaling revenue, and leading high-impact campaigns, we would love to hear from you. Skills & Expertise Sales & Marketing Digital Marketing (Social Media Marketing) SEO and Digital Marketing Telemarketing Reporting and Documentation Sales target Customer Service Sales Funnel management Business Planning and Budgeting Team Leadership Consumer Behavior Understanding Workplace Work at office Employment Status Full Time Job Location Dhaka (Jatrabari) Company Information Fish Vally Follow Address: Hayat Villa\r\nHolding No: 84/7/kha\r\nNorth Jatrabari\r\nBibir Bagicha 1 no Gate Business: Fish Vally Rep"
  },
  {
    "url": "https://bdjobs.com/h/details/1459243?ln=1",
    "company_name": "AW Communication",
    "job_title": "Training Coordinator",
    "location": "Chattogram (Agrabad)",
    "salary": "Negotiable",
    "experience": "",
    "education": "Graduation in any discipline",
    "deadline": "20 Feb 2026",
    "job_description": "Training Coordinator : AW Communication Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List AW Communication Training Coordinator Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 20 to 38 years Location: Chattogram (Agrabad) Salary: Negotiable Published: 14 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 38 years Responsibilities & Context Job Summary We are seeking a proactive and organized Training Coordinator to manage and execute our training programs effectively. The ideal candidate will be responsible for coordinating training schedules, communicating with trainers and trainees, generating and managing leads, onboarding participants, maintaining documentation, and supporting marketing activities both online and offline. This role requires strong communication skills, administrative capability, and the ability to handle multiple responsibilities simultaneously. Key Responsibilities 1. Training Program Coordination Plan, organize, and coordinate training sessions and workshops Prepare and manage training schedules Ensure smooth execution of all training activities Coordinate logistics including venue, materials, and technical requirements 2. Communication Management Maintain regular communication with trainers and trainees Provide necessary updates, reminders, and follow-ups Handle trainee queries and provide proper guidance 3. Lead Generation & Conversion Collect leads from prospective trainees Communicate with potential candidates and explain course details Follow up with interested prospects Convert leads into confirmed enrollments 4. Onboarding & Documentation Manage trainee registration and onboarding process Maintain proper documentation of all training programs Track attendance, payments, and participant records Prepare reports on training performance and participation 5. Marketing Support (On-field & Off-field) Assist in organizing promotional campaigns Participate in on-field marketing activities Support digital and offline promotional efforts Build partnerships for training promotion Educational Requirements Graduation in any discipline Experience Requirements Minimum 1 year of relevant experience (Training coordination, education management, sales, or marketing preferred) Required Skills Strong communication and interpersonal skills Organizational and time management skills Basic knowledge of MS Office / Google Workspace Lead management and follow-up capability Ability to work independently and as part of a team Salary Negotiable (Based on experience and skill level) Job Type Full-time Skills & Expertise Training & Development Coordination Workplace Work at office Employment Status Full Time Job Location Chattogram (Agrabad) Company Information AW Communication Follow Address: Chatt"
  },
  {
    "url": "https://bdjobs.com/h/details/1459208?ln=1",
    "company_name": "A Growing Animal Feed Manufacturing Company",
    "job_title": "Officer/Sr. Officer, QA & QC (Feed Mill)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Mar 2026",
    "job_description": "Officer/Sr. Officer, QA & QC (Feed Mill) : A Growing Animal Feed Manufacturing Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Growing Animal Feed Manufacturing Company Officer/Sr. Officer, QA & QC (Feed Mill) Application Deadline : 16 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: At least 25 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Must have practical experience in Feed Mill. Should have good communication skills. Responsibilities & Context 2. Key Responsibilities A. Raw Material Quality Control Inspect and sample all incoming raw materials including: Verify materials against approved specifications: Conduct on-site physical and rapid tests (where applicable). Ensure sampling is done scientifically and samples are properly labeled and retained. Accept or reject raw materials. Coordinate with Store to ensure segregation of accepted, and rejected materials. B. Finished Goods Quality Control Monitor finished feed quality for Pellet durability, Crumble size, Mash uniformity, Color & smell, Moisture level Ensure finished goods meet Nutritional formulation, and Physical appearance standards Retain reference samples batch-wise for traceability. C. In-Process Quality Control Monitor critical control points (CCPs) like Grinding (particle size), Mixing (CV value), Conditioning & pelleting temperature, Cooling & bagging etc. Ensure correct formulation & batching accuracy. Immediately report deviations and assist Production to take corrective action. Ensure proper cleaning & flushing between medicated and non-medicated feed. D. Documentation & Records Management Maintain accurate QA & QC documentation including Raw material inspection reports, Finished goods inspection reports, Batch records, Test results, Rejection & non-conformance reports etc. Maintain proper sample retention records. Skills & Expertise Suggested by Quality Control Raw material analysis Feed production Quality Assurance Compensation & Other Benefits Provident fund Salary Review: Yearly Festival Bonus: 2 Attractive remuneration package will be provided to the deserving candidates. Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information A Growing Animal Feed Manufacturing Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখ"
  }
]