[
  {
    "url": "https://bdjobs.com/h/details/1450841?ln=1",
    "company_name": "Section Seven Ltd.",
    "job_title": "Executive - Welfare",
    "location": "Chattogram",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Executive - Welfare : Section Seven Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Section Seven Ltd. Executive - Welfare Application Deadline : 16 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 35 years Location: Chattogram Salary: Negotiable Published: 17 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context Assist new workers during onboarding/induction and ensure they are aware of company rules, benefits, and welfare services. To prepare & keep training documents as per training schedule. To advise and brief workers on Use of PPE, Machine guarding, Sanitation, OSH etc. Carrying out daily floor visit to check housekeeping and conduct welfare inspections to identify improvement areas. To monitor & check the health, safety & welfare related issues, prepare list & take the necessary steps for correction under the supervision of the team leader. To attend & prepared documents of different committee meeting (such as: Participation Committee, Safety Committee, Canteen Committee, Grievance Handling Committee etc.) Maintaining a register of accidents/injuries. Analyzing root causes and taking appropriate corrective actions. To establish a liaison and discussion mechanism to maintain a cooperative relationship between the employer or factory management and the workers. To look after various facilities (such as: canteen, dining, childcare centers, adequate sanitation facilities, drinking water, etc.). Organize & conduct maternity awareness training with maintain documents on monthly basis & counseling pregnant workers on a regular basis. Follow up pregnant workers and to suggest female workers on procedure on availing of maternity leave and how to get the maternity benefits and to keep tracks of workers on maternity leave and to check out the reason if workers does not join after availing the maternity leave and also check out the well-being of workers those plans to avail maternity leave and ensuring maternity benefits. Arrange a health checkup for the workers working hazardous tasks and make a document on it. Maintaining complaint register. Reviewing complaint box in a timely manner and ensuring necessary action. To understand the grievances of workers and assist the employer and workers in resolving mutual disputes. To keep co-ordination with the medical officer of the factory for better services and treatment of workers. Monitor and take action the harassment and abuse of workers. Maintain updated knowledge of buyer compliance standards (BSCI, SEDEX, WRAP, GOTS, GRS, etc.) Assist to HR & Compliance team during audits. Prepare necessary reports and submit to management regularly, as and when required. To do any work assigned by the higher authority. Skills & Expertise Go"
  },
  {
    "url": "https://bdjobs.com/h/details/1453035?ln=1",
    "company_name": "Discount lover bangladesh",
    "job_title": "Motion Video Editor",
    "location": "Dhaka (Banasree)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Motion Video Editor : Discount lover bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Discount lover bangladesh Motion Video Editor Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 18 to 40 years Location: Dhaka (Banasree) Salary: Negotiable Published: 23 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 40 years Strong Command of video editing software (Adobe Premier Pro, After Effects, Adobe & illustrator Understanding of social media video formats and trends Strong storytelling and visual sense Ability to manage deadlines and work responsibly Ability to creat high-quality video content and motion graphics that meet branding and marketing Creative thinker with attention to details and problem-solving skills Cinemaology expertise for both indoor and outdoor settings ensuring high quality visuals Knowledge of lighting techniques to creat optimal video shots Student from any reputed university are welcome to apply Responsibilities & Context Edit raw video footage into polished final products incorporation special effects transition and soundtrack Drone flying ability to capture footage Assist with content planning and strategy development for campaign Skills & Expertise Photo and video editing software Product video making Video and sound editing Video content creating Video Editing Videography Suggested by Adobe Photoshop Drone Fly Video Production Employment Status Full Time Job Location Dhaka (Banasree) Company Information Discount lover bangladesh Follow Address: H-96,R-20/2,block-K south bonosree Dhaka 1219 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre "
  },
  {
    "url": "https://bdjobs.com/h/details/1457667?ln=1",
    "company_name": "Yameen Tours and Travels",
    "job_title": "Marketing Manager",
    "location": "Dhaka (Banani)",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Marketing Manager : Yameen Tours and Travels Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Yameen Tours and Travels Marketing Manager Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 03 Age: 24 to 36 years Location: Dhaka (Banani) Salary: Negotiable Experience: 1 to 5 years Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Commerce (BCom) in Brand Management HSC in Commerce Experience 1 to 5 years The applicants should have experience in the following business area(s): Group of Companies, Immigration/Visa Processing Freshers are also encouraged to apply. Additional Requirements Age 24 to 36 years Have strong interpersonal and leadershiop skills Have excellent verbal and written communication skills Have ability to monitore marketing Responsibilities & Context Initiate and execute post sales services to customers and ensure customer retention . Establishing the agency’s reputation as a reliable partner through success stories , testimonials , and industry through leadership . Building and maintain relationshiops with other recruitment agencies , overseas employers,and local agents. Montoring the agencies and working strategies Overseeing the agency’s “driving new client acquisition by creating  good proposals . Skills & Expertise Creative Thinking and Multitasking Planning and monitoring Strong communication Skiills Strong self-motivation and drive Typing Skill - Bengali and English Suggested by Client Relationship Management Sales & Marketing Sales target Customer Service Compensation & Other Benefits lunch facility Performance bonus Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Banani) Company Information Yameen Tours and Travels Follow More jobs from this company Address: House-79,Block-J,Chairmanbari, Banani,Dhaka-121 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register No"
  },
  {
    "url": "https://bdjobs.com/h/details/1458745?ln=1",
    "company_name": "alliance builders ltd",
    "job_title": "PS to MD cum Front Desk",
    "location": "Dhaka (Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "PS to MD cum Front Desk : alliance builders ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List alliance builders ltd PS to MD cum Front Desk Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 24 to 35 years Location: Dhaka (Mirpur) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 24 to 35 years Facebook Youtube Linkdin Responsibilities & Context Greet and welcome visitors with a friendly and professional demeanor. Manage phone calls, emails, and inquiries, directing them to the appropriate departments. Handle check-ins, check-outs, and appointment scheduling efficiently. Maintain a clean and organized reception area. Assist with administrative tasks, including filing, data entry, and handling mail. Provide information and assistance to guests or clients as needed. Ensure security by following procedures and monitoring access to the premises. Support other departments with tasks as required. Communicate with T&T person and Ensure connectivity Managing schedules and appointments of the Managing Director and updating him regularly. Manage the daily schedule, meeting and appointment of the Managing Director. Provide comprehensive secretarial and administrative support to Managing Director. Draft, review and manage official correspondence, reports and documents of behalf of the Managing Director. Manage meeting minutes & reporting. Maintaining confidential papers, files and agreement of The Managing Director’s work. Handling all sorts of personal accounts of Managing Director. Any other job assign by Management. Skills & Expertise Digital Marketing (Social Media Marketing) Suggested by Personal Secretary Administration Front Desk Compensation & Other Benefits T/A,Mobile bill Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur) Company Information alliance builders ltd Follow Address: 640, 1st floor floor, west kazipara, opposite side of shopno life, mirpur, dhaka-1216 Business: we are one of the pioneer real estate firm in bangladesh. we have many projects all around in dhaka city. we construct building and sell apartments to the prospective buyer. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627"
  },
  {
    "url": "https://bdjobs.com/h/details/1458743?ln=1",
    "company_name": "Retina Health Care",
    "job_title": "Accounts Office",
    "location": "Gazipur (Gazipur Sadar, Sreepur)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Accounts Office : Retina Health Care Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Retina Health Care Accounts Office Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: At least 25 years Location: Gazipur (Gazipur Sadar, S... Gazipur (Gazipur Sadar, Sreepur) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Responsibilities & Context ইনভেন্টরি ও স্টক ম্যানেজমেন্ট (Inventory & Stock) Raw Materials Tracking: ফ্যাক্টরির কাঁচামাল এবং প্যাকেজিং ম্যাটেরিয়ালসের স্টক নিয়মিত পর্যবেক্ষণ করা। Stock Reconciliation: ফিজিক্যাল স্টক (যা বাস্তবে আছে) এবং সফটওয়্যার বা খাতার হিসেবের মধ্যে মিল রাখা। Damage & Waste Analysis: নষ্ট হওয়া পণ্য বা ওয়েস্টেজ আইটেমের সঠিক হিসাব রাখা এবং রিপোর্ট তৈরি করা। Finished Goods Entry: ফ্যাক্টরিতে উৎপাদিত পণ্য স্টকে ঢোকানো এবং তার সঠিক ভ্যালুয়েশন করা। প্যাকেজিং ও প্রোডাকশন কস্টিং (Packaging & Costing) Packaging Inventory: প্যাকেজিং ইউনিটের প্রতিটি আইটেমের (বক্স, লেবেল, কার্টন) ইন-আউট ট্র্যাকিং। Product Costing: একটি পণ্য তৈরিতে কত টাকার ম্যাটেরিয়াল ও প্যাকেজিং খরচ হচ্ছে তা নির্ণয় করা। Supplier Coordination: প্যাকেজিং সাপ্লায়ারদের বিল চেক করা এবং পেমেন্টের ব্যবস্থা করা। অ্যাকাউন্টস ও ডাটা এন্ট্রি (General Accounting) Daily Transaction: প্রতিদিনের আয়-ব্যয়ের ভাউচার তৈরি এবং সিস্টেমে এন্ট্রি দেওয়া। Ledger Maintenance: ক্রেতা (Party) এবং সরবরাহকারীদের (Supplier) লেজার বা খতিয়ান নিয়মিত আপডেট রাখা। Petty Cash: হেড অফিস বা ফ্যাক্টরির ছোটখাটো দৈনন্দিন খরচ (Petty Cash) ব্যবস্থাপনা। Banking: ব্যাংকে টাকা জমা দেওয়া, তোলা এবং ব্যাংক স্টেটমেন্টের সাথে ক্যাশ বুক মিলানো। রিপোর্টিং ও মনিটরিং (Reporting) Weekly/Monthly Reports: প্রতি সপ্তাহ বা মাসের শেষে স্টকের অবস্থা এবং খরচের রিপোর্ট ম্যানেজমেন্টকে জমা দেওয়া। Audit Support: বার্ষিক বা অর্ধবার্ষিক অডিট করার সময় প্রয়োজনীয় তথ্য ও ডকুমেন্ট দিয়ে সহায়তা করা। Head Office Coordination: ফ্যাক্টরির কাজের আপডেট নিয়মিত হেড অফিসে পাঠানো। Skills & Expertise ERP Software Microsoft Excel Microsoft Office Quickbooks Tally Software Suggested by ERP Software Tally Software Tally ERP 9 Employment Status Full Time Job Location Gazipur (Gazipur Sadar, Sreepur) Company Information Retina Health Care Follow Address: Corporate Office: 53, T&T Road, Wareless Gate, Gazipur\nWhat'sApp: 01540800007 Business: Health Care Product Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complai"
  },
  {
    "url": "https://bdjobs.com/h/details/1458796?ln=1",
    "company_name": "Star Tech & Engineering Ltd.",
    "job_title": "Assistant Manager-Product(Mobile)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Mar 2026",
    "job_description": "Assistant Manager-Product(Mobile) : Star Tech & Engineering Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Star Tech & Engineering Ltd. Assistant Manager-Product(Mobile) Application Deadline : 12 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 35 to 45 years Location: Dhaka Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 35 to 45 years Ability to work under pressure and meet deadlines. Strong organizational and leadership skills. Passion for technology and innovation. Responsibilities & Context Job Context Star Tech Ltd. is seeking a competent professional for the role of Assistant Manager – Product (Mobile) , responsible for planning, managing, and executing mobile product strategies. The position requires effective coordination with suppliers and internal teams to ensure market-driven product decisions and support business growth. Job Responsibilities Develop and implement mobile product strategies aligned with company goals and market trends. Conduct market research, competitor analysis, and customer demand assessment to guide product decisions. Analyze product performance and recommend improvements, new launches, or discontinuation strategies. Coordinate with mobile brands, suppliers, and distributors for product sourcing and procurement. Negotiate pricing, commercial terms, and supply agreements to ensure competitive procurement. Ensure timely availability of products while maintaining optimal inventory levels. Manage the full product lifecycle from planning, sourcing, and launch to post-launch performance review. Monitor product pricing, margins, and profitability across all sales channels. Work closely with marketing teams to plan product launches, promotions, and campaigns. Prepare product forecasts, sales plans, and demand projections. Track sales performance, stock movement, and market response to ensure target achievement. Identify opportunities to increase sales, market share, and product visibility. Collaborate with sales, marketing, supply chain, and operations teams to ensure smooth execution of product plans. Train internal teams on new mobile products, features, specifications, and competitive positioning. Provide regular product insights and performance reports to management. Skills & Expertise Analytical Skill Email/Internet Proficiency Excellent communication and presentation skills Interpersonal Skill Patience Professionalism Smart and Dedicated Teamwork Compensation & Other Benefits Attractive salary package Leave: Encashment Mobile Allowance Salary Review: Yearly Lunch Facilities: Fully Subsidized Festival Bonus: 2 TA/DA (As per policy) Credit Card Insurance (Life & Health) Umrah Hajj (As per policy) Workplace Work at office Employment Status F"
  }
]