[
  {
    "url": "https://bdjobs.com/h/details/1454205?ln=1",
    "company_name": "FnF Pharmaceuticals Ltd.",
    "job_title": "Microbiologist",
    "location": "Jhenaidah",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Microbiologist : FnF Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List FnF Pharmaceuticals Ltd. Microbiologist Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: At least 28 years Location: Jhenaidah Salary: Negotiable Published: 27 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 28 years Responsibilities & Context R&D (Research and Development) Biological Unit. To carry out any other relevant tasks assigned by the Line Manager and authority, when necessary. Skills & Expertise Medicine Product Development Veterinary medicine Suggested by Medicine Product Development Compensation & Other Benefits Mobile bill,Provident fund Salary Review: Yearly Festival Bonus: 2 And other advantages, as per company policy. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Jhenaidah Read Before Apply Important Notice: We encourage all applicants to carefully read the full job description before applying. This ensures that your skills and experience align with the role, allowing us to better assess your suitability. Thank you for taking the time to review the details thoroughly! Company Information FnF Pharmaceuticals Ltd. Follow More jobs from this company Address: Corporate Office: Urban Stream Com. Complex, Level # 03, 18, New Eskaton (R.K Menon Road), Dhaka- 1000 Business: FnF Pharmaceuticals Ltd. is a fast growing, Innovative, research oriented company and the First vaccine manufacturing Industry in the Private sector of Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 096386"
  },
  {
    "url": "https://bdjobs.com/h/details/1457010?ln=1",
    "company_name": "Mahbuba International Trading Co.",
    "job_title": "Service Engineer",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Service Engineer : Mahbuba International Trading Co. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mahbuba International Trading Co. Service Engineer Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Anywhere in Bangladesh Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 2 years of relevant working experience. Experience in the related industrial machinery/service field will be preferred. Sound knowledge of PLC, HMI, Servo Motor, Motor Driver, Switching, and Troubleshooting. Strong problem-solving and technical diagnostic skills. Good communication skills with customers and internal teams. Responsibilities & Context Identify problems, troubleshoot, and repair industrial machinery, and ensure proper follow-up. Schedule appointments with existing and potential customers and visit them to collect technical requirements. Submit regular service and activity reports to the concerned authority. Install all kinds of machinery used in Garments Accessories Industries. Maintain strong communication with customers/clients and provide effective after-sales service. Skills & Expertise communication and interpersonal skill. Communication in English Industrial Engineering MS Excel MS Word Technical Skills Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Mahbuba International Trading Co. Follow More jobs from this company Address: HOUSE NO: 502 (4TH FLOOR), LANE - 9, DOHS BARIDHARA, DHAKA, BANGLADESH Business: MITC IS AN INDENTING COMPANY DEALS THE RMG AND ITS LINKAGE INDUSTRY. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is availa"
  },
  {
    "url": "https://bdjobs.com/h/details/1454258?ln=1",
    "company_name": "European International",
    "job_title": "Sr Counsellor / Counsellor",
    "location": null,
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Sr Counsellor / Counsellor : European International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List European International Sr Counsellor / Counsellor Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 6 Age: 20 to 40 years Location: Dhaka (Banani) Salary: Negotiable Published: 27 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 40 years Fresher’s are encouraged to apply. Honest & hard working Experience Candidate from Education Consultancy will be given preference. Must have good command over the English language. Computer skill : MS Word, Excel, English Typing, email, internet researching, etc. Must be polite, patient, honest, and loyal to the work. Responsibilities & Context Provide comprehensive counseling to students and their families on education abroad options and opportunities Guide students through the application and enrolment process for education abroad Build and maintain relationships with students, their families, and institutions abroad Stay up-to-date on education abroad options and opportunities, as well as changes in laws and regulations affecting international students Provide accurate and timely reports on counseling and enrolment progress Attend and participate in education fairs and other events to promote our services Providing students with materials related to a career of their choice or career counseling to suit their skills. Job Location: House 05, Road 17, Block D, Banani, Dhaka-1213 Skills & Expertise Suggested by Counseling Education Counseling Student Counseling Compensation & Other Benefits T/A, Mobile bill, Tour allowance, Performance bonus Salary Review: Yearly Festival Bonus: 2 Employment Status Full Time Job Location Dhaka (Banani) Apply Procedure Email Your CV Send your CV to the given email career.european@gmail.com or Email your CV from My Bdjobs account Company Information European International Follow Address: House# 42/A (4th floor), Road # 9/A, Dhanmondi, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FR"
  },
  {
    "url": "https://bdjobs.com/h/details/1456981?ln=1",
    "company_name": "Mahbuba International Trading Co.",
    "job_title": "Asst. Manager/ Sr. Executive - Commercial",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Asst. Manager/ Sr. Executive - Commercial : Mahbuba International Trading Co. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mahbuba International Trading Co. Asst. Manager/ Sr. Executive - Commercial Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Location: Anywhere in Bangladesh Salary: Negotiable Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have experience in the following business area(s): Indenting Firm/Any Export House and other organizations Good communication in English. Proficiency in MS Word & MS Excel. Responsibilities & Context Corresponding with suppliers for price, preparing CS, finalizing order, taking delivery schedule and collection Proforma Invoice. Checking Proforma Invoice for necessary correction. Reviewing Letters of Credit to ensure the absence of unacceptable or incorrect clauses. Container/Cargo/Ship, Arrival/Berthing follow up. Verifying import documents-such as the Commercial Invoice, Packing List, Bill of Lading, and Certificate of Origin-and making corrections if necessary; preparing and submitting draft/final shipping documents to the buyer. Coordinating with the buyer/importer/bank to facilitate acceptance or payment release; regularly reporting updates to senior management. Providing timely reports to senior authorities through well-prepared presentations using Excel or other relevant tools. Good communication with customers/clients as customers services. Skills & Expertise Communication in English Export Commercial MS Excel MS Word Compensation & Other Benefits Mobile bill,Provident fund Lunch Facilities: Partially Subsidize Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Mahbuba International Trading Co. Follow More jobs from this company Address: HOUSE NO: 502 (4TH FLOOR), LANE - 9, DOHS BARIDHARA, DHAKA, BANGLADESH Business: MITC IS AN INDENTING COMPANY DEALS THE RMG AND ITS LINKAGE INDUSTRY. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury"
  },
  {
    "url": "https://bdjobs.com/h/details/1453837?ln=1",
    "company_name": "Fortress Developments Ltd",
    "job_title": "Assistant Manager (Sub-Zonal)- Constructions Engineer",
    "location": "Dhaka (Basundhara RA)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Assistant Manager (Sub-Zonal)- Constructions Engineer : Fortress Developments Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fortress Developments Ltd Assistant Manager (Sub-Zonal)- Constructions Engineer Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 27 to 45 years Location: Dhaka (Basundhara RA) Salary: Negotiable Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 27 to 45 years Responsibilities & Context Oversee multiple construction projects within the assigned sub-zone. Ensure projects are executed as per approved plans, drawings, schedules, and budgets. Monitor overall progress and ensure timely completion of works. Support site teams in resolving execution and coordination issues. Assist in preparation and review of project execution plans and schedules. Coordinate between site engineers, contractors, consultants, and zonal office. Ensure availability of manpower, materials, and equipment at project sites. Facilitate inter-departmental coordination (planning, procurement, QA/QC, HSE). Ensure implementation of safety and environmental policies at all sites. Monitor site safety practices and compliance with statutory regulations. Support safety audits, inspections, and corrective action implementation. Promote safe work culture across the sub-zone. Supervise site engineers, supervisors, and support staff in the sub-zone. Provide technical guidance and mentoring to site teams. Evaluate team performance and recommend training or corrective measures. Promote discipline, productivity, and teamwork. Prepare and submit periodic progress, quality, cost, and safety reports. Maintain records of project status, issues, and risk mitigation actions. Update zonal management on achievements, delays, and challenges. Identify risks, bottlenecks, and improvement opportunities in sub-zonal projects. Support implementation of best practices and standard operating procedures. Assist zonal management in audits, reviews, and strategic initiatives. Skills & Expertise Construction engineering Cost control Creative Thinking and Multitasking Problem solving and decision making project coordination Site Engineering Compensation & Other Benefits Provident fund,Gratuity,Mobile bill Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 3 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Basundhara RA) Job Highlights Assist in planning, execution, and supervision of construction works. Ensure project progress as per approved drawings, specifications, schedules, and budgets. Coordinate with site engineers & contractors for smooth site operations. Company Informa"
  },
  {
    "url": "https://bdjobs.com/h/details/1456826?ln=1",
    "company_name": "SEBPO",
    "job_title": "Executive - Digital Advertising (Night Shift)",
    "location": "Dhaka (Kawran Bazar, Mohakhali)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Executive - Digital Advertising (Night Shift) : SEBPO Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SEBPO Executive - Digital Advertising (Night Shift) Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 40 Age: 22 to 35 years Location: Dhaka (Kawran Bazar, Moha... Dhaka (Kawran Bazar, Mohakhali) Salary: Tk. 15000 - 18000 (Monthly) Published: 03 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 35 years Strong team player with the ability to collaborate effectively across teams. High attention to detail with a strong focus on accuracy and quality. Willingness and ability to work from the office as required. Proficient in Microsoft Office and Google Workspace, with strong expertise in Excel/Google Sheets and PowerPoint/Google Slides. Excellent written and verbal communication skills in English. Basic knowledge of online marketing and digital advertising will be considered an added advantage. Demonstrated critical thinking skills with sound judgment and practical problem-solving ability. Ability to work in rotational shifts from 02:00 PM to 11:00 PM and 10:00 PM to 07:00 AM; night shift availability is mandatory. Responsibilities & Context SEBPO is looking for experienced or fresh graduates who want to build their careers in the Digital Advertising Industry by working in our Digital Advertising Team. This role works cross-functionally to ensure digital campaigns are set up correctly in production systems, delivery objectives are met, and clients and partners are appropriately billed. Trafficking and QA display and video campaigns/creatives across desktop, mobile, and tablet. Troubleshooting Ad Delivery and creative issues. Pulling and analyzing reports from various third-party platforms/Ad servers to monitor campaign delivery. Performing accounts with cross-functional partners/clients. Managing the work time and prioritizing tasks according to the client’s needs. NIGHT SHIFT for male employees is in WFO - Work From Office mode and female employees is in WFH - Work From Home mode after confirmation OR as and when requested by the team. Probation Period - 03 Months (Fixed) Skills & Expertise Computer Literacy Fluent In English Suggested by Technical Troubleshooting Data analysis Client Management Digital Marketing Compensation & Other Benefits Weekly 2 holidays,Over time allowance Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Life Insurance, Medical Insurance, and Discounts on Diagnostics. Workplace Work at office Employment Status Full Time Job Location Dhaka (Kawran Bazar, Mohakhali) Job Highlights SEBPO is a global outsourcing partner specializing in Ad Operations, Data Solutions, Creative and Software services. Recognized among the USA`s 5000 Fastest Gro"
  },
  {
    "url": "https://bdjobs.com/h/details/1362242?ln=0",
    "company_name": "ASSDcadfaASSDcadfa up asfadgaf up",
    "job_title": "Housekeeper",
    "location": "Pirojpur (Zianagar)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "28 Apr 2026",
    "job_description": "Housekeeper : ASSDcadfaASSDcadfa up asfadgaf up Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ASSDcadfaASSDcadfa up asfadgaf up Housekeeper Application Deadline : 28 Apr 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Pirojpur (Zianagar) Published: 28 Apr 2025 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context Test Employment Status Full Time Job Location Pirojpur (Zianagar) Company Information ASSDcadfaASSDcadfa up asfadgaf up Follow More jobs from this company Address: Building: Arial Kha, House: 182, Flat: 6/c, Dhanmondi, Dhaka-1209 up, Afghanistan; nkC1ARSsW7, Malawi Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1459565?ln=1",
    "company_name": "Display Art",
    "job_title": "Graphics Designer",
    "location": "Dhaka (Bosila, Mohammadpur)",
    "salary": "Tk. 15000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Graphics Designer : Display Art Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Display Art Graphics Designer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 3 Location: Dhaka (Bosila, Mohammadpu... Dhaka (Bosila, Mohammadpur) Salary: Tk. 15000 - 30000 (Monthly) Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Must have strong knowledge of Adobe Photoshop and Adobe Illustrator. Basic knowledge of Microsoft Word & Excel. Creative mindset with a good understanding of typography. Minimum 1–2 years of experience (Fresher’s with a strong portfolio will also be considered). Must be punctual and responsible. Responsibilities & Context Workplace: Office-based Location: Bosila, Mohammadpur, Dhaka Job Responsibilities: Creating creative designs using Adobe Photoshop and Adobe Illustrator. Designing social media posts, banners, flyers, and brochures. Developing logo and complete branding designs. Preparing design output file ready for printing production. Skills & Expertise Adobe Illustrator Adobe Photoshop Suggested by Adobe Illustrator Adobe Photoshop Graphic Design MS Office Workplace Work at office Employment Status Full Time Job Location Dhaka (Bosila, Mohammadpur) Company Information Display Art Follow Address: Sam Market, 1st floor, Road 3, Block C, Bosila Garden City, Mohammadpur , Dhaka. Website: https://www.displayart.com.bd/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is innacurate.” Back to Top ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Da"
  },
  {
    "url": "https://bdjobs.com/h/details/1459625?ln=1",
    "company_name": "Resilient Solutions",
    "job_title": "Marketing & Sales Manager",
    "location": "Dhaka (Mirpur 2, Pallabi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Marketing & Sales Manager : Resilient Solutions Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Resilient Solutions Marketing & Sales Manager Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 25 years Location: Dhaka (Mirpur 2, Pallabi) Salary: Negotiable Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years At least 4–6 years of experience in: B2B outbound marketing Lead generation for IT services / SaaS / BPO Demand generation or SDR leadership Proven success in client acquisition through outbound channels Strong knowledge of LinkedIn outreach, cold email, and sales funnels Experience using CRM and automation tools Analytical mindset with ROI-focused execution Excellent communication and persuasion skills Experience working with global clients (USA/Europe) preferred Familiarity with AI-driven marketing tools and automation platforms Skills & Expertise Outbound Marketing B2B Lead Generation Demand Generation LinkedIn Prospecting Cold Email Strategy CRM Management Sales Funnel Development AI-assisted Marketing Tools Global Client Communication Responsibilities & Context Responsibilities & Context We are seeking a performance-driven professional to lead outbound marketing and client acquisition initiatives for global service delivery. The role focuses on building a consistent pipeline of qualified leads, generating meetings, and onboarding new clients. Key Responsibilities: Plan and execute outbound growth strategies targeting international markets Identify Ideal Customer Profiles (ICP) and build prospect databases Manage LinkedIn, email outreach, and campaign automation Create and optimize outreach messaging and positioning Generate and qualify leads for IT services, AI solutions, and BPO offerings Track campaign performance and optimize conversion funnels Maintain CRM pipelines and reporting dashboards Collaborate with leadership and delivery teams to support proposals and closures Explore partnerships, referrals, and agency collaboration channels Skills & Expertise Capital Market/ Investment Banking Corporate Marketing Digital Marketing (Social Media Marketing) Market Research Marketing Sales & Marketing SEO and Digital Marketing Telemarketing Suggested by Client Relationship Management Customer Relations Sales target Customer Service Compensation & Other Benefits Performance-based incentives\nCareer growth into Growth/Revenue leadership roles\nOpportunity to work with global clients\nLearning environment in AI and automation-driven business\nFestival bonuses as per company policy Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur 2, Pallabi) Company Information Resilient Solutions Follow More jobs from this company Addre"
  },
  {
    "url": "https://bdjobs.com/h/details/1460137?ln=1",
    "company_name": "Graphics Ad",
    "job_title": "কম্পিউটার অপারেটর",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "কম্পিউটার অপারেটর : Graphics Ad Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Graphics Ad কম্পিউটার অপারেটর Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 18 to 30 years Location: Chattogram Salary: Negotiable Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 30 years Responsibilities & Context জরুরী নিয়োগ একটি গ্রাফিক্স এ্যাড্ ফার্মের জন্য বাংলা ও ইংরেজি টাইপ জানা একজন দক্ষ কম্পিউটার অপারেটর আবশ্যক। মোটামুটি কাজ জানা হলেও চলবে। গ্রাফিক্সের কাজ শিখিয়ে নেওয়া হবে। ডিজাইন তৈরি: ক্লায়েন্টের নির্দেশনানুযায়ী ব্যানার, লিফলেট, ক্যাটালগ, বই, এবং প্যাকেজিংয়ের সৃজনশীল ডিজাইন তৈরি করা। প্রি-প্রেস প্রিপারেশন: প্রিন্টিংয়ের জন্য ফাইল রেডি করা (যেমন- bleed, margin, bleed, Resolution, CMYK মোড সেট করা)। সফটওয়্যার দক্ষতা: Adobe Illustrator, Photoshop, InDesign বা CorelDRAW-তে দক্ষ হতে হবে। Skills & Expertise COMPUTER OFFICE MANAGEMENT Computer Literacy Data Entry Operator/ Supervisor Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Chattogram Company Information Graphics Ad Follow More jobs from this company Address: 154 Alkaran Road, Chattogram Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employabil"
  },
  {
    "url": "https://bdjobs.com/h/details/1460454?ln=1",
    "company_name": "Agro Acres Bangladesh",
    "job_title": "Delivery & Order Placement Executive",
    "location": "Dhaka (Keraniganj)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Delivery & Order Placement Executive : Agro Acres Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Acres Bangladesh Delivery & Order Placement Executive Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 35 years Location: Dhaka (Keraniganj) Salary: Tk. 12000 - 18000 (Monthly) Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 35 years Responsibilities & Context Deliver frozen products such as Milk, Yoghurt, Laban and other products of RR Dairy Farm to local shops, distributors, and customer delivery locations Travel using company-assigned frozen / cold-chain vehicle to ensure proper temperature-controlled delivery Collect orders from retailers and distributors and place them to the office for processing Ensure timely and accurate delivery while maintaining product quality and cold-chain integrity Handle loading and unloading of frozen products carefully Collect cash payments from sales points, retailers, and customers, and submit properly to the office Maintain accurate records of delivery, orders, and cash collection Visit assigned market areas regularly to support distribution and product availability Maintain professional behavior and build good relationships with retailers, distributors, and customers Skills & Expertise Delivery Management Suggested by Delivery Management Order Management Order processing Compensation & Other Benefits Festival Bonus: 2 Lunch Facilities: Full Subsidize Living Facilities, Dinner Facility Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Keraniganj) Company Information Agro Acres Bangladesh Follow Address: 382/1 Ibrahimpur, Kafrul, Mirpur, Dhaka-1206, Bangladesh. Website: https://agroacres.com.bd/ Business: AgroAcres, a dynamic leader in Bangladesh''s agro-product sector. We specialize in premium nuts, seeds, spice pastes, and natural food products, catering to a rapidly growing market.\nFounded in Bangladesh in 2020, AgroAcres began its journey with whole spices, nuts, healthy products, and thoughtfully curated gifting items. In 2025, we expanded into consumer convenience with the launch of Curry House—our ready-to-cook range designed to save time and make hassle-free home cooking possible for everyone. Alongside our retail products, we proudly supply corporate gifting solutions and commodity products to universities and offices. At AgroAcres, we combine quality, convenience, and care to support modern lifestyles. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অত"
  },
  {
    "url": "https://bdjobs.com/h/details/1462841?ln=1",
    "company_name": "Kazi abul Hossain  school",
    "job_title": "শিক্ষক",
    "location": "Dhaka (Kafrul)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "শিক্ষক : Kazi abul Hossain  school Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Kazi abul Hossain  school শিক্ষক Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Location: Dhaka (Kafrul) Salary: Tk. 5000 - 7000 (Monthly) Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Additional Requirements বয়সের সীমাবদ্ধতা নেই। বিদ্যালয়ে শিক্ষকতায় অভিজ্ঞতা অগ্রাধিকার পাবে। Responsibilities & Context কাজী আবুল হোসেন হাই স্কুল(EIIN 138611, School code 1429) বাইশটেকী, মিরপুর ১৩ ঢাকা ১২১৬ তে শিক্ষক আবশ্যক। Skills & Expertise Suggested by Classroom teaching Curriculum Development Lesson Planning Teaching/ Training Compensation & Other Benefits প্রয়োজনে একদিন ডেমু ক্লাশ নেয়া হতে পারে।\nবেতন আলোচনা সাপেক্ষে। Workplace Work at office Employment Status Full Time Job Location Dhaka (Kafrul) Company Information Kazi abul Hossain  school Follow Address: Baishtaki,Mirpur 13 Business: ???????? - ??? ?????? ??????? ?????? ???? ?? Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers "
  },
  {
    "url": "https://bdjobs.com/h/details/1459736?ln=1",
    "company_name": "Zynova Textile",
    "job_title": "Junior Executive",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 20000 - 22000 (Monthly)",
    "experience": null,
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Junior Executive : Zynova Textile Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Zynova Textile Junior Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Tk. 20000 - 22000 (Monthly) Published: 16 Feb 2026 Application Insights View Requirements Education Additional Requirements Experience1 to 3 yearsThe applicants should have experience in the following business area(s): Advertising Agency, Audit Firms /Tax Consultant, Business-to-Business (B2B) Software and Services Startup, Direct Selling/Marketing Service Company, Software Company, TelecommunicationFreshers are also encouraged to apply. Responsibilities & Context Make outbound tele sales calls to prospective and existing customers Explain products/services clearly and handle customer objections Achieve daily, weekly, and monthly sales targets Follow up on leads generated through marketing campaigns Maintain accurate records of calls, leads, and conversions Build and maintain positive customer relationships Coordinate with the marketing and sales team to improve performance Employment Status Full Time Job Location Anywhere in Bangladesh Job Highlights Education Bachelor/Honors Master of Business Administration (MBA) Bachelor of Business Administration (BBA) in Marketing Master of Business Administration (MBA) in Marketing Company Information Zynova Textile Follow Address: Dhanmondi, Mirpur, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Da"
  },
  {
    "url": "https://bdjobs.com/h/details/1463142?ln=1",
    "company_name": "Data Head Pvt. Ltd.",
    "job_title": "Diploma Engineer - IoT Device Development & Support",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Diploma Engineer - IoT Device Development & Support : Data Head Pvt. Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Data Head Pvt. Ltd. Diploma Engineer - IoT Device Development & Support Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 18 to 25 years Location: Dhaka Salary: Negotiable Published: 24 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 18 to 25 years Strong knowledge of:Analog & digital electronics Microcontrollers (Arduino/ESP32/STM/others) Sensors and measurement systems Power supply design (SMPS, battery systems) Basic understanding of IoT communication protocols. Ability to read circuit diagrams and technical drawings. Hands-on soldering and PCB troubleshooting skills. Basic computer skills. Responsibilities & Context Job Summary We are looking for a skilled and motivated Diploma Engineer (Electrical & Electronics) to work on our IoT-based devices such as Smart Scale and other work-done measurement systems. The candidate will be involved in circuit design, prototyping, testing, assembling, troubleshooting, and customer technical support. Key Responsibilities IoT Device Development Assist in design and development of IoT-based smart devices. Work with sensors, load cells, microcontrollers, communication modules (WiFi/GSM/Bluetooth, etc.). Support firmware integration and hardware-software interfacing. Circuit Design & PCB Design, analyze, and modify analog and digital circuits. Prepare schematic diagrams and assist in PCB layout. Component selection and BOM preparation. Assembly & Prototyping Assemble prototype devices. Soldering (SMD/through-hole), wiring, and enclosure fitting. Ensure proper grounding, shielding, and safety standards. Testing & Calibration Perform functional testing and calibration of smart scale and measurement devices. Identify and fix hardware issues. Conduct field testing and performance validation. Troubleshooting & Maintenance Diagnose and repair faulty boards and devices. Provide technical support to customers (remote and onsite if required). Maintain service and repair records. Documentation Prepare technical documentation, test reports, and maintenance logs. Assist in user manual preparation. Continuous Improvement Suggest design improvements for better efficiency and cost reduction. Support R&D activities for new product development. Skills & Expertise Assembly Calibration IoT device Microcontroller PCB design Prototyping Sensors Testing Suggested by Assembly Calibration IoT device PCB design Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Data Head Pvt. Ltd. Follow Address: 43, Eskaton Garden Road, Dhaka 1000 Business: Software development & implementation,  and Others IT enable services Report this Job / Company (রিপোর্ট) রিপ"
  },
  {
    "url": "https://bdjobs.com/h/details/1462819?ln=1",
    "company_name": "Farr Bulders & Landmark",
    "job_title": "Project Engineer (Civil Engineering)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Project Engineer (Civil Engineering) : Farr Bulders & Landmark Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Farr Bulders & Landmark Project Engineer (Civil Engineering) Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 28 to 45 years Location: Dhaka Salary: Negotiable Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 28 to 45 years Age preference is flexible for highly deserving candidates. Proven track record in residential, commercial, or mixed-use developments. Strong, practical knowledge of modern construction methodologies, materials, and project management. Technical proficiency in AutoCAD, MS Project, and MS Office. Strong understanding of BOQ preparation, cost control, and material estimation. Sound knowledge of BNBC (Bangladesh National Building Code) and other relevant compliance standards. Responsibilities & Context Oversee day-to-day construction activities at the project sites. Monitor project progress and ensure strict adherence to project timelines. Coordinate seamlessly with architects, consultants, contractors, and suppliers. Review architectural/structural drawings, BOQs, and specifications, ensuring proper implementation on-site. Ensure full compliance with local building codes, safety regulations, and quality standards. Prepare and present project schedules, progress reports, and cost-tracking reports. Conduct regular site inspections and comprehensive quality control checks. Manage subcontractors effectively and ensure proper resource allocation. Identify and resolve technical and structural issues during the construction phase. Ensure proper documentation and reporting of all project milestones. Assist management in project budgeting, cost estimation, and variation management. Skills & Expertise Civil Engineering Project Engineer Site Engineer Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Farr Bulders & Landmark Follow Address: CO+Lab\nHouse no -6,(5th floor),Rd no- 2/ B, Block- J,Baridhara, Dhaka -1212 Website: https://fbl.com.bd/ Business: FARR Builders & Landmark one of the most influential real estate companies, which have been giving an exceptional branch of style and living comfort. When it comes to aesthetic design, the company puts the utmost effort into the design and each stage of the building process, ensuring that all business best practices are followed. FARR Builders & Landmark was formed with a new identity by one of the most reliable real estate businesses Future Base Limited.\n\nFARR Builders & Landmark is a 4th generation company and its origin is one of the oldest Construction firms of Bangladesh named M H Khan Construction. Mr Munsur Ha"
  },
  {
    "url": "https://bdjobs.com/h/details/1462840?ln=1",
    "company_name": "Barnali International Sign Media",
    "job_title": "Computer Operator",
    "location": "Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Computer Operator : Barnali International Sign Media Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Barnali International Sign Media Computer Operator Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 20 to 30 years Location: Dhaka (Motijheel) Salary: Tk. 15000 - 17000 (Monthly) Published: 24 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 20 to 30 years Responsibilities & Context আমাদের প্রতিষ্ঠানের জন্য জরুরিভিত্তিতে একজন দক্ষ Computer Operator নিয়োগ দেওয়া হবে। 📌 শিক্ষাগত যোগ্যতা ন্যূনতম এইচএসসি পাস 💼 অভিজ্ঞতা ও দক্ষতা বাংলা ও ইংরেজি কম্পিউটার টাইপিংয়ে দক্ষ হতে হবে দ্রুত টাইপিং স্পীড থাকতে হবে ইন্টারনেট ব্যবহারে এক্সপার্ট হতে হবে Microsoft Office (Word, Excel, PowerPoint) -এ দক্ষতা থাকতে হবে অফিসিয়াল ডকুমেন্ট তৈরি, ডাটা এন্ট্রি ও রিপোর্ট প্রস্তুত করার অভিজ্ঞতা থাকতে হবে অফিসে এসে কাজ করতে হবে নিয়মিত। 🎯 অতিরিক্ত যোগ্যতা দায়িত্বশীল ও পরিশ্রমী হতে হবে সময়মতো কাজ সম্পন্ন করার মানসিকতা থাকতে হবে দলগতভাবে কাজ করার সক্ষমতা থাকতে হবে Skills & Expertise MS Office MS Excel Microsoft PowerPoint Compensation & Other Benefits Performance bonus Salary Review: Half Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Motijheel) Company Information Barnali International Sign Media Follow Address: 191. Fakirapool, k.y plaza (3rd floor), motijheel, dhaka-1000 Business: ??????? ?????????????? ???? ??????? ???? ????????? ????? ????? ???? ????? ??????? ?? ????? ????????? ??? ????? ??????? Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is innacurate.” Back to Top ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT "
  }
]