[
  {
    "url": "https://bdjobs.com/h/details/1458291?ln=1",
    "company_name": "M/S KM International",
    "job_title": "Electrical Engineer",
    "location": "Japan",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Electrical Engineer : M/S KM International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List M/S KM International Electrical Engineer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 15 Age: 20 to 40 years Location: Japan Salary: Tk. 200000 - 200000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 40 years যোগ্যতা: কাজের অভিজ্ঞতা থাকলে অগ্রাধিকার প্রাথমিক ইংরেজি বা জাপানি ভাষা জানা থাকলে ভালো Responsibilities & Context জাপানে ইলেকট্রিক্যাল ইঞ্জিনিয়ার নিয়োগ চলছে! জাপানের স্বনামধন্য কোম্পানিতে জরুরিভাবে Electrical Engineer পদে জনবল নিয়োগ দেওয়া হবে। Skills & Expertise Electrical and Electronic Engineering Electrical Engineering Electrical technician Electrician Suggested by Electrical Engineering Electrical Installation and Maintenance Electrical/ Electronics Japanese Language Compensation & Other Benefits থাকার ব্যবস্থা - কোম্পানি প্রদান করবে\nখাবার - নিজ দায়িত্বে\nজাপান সরকারের নিয়ম অনুযায়ী সকল সুযোগ-সুবিধা প্রদান\nওভারটাইম সুবিধা\nস্বাস্থ্য বীমা ও অন্যান্য সরকারি সুবিধা প্রযোজ্য Employment Status Full Time Gender Only males are allowed to apply. Job Location Japan Read Before Apply আগ্রহীরা দ্রুত যোগাযোগ করুন ও আপনার CV, পাসপোর্ট কপি পাঠান।\n01335176141\n01335176142\n01335176143\n01335176144\noceanautobd@gmail.com\nwww.kminternationalbd.com\nRl 1294 Company Information M/S KM International Follow Address: Cha 73/2 (6th Floor) Ocean Tower North Badda, Dhaka-1212 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now × সতর্কবার্তা View in English এটি একটি বিদেশি চাকরির বিজ্ঞাপন। এই চাকরির বিবরণ ও নিয়োগ প্রক্রিয়ার সম্পূর্ণ দায়িত্ব সংশ্লিষ্ট নিয়োগকারী প্রতিষ্ঠানের। কোনো ভুল বা অসম্পূর্ণ তথ্যের জন্য বিডিজবস দায়ী নয়। চাকরিপ্রার্থীদের "
  },
  {
    "url": "https://bdjobs.com/h/details/1457891?ln=1",
    "company_name": "Southwest Composite Ltd.",
    "job_title": "Deputy Manager-ETP",
    "location": "Gazipur (Kaliakair)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Deputy Manager-ETP : Southwest Composite Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Southwest Composite Ltd. Deputy Manager-ETP Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 32 to 45 years Location: Gazipur (Kaliakair) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 32 to 45 years Responsibilities & Context Operational Management: Manage and monitor daily ETP operations, including inlet effluent quality , treatment processes (biological, chemical), and final discharge to ensure compliance with environmental standards. Team Leadership: Supervise, train, and guide shift operators and technicians to ensure safety and operational efficiency. Maintenance & Troubleshooting: Oversee preventive and breakdown maintenance of machinery (pumps, aerators, filters) to minimize downtime. Compliance & Reporting: Ensure all discharge meets legal standards, manage documentation for audits (e.g., ISO, Pollution Control Board), and prepare daily shift reports. Process Optimization & Safety: Identify opportunities to reduce chemical and energy consumption (cost saving) and strictly implement safety protocols. Resource Management: Manage chemical inventory, handle reject water/sludge, and collaborate with maintenance teams for repairs. Skills & Expertise EMS ETP and WTP Health Safety and Environment Leadership and teamwork Microsoft Office Suggested by EMS ETP and WTP Health Safety and Environment Compensation & Other Benefits Mobile bill Salary Review: Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Kaliakair) Apply Procedure Email Your CV Send your CV to the given email it.hr@southwest-bd.com or Email your CV from My Bdjobs account Company Information Southwest Composite Ltd. Follow Address: Plot # 122, Ward # 06, Kalampur (Chandara), KaliaKoir, Gazipur-1750 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! "
  },
  {
    "url": "https://bdjobs.com/h/details/1459218?ln=1",
    "company_name": "BETELCO",
    "job_title": "Asst. Manager / Manager - Marketing & Sales",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "At least 5 years",
    "education": null,
    "deadline": "16 Mar 2026",
    "job_description": "Asst. Manager / Manager - Marketing & Sales : BETELCO Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List BETELCO Asst. Manager / Manager - Marketing & Sales Application Deadline : 16 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: At least 32 years Location: Dhaka Salary: Negotiable Experience: At least 5 years Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Electrical & Electronic Engineering Master of Science (MSc) in Electrical & Electronic Engineering Master of Business Administration (MBA) in Marketing American International University Bangladesh,North South University,BRAC University,Independent University, Bangladesh,Military Institute of Science and Technology (MIST) students will get preference Experience At least 5 years The applicants should have experience in the following business area(s): Manufacturing (Light Engineering and Heavy Industry), Power Additional Requirements Age At least 32 years Age 32 to 45 years Responsibilities & Context BETELCO (Manufacturing Electric machineries in the power sector) require experienced personnel in the following fields for its expansion program. Applications are hereby invited Marketing & Sales Division for this position. Title : Marketing & Sales of 33/11/.415kV Electrical Transformer, Switchgear & other Substation equipment, Generator, BBT, Solar energy System, LPS, Automation etc. We are currently looking for a dynamic and results-oriented Asst. Manager / Manager - Marketing & Sales engineer to join our team at BETELCO. The Asst. Manager/Manager - Marketing & Sales Engineer`s responsibilities include maintaining extensive knowledge of the products` parts, functions, and processes and assisting with closing sales where technical expertise may be required to fit clients` needs. To be successful as an Asst. Manager / Manager - Marketing & Sales engineer, you should possess an in-depth knowledge of our company`s technical products and services and you should be able to relate this knowledge in a way that is understandable to nontechnical customers. You should be driven to achieve your sales goals and should have excellent sales and customer service skills. As an Asst. Manager / Manager - Marketing & Sales engineer, you will drive business growth by understanding customer needs, providing technical solutions and effectively articulating the value of our products or services. Your role will be pivotal in effectively communicating technical information to customers and helping to develop and maintain relationships to build trust. This is an exciting opportunity to contribute to our company’s success and be part of a high-performing sales team in a competitive market. If you’re passionate about sales and innovation, we invite you to apply. We offer Attractive Salary and incenti"
  },
  {
    "url": "https://bdjobs.com/h/details/1460912?ln=1",
    "company_name": "CareTrip",
    "job_title": "Sales Executive (Travel Agency)",
    "location": "Dhaka (Farmgate)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Sales Executive (Travel Agency) : CareTrip Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List CareTrip Sales Executive (Travel Agency) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 35 years Location: Dhaka (Farmgate) Salary: Tk. 10000 - 15000 (Monthly) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 35 years Hard working & Discipline Computer skill in MS word, Excel, Bangla and English Typing) Customer service skills to assist and guide clients professionally Responsibilities & Context Responsibilities (Sales & Marketing Executive): Communication with Clients Telemarketing, WhatsApp & email marketing Social Media handling Skills & Expertise Suggested by Computer Literacy Customer Service MS Office Compensation & Other Benefits Mobile bill,Profit share,Performance bonus Salary Review: Half Yearly Festival Bonus: 2 Weekly 1 Holiday Employment Status Full Time Job Location Dhaka (Farmgate) Company Information CareTrip Follow Address: Mahbub Plaza (Lift-6), Indira Road, Farmgate Website: www.caretrip,net Business: air ticket, visa processing, tour package, hotel booking Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজ"
  },
  {
    "url": "https://bdjobs.com/h/details/1461587?ln=1",
    "company_name": "Three-m",
    "job_title": "Customer & Courier Service Officer",
    "location": "Dhaka (Mirpur, Mirpur 10)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "02 Mar 2026",
    "job_description": "Customer & Courier Service Officer : Three-m Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Three-m Customer & Courier Service Officer Application Deadline : 02 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 18 to 27 years Location: Dhaka (Mirpur, Mirpur 10) Salary: Negotiable Published: 20 Feb 2026 Application Insights View Requirements Education Additional Requirements Age 18 to 27 years Only Female candidates. Candidates must be residents of Mirpur , Dhaka. Responsibilities & Context Job Responsibilities: Handle sales-related activities Provide solutions to customer problems Answer customer queries and build confidence in purchasing Increase delivery success ratio Follow up with potential customers regularly Maintain basic Excel sheets Skills & Expertise Confidence Fast Learner Negotiation and Convincing Skill convincing customers Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Mirpur, Mirpur 10) Company Information Three-m Follow Address: Mirpur 10. dhaka 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Cont"
  },
  {
    "url": "https://bdjobs.com/h/details/1461512?ln=1",
    "company_name": "Nahar Agro Group",
    "job_title": "Engineer - Hatchery (Poultry)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "21 Mar 2026",
    "job_description": "Engineer - Hatchery (Poultry) : Nahar Agro Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nahar Agro Group Engineer - Hatchery (Poultry) Application Deadline : 21 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 04 Location: Anywhere in Bangladesh Salary: Negotiable Published: 19 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Hands-on experience with incubator & hatchery automation systems preferred. The candidate will be required to stay within the hatchery premises as part of the biosecurity protocol. Responsibilities & Context Ensure proper functioning of incubators, hatchers, HVAC, generators, and electrical systems. Maintain temperature, humidity, ventilation, and sanitation protocols. Plan and execute preventive maintenance of hatchery equipment. Troubleshoot mechanical and electrical issues. Skills & Expertise Hatchery Maintaining Compensation & Other Benefits As per company policy. Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Read Before Apply Applications are invited from experienced candidates who have previously worked in a poultry hatchery. Company Information Nahar Agro Group Follow Address: Plot# 02, Road# 01, Paharika R/A, South Khulshi, Khulshi, Chittagong, Bangladesh Business: Nahar Agro Group is one of the faster growing agro based company in the country engaged in producing day old Broiler & Layer Chicks and manufacturing Poultry Feed, Fish Feed and cattle feed by its different Hatchery and Feed Mills. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree "
  },
  {
    "url": "https://bdjobs.com/h/details/1461466?ln=1",
    "company_name": "Automan Steel Building System Limited (ASBS)",
    "job_title": "Civil Engineer (Sales & Marketing)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "21 Mar 2026",
    "job_description": "Civil Engineer (Sales & Marketing) : Automan Steel Building System Limited (ASBS) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Automan Steel Building System Limited (ASBS) Civil Engineer (Sales & Marketing) Application Deadline : 21 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 3 Location: Dhaka Salary: Negotiable Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Must have knowledge of excellent approach towards client, arrange meeting with clients/ customers, price estimating & planning. Should have knowledge in Industrial building, power plant & high-rise building. Able to work in under pressure & self-motivated. Honest, dynamic & disciplined. Computer knowledge is must. Candidate should have adequate proficiency in English. Responsibilities & Context We are looking for Civil Engineer (steel building sector) Job Responsibilities: To prepare presentation & present pre-fabricated steel building to our local clients. It needs proper knocking to create potential buyer; should have ability to do so is the fundamental requirements of a candidate. Visiting Working site time to time. Taking practical measurements from site. Preparation of running bills and negotiating with the client. Monitoring working updates and informing the concerns. Preparing daily marketing reports and implements marketing strategy. Ready to do hard works. Any other tasks assigned by the management time to time. Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply Company Information Automan Steel Building System Limited (ASBS) Follow More jobs from this company Address: House# 8/5, Block# C, Lalmatia, Dhaka 1207, Bangladesh. Website: https://www.asbs.com.bd/ Business: Pre-fabricated steel building. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Empl"
  },
  {
    "url": "https://bdjobs.com/h/details/1460730?ln=1",
    "company_name": "Kratos Energy",
    "job_title": "Admin & Accounts Officer",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Admin & Accounts Officer : Kratos Energy Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Kratos Energy Admin & Accounts Officer Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: At least 25 years Location: Dhaka Salary: Negotiable Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years ●       Minimum 5 years’ experience in administration and accounts ●       Strong organizational and communication skills ●       Proficiency in Microsoft Office (especially Excel) ●       Basic bookkeeping / finance knowledge ●       Attention to detail and confidentiality ●       Strong English communication skills are required Responsibilities & Context ●       Provide administrative support to management and staff ●       Manage calls, emails, and office correspondence ●       Maintain filing systems and office records ●       Schedule meetings and manage calendars ●       Handle office supplies and inventory ●       Assist with invoicing and purchase orders ●       Maintain expense records and financial documents ●       Coordinate with suppliers to order solar systems and arrange timely delivery ●       Coordinate with electricians and customers to schedule installations ●       Ensure job completion through follow-ups and update status in the portal ●       Support basic bookkeeping and data entry ●       Assist with payroll / timesheet records ●       Prepare basic financial reports Skills & Expertise Accounts and Finance Administration Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Kratos Energy Follow More jobs from this company Address: Kratos Energy Pty Ltd is an Australian-owned renewable energy engineering and consulting firm specialising in solar PV and battery storage, delivering end-to-end solutions from feasibility to installation and maintenance. Website: https://www.kratos-energy.com/ Business: Kratos Energy Pty Ltd is an Australian-owned renewable energy engineering and consulting company dedicated to driving a cleaner, more sustainable future. We specialise in solar PV and battery storage and deliver end-to-end solutions, from site selection and feasibility studies to system design, project management, installation, and long-term maintenance.\n\nOur team of energy experts has worked across Australia, Europe, America, and Asia, bringing global experience to every project. With a track record of assessing, installing, and commissioning megawatts of renewable energy systems, we’re helping businesses, homeowners, and communities transition to affordable and sustainable energy solutions.\n\nWe are also proud participants in the University of Wollongong’s iAccelerate Program, fostering innovati"
  },
  {
    "url": "https://bdjobs.com/h/details/1461571?ln=1",
    "company_name": "Kewra Seafood Limited",
    "job_title": "Assistant Accountant",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Assistant Accountant : Kewra Seafood Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Kewra Seafood Limited Assistant Accountant Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Maintain the Accounts of the Company. Skills & Expertise Tally Software Suggested by Accounts and Finance Accounting Data Entry Accounting Software Financial Reporting Financial Research Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Kewra Seafood Limited Follow Address: Paradise Tower, 11th floor, road no 2, Jashimuddin Avenue, Uttara Dhaka Website: kewraseafood.com Business: Soft shell crab and Vannamei Prawn producer and Exporter. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjo"
  },
  {
    "url": "https://bdjobs.com/h/details/1461585?ln=1",
    "company_name": "Three-m",
    "job_title": "Packaging Staff",
    "location": "Dhaka (Mirpur, Mirpur 10)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "Packaging Staff : Three-m Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Three-m Packaging Staff Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 18 to 25 years Location: Dhaka (Mirpur, Mirpur 10) Salary: Tk. 8000 - 12000 (Monthly) Published: 19 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 25 years Only candidates from Mirpur, Dhaka are allowed to apply (must be residents of Mirpur ) Knowledge of basic English Writing & Reading. Basic product packing skill Ability to do quality checking before packing Attention to detail Ability to maintain simple packing records Basic labeling knowledge Physically fit and able to work long hours Teamwork and discipline Responsibilities & Context Product packing Quality checking before packing Maintaining packing records on note Package labeling Skills & Expertise Packing operations Teamwork Suggested by Packaging Production Compensation & Other Benefits Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur, Mirpur 10) Company Information Three-m Follow Address: Mirpur 10. dhaka 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে র"
  },
  {
    "url": "https://bdjobs.com/h/details/1461979?ln=1",
    "company_name": "Vivid Automobiles",
    "job_title": "Business Development Executive",
    "location": "Dhaka (Tejgaon Industrial Area)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "Business Development Executive : Vivid Automobiles Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Vivid Automobiles Business Development Executive Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 25 to 32 years Location: Dhaka (Tejgaon Industrial... Dhaka (Tejgaon Industrial Area) Salary: Negotiable Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 32 years Responsibilities & Context Customer Engagement: Greet and interact with customers professionally, understand their needs, and provide guidance on vehicle options. Product Knowledge: Maintain in-depth knowledge of all car models, features, financing options, and promotions to effectively inform and advise customers. Sales Generation: Identify potential customers, follow up on leads, and convert inquiries into sales to achieve monthly and quarterly targets. Demonstration & Test Drives: Conduct vehicle demonstrations and arrange test drives to showcase car features and benefits. Negotiation & Closing: Handle negotiations professionally and guide customers through the purchase process to ensure a successful sale. Documentation: Assist customers with required paperwork, financing, and insurance formalities accurately and efficiently. After-Sales Support: Follow up with customers post-purchase to ensure satisfaction, build loyalty, and encourage referrals. Skills & Expertise Automotive sector Suggested by Sales & Marketing Sales target Customer Service Strategic Planning Strategic Sales Planning Compensation & Other Benefits Mobile bill,Performance bonus Festival Bonus: 2 Attractive commission on every car sold Employment Status Full Time Job Location Dhaka (Tejgaon Industrial Area) Company Information Vivid Automobiles Follow Address: 247/248, Tejgaon Industrial Area, Tejgaon Link Road, Dhaka-1208 Website: https://vividautomobiles.com/ Business: VIVID Automobiles is a leading reconditioned and brand-new car importer in Bangladesh. Our mission is to help customers find their dream car by providing quality vehicles and expert guidance. We have a dedicated team that assists customers in choosing a quality car, bidding at auctions in Japan, importing to Bangladesh, and delivering the unit in a ready-to-go shape. We value our customers and provide constant after-sale services to ensure their satisfaction. We import various models from top brands such as: \nToyota: Toyota C-HR, Toyota Premio, Toyota Allion, Toyota Corolla Axio (hybrid & non-hybrid), Toyota Fielder, Toyota Prius, Toyota Harrier, Toyota Noah, Toyota Esquire. Toyota Camry, Toyota Yaris Cross\nHonda: Honda C-RV, Honda Accord, Honda Vezel, Honda Grace, Honda CIVIC, Honda Fit, Honda Insight, Honda N BOX Custom, Honda"
  },
  {
    "url": "https://bdjobs.com/h/details/1462046?ln=1",
    "company_name": "EQUE",
    "job_title": "ক্যাশিয়ার",
    "location": "Nilphamari (Saidpur)",
    "salary": null,
    "experience": "At least 1 year",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "ক্যাশিয়ার : EQUE Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List EQUE ক্যাশিয়ার Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Nilphamari (Saidpur) Salary: Negotiable Experience: At least 1 year Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education HSC Experience At least 1 year The applicants should have experience in the following business area(s): Hotel, Resort Additional Requirements কমপক্ষে ১ বছরের কাজের অভিজ্ঞতা থাকতে হবে। অতিথিদের সাথে ভদ্র ও সুন্দর আচরণ করতে সক্ষম। দলগতভাবে কাজ করার মানসিকতা থাকতে হবে। পরিষ্কার-পরিচ্ছন্ন ও দায়িত্বশীল হতে হবে। কমপক্ষে ২ বছর কাজ করার মানসিকতা থাকতে হবে। Responsibilities & Context নিয়োগ বিজ্ঞপ্তি সৈয়দপুরের স্বনামধন্য ইকু হেরিটেজ হোটেল এবং রিসোর্ট এর জন্য জরুরী ভিত্তিতে ক্যাশিয়ার নিয়োগ দেওয়া হবে। Skills & Expertise Suggested by Cash Handling petty cash management Cash Flow Management Compensation & Other Benefits বেতন ও সুবিধা : ১. অভিজ্ঞতা অনুযায়ী বেতন আলোচনা সাপেক্ষে। ২. থাকা ও খাবারের সু-ব্যবস্থা। ৩. মাসিক ছুটি (৪টি) ও অন্যান্য সুযোগ-সুবিধা। ৪. কোম্পানির নীতিমালা অনুযায়ী উৎসব বোনাস (২টি)। Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Nilphamari (Saidpur) Company Information EQUE Follow More jobs from this company Address: Bimanbandor Road, Saidpur Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Re"
  },
  {
    "url": "https://bdjobs.com/h/details/1462267?ln=1",
    "company_name": "𝐍𝐞𝐨𝐬𝐂𝐨𝐝𝐞𝐫 𝐋𝐭𝐝",
    "job_title": "𝐂𝐡𝐢𝐞𝐟 𝐓𝐞𝐜𝐡𝐧𝐨𝐥𝐨𝐠𝐲 𝐎𝐟𝐟𝐢𝐜𝐞𝐫 (𝐂𝐓𝐎)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "𝐂𝐡𝐢𝐞𝐟 𝐓𝐞𝐜𝐡𝐧𝐨𝐥𝐨𝐠𝐲 𝐎𝐟𝐟𝐢𝐜𝐞𝐫 (𝐂𝐓𝐎) : 𝐍𝐞𝐨𝐬𝐂𝐨𝐝𝐞𝐫 𝐋𝐭𝐝 Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List 𝐍𝐞𝐨𝐬𝐂𝐨𝐝𝐞𝐫 𝐋𝐭𝐝 𝐂𝐡𝐢𝐞𝐟 𝐓𝐞𝐜𝐡𝐧𝐨𝐥𝐨𝐠𝐲 𝐎𝐟𝐟𝐢𝐜𝐞𝐫 (𝐂𝐓𝐎) Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Location: Dhaka Salary: Negotiable Published: 22 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements At least 5 years in leadership roles. Proven experience leading technology teams in senior roles such as CTO or equivalent. Experience working in large diversified or multi-business organizations is preferred. Responsibilities & Context Define and execute company-wide technology strategy and roadmap. • Lead software development. • Ensure secure, scalable, and high-performance system architecture. • Supervise infrastructure, cybersecurity, and IT governance. • Manage and mentor engineering, DevOps, QA, UI/UX, and network teams. • Oversee project delivery timelines and product quality standards. • Prepare and control annual technology budget. • Coordinate with Group leadership and business units on digital initiatives. • Drive innovation and continuous technical improvement Skills & Expertise CyberSecurity DevOps DevOps Cloud DevOps Engineer DevOps Tools System Architecture UI/UX Design UI/UX strategies Compensation & Other Benefits Provident fund,Mobile bill,Weekly 2 holidays,Gratuity,Insurance Salary Review: Yearly Festival Bonus: 2 As per the company policy Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights CTO will lead technology strategy, engineering operations & digital transformation at NeosCoder Ltd. Akij Venture Group. Responsible for executing tech roadmap, ensuring secure & scalable systems and aligning innovation with business objectives. Read Before Apply Send your CV to info@neoscoder.com and Subject line: Chief Technology Officer or Visit: https://www.neoscoder.com/career/cto-01?title=Chief%20Technical%20Officer%20(CTO) Company Information 𝐍𝐞𝐨𝐬𝐂𝐨𝐝𝐞𝐫 𝐋𝐭𝐝 Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Si"
  },
  {
    "url": "https://bdjobs.com/h/details/1462273?ln=1",
    "company_name": "UpSkill Bangladesh",
    "job_title": "Senior Business Development Manager (USA Market)",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Mar 2026",
    "job_description": "Senior Business Development Manager (USA Market) : UpSkill Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List UpSkill Bangladesh Senior Business Development Manager (USA Market) Application Deadline : 25 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Location: Dhaka Salary: Tk. 20000 - 30000 (Monthly) Published: 23 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Job Title: Senior Business Development Manager (USA Market) Company: UpSkill Bangladesh Job Location: Onsite – Dhaka Employment Type: Full-Time Work Schedule: 5 Days a Week Weekly Holidays: Friday & Saturday Office Hours: 9:00 AM – 6:00 PM Salary: Negotiable (Based on experience & performance) About the Role UpSkill Bangladesh is seeking a highly motivated and results-driven Senior Business Development Lead to drive business expansion in the USA market . This advanced-level role focuses on cold calling, sales prospecting, USA client acquisition, tender/RFP participation, and revenue generation through IT, software, and digital solutions. Key Responsibilities Conduct cold calling and outbound sales outreach to USA prospects Lead sales prospecting and pipeline development Identify and pursue USA-based tenders, RFPs, and contract opportunities Develop and execute USA client acquisition strategies (B2B / Corporate) Sell software solutions, SaaS products, and digital marketing services Manage the full sales cycle: prospecting → pitching → negotiation → closure Prepare proposals, capability statements, and tender submissions Build and maintain strong relationships with international decision-makers Collaborate with marketing & technical teams to align solutions with client needs Maintain CRM records, forecasts, and performance reports Achieve assigned revenue and growth targets Requirements Proven expertise in Business Development / IT Sales / International Sales Strong experience in cold calling & outbound sales Demonstrated ability to sell software, SaaS, and digital services Strong understanding of the USA market Experience handling USA tenders / RFPs / proposals preferred Excellent English communication & negotiation skills Strong consultative & solution-selling ability Strategic, target-driven, and self-motivated Preferred Skills Experience in B2B SaaS / Software Sales Knowledge of digital marketing & tech solutions Familiarity with CRM platforms and sales automation tools such as Salesforce, HubSpot, Zoho CRM, Apollo.io, Asana, and other modern CRM solutions Skills & Expertise Cold Calling Tender Preparation USA market Fluent in English Speaking Compensation & Other Benefits T/A,Tour allowance,Weekly 2 holidays,Profit share,Performance bonus Salary Review: Yearly Festival Bonus: 2 Salary: Negotiable "
  },
  {
    "url": "https://bdjobs.com/h/details/1462244?ln=1",
    "company_name": "Sayma Enterprise",
    "job_title": "Senior Executive/ Executive",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "Senior Executive/ Executive : Sayma Enterprise Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sayma Enterprise Senior Executive/ Executive Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 22 to 35 years Location: Dhaka Salary: Negotiable Published: 22 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 35 years Responsibilities & Context Manage tender activities from Government entities, especially Military. Prepare & submit RFQs and tender documents. Source machinery & equipment from local & international suppliers. Communicate with manufacturers/suppliers for pricing & technical clarification. Prepare comparative statements, cost analysis (MS Excel), and official documents (MS Word). Maintain client communication via website, email, and phone. Monitor and update company website; support digital marketing and online sales. Create catalogs, datasheets, and compliance sheets using Adobe Photoshop. Maintain proper documentation and tender records. Travel as required for tender submission. Skills & Expertise Digital Marketing (Social Media Marketing) Engineering Export & Import Microsoft Excel Microsoft Word Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Sayma Enterprise Follow Address: 59/A, Old Jessore Road, Khulna-9000 Website: www.saymaenterprise.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT"
  },
  {
    "url": "https://bdjobs.com/h/details/1462260?ln=1",
    "company_name": "PLABAN POLLI UNNAYAN KORMOSUCHI ( PPUK )",
    "job_title": "শাখা ব্যবস্থাপক(ক্ষুদ্র ঋণ)",
    "location": "Dhaka (Dhamrai)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Mar 2026",
    "job_description": "শাখা ব্যবস্থাপক(ক্ষুদ্র ঋণ) : PLABAN POLLI UNNAYAN KORMOSUCHI ( PPUK ) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List PLABAN POLLI UNNAYAN KORMOSUCHI ( PPUK ) শাখা ব্যবস্থাপক(ক্ষুদ্র ঋণ) Application Deadline : 24 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 5 Age: 25 to 35 years Location: Dhaka (Dhamrai) Salary: Tk. 25000 - 38750 (Monthly) Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context সমাজ সেবা অধিদপ্তরের নিবন্ধন নং ঢ- ০৭৬১০, মাইক্রোক্রেডিট রেগুলেটরি অথরিটি এর লাইসেন্স নং ০০২০২-০১৯৬৩-০০৭১৯। প্লাবন পল্লী উন্নয়ন কর্মসূচী (পিপিইউকে) একটি জাতীয় পর্যায়ে বেসরকারি উন্নয়ন সংস্থা। সংস্থাটি ২০০৪ সাল থেকে দরিদ্র জনগোষ্ঠির উন্নয়নের লক্ষ্যে বিভিন্ন কর্মসূচী পরিচালনা করে আসছে। যার মধ্যে ঋণ কার্যক্রম অন্যতম। শিক্ষানবীশ শাখা ব্যবস্থাপকের দায়িত্ব সমূহ- প্রাথমিক ভাবে মাঠ পর্যায়ের কর্মীদের সাথে কাজ করে সদস্যদের তত্ত্বাবধান ও লক্ষ্যমাত্রা অর্জনে সহায়তা করা। সদস্য নির্বাচন, ঋণ বিতরণ ও আদায়ে কার্যকর ভূমিকা পালন করা। হিসাব রক্ষণ ও দাপ্তরীক কাজে শাখা হিসাব রক্ষককে সহযোগিতা করা। নির্দিষ্ট সফ্টওয়ারে ডাটা এন্ট্রি করা। শাখার OTR,PAR,CRR উন্নয়নে বাস্তবতা অনুযায়ী সঠিক পদক্ষেপ গ্রহন করা। Compensation & Other Benefits T/A,Provident fund,Pension policy,Medical allowance,Mobile bill,Performance bonus,Insurance,Gratuity Salary Review: Yearly Festival Bonus: 2 প্রশিক্ষণকালীন ৬ মাস ২০,০০০/-বেতন, ৪০০০/- ফুয়েল,মোবাইল ১০০০/- সর্ব মোট=২৫০০০/- স্থায়ী হলে সংস্থার নিয়ম অনুযায়ী সর্বোচ্চ=৩২৭৫০/- থেকে৩৮৭৫০/- সর্ব সাকুল্যে প্রদান করা হবে।ও একক আবাসন ফ্রি Workplace Work at office Employment Status Full Time Job Location Dhaka (Dhamrai) Read Before Apply চাকুরীতে যোগদানের পূর্বে নির্ধারিত (ফেরত যোগ্য) জামানত জমা এবং সংস্থার চাহিদা অনুযায়ী নিশ্চয়তা প্রদান করতে হবে ও বৈধ মোটরসাইকেলসহ ড্রাইভিং লাইসেন্স থাকতে হবে । পিতা/দায়িত্বশীল ব্যাক্তির জামিনদার হিসাবে সংস্থার সাথে চুক্তিবদ্ধ হতে হবে। অধ্যায়নরতদের আবেদন করার প্রয়োজন নাই। আগ্রহী প্রার্থীগণ আবেদনপত্র, পূর্ণ জীবনবৃত্তান্ত ও ২ কপি পাসপোর্ট সাইজ ছবি সকল শিক্ষাগত যোগ্যতার সত্যায়িত ফটোকপিসহ আগামী ২৭ শে ফেব্রুয়ারী,১৩ ই মার্চ,২৭ শে মার্চ ২০২৬ রোজ শুক্রবার সকাল ১১:০০ ঘটিকায় নিম্ন লিখিত ঠিকানায় উপস্থিত হয়ে লিখিত ও মৌখিক পরীক্ষায় অংশগ্রহনের জন্য অনুরোধ করা হলো।  প্লাবন পল্লী উন্নয়ন কর্মসূচী,(পিপিইউকে) প্রধান কার্যালয়, মরহুম হাসান সুপার মার্কেট (৩য় তলা ), জয়পুরা বাস-ষ্ট্যশন(উত্তর পাশে ), জয়পুরা,ধামরাই, ঢাকা। উল্লেখ থাকে যে পরীক্ষার জন্য কোনো প্রকার এসএমএস করা হবে না এবং কোনো টি/এ,ডি/এ প্রদান করা হবে না। Company Information PLABAN POLLI UNNAYAN KORMOSUCHI ( PPUK ) Follow Address: Joypura, Dhamrai, Dhaka Business: Micro Finance Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আ"
  },
  {
    "url": "https://bdjobs.com/h/details/1459201?ln=1",
    "company_name": "Safety Consultants BD",
    "job_title": "Accountant",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "22 Mar 2026",
    "job_description": "Accountant : Safety Consultants BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Safety Consultants BD Accountant Application Deadline : 22 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 03 Location: Dhaka Salary: Negotiable Published: 22 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Responsibilities & Context Maintain daily accounts and financial records Prepare monthly rent collection statements Handle bank transactions & reconciliation Prepare financial reports Maintain vouchers, invoices & billing records Assist in audit & tax-related matters Skills & Expertise Accounting Software Microsoft Excel Microsoft Word Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Safety Consultants BD Follow Address: Mamun Plaza (2nd Floor), 31 Hatkhola Road, Dhaka-1203, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My B"
  },
  {
    "url": "https://bdjobs.com/h/details/1462270?ln=1",
    "company_name": "Aalok Healthcare & Hospital",
    "job_title": "Product Manager (Hospital)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "07 Mar 2026",
    "job_description": "Product Manager (Hospital) : Aalok Healthcare & Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aalok Healthcare & Hospital Product Manager (Hospital) Application Deadline : 07 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 35 to 45 years Location: Dhaka Published: 22 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 35 to 45 years Experience in Leaflet compare different Hospital, Laboratory, Radiology & Imaging Investigation (Test) Product. Ensure work within time as provide from Management. Responsibilities & Context Actively visit and engage with Consultant Physicians to promote Aalok’s diagnostic capabilities. Communicate the technical superiority and reliability of our investigation services to secure consistent patient referrals. Design and develop high-impact leaflets and promotional materials specifically for diagnostic investigation products. Translate complex clinical data into clear, persuasive value propositions for patients and doctors. Lead training sessions for the Marketing & Sales teams regarding Laboratory and Radiology & Imaging services. Ensure the team possesses deep technical knowledge to effectively pitch diagnostic products. Conduct regular branch visits to monitor the quality of diagnostic investigations. Identify service gaps and implement improvement strategies to ensure Aalok remains the preferred choice for diagnostic care. Assigned any job task by Management. Skills & Expertise Hospital Diagnostics Laboratory testing Radiology & Imaging Compensation & Other Benefits Provident fund Salary Review: Yearly Festival Bonus: 2 As per Hospital Policy Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Preferred experience in design and develop high-impact leaflets and promotional materials specifically for diagnostic investigation products. Have opportunity for huge career development with Great Management at Aalok. Read Before Apply Suitable candidates are requested to send an application with their updated CV including License Number if any. Photo, all Academic & Experience certificates. Last date of submitting application with Hard Copy of CV (PDF) is on 07-March-2026. Report to Managing Director . You can also submit your Updated CV to: hr.aalok@gmail.com . Company Information Aalok Healthcare & Hospital Follow More jobs from this company Address: Corporate Office: House# 3, Road # 4, Block # A, Section-06, Mirpur, Dhaka-1216 Website: https://www.aalokhealthcare.com/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব"
  },
  {
    "url": "https://bdjobs.com/h/details/1462249?ln=1",
    "company_name": "World Visa Consultancy",
    "job_title": "Consultant (Female )",
    "location": "Dhaka (Banani)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "Consultant (Female ) : World Visa Consultancy Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List World Visa Consultancy Consultant (Female ) Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 18 to 28 years Location: Dhaka (Banani) Salary: Negotiable Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 28 years Good Communication skill and pleasant personality in mandatory Must be honest and punctual in work Air Ticketing and Visa processing. package tourTourist visa processing Responsibilities & Context Receive and reply to emails, and expert in replying client queries via any platform of social media Prepare necessary documents, fill out forms, and maintain files and records. Managing client's databases and regularly following up and update them. Skills & Expertise Consultant Compensation & Other Benefits asper company policy Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Banani) Company Information World Visa Consultancy Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Le"
  },
  {
    "url": "https://bdjobs.com/h/details/1462027?ln=1",
    "company_name": "Jet-Tex Ltd.",
    "job_title": "Senior Executive / Assistant Manager",
    "location": "Dhaka",
    "salary": "Tk. 30000 - 60000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Senior Executive / Assistant Manager : Jet-Tex Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Jet-Tex Ltd. Senior Executive / Assistant Manager Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 4 Age: 25 to 50 years Location: Dhaka Salary: Tk. 30000 - 60000 (Monthly) Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 50 years Responsibilities & Context Acquire and maintain new clients (Export oriented garment factory only) for these following items (Schiffli Embroidery, Flat/ Cording Embroidery) Coordinate with operations team and manufacturing team to ensure seamless service to customers Coordinate with admin and commercial team and customers to ensure proper payment and documentation support should keep knowledge and resources in the supporting segments to be on the top of the game and have a mentality to go an extra mile for performance. Achieve monthly/ quarterly/ yearly sales targets assigned by the management Skills & Expertise Suggested by Sales & Marketing Market Research and Development Strategic Planning Strategic Sales Planning Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Jet-Tex Ltd. Follow Address: Plot #02, 2nd Floor, RD # 04, Block-A, Section # 11, Mirpur , Dhaka , Bangladesh Business: Greetings from Jet-Tex Ltd. team. \n\n One of our sister concern, Amin Corporation is an Oeko-Tex Standard 100 certified garments accessories manufacturer, located in Dhamrai BSCIC. We basically manufacture Polyester Buttons, Smocking/ Elastic Thread, All kinds of Tapes, All Kinds of Elastic, Drawstrings etc.\n\nMoreover, Dhaka Schiffli Fashion Limited, another sister concern of Jet-Tex, specializes in Chic-en Lace & Chic-en Embroidery, Fabric Lace, Mesh Lace etc. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das"
  }
]