[
  {
    "url": "https://bdjobs.com/h/details/1453898?ln=1",
    "company_name": "Akij Insaf Group",
    "job_title": "Store Keeper (Civil Materials)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Store Keeper (Civil Materials) : Akij Insaf Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Akij Insaf Group Store Keeper (Civil Materials) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Negotiable Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Candidates with prior experience in “Civil Store” will be given preference. Responsibilities & Context We are seeking a dynamic & energetic person to join us as “ Store Keeper (Civil Materials) ”. Work Conditions : Project Based and Transferable Job. The candidate has to perform following responsibilities: Maintain up-to-date records of all stock movements (Civil Store) to ensure that optimum stock levels are maintained. Check inventory records for accuracy to ensure that adequate supplies are maintained. Maintain stock ledgers, and preparing daily/monthly consumption reports. Communicate with the Department Head regarding delivered materials. Releasing materials only against authorized, signed requisition notes. Communicate with department concerned person to ensure that stock items and stock levels are appropriate to their requirements. Skills & Expertise Communication Inventory Management Record Keeping Reporting Compensation & Other Benefits Provident fund,Gratuity Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Akij Insaf Group Follow More jobs from this company Address: Akij House, 198, Bir Uttam Mir Shawkat Sarak, (Gulshan Link Road), Tejgaon Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now "
  },
  {
    "url": "https://bdjobs.com/h/details/1453929?ln=1",
    "company_name": "Multinational Textile & Garments Company",
    "job_title": "Assistant Manager - Organizational Development (OD) and Training",
    "location": "Dhaka (Savar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Assistant Manager - Organizational Development (OD) and Training : Multinational Textile & Garments Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Multinational Textile & Garments Company Assistant Manager - Organizational Development (OD) and Training Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 35 years Location: Dhaka (Savar) Salary: Negotiable Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Must have practical knowledge of Training Process, Development methodologies, Performance Management tools, Online Learning Platform, Engagement, Reward and recognition etc. Strong interpersonal skills and desire to work with a wide variety of people. Positive attitude and manners with good behaviour. Positive attitude with good stakeholders management. Knowledge of manufacturing operations and reporting. Working in challenging environment at office. Responsibilities & Context Manage the training programs, support the organizational development initiatives and coordinate the recognition programs as per official process of the facility. Coordinate and collaborate the Performance Appraisal Tools and System and probationary assessment in hardcopies Maintain all the data related to Performance Appraisal in order and keep updated. Design training course, prepare training module in Bangla & English Prepare annual training calendar based on TNA, analyze to develop the action plan, implement the programs and maintain the dashboard. Conduct the training evaluation/feedback after each training and ensure proper learning into action. Coordinate all internal and external training programs as per requisition and ensure logistics accordingly. Ensure accuracy of training hours and upload into the electronic database system. Maintain the master excel database for verification and regularly update in a timely manner. Coordinate the employee onboarding program for new joiners and bring improvements gradually. Acquaintance with online learning platform like Online Platform, internal global learning platform Manage logistics (Venue, Food, Transport, etc.) and finance (requisition, PI, PO, fund arrangement, Bill processing) for internal & external training programs. Liaison with internal employees and external stakeholders (consultant/vendor/trainer) to select the best resource person/trainer to deliver training programs effectively. Coordinate the talent management and succession planning initiatives, e.g. 9- box assessment including Career planning, IDP etc. Research on HR Trend, analyze the current work process for coming up with new idea, initiative for organizational development and execute as required. Perform HR"
  },
  {
    "url": "https://bdjobs.com/h/details/1456607?ln=1",
    "company_name": "Anwar Landmark Limited",
    "job_title": "Executive/Senior Eecutive- SCM (Brand Items)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Executive/Senior Eecutive- SCM (Brand Items) : Anwar Landmark Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Anwar Landmark Limited Executive/Senior Eecutive- SCM (Brand Items) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Location: Dhaka Salary: Negotiable Published: 03 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Responsibilities & Context 1. Brand Requisition Handling Receive and validate brand-initiated requisitions for services and products Ensure requisitions comply with approved scope, specifications, and budget Coordinate closely with Brand, Finance, and Accounts for smooth execution 2. Vendor Sourcing & Commercial Evaluation Identify, coordinate, and negotiate with suitable vendors for brand requirements Prepare Comparative Statements (CS) with proper technical and commercial analysis Ensure competitive pricing, service quality, and delivery timelines 3. Purchase Order Management Prepare and issue Purchase Orders (PO) as per approved CS and management authorization Ensure PO terms align with company policy (price, delivery, payment, warranty, SLA) Track PO execution and follow up with vendors until completion 4. Billing & Documentation Verify vendor invoices against PO, CS, and delivery/completion confirmation Coordinate billing submission to Accounts for timely processing Maintain proper procurement documentation for audit and compliance 5. Compliance & Process Control Ensure procurement activities strictly follow SCM policies and approval matrix Maintain vendor files, price history, and procurement records Support internal and external audits when required 6. Cross-Functional Coordination Act as the single SCM point of contact for Brand procurement requirements Resolve procurement-related issues in coordination with Brand, Finance, and Accounts Support continuous improvement of brand procurement processes Skills & Expertise Suggested by Bill Processing Budgetary Control Procurement Purchase orders Supply Chain Management Vendor Sourcing Compensation & Other Benefits Alternative Saturday Holiday Partially Subsidized Lunch facility Earned Leave Encashment Contributory Fund KPI Based yearly increment Training Facilities over the year Two Festival Bonuses Enhanced Cultural Focus TA, Mobile Bill Allowance Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Anwar Landmark Limited Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভ"
  },
  {
    "url": "https://bdjobs.com/h/details/1459110?ln=1",
    "company_name": "Master Simex Paper Ltd",
    "job_title": "Receptionist / Office Executive",
    "location": "Dhaka, Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Mar 2026",
    "job_description": "Receptionist / Office Executive : Master Simex Paper Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Master Simex Paper Ltd Receptionist / Office Executive Application Deadline : 16 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 21 to 26 years Location: Dhaka, Dhaka (Motijheel) Salary: Tk. 15000 - 18000 (Monthly) Published: 14 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 21 to 26 years Responsibilities & Context We are looking for a professional, well-presented, and organized Receptionist / Office Executive to manage front desk operations and support administrative activities. The ideal candidate should have a welcoming personality, strong communication skills, and the ability to maintain smooth office coordination while ensuring a professional environment for visitors, staff, and management. Routine / Regular Duties Reception & Guest Management Receive and greet visitors, clients, and vendors professionally Maintain visitor records and logbooks Direct guests to relevant departments and inform concerned staff Handle incoming calls, emails, and courier coordination Office Management Ensure front office operations run smoothly and professionally Monitor meeting room bookings and office space coordination Support basic administrative and coordination tasks Support Staff Management Coordinate with office assistants, cleaners, and security personnel Ensure duties are properly assigned and completed Report any issues in office services or maintenance Meeting & Training Coordination Arrange meeting rooms, refreshments, and materials Support internal training sessions and management meetings Assist departments with scheduling and preparation logistics Cleaning & Pest Control Management Coordinate regular cleaning schedules Liaise with pest control vendors and maintenance teams Ensure reception and common areas remain presentable Documentation & Record Keeping Maintain visitor logs, courier records, and administrative documents Assist in preparing reports, letters, and office files when required Support document dispatch and internal communication flow Non-Routine / Periodical Duties Monitor overall office cleanliness on a daily basis Report facility issues to administration or management Assist with company events, audits, or official visits Perform any additional tasks assigned by supervisors or management Skills & Expertise Customer Service Customer Support Customer Support through Phone Office Administration Organizational Skills Receptionist/ Front Desk Suggested by Front Desk Management Guest Management Guest Relations Services Office Management Receptionist/ Front Desk Staff Management Compensation & Other Benefits Provident fund,Mobile bill,Performance bonus Lunch Facilities: Full Subsidize Salary "
  },
  {
    "url": "https://bdjobs.com/h/details/1460382?ln=1",
    "company_name": "AGAM International (BD) Limited",
    "job_title": "Assistant Manager/ Manager",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Assistant Manager/ Manager : AGAM International (BD) Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List AGAM International (BD) Limited Assistant Manager/ Manager Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Location: Dhaka Salary: Tk. 30000 - 40000 (Monthly) Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Identify, approach, and onboard new corporate clients for Advance salary(EWA) solution. Build and maintain strong professional relationships with HR, Finance, and senior management decision-makers. Achieve monthly and quarterly business development targets. Conduct presentations, prepare proposals, and negotiate agreements with clients. Collaborate with internal teams to ensure smooth client onboarding and service delivery. Maintain accurate sales records and submit regular reports to management. Skills & Expertise Market Research Marketing Sales Sales & Marketing Sales target Customer Service Suggested by Business Development Client Relationship Management Compensation & Other Benefits T/A,Mobile bill,Weekly 2 holidays,Performance bonus Salary Review: Yearly Festival Bonus: 2 Opportunities for professional development and career advancement. Dynamic and supportive work environment in a high-growth fintech company. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information AGAM International (BD) Limited Follow Address: Office B4, 215 Arma Majeda Malik Tower, Merul Badda, Dhaka 1212, Bangladesh Website: https://agam.ai/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate "
  },
  {
    "url": "https://bdjobs.com/h/details/1460869?ln=1",
    "company_name": "VX Services Limited",
    "job_title": "Deputy Manager - Procurement & Finance",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "4 to 5 years",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "Deputy Manager - Procurement & Finance : VX Services Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List VX Services Limited Deputy Manager - Procurement & Finance Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Location: Dhaka Salary: Negotiable Experience: 4 to 5 years Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Business Administration (BBA) Master of Business Administration (MBA) Diploma in Supply Chain Management will be an added advantage Experience 4 to 5 years The applicants should have experience in the following business area(s): IT Enabled Service, Computer Hardware/Network Companies, Engineering Firms, Architecture Firm, Security Service, Electronic Equipment/Home Appliances, Interior Design, HVAC System, Technical Infrastructure Additional Requirements Should have very good communication skill both English & Bangla. Sound knowledge on Computer Literacy. Good knowledge of supply chain. Strong negotiation and supplier management skills. Strong analytical and problem-solving abilities. Ability to work under pressure and meet deadlines. Responsibilities & Context The Deputy Manager – Procurement & Finance will be responsible for managing end-to-end procurement activities while supporting financial control, budgeting, and reporting functions. The role ensures timely sourcing of goods and services, cost efficiency, supplier management, and compliance with company policies and financial procedures. Responsibilities Receive and review purchase requisitions from various departments and ensure accuracy, completeness, and proper authorization. Justify requisitions, analyze requirements, and determine appropriate specifications in coordination with the requesting departments. Source required goods and services from local and international suppliers, and conduct cost analysis and budget alignment. Prepare Requests for Quotation (RFQs), collect and evaluate supplier quotations, negotiate prices and terms, and prepare comparative statements for management approval. Issue purchase orders and work orders, monitor delivery schedules, and coordinate with suppliers to ensure timely delivery of materials and services. Oversee supplier invoices, verify documents, and coordinate with the finance team to ensure accurate and timely payments. Ensure all procurement activities comply with company policies, financial procedures, and internal controls. Monitor procurement budgets, control costs, and support financial planning and reporting activities. Measure, evaluate, and document supplier performance; develop and maintain relationships with reliable and potential suppliers. Maintain and regularly update the supply chain and vendor database. Prepare periodic procurement and financial reports for"
  },
  {
    "url": "https://bdjobs.com/h/details/1459666?ln=1",
    "company_name": "Hotel Luxury Inn",
    "job_title": "Experienced Chef Required",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Experienced Chef Required : Hotel Luxury Inn Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hotel Luxury Inn Experienced Chef Required Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Negotiable Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Responsibilities & Context Position: Head Chef / Senior Chef Experience Required: Minimum 5 Years Hotel Luxury Inn is looking for a skilled and experienced Chef to join our team immediately. 🔹 Requirements: Minimum 5 years of professional experience as a Chef in a hotel or restaurant. Must be expert in preparing: Chinese Cuisine Bengali Cuisine American Cuisine British Cuisine Italian Cuisine Mexican Cuisine Strong knowledge of food presentation and hygiene standards. Ability to manage kitchen operations and kitchen staff. Creative, energetic, and able to work under pressure. 🔹 Responsibilities: Prepare high-quality meals according to hotel standards. Create new menu items and improve existing recipes. Maintain cleanliness and food safety regulations. Control food cost and kitchen inventory. 🔹 Salary & Benefits: Negotiable (Based on Experience) Friendly working environment Accommodation (if applicable) Join Hotel Luxury Inn and grow your career with us! Skills & Expertise Head Chef Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Hotel Luxury Inn Follow Address: Hotel Luxury Inn is a modern and comfortable hotel dedicated to providing premium hospitality services with warm, personalized care. Located in a convenient and accessible area, our hotel is designed to meet the needs of business travelers, families, and tourists seeking comfort, safety, and quality Website: https://www.hotelluxuryinnbd.asia Business: Hotel Luxury Inn is a modern and comfortable hotel dedicated to providing premium hospitality services with warm, personalized care. Located in a convenient and accessible area, our hotel is designed to meet the needs of business travelers, families, and tourists seeking comfort, safety, and quality service at a reasonable price.\n\nWe offer well-furnished rooms, a clean and peaceful environment, and professional staff who are always ready to ensure a pleasant stay for our guests. At Hotel Luxury Inn, guest satisfaction, cleanliness, and service excellence are our top priorities.\n\nOur Services:\n\nLuxury & Standard Accommodation\n\n24/7 Front Desk & Guest Support\n\nHousekeeping Services\n\nRestaurant & Room Service\n\nFree Wi-Fi & Modern Amenities\n\nSafe & Secure Environment Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শার"
  },
  {
    "url": "https://bdjobs.com/h/details/1461769?ln=1",
    "company_name": "OMNIA CORPORATION",
    "job_title": "Manager/Sr. Manager - HR & Admin",
    "location": "Dhaka",
    "salary": null,
    "experience": "3 to 6 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Manager/Sr. Manager - HR & Admin : OMNIA CORPORATION Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List OMNIA CORPORATION Manager/Sr. Manager - HR & Admin Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 18 to 35 years Location: Dhaka Salary: Tk. 30000 - 40000 (Monthly) Experience: 3 to 6 years Published: 21 Feb 2026 Application Insights View Requirements Education Master of Business Administration (MBA) Bachelor of Business Administration (BBA) North South University,East West University,BRAC University,American International University Bangladesh,Daffodil International University students will get preference Experience 3 to 6 years The applicants should have experience in the following business area(s): Immigration and Education Consultancy Service, Immigration/Visa Processing, Overseas Companies Additional Requirements Age 18 to 35 years What We’re Looking For: A dedicated learner with a keen desire to grow and improve continuously. A problem-solver who enjoys taking on challenges and finding innovative solutions. Strong communication and leadership skills, with the ability to inspire and manage a team. Ability to thrive under pressure and maintain focus in a fast-paced environment. A mindset that aligns with a growing organisation, adaptable to change and eager to contribute to its success. Responsibilities & Context We require a qualified and experienced management professional to efficiently oversee the growing operations of our organization. The selected candidate will supervise the overall activities of the company and assume full responsibility in the absence of the General Manager. The candidate must possess strong leadership, strategic decision-making, and management skills. HR Responsibilities: Recruitment & Staffing, Employee Relations & Engagement, Policy & Compliance, Performance Management, Compensation & Benefits, HR Reporting & MIS. Admin Responsibilities: Office Administration, Sales Administration, Sales team support and Performance, Logistics & Support Services, Compliance & Legal Support, Health, Safety & Security, Management Support. Training Responsibilities: Train to Worker, Sales Force, Office stuff ( As per training need) Skills & Expertise Communication in English Good communication skills in both English and Bangla Compensation & Other Benefits Mobile bill,Profit share,Performance bonus Lunch Facilities: Partially Subsidize Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka Company Information OMNIA CORPORATION Follow Address: Sheltech Ayaan Tower, Level 8, House 58, Road 11&06, Banani C/A, Dhaka 1213 Business: We do manpower placements effectively, saving you 50% time and effort. You  just need to shortlist the  candidates and we shall do "
  },
  {
    "url": "https://bdjobs.com/h/details/1461933?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1461942?ln=1",
    "company_name": "KB Outdoor Ltd.",
    "job_title": "Manager / General Manager - Quality",
    "location": "Chattogram",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Mar 2026",
    "job_description": "Manager / General Manager - Quality : KB Outdoor Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List KB Outdoor Ltd. Manager / General Manager - Quality Application Deadline : 24 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Chattogram Salary: Negotiable Published: 22 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experience Minimum 10–15 years of experience in QC, merchandising, or buyer handling. Proven experience dealing with foreign buyers and quality standards. At least 3–5 years in a senior or managerial role. Other Skills & Expertise Strong coordination and communication skills with buyers and internal teams. In-depth knowledge of buyer quality standards, AQL, and inspection systems. Proven ability to handle buyer complaints, audits, and corrective actions (CAPA). Good command of English (written & spoken). Strong leadership, decision-making, and problem-solving skills. Ability to work under pressure and meet shipment deadlines. Responsibilities & Context Location: CEPZ, Chattogram Responsibilities & Context (Garments / Textile / Export Oriented) Act as a strong coordination bridge between Sales, Quality Control, Production, Merchandising, and Buyers to ensure alignment on quality expectations. Ensure buyer quality standards, manuals, and compliance requirements are clearly communicated, understood, and implemented across all departments. Support the sales and merchandising teams during buyer meetings, audits, inspections, and factory visits by providing technical and quality-related input. Handle buyer quality complaints professionally, conduct root cause analysis, and ensure timely corrective and preventive actions (CAPA). Coordinate closely with QC, production, and merchandising teams to ensure consistent quality compliance throughout the order lifecycle. Monitor and control pre-production, pilot run, inline, and final inspection processes to ensure adherence to approved standards. Review and approve PP samples, size sets, TOP samples, and GPT samples in line with buyer requirements. Ensure proper implementation of quality systems such as AQL, SOPs, quality checkpoints, and inspection procedures. Analyze quality performance data, defect trends, and rejection reports to identify improvement areas and reduce rework and wastage. Lead, train, and develop the quality team to improve inspection efficiency and product quality. Ensure factory compliance with buyer codes of conduct, social compliance, and product safety requirements. Coordinate with sourcing and production teams to ensure raw materials, trims, and accessories meet buyer quality standards. Participate in risk assessment, failure analysis, and continuous improvement initiatives. Assist management in developin"
  },
  {
    "url": "https://bdjobs.com/h/details/1462428?ln=1",
    "company_name": "A Renowned RMG Industry",
    "job_title": "Executive-Travel Desk (Visa & Ticketing)",
    "location": "Dhaka (GULSHAN 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Mar 2026",
    "job_description": "Executive-Travel Desk (Visa & Ticketing) : A Renowned RMG Industry Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Renowned RMG Industry Executive-Travel Desk (Visa & Ticketing) Application Deadline : 25 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (GULSHAN 1) Salary: Tk. 30000 - 35000 (Monthly) Published: 23 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Proven experience as a Travel Desk Officer / Travel Executive. Strong hands-on experience in air ticketing, reservations, and visa processing. Practical experience handling visa processes for Schengen countries, USA, UK, Canada, Japan, and China. Sound knowledge of airline rules, fare structures, and travel documentation. Good communication skills in English and Bangla. Proficient in MS Office and travel reservation systems. Ability to work under pressure and manage multiple travel requests. Responsibilities & Context Handle end-to-end air ticketing processes, including booking, re-issue, cancellation, and refunds. Handle Visa processing. Manage international travel reservations for employees, management, and guests. Process and coordinate visa applications & air ticketing for business and official travel. Handle air ticketing for Schengen countries, USA, UK, Canada, Japan, China, and other first-world countries. Maintain close coordination with embassies, visa application centers, and authorized travel agents. Prepare and verify all supporting documents Maintain proper records of travel, visa status, passport details, and validity tracking. Support urgent and last-minute travel arrangements as per management requirements. Skills & Expertise Air Ticketing and Visa processing. Air ticketing Reservation Visa Processing Suggested by Air Ticketing Travel management Visa Processing Compensation & Other Benefits Provident fund,Mobile bill,Gratuity Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Hospitalization benefits Leave Fair Assistance (LFA) Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (GULSHAN 1) Company Information A Renowned RMG Industry Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now I"
  },
  {
    "url": "https://bdjobs.com/h/details/1462585?ln=1",
    "company_name": "Credit Excellence and Consultancy Service",
    "job_title": "Computer Operator (Pharmacy)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Computer Operator (Pharmacy) : Credit Excellence and Consultancy Service Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Credit Excellence and Consultancy Service Computer Operator (Pharmacy) Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 18 to 30 years Location: Dhaka Salary: Negotiable Published: 23 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Age 18 to 30 years Candidate should have in-depth knowledge of data entry, internet browsing, Adobe Photoshop, MS Word, and MS Excel. Candidate should be proficient in computer typing (speed: Bengali – 20 wpm, English – 30 wpm). Responsibilities & Context Any other duties as assigned by the management. Skills & Expertise Suggested by Data Entry (Both English & Bengali) MS Office Compensation & Other Benefits as-per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Credit Excellence and Consultancy Service Follow Address: 125 senpara, mirpur 10 Dhaka 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 0189762"
  },
  {
    "url": "https://bdjobs.com/h/details/1462837?ln=1",
    "company_name": "ABROAD ZONE BANGLADESH",
    "job_title": "Visa Councilor",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Visa Councilor : ABROAD ZONE BANGLADESH Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ABROAD ZONE BANGLADESH Visa Councilor Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Age: 18 to 26 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Additional Requirements Age 18 to 26 years Responsibilities & Context Increase customer quantity. Convince customers for buy our visa & air ticket. Process all kind of visa related work. Data saving & controlling. Control Facebook page. Communicate with customers over the phone call. Compensation & Other Benefits Mobile bill,Performance bonus,T/A Salary Review: Half Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information ABROAD ZONE BANGLADESH Follow Address: It's a travel & manpower related company Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel L"
  },
  {
    "url": "https://bdjobs.com/h/details/1462704?ln=1",
    "company_name": "Merkel Ltd",
    "job_title": "Business Proposal Writer & Field Researcher",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Business Proposal Writer & Field Researcher : Merkel Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Merkel Ltd Business Proposal Writer & Field Researcher Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka Salary: Tk. 30000 - 60000 (Monthly) Published: 23 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Responsibilities & Context We are seeking a motivated and detail-oriented individual for a short-term research project involving field data collection in Dhaka and business proposal development. The role requires visiting multiple locations, gathering market information, and converting findings into a professional business proposal. Job Responsibilities Field Research: Visit assigned locations/properties across Dhaka (outskirts i.e. Narayanganj) Collect current market price (sale/lease where applicable) Identify availability status (for sale/rent) Gather information from local agents, owners, or relevant sources Track historic or past price trends where possible Document findings with notes and phots Business Proposal And Reporting Organize research data and additional information into structured reports. Analyze pricing trends and market feasibility Prepare a professional business proposal (to be discusses) Skills & Expertise Data Collection Project proposal writing Property Valuation Real Estate Marketing Report Writing Research Research Design/ Analysis Suggested by Data Collection Field Data Collection Market Research Report Writing Compensation & Other Benefits T/A Workplace Work from home Employment Status Contractual Job Location Dhaka Company Information Merkel Ltd Follow Address: 28, Majir Ghat Road,Chattogram. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Interna"
  }
]