[
  {
    "url": "https://bdjobs.com/h/details/1450656?ln=1",
    "company_name": "Sharmin Palace",
    "job_title": "কেয়ারগিভার (ছেলে / মেয়ে)",
    "location": "Chattogram",
    "salary": "Tk. 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "কেয়ারগিভার (ছেলে / মেয়ে) : Sharmin Palace Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sharmin Palace কেয়ারগিভার (ছেলে / মেয়ে) Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 18 to 40 years Location: Chattogram Salary: Tk. 15000 (Monthly) Published: 19 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 40 years পূর্ব অভিজ্ঞতাসম্পন্ন ব্যক্তি অগ্রাধিকার পাবে। শুধুমাত্র চট্টগ্রামের বসবাস কারী প্রার্থীরা আবেদন করবেন Responsibilities & Context ৮ বছর বয়সী একজন বিশেষ চাহিদা সম্পন্ন ছেলে শিশু (অটিজম চাইল্ড) এর জন্য একজন কেয়ারগিভার প্রয়োজন। বাচ্চাকে সকালে ঘুম থেকে উঠিয়ে রেডি করে স্কুলে আনা নেওয়া, বাচ্চাকে টয়লেট করানো, নিয়মিত গোসল, বাচ্চাকে খাবার খাওয়ানো, বাচ্চার সাথে হাসিমুখে খেলাধূলা করা, সার্বক্ষণিক বাচ্চার খেয়াল রাখা সহ বাচ্চার যাবতীয় সবকিছুর দায়িত্ব নিতে হবে। Skills & Expertise Care Giver Child Care Suggested by Care Giver Workplace Work at office Employment Status Full Time Job Location Chattogram Read Before Apply বিশেষ দ্রষ্টব্য: ভালো করে পড়ে আবেদন করুন। যারা আগে বাচ্চা দেখাশোনা করেছেন, কেয়ার গিভার হিসেবে কাজ করেছেন অভিজ্ঞদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিল যোগ্য। বিস্তারিত না পরে আবেদন না করার জন্য অনুরোধ করা হলো কমপক্ষে ৬ মাস চাকরি করতে হবে। চাকরি ছাড়তে চাইলে ১ থেকে দেড় মাস আগে জানাতে হবে। Company Information Sharmin Palace Follow Address: Chattogram Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Se"
  },
  {
    "url": "https://bdjobs.com/h/details/1451327?ln=1",
    "company_name": "Silkywhite Fashion Ltd.",
    "job_title": "Sr. Merchandiser | Merchandising Manager (Fabric Sales & Sourcing)",
    "location": "Dhaka (Gulshan)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Sr. Merchandiser | Merchandising Manager (Fabric Sales & Sourcing) : Silkywhite Fashion Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Silkywhite Fashion Ltd. Sr. Merchandiser | Merchandising Manager (Fabric Sales & Sourcing) Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 28 to 42 years Location: Dhaka (Gulshan) Salary: Tk. 80000 - 120000 (Monthly) Published: 19 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 28 to 42 years Responsibilities & Context Handle sales and marketing of woven fabrics (local and imported). Work closely with garment manufacturers, buying houses, textile mills, and regional sourcing teams. Prior experience in a garment buying house, liaison office, or textile mill, preferably in merchandising department. Strong communication and coordination skills. Can-do attitude, energetic, multitasker, and willing to travel. Capable of handling end-to-end merchandising operations in a fast-paced work environment. Sound technical knowledge in textiles. Ability to build and maintain strong buyer–vendor–mill relationships. Skills & Expertise Apparel merchandising Costing Merchandising Sales & Marketing Sample Development Textile and Garments Textile Processing Suggested by Merchandising and Marketing Textiles & Garments Maintaining Compensation & Other Benefits T/A,Provident fund,Medical allowance,Mobile bill,Weekly 2 holidays,Gratuity Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Gulshan) Job Highlights We are looking for a Senior Merchandiser to handle textile business, including Sales, Sourcing, and Development of woven fabrics from Bangladesh, India, Indonesia, Vietnam, and China, for both local and international markets. Apply Procedure Email Your CV Send your CV to the given email saeed@sns-fashion.cc or Email your CV from My Bdjobs account Company Information Silkywhite Fashion Ltd. Follow Address: House 58B (Hassan Center)\nLevel 7, Road 131, \nGulshan 1, Dhaka 1212\nBangladesh Website: https://snsfashionltd.com/ Business: SNS Fashion Ltd. is a multinational textile trading company connecting mills and fashion brands across Asia and beyond. We specialize in fabric sourcing, development, and supply chain solutions, delivering quality and innovation for apparel manufacturing brands. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখা"
  },
  {
    "url": "https://bdjobs.com/h/details/1451424?ln=1",
    "company_name": "FCIL",
    "job_title": "Food Nutritionist Cum Chef",
    "location": "Dhaka (Baridhara, DOHS Baridhara, GULSHAN 2)",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Food Nutritionist Cum Chef : FCIL Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List FCIL Food Nutritionist Cum Chef Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 45 years Location: Dhaka (Baridhara, DOHS Ba... Dhaka (Baridhara, DOHS Baridhara, GULSHAN 2) Salary: Tk. 25000 - 30000 (Monthly) Experience: 3 to 5 years Published: 19 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Diploma in Culinary Art in Food & Nutrition Bachelor of Science (BSc) in Food & Nutrition Having a professional course in food and nutrition from NHTTI will be given preference. Experience 3 to 5 years The applicants should have experience in the following business area(s): Group of Companies, Hospital, Multinational Companies, Hotel, Embassies/Foreign Consulate Additional Requirements Age 25 to 45 years Must have a formal education or an appropriate professional course in Food & Nutrition. Ability to prepare healthy, balanced, and tasty meals as per dietary guidelines. Must strictly maintain personal hygiene, kitchen cleanliness, and food safety standards. Should be proactive, disciplined, and responsible in daily duties. Willingness to work prolonged hours. Prior experience working in a modular kitchen will get priority; however, training will be provided if necessary. Should be willing to visit local markets for purchasing fresh cooking ingredients when required. Must have the mindset to prepare additional meals outside the regular schedule in case of urgent or special requirements. Flexibility and willingness to travel with the Managing Director if needed. Responsibilities & Context Prepare daily meals for the Managing Director in accordance with Dietary and calorie specifications. Maintain daily calorie counts and nutrition charts accurately. Plan and adjust menus to support health goals and dietary instructions. Ensure proper portion control, cooking methods, and nutritional balance. Maintain strict hygiene, cleanliness, and food safety standards. Oversee kitchen supplies, quantities, ingredient quality, expiration dates, and packaging. Perform other related duties as assigned. Skills & Expertise Cold Kitchen Cooking Food Serving Skills Health and Food Safety Hot kitchen kitchen appliances Kitchen Management Multicuisine Suggested by Chef Compensation & Other Benefits Lunch Facilities: Full Subsidize Festival Bonus: 2 As per the company policy. Workplace Work at office Employment Status Full Time Job Location Dhaka (Baridhara, DOHS Baridhara, GULSHAN 2) Company Information FCIL Follow More jobs from this company Address: House-532/3 (1st Floor), Lane-11, Baridhara DOHS, Dhaka-1206 Business: 100% export-oriented Readymade Garments company based in the market of Europe and the USA. Report thi"
  },
  {
    "url": "https://bdjobs.com/h/details/1392042?ln=0",
    "company_name": "Md.Alamgir Hossain",
    "job_title": "Labor",
    "location": "Dhaka",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "02 Aug 2026",
    "job_description": "Labor : Md.Alamgir Hossain Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Md.Alamgir Hossain Labor Application Deadline : 02 Aug 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Dhaka Published: 02 Aug 2025 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context কনস্ট্রাকশন কাজের অভিজ্ঞতা Employment Status Full Time Job Location Dhaka Company Information Md.Alamgir Hossain Follow Address: Rajib cottage, check post road, Akhaura, Brahmanbaria ,, Akhaura, Akhaura, Brahmanbaria 3860 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1455390?ln=1",
    "company_name": "Trade Global Ltd.",
    "job_title": "Digital Marketing Executive",
    "location": "Dhaka (Kamlapur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Digital Marketing Executive : Trade Global Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Trade Global Ltd. Digital Marketing Executive Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 24 to 32 years Location: Dhaka (Kamlapur) Salary: Negotiable Published: 02 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 24 to 32 years কাজের প্রতি অনীহা বা উদাসীনতা বশে থাকবে না। সর্বদা কমিটমেন্টের সঙ্গে দায়িত্বশীলভাবে কাজ করতে হবে। সময়মতো অফিস বা ফিল্ডে গিয়ে কাজ সম্পন্ন করতে হবে। অলস আচরণ কখনো মেনে নেওয়া হবে না। বিশেষ দ্রষ্টব্য:যারা অলস বা কমিটমেন্ট রাখতে জানে না, তারা দয়া করে আবেদন করবেন না। Responsibilities & Context গ্রাফিক্স ডিজাইন এ পারদর্শী ভিডিও এডিটিং এর ভালো জ্ঞান স্যোশাল মিডিয়া মার্কেটিং এ অভিজ্ঞতা কাজের প্রতি দায়িত্বশীল ও সময়নিষ্ঠ টিমওয়ার্ক ও চাপের মধ্যে কাজ করার মানসিকতা অফিস ও ফিল্ড এ কাজ করার মানসিকতা থাকতে হবে ডিজিটাল মার্কেটিং ক্যাম্পেইন প্ল্যান ও বাস্তবায়ন করা নতুন প্রোডাক্ট/সার্ভিস প্রোমোট করা লিখিত কন্টেন্ট তৈরি করা Skills & Expertise Advance Knowlegde of SQL Creative Design Digital Marketing (Social Media Marketing) Field Operation Media & Communication SEO and Digital Marketing Suggested by Digital Marketing SEO and Digital Marketing Search Engine Optimization (SEO) Compensation & Other Benefits T/A,Tour allowance,Mobile bill,Over time allowance Salary Review: Yearly Festival Bonus: 2 Fixed office working hour.\nFriendly and supportive management.\nComfortable seating and clean office environment.\nOpportunity for skill development and career growth.\nOn time salary. Workplace Work at office Employment Status Full Time Job Location Dhaka (Kamlapur) Company Information Trade Global Ltd. Follow Address: Eastern Kamalapur Commercial Complex, 3rd Floor, Room# 308/309, 64-67- North Kamalapur, Dhaka, Bangladesh, 1217 Business: (TGL) is a Joint stock registered company established in 2015 , which nature of business are Manufacturer, Importer, supplier and consultancy. (TGL) has Obtained ISO 2009-2015, Category-2 license from Bangladesh Livestock Research Institute. Mass Scale / Weight Scale’s certified Supplier of BSTI (Bangladesh Standard and Testing Institution) and a member of AHCAB (Animal Health Companies Association of Bangladesh). Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 0189762785"
  },
  {
    "url": "https://bdjobs.com/h/details/1453988?ln=1",
    "company_name": "Apex Data Management & IT Ltd",
    "job_title": "Intern - Human Resources",
    "location": "Dhaka (Banani)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Intern - Human Resources : Apex Data Management & IT Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Apex Data Management & IT Ltd Intern - Human Resources Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At most 30 years Location: Dhaka (Banani) Published: 26 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age At most 30 years Candidates must have completed all academic courses except the internship. Internship Duration: 6 months Responsibilities & Context Job Overview: Apex DMIT Limited is seeking an HR Intern who is enthusiastic about people-focused work and eager to develop a strong career in Human Resources within a high-performing, multinational environment. The selected candidate will support core HR operations, including recruitment, onboarding, HRIS updates, employee engagement, and documentation. As the role involves frequent interaction with employees, applicants must possess strong communication skills, professionalism, and a proactive learning mindset. Key Responsibilities: Assist in sourcing, screening, and shortlisting candidates. Coordinate interview scheduling and maintain candidate databases. Communicate application updates and support background checks. Help with onboarding tasks and updating employee information in HR systems. Post and update job ads across platforms. Respond to basic employee queries on HR policies and leave. Support HR in organizing events, engagement activities, and career programs. Skills & Expertise Energetic and self-motivated Good Ms office and Emailing skill Google Suite Google workspace Leadership and Good Communication skill. Organizational Skills Problem solving and analytical skill Suggested by Human Resource Management Compensation & Other Benefits Weekly 2 holidays A collaborative and dynamic work environment. Hands-on experience in various HR functions. Mentorship and learning opportunities. What We Offer: Monthly Remuneration BDT 10,000. Professional learning and development opportunities. A supportive and collaborative team culture. Real-world HR experience in a growing organization. Workplace Work at office Employment Status Full Time Job Location Dhaka (Banani) Job Highlights Evening Shift: 1 PM to 10 PM Work Days: Sunday- Thursday Weekend: 2 Days (Friday-Saturday) Job Location: Dhaka (Banani) Work Schedule: 5 days a week, Sunday to Thursday Company Information Apex Data Management & IT Ltd Follow More jobs from this company Address: House No: 133 (6th, 7th & 8th Floor), Road: 12, Block-E, Banani, Dhaka-1213 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা "
  },
  {
    "url": "https://bdjobs.com/h/details/1391675?ln=0",
    "company_name": "Posted by Anonymous",
    "job_title": "Security guard",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "31 Jul 2026",
    "job_description": "Security guard : Posted by Anonymous Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Posted by Anonymous Security guard Application Deadline : 31 Jul 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Anywhere in Bangladesh Published: 31 Jul 2025 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context বেতনঃ ৮,০০০ টাকা প্রতি মাস সুবিধাঃ ফ্ল্যাটে সার্বক্ষণিক ফ্রি থাকার সুযোগ দায়িত্ব ও কর্তব্যসমূহঃ প্রতিদিন বাড়ির মূল দরজা খোলা ও বন্ধ করা। মাসিক ভাড়া ও বিল সংগ্রহ করা এবং রশিদ প্রদান করা। বাড়ির চারপাশে গাছ লাগানো ও যত্ন নেওয়া। সিঁড়ি ও আশেপাশের স্থান পরিষ্কার-পরিচ্ছন্ন রাখা। ভাড়াটিয়াদের যেকোনো হাউজিং সংক্রান্ত সমস্যায় সহায়তা করা। বাড়ির মালিকের প্রয়োজন অনুযায়ী অতিরিক্ত কাজে সহায়তা করা। সুবিধাসমূহঃ সার্বক্ষণিক ফ্ল্যাটে থাকার সুযোগ (ফ্রি অ্যাকমোডেশন। শান্ত ও নিরাপদ পরিবেশে কাজের সুযোগ। Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Posted by Anonymous Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1373274?ln=0",
    "company_name": "Md. Abdul Hannan",
    "job_title": "Driver",
    "location": "Dhaka",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "02 Jun 2026",
    "job_description": "Driver : Md. Abdul Hannan Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Md. Abdul Hannan Driver Application Deadline : 02 Jun 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Dhaka Published: 30 Jul 2025 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context I am interested in taking the job. Employment Status Full Time Job Location Dhaka Company Information Md. Abdul Hannan Follow Address: Bonkura, Nalitabari, Sherpur; Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1448765?ln=1",
    "company_name": "The Premier Bank PLC",
    "job_title": "Chief HR Officer (EVP to DMD)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Chief HR Officer (EVP to DMD) : The Premier Bank PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The Premier Bank PLC Chief HR Officer (EVP to DMD) Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 55 years Location: Anywhere in Bangladesh Published: 19 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At most 55 years Minimum 15 years of progressive HR experience in Bank or Financial Institution with at least 5 years in a senior leadership role in a reputed private commercial Bank. In depth knowledge in Bangladesh Bank regulations, Labor Law, governance, compliance and strategic transformation. Proven track record of HR modern system handling. Age not exceeding 55 years as of January 31, 2026 (may be relaxed for exceptionally qualified candidates) Responsibilities & Context The Premier Bank PLC. , with the network of 136 branches and 67 sub-branches across the country, is on a growth trajectory to expand its network and services nationwide. As part of its commitment to corporate goals, financial inclusion and good governance, the Bank invites applications from highly experienced, strategic, and performance-driven banking professionals for the position of Chief HR Officer (CHRO), Human Resources Division. Job Responsibility: Develop and implement a comprehensive HR strategies aligned with the Bank’s corporate vision, business goals, and regulatory framework. Act as a strategic advisor to the Managing Director & CEO and the Board on human capital planning, workforce optimization, and organizational development. Oversee talent acquisition, succession planning, leadership development, and employee retention strategies across the Bank. Formulate and review HR policies, service rules, compensation structures, and benefits in compliance with Bangladesh Bank regulations and labor laws. Lead performance management systems, appraisal frameworks, and incentive schemes to drive a high-performance culture. Ensure effective manpower planning, deployment, and productivity optimization across branches and Head Office. Oversee learning and development initiatives, training needs analysis, and leadership capability building. Strengthen employee engagement, organizational culture, ethics, and disciplinary frameworks. Ensure compliance with Bangladesh Bank circulars, labor laws, internal audit requirements, and regulatory inspections related to HR. Supervise HR operations including recruitment, payroll, leave, confirmation, promotion, transfer, disciplinary actions, and retirement processes. Lead HR digitization initiatives, HRIS enhancement, and data-driven HR analytics. Manage industrial relations, grievance handling, and employee communication mechanisms. Coordinate with regulators, exter"
  },
  {
    "url": "https://bdjobs.com/h/details/1392049?ln=0",
    "company_name": "Posted by Anonymous",
    "job_title": "Cashier",
    "location": "Dhaka",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "02 Aug 2026",
    "job_description": "Cashier : Posted by Anonymous Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Posted by Anonymous Cashier Application Deadline : 02 Aug 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Dhaka Published: 02 Aug 2025 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context শিক্ষাগত যোগ্যতা: >এসএসসি/এইচএসসি/সমমান >সন্ধানী লাইফ ইন্সুইরেন্সের অধীনে কমিশন ভিত্তিতে জীবন বীমা পলিসি বিপণের কাজ করতে হবে। > মাসে টার্গেট ভিত্তিক লক্ষ‌্যমাত্রা অর্জন করলে বেতন প্রদান করা হবে। Employment Status Full Time Job Location Dhaka Company Information Posted by Anonymous Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1457509?ln=1",
    "company_name": "The Subhana Traders",
    "job_title": "Receptionist",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Receptionist : The Subhana Traders Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The Subhana Traders Receptionist Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 2 Age: 25 to 30 years Location: Dhaka Salary: Negotiable Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 25 to 30 years Responsibilities & Context Receive and welcome visitors in a professional manner Answer, screen, and forward incoming phone calls Maintain front desk operations and office records Schedule meetings and manage appointments Assist with basic administrative and clerical tasks Handle courier, mail, and office correspondence Skills & Expertise Suggested by Customer Service Reception Receptionist/ Front Desk Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka Company Information The Subhana Traders Follow Address: Rajanigandha Tower, L 01, 4th Floor,\nDhaka Cantonment, Dhaka- 1206. Business: Importer & Supplier of Stone, Coal and Food Grains. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458313?ln=1",
    "company_name": "The White Horse Pharmaceuticals Ltd.",
    "job_title": "IT Officer",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "IT Officer : The White Horse Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The White Horse Pharmaceuticals Ltd. IT Officer Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 40 years Location: Anywhere in Bangladesh Salary: Tk. 15000 - 20000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Age 22 to 40 years Responsibilities & Context Maintenance, diagnosing and troubleshooting hardware, installing OS/software, and networking. Prepare, Install, Configure & Setup and also provide extensive support to PC, workstation, Laptop, UPS, Printer, multifunctional printer, related Hardware and software issues instantly. Keep computer systems running smoothly and ensure users get the maximum benefit from them. Provide support, including procedural documentation and relevant reports that deliver technical assistance to the entire office. Inventory Management of Computer Hardware, Laptop, Printer, UPS, Scanner, Multimedia Projector and Various types of Software and operating system. Configuration and maintaining LAN/WAN/WIFI setup and troubleshooting. Provide IT supports to user end for their desktops, laptops, wireless routers, scanners, printers and other IT assets as per office IT policy. Communicate with different service providers/vendors/organizations and take necessary steps as per requirements. Other duties as assigned by the higher authority. Compensation & Other Benefits As per company Policy. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Read Before Apply Please bring a copy of updated CV with recent photo when come for interview. Company Information The White Horse Pharmaceuticals Ltd. Follow More jobs from this company Address: 68, Dilkusha C/A (6th Floor), Dhaka-1000 Website: www.whitehorsepharma.com Business: The White Horse Pharmaceuticals Ltd. A Swiss Born Company started its journey since 1991 in Switzerland and activated in Bangladesh in 1996. Every smile is important. That`s why we work to protect you and your smile. We are a company which is working to ensure your happiness and safety. Our-state-of-the-art world class plant with modern facilities on a 4.5 acres land in Sreepur, Gazipur which complies with cGMP-WHO requirements is the perfect exposition of a proficient pharmaceuticals company. Presently, we are exporting to many countries and playing an important role in the global arena as well as domestic market, for the improvement of people`s health to see a face of full smile. As an integral part of this journey The White Horse Pharmaceuticals Ltd. is seeking dynamic, responsible & innovative individual. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদ"
  },
  {
    "url": "https://bdjobs.com/h/details/1458307?ln=1",
    "company_name": "MEGASAN Medical Industries BD Ltd.",
    "job_title": "অফিস সহায়ক (পুরুষ/মহিলা)",
    "location": "Dhaka",
    "salary": "Tk. 10000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "অফিস সহায়ক (পুরুষ/মহিলা) : MEGASAN Medical Industries BD Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MEGASAN Medical Industries BD Ltd. অফিস সহায়ক (পুরুষ/মহিলা) Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Salary: Tk. 10000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context অফিসের জন্যে জরুরি ভিত্তিতে একজন অফিস সহকারি প্রয়োজন সকাল ১০টা থেকে রাত ৮.৩০টা অফিস ক্লিনিং এবং চা বানানোর কাজ। Skills & Expertise Suggested by Peon Office Assistance Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information MEGASAN Medical Industries BD Ltd. Follow Address: ????? ????? ???/?,??? ???,???? Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458354?ln=1",
    "company_name": "Decor Interior Ltd.",
    "job_title": "Business Development Manager (Solar & Renewable Energy)",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Business Development Manager (Solar & Renewable Energy) : Decor Interior Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Decor Interior Ltd. Business Development Manager (Solar & Renewable Energy) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Age: 28 to 35 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 28 to 35 years Must be highly active and field-oriented Willing to travel and meet clients as required Strong professional attitude and commitment to work Responsibilities & Context Decor Energy Solutions Ltd., one of the leading renewable energy companies in Bangladesh, is looking for a highly active, motivated, and experienced Business Development Manager with strong knowledge of solar-related products and projects . The ideal candidate must be energetic, client-focused, and capable of working under pressure to meet business targets and serve clients efficiently. Identify, develop, and manage new business opportunities in the solar and renewable energy sector Maintain strong relationships with existing and potential clients Conduct client meetings, site visits, and technical discussions when required Prepare business proposals, quotations, and B2B communications Coordinate with technical, engineering, and marketing teams Achieve sales targets and support company growth Handle negotiations and close deals professionally Work actively in all situations to meet client requirements Skills & Expertise Suggested by Consumer Durables - Sales & Marketing Sales & Marketing Sales target Customer Service Salesman Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Decor Interior Ltd. Follow Address: House#09, Road#105, Gulshan-2, Dhaka-1212 Website: https://www.decor-bd.com/ Business: IT Services Provider, Software Company, GPRS programmable meter control using software, Construction Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশ"
  },
  {
    "url": "https://bdjobs.com/h/details/1458453?ln=1",
    "company_name": "Mitali Fashions Ltd.",
    "job_title": "Head of IE",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "12 to 15 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Head of IE : Mitali Fashions Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mitali Fashions Ltd. Head of IE Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Negotiable Experience: 12 to 15 years Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor in Engineering (BEngg) in Industrial Eng & Production Bachelor in Engineering (BEngg) in Textile Engineering Experience 12 to 15 years The applicants should have experience in the following business area(s): Garments, Textile, Garments Accessories, Dyeing Factory Additional Requirements •\tExcellent command over SMV, GSD, work study, capacity & manpower planning. •\tStrong leadership, strategic thinking, and decision-making ability. •\tHigh proficiency in data analysis, MS Excel, and reporting dashboards. •\tAbility to work with senior management and drive change at scale. •\tStrong communication, presentation, and team development skills. Responsibilities & Context Lead, control, and develop the Industrial Engineering function across all factories. Set IE strategies, KPIs, and productivity benchmarks aligned with business goals. Oversee SMV development, time & motion study, line balancing, and capacity planning. Monitor efficiency, productivity, cost, and manpower utilization company-wide. Drive continuous improvement initiatives (Lean, productivity enhancement, waste reduction). Coordinate with Production, Planning, QA, Merchandising, and Management teams. Analyze factory performance data and present actionable reports to top management. Mentor and develop IE Managers, Senior IEs, and IE teams. Ensure standardized IE practices and compliance across all units. Skills & Expertise Suggested by Industrial & Production Engineering Merchandising Planning Textiles & Garments Maintaining Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Mitali Fashions Ltd. Follow Address: House No. 11/A (Level 6-7), Road No. 130, Gulshan-1, Dhaka-1212 Business: 100% export oriented Knit Composite Garments Industry. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Registe"
  },
  {
    "url": "https://bdjobs.com/h/details/1458475?ln=1",
    "company_name": "Mitali Fashions Ltd.",
    "job_title": "Woven Merchandiser",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Woven Merchandiser : Mitali Fashions Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mitali Fashions Ltd. Woven Merchandiser Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Strong knowledge of woven fabric, trims, costing & production processExcellent communication skills in English & BanglaGood command of MS Excel, Word & email communicationAbility to work under pressure and meet deadlinesHonest, proactive and team-oriented mindset Responsibilities & Context Handle end-to-end merchandising for Woven garments (Trouser, Pant & Shirt items) Costing preparation & execution for woven pant and shirt orders Buyer communication regarding price, sample, approval & delivery Product development, sample follow-up and approval coordination Fabric, trims & accessories booking and follow-up Production planning, time & action calendar follow-up Execution of orders from order confirmation to final shipment Coordination with production, quality, sourcing & commercial departments Ensure on-time shipment with required quality standards Maintain accurate merchandising documentation & reports Skills & Expertise Suggested by Merchandising woven woven Garments Woven Merchandiser Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Mitali Fashions Ltd. Follow Address: House No. 11/A (Level 6-7), Road No. 130, Gulshan-1, Dhaka-1212 Business: 100% export oriented Knit Composite Garments Industry. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm ("
  },
  {
    "url": "https://bdjobs.com/h/details/1458965?ln=1",
    "company_name": "IVAMCO",
    "job_title": "Executive - Inventory Management",
    "location": "Dhaka (Uttara Sector 4)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Executive - Inventory Management : IVAMCO Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List IVAMCO Executive - Inventory Management Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 22 to 28 years Location: Dhaka (Uttara Sector 4) Salary: Tk. 15000 - 18000 (Monthly) Published: 13 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 28 years 2-5 years of experience in warehouse, inventory, or logistics operations. Familiarity with SKU system, barcoding, and stock tracking procedures. Competence in using Google spreadsheets or inventory management tools. Strong attention to detail, punctuality, and accountability. Experience in e-commerce or Retail fulfillment is an added advantage. Responsibilities & Context Inventory Management Executive is responsible for executing daily warehouse activities including SKU labeling, packaging, inventory tracking, and dispatch coordination. This role plays a key part in ensuring the seamless flow of products from IVAMCO (B2B) to B2C Retail channels. The job needs someone who is organized, detail-oriented, and comfortable working with inventory systems to help keep things running efficiently and accurately. Key Responsibilities: Perform processing of inbound product. Maintain accurate and up-to-date inventory records in the system. Coordinate product dispatches and ensure correct product allocation to B2C retailers. Follow warehouse SOP and maintain a clean, organized storage environment. Collaborate with procurement and inventory teams to support B2B to B2C workflows. Support team management and maintain accurate inventory. Skills & Expertise Accuracy Auditing skill Data analysis Ecommerce Google Sheets Microsoft Excel Supply Chain Management Suggested by Cost and Inventory Management Inventory Management Store/ inventory Compensation & Other Benefits Performance bonus Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Uttara Sector 4) Company Information IVAMCO Follow More jobs from this company Address: House-30, Road-11, Sector-04, Uttara, Dhaka-1230 Website: https://www.ivamco.com Business: IVAMCO is a supply chain and distribution company focused on sourcing consumer goods, managing inventory, and delivering products across Bangladesh. We ensure efficient logistics and warehousing while supporting retail operations through reliable product flow. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান"
  },
  {
    "url": "https://bdjobs.com/h/details/1458790?ln=1",
    "company_name": "E.Engineer's Trade",
    "job_title": "Assistant Executive Sales and Marketing",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Assistant Executive Sales and Marketing : E.Engineer's Trade Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List E.Engineer's Trade Assistant Executive Sales and Marketing Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 27 to 30 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 14 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 27 to 30 years Age 27 to 30 years candidates must have an experience on cpvc/upvc/pvc pipe-related marketing. Well groomed and mannered. Self motivated. Ability to work under pressure. Work individually and in team. Skills & Expertise Consumer Durables-Sales & Marketing Dealer Management Direct Sales and Marketing Responsibilities & Context Fully Responsible for Sales & Marketing activities of PVC/CPVC pipes and Fittings, Water management (STP, WTP, ETP) systems. Prepare market activity forecast, sales . Analyze competitive market strategies through analysis of the related product, market of share trends. Ensure market development by maintaining a strong relationship with customer. Collect regular marketing feedback from clients. Any other tasks assigned by the management. Skills & Expertise Suggested by Client Relationship Management Sales & Marketing Technical Sales/ IT Marketing Water Resources Engineering Compensation & Other Benefits · Mobile bill · Salary Review: Yearly · Festival Bonus: 2 · Incentives will be provided for achieving the monthly target Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information E.Engineer's Trade Follow Address: Plot-3108, Road-6/2, Block-G, Sagufta Residential Project, In front of Mirpur DOHS gate No. 01, Mirpur-12, Dhaka-1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রে"
  },
  {
    "url": "https://bdjobs.com/h/details/1458952?ln=1",
    "company_name": "Farion Power Solution",
    "job_title": "Generator Technician",
    "location": "Bangladesh, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Generator Technician : Farion Power Solution Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Farion Power Solution Generator Technician Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 18 to 35 years Location: Bangladesh, Dhaka Salary: Tk. 18000 - 30000 (Monthly) Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 35 years Practical experience in petrol generator overhauling. Willing to travel for installation, servicing, and emergency support. Dedicated, hardworking, and responsible. Able to work under pressure and handle urgent service calls. Education requirement flexible for highly skilled candidates. Responsibilities & Context Install generators (PG or DG) at customer sites following technical standards and safety guidelines. Perform routine servicing and preventive maintenance to ensure optimal generator performance and longevity. Diagnose electrical and mechanical faults, identify problems, and carry out necessary repairs efficiently. Troubleshoot issues related to starting the system, alternator, AVR, control panel, fuel system, and load management. Conduct load testing, commissioning, and performance checks after installation or major repair. Ensure proper wiring, earthing, ATS/AMF panel connection, and compliance with safety regulations. Provide emergency breakdown support and on-site technical assistance when required. Maintain service records, checklists, and reports for each job completed. Handle spare parts replacement, oil change, filter change, battery maintenance, and coolant checks. Coordinate with the technical team, service manager, and store for parts availability and scheduling. Communicate clearly with customers regarding issues, solutions, and maintenance advice. Perform customer handover after installation/service, including operational guidance and safety instructions. Maintain tools, equipment, and company assets in proper working condition. Follow company policies, safety procedures, and industry best practices at all times. Be available for field visits, urgent service calls, and assignments as directed by management. Skills & Expertise Diesel Generator Generator Repair Generators Suggested by Generator Mechanical Technician Mechnical Repairing Troubleshooting Compensation & Other Benefits T/A,Provident fund,Mobile bill Salary Review: Yearly Festival Bonus: 2 Lunch Facilities: Partially Subsidize Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Bangladesh, Dhaka Company Information Farion Power Solution Follow Address: Suhita Tower (2nd Floor), House #11, Jashimuddin Avenue, Uttara, Dhaka-1230 Website: https://farionpower.com/ Business:"
  },
  {
    "url": "https://bdjobs.com/h/details/1459250?ln=1",
    "company_name": "REVELMAN",
    "job_title": "Telesales Executive (Office-Based)",
    "location": "Dhaka (Mirpur 10)",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Telesales Executive (Office-Based) : REVELMAN Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List REVELMAN Telesales Executive (Office-Based) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Age: At least 20 years Location: Dhaka (Mirpur 10) Salary: Tk. 12000 - 14000 (Monthly) Experience: 1 to 5 years Published: 14 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education SSC Experience 1 to 5 years Freshers are also encouraged to apply. Additional Requirements Age At least 20 years Responsibilities & Context Job Context Revelman BD একটি দ্রুত বর্ধনশীল Men’s Grooming Brand । আমরা অনলাইন ভিত্তিক সেলসের মাধ্যমে প্রতিদিন শত শত কাস্টমারের সাথে যোগাযোগ করি। এই পজিশনে কাজ করার মাধ্যমে আপনি সরাসরি কাস্টমার কমিউনিকেশন, সেলস কনভার্সন এবং ব্র্যান্ড গ্রোথে গুরুত্বপূর্ণ ভূমিকা পালন করবেন। যারা target-driven , income-focused এবং নিজের স্কিল দিয়ে বেশি আয় করতে চান—তাদের জন্য এটি একটি দুর্দান্ত সুযোগ। Job Responsibilities নতুন ও বিদ্যমান কাস্টমারদের সাথে ফোন কলের মাধ্যমে যোগাযোগ করা কাস্টমারের প্রয়োজন বুঝে Revelman-এর প্রোডাক্ট সঠিকভাবে প্রেজেন্ট করা Outbound কল হ্যান্ডেল করা অর্ডার কনফার্মেশন ও কাস্টমার ফলো-আপ করা Daily / Weekly sales target অর্জন করা WhatsApp ও Call এর মাধ্যমে কাস্টমার কনভার্সন বাড়ানো কাস্টমার প্রশ্ন, আপত্তি (objection) ও সমস্যা দক্ষতার সাথে হ্যান্ডেল করা Sales report ও কাজের আপডেট টিম লিডারকে প্রদান করা কোম্পানির sales guideline ও call script অনুসরণ করা Compensation & Other Benefits Over time allowance Salary Review: Half Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Salary & Benefits The selected candidates will be offered a competitive remuneration package along with the following benefits: Basic Salary: BDT 12,000 – 15,000 (based on skills, experience, and performance) Performance-Based Bonus: Attractive incentives based on individual performance and sales achievement Target Incentive: Additional incentives upon achieving assigned sales targets Weekly Holiday: One day off per week as per company policy Overtime / Holiday Allowance: Extra compensation for working on weekly holidays, when applicable Timely Salary Disbursement: Salary will be paid on time every month Career Growth Opportunity: Scope for professional and personal development through skill enhancement and performance evaluation Promotion & Increment: Opportunity for promotion and salary increment based on consistent performance Work Environment: Friendly, supportive, and professional working environment Brand Experience: Opportunity to work with a fast-growing and emerging men’s grooming brand in Bangladesh. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur 10) Company Information REVELMAN Follow Address: House-17, Road - 10, Block-B, Mirpur-10, Dhaka Websi"
  },
  {
    "url": "https://bdjobs.com/h/details/1459104?ln=1",
    "company_name": "SA LEGAL COUNSEL",
    "job_title": "Officer (RJSC and Accounts)",
    "location": "Dhaka (DOHS Baridhara)",
    "salary": "Negotiable",
    "experience": "RJSC",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Officer (RJSC and Accounts) : SA LEGAL COUNSEL Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SA LEGAL COUNSEL Officer (RJSC and Accounts) Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 18 to 30 years Location: Dhaka (DOHS Baridhara) Salary: Negotiable Published: 14 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 30 years Responsibilities & Context Prepare and file all necessary documents for company registration with RJSC. Draft and review Memorandum of Association (MOA) and Articles of Association (AOA). Handle annual return filing and statutory returns to RJSC. Skills & Expertise Accounts and audit Company Law Legal Affairs Return Submission RJSC Experience RJSC Suggested by Accounting Accounts and Finance Documentation Financial Reporting Reporting and Documentation Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (DOHS Baridhara) Company Information SA LEGAL COUNSEL Follow Address: House- 153 (2nd Floor) Road- 01, Baridhara DOHS, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available fr"
  },
  {
    "url": "https://bdjobs.com/h/details/1457930?ln=1",
    "company_name": "power Engineering",
    "job_title": "Marketing Executive - Lift Marketing",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Marketing Executive - Lift Marketing : power Engineering Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List power Engineering Marketing Executive - Lift Marketing Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 22 to 46 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 46 years Responsibilities & Context নতুন লিফট প্রজেক্ট ও ক্লায়েন্ট সংগ্রহ করা বিল্ডিং ও কনস্ট্রাকশন সাইট ভিজিট করা ডেভেলপার, কন্ট্রাক্টর, আর্কিটেক্ট ও বিল্ডিং মালিকদের সাথে নিয়মিত যোগাযোগ রাখা লিফট সেলস, ইনস্টলেশন ও সার্ভিস সম্পর্কিত তথ্য ক্লায়েন্টকে প্রদান করা কোটেশন, ফলোআপ ও ডিল ক্লোজিং এ সহযোগিতা করা কোম্পানির মার্কেটিং টার্গেট পূরণে সক্রিয়ভাবে কাজ করা গ্রাহকদের প্রতি সদাচরণ, সহানুভূতিশীল ও পেশাদার মনোভাব বজায় রাখা গ্রাহকের জিজ্ঞাসার দ্রুত ও কার্যকর জবাব প্রদান ভালোভাবে মনোযোগ দিয়ে গ্রাহকের কথা শোনা টেলিফোনে দক্ষতা থাকা (বিশেষ করে জটিল বা মাল্টি-লাইন ফোন সিস্টেমে) গ্রাহকের প্রয়োজন বুঝে সমস্যা চিহ্নিত করা এবং যথাযথ সমাধান প্রদান চমৎকার যোগাযোগ দক্ষতা ও শ্রবণ দক্ষতা থাকা আকর্ষণীয় কণ্ঠস্বর থাকা অবশ্যই পরিশ্রমী হতে হবে (যারা কঠোর পরিশ্রমে অভ্যস্ত নন, তারা অনুগ্রহ করে আবেদন করবেন না) Skills & Expertise Good communication skills in both English and Bangla Good comunication skill Presentation skill Compensation & Other Benefits T/A,Mobile bill Festival Bonus: 2 🚲 কোম্পানির পক্ষ থেকে বাইক প্রদান করা হবে 💰 অভিজ্ঞতা অনুযায়ী আকর্ষণীয় বেতন 📈 সেলস কমিশন ও পারফরম্যান্স বোনাস 📊 দক্ষতার ভিত্তিতে স্থায়ী চাকরি ও পদোন্নতির সুযোগ যোগাযোগের জন্য (অফিসিয়াল): প্রয়োজনে নিম্নোক্ত নম্বরসমূহে যোগাযোগ করার জন্য অনুরোধ করা যাচ্ছে— 📞 সিইও: ০১৮৪৩-৪৩৮৮১০ 📞 এইচ আর : ০১৯৪৭-০০২৯৯৯ আপনার প্রয়োজনীয় যেকোনো তথ্য বা সহায়তার জন্য উল্লিখিত নম্বরগুলোতে যোগাযোগ করতে পারেন। Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Job Highlights লিফট / এলিভেটর মার্কেটিংয়ে ন্যূনতম ১ বছর বাস্তব অভিজ্ঞতা অফিস থেকে প্রাইভেট কার / মোটরবাইক প্রদান করা হবে (অপশনাল) ঢাকার বিভিন্ন এলাকা ও বিল্ডিং সেক্টর সম্পর্কে ধারণা থাকতে হবে যোগাযোগ ও নেগোশিয়েশন স্কিল ভালো হতে হবে Company Information power Engineering Follow Address: House# 30/32, Road# 10, Sector# 15/B, (Dubai Tower) Uttara, Dhaka-1230 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01"
  }
]