[
  {
    "url": "https://bdjobs.com/h/details/1457545?ln=1",
    "company_name": "ABROAD ZONE BANGLADESH",
    "job_title": "Customer Service Officer",
    "location": "Dhaka (Purana Paltan)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Customer Service Officer : ABROAD ZONE BANGLADESH Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ABROAD ZONE BANGLADESH Customer Service Officer Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 5 Age: 18 to 35 years Location: Dhaka (Purana Paltan) Salary: Tk. 12000 - 20000 (Monthly) Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 35 years Responsibilities & Context Increase new customer. Increase sales. Maintain good relationship with customers & agents. Others office work Skills & Expertise Suggested by Customer Service Customer Support Compensation & Other Benefits Mobile bill,Performance bonus Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Purana Paltan) Company Information ABROAD ZONE BANGLADESH Follow Address: It's a travel & manpower related company Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458295?ln=1",
    "company_name": "babai",
    "job_title": "Customer Support Officer",
    "location": "Dhaka (Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Customer Support Officer : babai Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List babai Customer Support Officer Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 20 to 35 years Location: Dhaka (Uttara) Salary: Tk. 12000 - 18000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Responsibilities & Context Handle incoming and outgoing customer calls. Provide call and chat support across Facebook Messenger, Instagram, Website Live Chat, and WhatsApp. Respond to customer queries, complaints, and requests promptly. Collect and record customer feedback. Maintain records of orders, deliveries, and return entries. Keep the customer database updated and organized. Assist with stock monitoring and ensure proper inventory status. Deliver an excellent customer experience with a positive and solution-focused approach. Skills & Expertise Call Center Call Support Customer Care Customer Handling Customer Service Customer Service Management Customer Support through Phone E-Commerce products Facebook Post Google Sheets Suggested by Call Center Operation Customer Handling Customer Relations Social Media Management Compensation & Other Benefits Performance bonus Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 - Free lunch, evening snacks - Unlimited tea/coffee - 2 yearly bonuses - Salary review every year Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara) Company Information babai Follow Address: Domino building, House 6, Lift 6, Flat B , Rabindro Sarani Road, Sector 7, Uttara. ( beside City Bank Azompur Branch) Website: https://www.babai.com.bd/ Business: Babai is a growing e-commerce brand from Bangladesh, dedicated to offering high-quality products at affordable prices. We operate fully online, making shopping simple, fast, and reliable for customers across the country. We directly import products from China, ensuring better quality control, compet Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Cour"
  }
]