[
  {
    "url": "https://bdjobs.com/h/details/1455289?ln=1",
    "company_name": "Orbit Traders",
    "job_title": "Full-Stack Developer",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Full-Stack Developer : Orbit Traders Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Orbit Traders Full-Stack Developer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Anywhere in Bangladesh Salary: Tk. 200000 - 300000 (Monthly) Published: 31 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Only candidates with proven experience in TypeScript, React/Next.js, and active use of Cursor and/or Claude are eligible. Please do not apply if you do not meet these requirements. Expert-level English communication is mandatory. You will write documentation, communicate daily in Slack, and collaborate directly with US stakeholders. If writing in English isn’t second nature to you, this role is not a fit. Required Qualifications Expert-level English fluency (written and verbal)—non-negotiable 3+ years full-stack development experience Strong TypeScript and React/Next.js skills Active experience using Cursor and/or Claude for development Understanding of LLMs and experience with prompt engineering or AI integrations Ability to work independently and meet deadlines in a remote setup Preferred Qualifications Experience building chat interfaces or conversational UIs Familiarity with multi-tenant SaaS architecture Experience with webhook implementations and third-party API integrations Backend experience with Node.js, PostgreSQL, and REST APIs Experience with AWS deployments Familiarity with Vercel AI SDK Previous experience working with US-based or international teams Responsibilities & Context We are a Seattle, Washington–based B2B SaaS company looking for a highly skilled Full-Stack Developer based in Bangladesh. You’ll work directly with our US-based engineering team building production AI chat systems and embeddable widgets for software companies. ** Active, hands-on experience using Cursor and/or Claude for development is required; applicants without substantial experience are strongly discouraged from applying. Working Hours Overlap with Seattle (PST) time zone is required. You must be available to work during US business hours. Responsibilities Build and maintain multi-tenant SaaS applications using React, Next.js, and TypeScript Develop backend services including webhook integrations, authentication flows, and API endpoints Work on AI agent logic—prompt engineering, conversation flows, and LLM integrations Leverage Cursor, Claude Code, and AI coding tools to improve development efficiency Collaborate remotely with Seattle-based engineering team via Slack, Linear, and GitHub Participate in code reviews and architectural discussions Skills & Expertise Spoken and written fluency in English Suggested by Full Stack Development Next.js PostgreSQL react.js Compe"
  },
  {
    "url": "https://bdjobs.com/h/details/1454531?ln=1",
    "company_name": "SHANGHAI FOOD & BEVERAGE CO. LTD.",
    "job_title": "Accounts Officer",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Accounts Officer : SHANGHAI FOOD & BEVERAGE CO. LTD. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SHANGHAI FOOD & BEVERAGE CO. LTD. Accounts Officer Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: 25 to 35 years Location: Dhaka Salary: Tk. 10000 - 20000 (Monthly) Published: 27 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Basic to advanced knowledge of accounting principles Experience with Excel / Google Sheets (mandatory) Ability to analyze numbers and prepare reports accurately Good organizational and record-keeping skills Honest, responsible, and detail-oriented Responsibilities & Context Shanghai Food & Beverage Company Ltd. is looking for a dedicated and detail-oriented Accountant to manage and analyze the financial performance of different sections of the company. The selected candidate will be responsible for all expenses, calculating profits and losses, and preparing organized financial reports to support business decisions. Key Responsibilities: Record and calculate daily, weekly, and monthly expenses of each section of the Company. Maintain accurate financial records of purchases, sales, and operational costs. Prepare final summarized spreadsheets containing all financial data. Analyze financial performance and highlight areas of profit or loss. Ensure accuracy and transparency in all calculations. Assist management with financial insights and reports when required. Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information SHANGHAI FOOD & BEVERAGE CO. LTD. Follow More jobs from this company Address: House-20, Sonargaon Janapath Road, Sector-12, Uttara, Dhaka, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Al"
  },
  {
    "url": "https://bdjobs.com/h/details/1453968?ln=1",
    "company_name": "SHANGHAI FOOD & BEVERAGE CO. LTD.",
    "job_title": "National Sales Manager",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "National Sales Manager : SHANGHAI FOOD & BEVERAGE CO. LTD. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SHANGHAI FOOD & BEVERAGE CO. LTD. National Sales Manager Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 30 to 40 years Location: Dhaka Salary: Negotiable Published: 26 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 30 to 40 years Responsibilities & Context We are a manufacturing (Food & Beverage) company looking for proactive National Sales & Marketing Manager to meet job objectives without compromising company policies. Prepare an annual sales plan & implement strategies to make sales & achieve the sales target. Prepare and present regular sales reports, forecasts, and analyses to senior management. Build-on and develop relationships with new customers or clients. Ensure compliance with company policies, procedures, and regulatory requirements. Develop and execute strategic sales plans to achieve revenue and growth targets within the division. Lead, mentor, and motivate a team of Regional Sales Managers and Territory Sales Managers to achieve individual and collective sales goals. Monitor and analyze sales performance metrics, market trends, and competitor activities to identify opportunities for growth. Manage key customer accounts and maintain strong relationships to drive customer satisfaction and loyalty. Coordinate with divisional sales management and others department to align divisional sales strategies with overall business objectives. Provide training, coaching, and professional development opportunities for sales team members. Collaborate with HR on recruitment, selection, and on boarding of sales team members. Foster a positive and productive work environment that promotes teamwork and high performance. Ensuring distribution of primary and secondary sales that is assigned by the company. Ensure market return reduction and proper monitoring of damaged products and maintain them. Follow competitive activities and ensure regular feedback to management regularly. Skills & Expertise Suggested by Sales & Marketing Strategic Planning Target Oriented Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information SHANGHAI FOOD & BEVERAGE CO. LTD. Follow More jobs from this company Address: House-20, Sonargaon Janapath Road, Sector-12, Uttara, Dhaka, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদ"
  },
  {
    "url": "https://bdjobs.com/h/details/1459547?ln=1",
    "company_name": "Bangla Dynasty Global Consultancy Limited",
    "job_title": "Visa Consultant Executive",
    "location": "Dhaka (Vatara)",
    "salary": "Negotiable",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Visa Consultant Executive : Bangla Dynasty Global Consultancy Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bangla Dynasty Global Consultancy Limited Visa Consultant Executive Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 2 Age: 25 to 40 years Location: Dhaka (Vatara) Salary: Negotiable Experience: At least 1 year Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 1 year The applicants should have experience in the following business area(s): Immigration/Visa Processing Additional Requirements Age 25 to 40 years Responsibilities & Context Provide consultation to students regarding study options and visa procedures Prepare and verify necessary documents Assist students with university/college applications Maintain regular follow-up and communication with clients Skills & Expertise Suggested by Air Ticketing and Visa processing. Student Visa Processing Visa Processing Workplace Work at office Employment Status Full Time Job Location Dhaka (Vatara) Company Information Bangla Dynasty Global Consultancy Limited Follow Address: Ka-228, Mokbul Plaza, 5th Floor, Kuril, Progati Sharani, Vatara , Dhaka, Bangladesh Website: https://bdglobal.ltd Business: We are doing study and work permit visa processing Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joy"
  },
  {
    "url": "https://bdjobs.com/h/details/1460021?ln=1",
    "company_name": "Explorer Tech ltd",
    "job_title": "Personal Secretary (PS)",
    "location": "Dhaka (Uttara)",
    "salary": "Tk. 15000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Personal Secretary (PS) : Explorer Tech ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Explorer Tech ltd Personal Secretary (PS) Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 2 Age: 25 to 35 years Location: Dhaka (Uttara) Salary: Tk. 15000 - 30000 (Monthly) Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context Manage Schedule & Appointments Arrange meetings, reminders, and travel plans. Example: Booking meetings for the CEO and sending calendar invites. Handle Communication Answer calls, emails, and messages on behalf of the boss. Example: Replying to client emails professionally. Prepare Documents & Reports Write letters, reports, presentations, and meeting notes. Example: Preparing a monthly performance report. Maintain Confidentiality Keep personal and business information private. Example: Not sharing company financial details. Travel & Event Arrangements Book flights, hotels, transport, and plan events. Example: Booking tickets for a business trip to Dhaka. Office Coordination Communicate with departments and ensure smooth work. Example: Coordinating with HR and accounts for documents. File & Record Management Keep important files organized and updated. Example: Maintaining digital and physical records. Meeting Preparation Prepare agenda, notes, and follow-up tasks. Example: Sending meeting minutes after discussion. Support Decision Making Provide data and information when needed. Example: Collecting market data before a business decision. Personal Assistance Tasks Handle small personal errands if required. Example: Arranging doctor appointments or gifts. Skills & Expertise Suggested by Office Administration Personal Secretary Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Uttara) Company Information Explorer Tech ltd Follow Address: House- 7, Block- A,Road-2, sector 5,dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six"
  },
  {
    "url": "https://bdjobs.com/h/details/1460159?ln=1",
    "company_name": "Rigglo Technologies",
    "job_title": "Flyer Designer/ AI Videos/ Canva/ Photoshop Designer",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Flyer Designer/ AI Videos/ Canva/ Photoshop Designer : Rigglo Technologies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rigglo Technologies Flyer Designer/ AI Videos/ Canva/ Photoshop Designer Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 18 to 40 years Location: Dhaka Salary: Tk. 12000 - 15000 (Monthly) Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 40 years Responsibilities & Context Graphic Design & Content Creation Design engaging and on-brand digital assets, including social media banners, flyers, ads, and infographics for platforms like Instagram, Facebook, LinkedIn, and TikTok . Edit and repurpose existing images and videos to create fresh content for various campaign needs . Translate complex ideas or data into clear, visually appealing infographics and illustrations that enhance audience understanding . Ensure all designs are optimized for specific platform requirements (dimensions, file size, mobile viewing) and maintain brand consistency . AI Video Generation & Multimedia Production Utilize generative AI video platforms (RunwayML, Pika Labs, CapCut AI, Veo) to create short-form video content for social media, such as Reels, Shorts, and promotional ads . Integrate AI-generated footage into traditional video editing workflows using software like Adobe Premiere Pro and After Effects for final polish, compositing, and motion graphics . Enhance audio quality and synchronize voiceovers using AI audio tools (e.g., Adobe Podcast AI) . Capture and edit video content from various sources, including mobile devices, to support quick-turnaround social media stories and campaigns . Skills & Expertise Adobe Photoshop Content Creation Content Marketing Content writing Photo and video editing software Photo Editing Photo Retouching Video content creating Video Editing Compensation & Other Benefits Performance bonus Salary Review: Yearly Monday to Friday (2PM to 7PM) Workplace Work from home,Work at office Employment Status Part Time Job Location Dhaka Company Information Rigglo Technologies Follow Address: Lion Shopping Complex, Monipuri Para, Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor cer"
  },
  {
    "url": "https://bdjobs.com/h/details/1460733?ln=1",
    "company_name": "Quadbit Technologies",
    "job_title": "Full Stack PHP Developer",
    "location": "Dhaka (Basundhara RA)",
    "salary": "",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Full Stack PHP Developer : Quadbit Technologies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Quadbit Technologies Full Stack PHP Developer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 18 to 25 years Location: Dhaka (Basundhara RA) Experience: At least 1 year Published: 18 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience At least 1 year Freshers are also encouraged to apply. Additional Requirements Age 18 to 25 years শুধুমাত্র PHP ডেভেলোপার আবেদন করবেন, অবশ্যই Raw PHP, Mysql সম্পর্কে ভালো নলেজ থাকতে হবে। Responsibilities & Context অফিসিয়াল সকল PHP রিলেটেড টাস্ক করতে হবে। Skills & Expertise JavaScript MySQL MySQL database PHP Suggested by Full Stack Development HTML MySQL Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Basundhara RA) Company Information Quadbit Technologies Follow More jobs from this company Address: New Apollo Hospital Road,Bashundhara,Vatara,dhaka-1229 Website: https://quadbittech.com/ Business: QuadBit Technologies, established in 2020, is a global software development company that specializes in building innovative business software solutions. With a strong presence in the US and UK markets, QuadBit helps enterprises streamline operations, enhance customer experiences, and achieve digital transformation. Their expertise spans custom software development, web solutions, and enterprise applications, delivering reliable and scalable products that empower businesses to grow in the digital age. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Regi"
  },
  {
    "url": "https://bdjobs.com/h/details/1460923?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "Front Desk Executive",
    "location": "Dhaka (Mirpur 6)",
    "salary": "Tk. 12000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Front Desk Executive : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD Front Desk Executive Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 18 to 32 years Location: Dhaka (Mirpur 6) Salary: Tk. 12000 - 15000 (Monthly) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 32 years সুন্দর ভাবে কথা বলা ও প্রয়োজনীয় তথ্য আদানপ্রদান করা এবং কম্পিউটার চালানোই ভালো দক্ষ হতে হবে । অবশ্যই নম্র ভদ্র সুশ্রী এবং স্মার্ট হতে হবে । Responsibilities & Context Skills & Expertise Call Center Suggested by Receptionist/ Front Desk Customer Service Good behaviour Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Mirpur 6) Company Information Agro Farm BD Follow Address: Kathalbaria, Lakshmipur Hat, Natore Sadar, Natore Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Term"
  },
  {
    "url": "https://bdjobs.com/h/details/1461087?ln=1",
    "company_name": "Exord Online",
    "job_title": "Marketing Officer /Manager",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Marketing Officer /Manager : Exord Online Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Exord Online Marketing Officer /Manager Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 20 to 35 years Location: Dhaka Salary: Tk. 14000 - 28000 (Monthly) Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Excellent interpersonal, communication and convincing skill. The applicants should have experience in the following business area(s): ISP, Telecommunication, and Network Solution Providers or related technical fields. Must be Enthusiastic, Pro-active, Punctual, Honest and Hard-working. Responsibilities & Context Generate and qualify leads through multiple channels. Conduct client meetings, presentations, and solution demonstrations. Build and maintain strong client relationships. Analyze market trends, competitors, and pricing strategies. Understand client requirements and propose suitable ISP solutions. Analyze market trends, competitors, and pricing strategies. Skills & Expertise Communication Computer Literacy ISP ISP related work Market Research Negociation Office Management Sales & Marketing Telecommunication Compensation & Other Benefits Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Performance based salary revision. Daily refreshment facility and snacks benefits. Employee Welfare Fund. Workplace Work at office Employment Status Full Time Job Location Dhaka Apply Procedure Email Your CV Send your CV to the given email career@exordonline.com Company Information Exord Online Follow Address: House: 18, Road: 05, Block: C, Banasree, Rampura, Dhaka 1219. Website: https://www.exordonline.com Business: Internet Service Provider Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now"
  },
  {
    "url": "https://bdjobs.com/h/details/1461095?ln=1",
    "company_name": "Exord Online",
    "job_title": "Customer Support Officer /Manager",
    "location": "Dhaka, Dhaka (Badda, Rampura)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Customer Support Officer /Manager : Exord Online Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Exord Online Customer Support Officer /Manager Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 22 to 35 years Location: Dhaka, Dhaka (Badda, Ramp... Dhaka, Dhaka (Badda, Rampura) Salary: Tk. 16000 - 30000 (Monthly) Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 35 years Responsibilities & Context Handle inbound and outbound customer calls Provide technical support to Customers Escalate complex technical problems to proper department Follow up with customers on issue resolution Maintain customer records and documentation Explain package features, updates, and service plans Coordinate with Other Departments Skills & Expertise Communication Computer Literacy Internet browsing & online work ability. Customer Service Technical Skills Network Engineering Public dealing Compensation & Other Benefits Mobile bill Salary Review: Yearly Festival Bonus: 2 Internet Connectivity Mobile SIM with Recharge Performance bonus Performance based salary revision Daily refreshment facility and snacks benefits Employee Welfare Fund Workplace Work at office Employment Status Full Time Job Location Dhaka, Dhaka (Badda, Rampura) Apply Procedure Email Your CV Send your CV to the given email career@exordonline.com Company Information Exord Online Follow Address: House: 18, Road: 05, Block: C, Banasree, Rampura, Dhaka 1219. Website: https://www.exordonline.com Business: Internet Service Provider Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 B"
  },
  {
    "url": "https://bdjobs.com/h/details/1461011?ln=1",
    "company_name": "Ocean Trade International.",
    "job_title": "Accounts Officer",
    "location": "Dhaka (Uttara)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Accounts Officer : Ocean Trade International. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ocean Trade International. Accounts Officer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 28 to 35 years Location: Dhaka (Uttara) Salary: Negotiable Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 28 to 35 years Responsibilities & Context Record daily financial transactions Prepare reports (monthly/yearly) Handle cash, bank, and payments Make invoices and check bills Maintain accounts payable & receivable Prepare VAT/Tax documents Keep financial records organized Support audit and management decisions Skills & Expertise Accounting Software Analytical Skill Calm Data Entry Microsoft Office Suggested by Accounting Data Entry Accounting Software Accounts and Finance Financial Analysis Financial Reporting VAT and Tax Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Uttara) Company Information Ocean Trade International. Follow Address: House -18, Road-6/A, Sector -5, Uttara, Dhaka-1230, Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BD"
  },
  {
    "url": "https://bdjobs.com/h/details/1461363?ln=1",
    "company_name": "TALERB ENTERPRISE",
    "job_title": "সেলসম্যান",
    "location": "Kurigram (Rajarhat)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "21 Mar 2026",
    "job_description": "সেলসম্যান : TALERB ENTERPRISE Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List TALERB ENTERPRISE সেলসম্যান Application Deadline : 21 Mar 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: At least 20 years Location: Kurigram (Rajarhat) Published: 19 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age At least 20 years সততা ও কঠোর পরিশ্রম করার মানসিকতা থাকতে হবে।​ ব্যবহার মার্জিত ও সুশৃঙ্খল হতে হবে।​ অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে (তবে নতুনরাও আবেদন করতে পারবেন)। ​নিজস্ব বাইসাইকেল বা মোটরসাইকেল থাকলে সুবিধা হবে। Responsibilities & Context কুড়িগ্রাম জেলার রাজারহাট বাজারের স্বনামধন্য ব্যবসা প্রতিষ্ঠান তালেব এন্টারপ্রাইজ -এ মাঠ পর্যায়ে কাজ করার জন্য ২ জন কর্মঠ ও চটপটে সেলসম্যান নিয়োগ দেওয়া হবে। ​ কাজের বিবরণ: ​ কাজের ধরণ: সরাসরি মাঠ পর্যায়ে (দোকানে দোকানে) বিভিন্ন মুদি সামগ্রী বিক্রয় ও অর্ডার সংগ্রহ করা। ​ কর্ম এলাকা: রাজারহাট ও এর আশেপাশের ইউনিয়নসমূহ। Skills & Expertise Sales Representative Salesman Compensation & Other Benefits মাসিক বেতন (আলোচনা সাপেক্ষে)। ​বিক্রয়ের ওপর আকর্ষণীয় কমিশন বা বোনাস (আলোচনা সাপেক্ষে)। Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Kurigram (Rajarhat) Read Before Apply আগ্রহী প্রার্থীদের কে মোবাইল নাম্বার উল্লেখপূর্বক জীবন বৃত্তান্ত(CV), ছবি, শিক্ষাগত যোগ্যতাও অভিজ্ঞতার সনদ এবং NID কার্ডের কপি সহ ইমেইল এর মাধ্যমে আবেদন করার জন্য আহবান করা যাচ্ছে। ইমেইল : talebenterprise345@gmail.com Apply Procedure Email Your CV Send your CV to the given email talebenterprise345@gmail.com or Email your CV from My Bdjobs account Company Information TALERB ENTERPRISE Follow Address: Rajarhat Bazar, Rajarhat, Kurigram Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT "
  },
  {
    "url": "https://bdjobs.com/h/details/1461355?ln=1",
    "company_name": "Patriot Group",
    "job_title": "Sr Manager / General Manager (Compliance,HR,Admin)",
    "location": "Gazipur (Tongi)",
    "salary": null,
    "experience": "10 to 20 years",
    "education": null,
    "deadline": "19 Mar 2026",
    "job_description": "Sr Manager / General Manager (Compliance,HR,Admin) : Patriot Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Patriot Group Sr Manager / General Manager (Compliance,HR,Admin) Application Deadline : 19 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 40 to 55 years Location: Gazipur (Tongi) Salary: Negotiable Experience: 10 to 20 years Published: 20 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Master of Business Administration (MBA) in HRM Master's PGD in Compliance Experience 10 to 20 years The applicants should have experience in the following business area(s): Buying House, Garments, Textile Additional Requirements Age 40 to 55 years Responsibilities & Context Ensure compliance with local labor laws, international standards, and buyer codes of conduct. • Lead and manage audits including SEDEX (4 Pillar), NIRAPON, HIGG FEM & FSLM, ISO 14001, GRS, GOTS, and Buyer CoC. • Maintain updated documentation and ensure readiness for external audits covering labor, safety, environmental, and ethical standards. • Oversee renewal and maintenance of legal permits (Trade, Fire, Factory, Environmental, Generator, Explosive licenses). • Conduct job safety analyses, risk assessments, and deliver compliance and safety training programs. • Supervise ZDHC and environmental compliance testing (water, wastewater, emissions, noise, lighting). • Manage chemical inventories and MSDS updates, ensuring strict chemical safety measures. • Lead sustainability initiatives related to energy, water, and waste management. • Coordinate compliance reporting through customer and government web portals. • Act as liaison with Fire & Civil Defense, Labor Office, Factory Inspectorate, and Environmental authorities. Skills & Expertise Skills & Expertise Compliance Management HR and Administration Compensation & Other Benefits Mobile bill Festival Bonus : 2 Competitive salary and benefits. Workplace Work at office Employment Status Full Time Job Location Gazipur (Tongi) Company Information Patriot Group Follow Address: Plot #B-35,B-50,BSCIC Industrial Estate,Tongi Gazipur Business: GARMENTS Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 90"
  },
  {
    "url": "https://bdjobs.com/h/details/1461763?ln=1",
    "company_name": "Pix Store",
    "job_title": "Customer Support Executive",
    "location": "Khulna (Khulna Sadar)",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "Customer Support Executive : Pix Store Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Pix Store Customer Support Executive Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 18 to 35 years Location: Khulna (Khulna Sadar) Salary: Tk. 10000 - 15000 (Monthly) Experience: 1 to 5 years Published: 21 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Higher Secondary Diploma Bachelor/Honors Experience 1 to 5 years The applicants should have experience in the following business area(s): E-commerce, E-commerce Startup, F-commerce Freshers are also encouraged to apply. Additional Requirements Age 18 to 35 years Responsibilities & Context 📍 অফিসের নাম: Pix Store 🕙 অফিস সময়: সকাল ১০টা – সন্ধ্যা ৭টা পদবী: কাস্টমার সাপোর্ট এক্সিকিউটিভ (মিনিমাম ১ বছরের অভিজ্ঞতা ) 🔹 দায়িত্বসমূহঃ গ্রাহকের ফোন, ফেসবুক, হোয়াটসঅ্যাপ ইত্যাদির প্রশ্নের উত্তর দেওয়া অর্ডার গ্রহণ ও প্রসেস করা গ্রাহকের সঙ্গে সুন্দর যোগাযোগ বজায় রাখা সফটয়্যার সম্পর্কে কাস্টমারদের সাপোর্ট দেওয়া অফিসের দৈনন্দিন কাজকর্মে সহায়তা করা 🔹 যোগ্যতাঃ ন্যূনতম এইচএসসি পাশ ১ বছরের বাস্তব অভিজ্ঞতা ( কাস্টমার সাপোর্ট ) বেসিক কম্পিউটার ও ইন্টারনেট সম্পর্কে ধারণা থাকতে হবে ভালো যোগাযোগ দক্ষতা (বাংলা এবং ইংরেজি হলে অগ্রাধিকার) সময়নিষ্ঠ, আন্তরিক এবং দায়িত্বশীল হতে হবে 🔹 সুবিধাসমূহঃ মাসিক বেতন ১০০০০- ১৪০০০ হাজার টাকা (আলোচনা সাপেক্ষে) সাপ্তাহিক ছুটি শুক্রবার বন্ধুত্বপূর্ণ কর্মপরিবেশ শিখে উন্নতি করার সুযোগ 📌 কর্মস্থল: বৈকালী , খুলনা 📩 আবেদন করতে চাইলে: আপনার সিভি সেন্ড করুন - pixstorebd@ gmail.com সিভি চেক করে অফিস থেকে যোগাযোগ করা হবে Skills & Expertise Customer Support Ecommerce Office Management Compensation & Other Benefits Mobile bill,Over time allowance,Performance bonus,Profit share Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Khulna (Khulna Sadar) Company Information Pix Store Follow Address: Pix House, 3rd Floor, Boikali, Boyra, Khalishpur, Khulna Website: https://pixstore.com.bd/ Business: Pix is a registered trademark gadget and gadget accessories brand in Bangladesh. We specialize in providing top-notch accessories for various gadgets, including Apple, Samsung, and Pixel smartphones, as well as smartwatches. Our product range includes Smartwatch, Mobile Charger, Neckband, Earphone, TWS, phone cases, screen protectors, straps, wireless charger, mini printer and more – all designed to ensure that your gadgets remain protected, stylish, and functional. At Pix, we take pride in offering only the highest quality products to our customers. All our products are made from premium materials and undergo rigorous quality checks before being made available for sale. Our team of experts is dedicated to providing you with the best products and services, ensuring that your gadgets remain safe and protected at all times. S"
  },
  {
    "url": "https://bdjobs.com/h/details/1461741?ln=1",
    "company_name": "Pro IT",
    "job_title": "Digital Marketing Executive",
    "location": "Dhaka (PanthaPath)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Digital Marketing Executive : Pro IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Pro IT Digital Marketing Executive Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: N/A Age: 22 to 35 years Location: Dhaka (PanthaPath) Salary: Tk. 35000 - 50000 (Monthly) Experience: 1 to 2 years Published: 21 Feb 2026 Application Insights View Requirements Education A Level Bachelor/Honors Experience 1 to 2 years The applicants should have experience in the following business area(s): IT Enabled Service Additional Requirements Age 22 to 35 years Experience: Minimum 1 year Candidate Requirements: Strong knowledge of social media marketing & boosting Experience with Facebook Ads, Google Ads, YouTube Ads Excellent communication & multitasking skills Basic Photoshop, Illustrator & Video Editing Familiarity with Meta Business Suite (preferred) Experience in ICT companies (preferred) Responsibilities & Context Prothoma Bangladesh is Hiring! – Mid-Level Digital Marketing Executive Location: 147 D, 1 Green Rd, Dhaka 1215 About the Role Are you passionate about digital marketing and eager to make an impact? Join our creative and fast-growing team at Prothoma Bangladesh, where your ideas and skills will shape our digital future! Strong knowledge of social media marketing & boosting Basic Photoshop, Illustrator & Video Editing Edit and produce professional video content for campaigns Manage and promote content across Facebook, Instagram, LinkedIn, Google, Email, etc. Plan, monitor, and optimize paid campaigns (Facebook Ads, TiikTok,YouTube) Use Meta Business Suite and analyze performance metrics Write SEO-friendly content and manage website updates Stay updated with the latest digital trends and tools Collaborate with cross-functional teams for consistent branding Handle multiple projects and meet deadlines efficiently Skills & Expertise Digital Marketing (Social Media Marketing) Suggested by Adobe Illustrator Adobe Photoshop Digital Marketing (Social Media Marketing) Facebook Ads Manager Online Marketing Social Media Management Video Editing Compensation & Other Benefits Tour allowance,Performance bonus Festival Bonus: 2 Salary: Tk 25,000 - 50,000 per month Workplace Work at office Employment Status Full Time Job Location Dhaka (PanthaPath) Company Information Pro IT Follow More jobs from this company Address: 147/H, Green Road, Dhaka Panthpath Dhaka-1215 Website: https://proit.digital/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না"
  }
]