[
  {
    "url": "https://bdjobs.com/h/details/1457117?ln=1",
    "company_name": "CERAGEM Nasirabad",
    "job_title": "Customer Care Executive",
    "location": "Chattogram (Chittagong Epz)",
    "salary": "Tk. 8000 - 12000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Customer Care Executive : CERAGEM Nasirabad Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List CERAGEM Nasirabad Customer Care Executive Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 18 to 35 years Location: Chattogram (Chittagong Ep... Chattogram (Chittagong Epz) Salary: Tk. 8000 - 12000 (Monthly) Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 35 years Responsibilities & Context Ensuring good health care for customers. Increasing health awareness among them. Informing them about the company's activities. Establishing good business relations with customers. Workplace Address: Ceragem Bandartila. S. Islam plaza (2nd floor), Beside of City Bank , Bandartila, Chattogram. Skills & Expertise Public Speaking Smart and Dynamic Suggested by Client Relationship Management Customer Service Workplace Work at office Employment Status Full Time Job Location Chattogram (Chittagong Epz) Company Information CERAGEM Nasirabad Follow Address: 1/c, Baby super market, Bayezid Bostami Road, Nasirabad, Chattogram. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1456193?ln=1",
    "company_name": "REVELMAN",
    "job_title": "Telesales Executive (Office-Based)",
    "location": "Dhaka (Mirpur 10)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Telesales Executive (Office-Based) : REVELMAN Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List REVELMAN Telesales Executive (Office-Based) Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Age: 18 to 40 years Location: Dhaka (Mirpur 10) Salary: Tk. 12000 - 14000 (Monthly) Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 40 years Responsibilities & Context Job Context Revelman BD একটি দ্রুত বর্ধনশীল Men’s Grooming Brand । আমরা অনলাইন ভিত্তিক সেলসের মাধ্যমে প্রতিদিন শত শত কাস্টমারের সাথে যোগাযোগ করি। এই পজিশনে কাজ করার মাধ্যমে আপনি সরাসরি কাস্টমার কমিউনিকেশন, সেলস কনভার্সন এবং ব্র্যান্ড গ্রোথে গুরুত্বপূর্ণ ভূমিকা পালন করবেন। যারা target-driven , income-focused এবং নিজের স্কিল দিয়ে বেশি আয় করতে চান—তাদের জন্য এটি একটি দুর্দান্ত সুযোগ। Job Responsibilities নতুন ও বিদ্যমান কাস্টমারদের সাথে ফোন কলের মাধ্যমে যোগাযোগ করা কাস্টমারের প্রয়োজন বুঝে Revelman-এর প্রোডাক্ট সঠিকভাবে প্রেজেন্ট করা Outbound কল হ্যান্ডেল করা অর্ডার কনফার্মেশন ও কাস্টমার ফলো-আপ করা Daily / Weekly sales target অর্জন করা WhatsApp ও Call এর মাধ্যমে কাস্টমার কনভার্সন বাড়ানো কাস্টমার প্রশ্ন, আপত্তি (objection) ও সমস্যা দক্ষতার সাথে হ্যান্ডেল করা Sales report ও কাজের আপডেট টিম লিডারকে প্রদান করা কোম্পানির sales guideline ও call script অনুসরণ করা Compensation & Other Benefits Over time allowance Salary Review: Half Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Salary & Benefits The selected candidates will be offered a competitive remuneration package along with the following benefits: Basic Salary: BDT 12,000 – 15,000 (based on skills, experience, and performance) Performance-Based Bonus: Attractive incentives based on individual performance and sales achievement Target Incentive: Additional incentives upon achieving assigned sales targets Weekly Holiday: One day off per week as per company policy Overtime / Holiday Allowance: Extra compensation for working on weekly holidays, when applicable Timely Salary Disbursement: Salary will be paid on time every month Career Growth Opportunity: Scope for professional and personal development through skill enhancement and performance evaluation Promotion & Increment: Opportunity for promotion and salary increment based on consistent performance Work Environment: Friendly, supportive, and professional working environment Brand Experience: Opportunity to work with a fast-growing and emerging men’s grooming brand in Bangladesh. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur 10) Company Information REVELMAN Follow Address: House-17, Road - 10, Block-B, Mirpur-10, Dhaka Website: https://www.revelmanbd.com/home/ Business: About REVELMAN\nREVELMAN is a growing men"
  }
]