[
  {
    "url": "https://bdjobs.com/h/details/1457300?ln=1",
    "company_name": "TBN BD Ltd.",
    "job_title": "Data Entry operator",
    "location": "Dhaka",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "10 Feb 2026",
    "job_description": "Data Entry operator : TBN BD Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List TBN BD Ltd. Data Entry operator Application Deadline : 10 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 20 Age: 18 to 35 years Location: Dhaka Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Age 18 to 35 years Responsibilities & Context This is to inform all concerned that for Election purposes , applications are invited for the post of Data Entry Operator on a temporary basis. Details are as follows: Duration: 2 (Two) Days Nature of Work: Data Entry (Election purpose) Remuneration: BDT 1,000/- per person per day Food: Provided Skills & Expertise COMPUTER OFFICE MANAGEMENT Data Entry (Both English & Bengali) Workplace Work at office Employment Status Contractual Job Location Dhaka Company Information TBN BD Ltd. Follow More jobs from this company Address: House 43/2 6th Fl Ring Road Shyamoli Mohammadpur Dhaka 1207. Business: TBN24 is a Bangla language live television channel in North America provides content that is informative, educational, socially responsible, entertaining and comparable with world-class television broadcasters. TBN24 is the first Bangla 24x7 live television channel to produce original content here in the USA. This channel is currently available in US, Canada, Europe, Australia, and Middle-East. TBN24 Television is the for non-resident Bangladeshi living across the globe as well as people whose mother tongue is Bangla. Television has become a window on the world and many of us do seem to decide what the world is like because of what is on the television screen. TBN24 television is a window to Bangladesh for Bangladeshis living in North America. TBN24 focuses on positive Bangladesh by reporting on inclusive progress of Bangladesh governments` economic, social and environmental aspects to meet the challenges of the future and to help build a better Bangladesh for all. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals "
  }
]