[
  {
    "url": "https://bdjobs.com/h/details/1454959?ln=1",
    "company_name": "Starlink Engineering Ltd.",
    "job_title": "Diploma Engineer (Tower Technician)",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Diploma Engineer (Tower Technician) : Starlink Engineering Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Starlink Engineering Ltd. Diploma Engineer (Tower Technician) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 50 Age: 18 to 30 years Location: Anywhere in Bangladesh Salary: Tk. 16000 - 20000 (Monthly) Published: 29 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 30 years Installation and Maintenance, Network Engineering Teamwork and collaboration Technical Support Responsibilities & Context Troubleshooting about BTS & MW of ZTE, Huawei & Ericsson Equipment. To installation and commissioning the telecom equipment (2G, 3G,4G,5G & LTE) Routing ,FE,E1 Migration To establish the telecom network and fault management & network survey. Site Survey report making. Skills & Expertise Suggested by Electrical and Electronic Engineering Electrical Installation and Maintenance Electrical/ Electronics Compensation & Other Benefits There will be allowance in the salary. Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Starlink Engineering Ltd. Follow Address: Azhar Comfort Complex (Level-12),130/A Progoti Sarani, Middle Badda Gulshan-1, Dhaka-1212 Business: Starlink Engineering Ltd. is an Engineering servicing company providing full scope of engineering services like initial Site  Survey,  Planning,  Installation,  Commissioning,  Operation  and  Maintenance as  well  as  network optimization in the field of Telecommunication and Information Technology. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm"
  },
  {
    "url": "https://bdjobs.com/h/details/1456889?ln=1",
    "company_name": "Al Falaq Tour & Travels",
    "job_title": "Tour & Visa Processing Officer",
    "location": "Dhaka (Mirpur 1)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "Tour & Visa Processing Officer : Al Falaq Tour & Travels Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Al Falaq Tour & Travels Tour & Visa Processing Officer Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 25 to 40 years Location: Dhaka (Mirpur 1) Salary: Negotiable Published: 04 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 40 years Responsibilities & Context Tour Planning & Travel Operations Consult clients to understand travel purpose, budget, travel dates, destinations, and service needs. Prepare day-by-day itineraries, tour plans, and travel schedules (transport, sightseeing, free time, rest time). Prepare tour quotations and cost breakdowns (hotel, transfers, activities) and revise based on client feedback. Coordinate reservations and bookings (flights, hotels, transport, attractions) as assigned by management. Provide travel briefing and final document handover (itinerary, bookings, insurance, guidelines) before departure. Tourist Visa Processing Prepare tourist visa document checklists and guide clients on required supporting documents. Complete application forms accurately and draft supporting documents (cover letter, itinerary, explanation letters). Verify client documents for correctness and consistency (names, passport details, dates, funds, employment). Book visa appointments (embassy/VFS/visa center) and guide clients for biometrics and photo requirements. Submit visa applications via online portals or visa centers and maintain complete case files and submission records. Track application status, communicate updates to clients, and respond to additional document requests on time. Ensure ethical compliance: no false documents, no misleading information, and strict confidentiality of client data. Work Permit / Employment Visa Processing Support work permit / employment visa processing as per destination requirements and company procedure. Collect and prepare employer and candidate documentation (job contract, demand papers, sponsorship letters, etc.). Coordinate medical, police clearance, training, and other mandatory steps depending on destination and category. Maintain processing timelines for each candidate and ensure readiness for submission and deployment stages. New Labour Recruitment & Coordination Source new candidates through local networks, referrals, and online channels as per manpower demand. Conduct preliminary screening and basic interviews; verify eligibility (passport, experience, skills, readiness). Prepare candidate profiles/CVs and submit to foreign employers/partners for shortlisting and selection. Coordinate trade tests/interviews and ensure candidates receive timely instructions and schedules. Maintain a structured candidate database and recruitment pipel"
  },
  {
    "url": "https://bdjobs.com/h/details/1453426?ln=1",
    "company_name": "The White Horse Pharmaceuticals Ltd.",
    "job_title": "Executive, PMD",
    "location": "Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Executive, PMD : The White Horse Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The White Horse Pharmaceuticals Ltd. Executive, PMD Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 22 to 40 years Location: Dhaka (Motijheel) Salary: Tk. 15000 - 20000 (Monthly) Published: 25 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 40 years Responsibilities & Context To Deal all PMD related works. To visit qualified specialist doctors (If required) to communicate the scientific messages of our products. Maintaining good liaison between company and doctors with best professional rapport. Good coordination, collaboration and networking ability with different organization, Institution and doctors community. Clinically sound and competent, conceptually sound in planning, designing, implementing, analyzing, monitoring and reporting on the public health field. Have patience and empathy in dealing with PMD. To operate and represent the total selling activities of the company in a very specialized territory and create consistent demand of our products. Skills & Expertise Suggested by clinical research center relationship building Pharmaceuticals Compensation & Other Benefits Mobile bill,Provident fund Festival Bonus: 2 Salary Review: Yearly Lunch Facilities: Full Subsidize As per company policy . Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Motijheel) Read Before Apply Please bring a copy of Updated CV with recent passport size photography when come for interview. Company Information The White Horse Pharmaceuticals Ltd. Follow More jobs from this company Address: 68, Dilkusha C/A (6th Floor), Dhaka-1000 Website: www.whitehorsepharma.com Business: The White Horse Pharmaceuticals Ltd. A Swiss Born Company started its journey since 1991 in Switzerland and activated in Bangladesh in 1996. Every smile is important. That`s why we work to protect you and your smile. We are a company which is working to ensure your happiness and safety. Our-state-of-the-art world class plant with modern facilities on a 4.5 acres land in Sreepur, Gazipur which complies with cGMP-WHO requirements is the perfect exposition of a proficient pharmaceuticals company. Presently, we are exporting to many countries and playing an important role in the global arena as well as domestic market, for the improvement of people`s health to see a face of full smile. As an integral part of this journey The White Horse Pharmaceuticals Ltd. is seeking dynamic, responsible & innovative individual. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক ("
  },
  {
    "url": "https://bdjobs.com/h/details/1455689?ln=1",
    "company_name": "A reputed 100% Export Oriented Knit Composite Industry",
    "job_title": "Merchandiser",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Merchandiser : A reputed 100% Export Oriented Knit Composite Industry Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A reputed 100% Export Oriented Knit Composite Industry Merchandiser Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Location: Narayanganj Salary: Negotiable Published: 03 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have 5-7 years’ experience in Lingerie Merchandising area- Strong knowledge about garment costing, sampling, and production follow-up for Lingerie product- The applicants should have good knowledge about commercial terms for import and export. Understand garment construction and material details in Lingerie product. Excellent communication and coordination skills. Responsibilities & Context Job Location - Narayangonj (Near Dhaka City, Chittagong road, sign board area) Manage the full order lifecycle—from development to shipment—ensuring alignment with buyer requirements- Prepare accurate product costing based on fabric, trims, wash processes, and labor to offer competitive quotes. Manage sample development (proto, fit, size set, PP, and shipment samples) by coordinating with production and quality teams, Communicate with suppliers for sourcing require raw material, and follow up to ensure timely sample and material delivery. Maintain accurate records of buyer instructions, order details, approvals, and shipment timelines. Collaborate with the QA/QC team to address and resolve any quality issues during production. Act as the main point of contact for buyers, providing regular updates and handling inquiries or concerns Prepare and present regular reports on order status and its challenges to senior. Skills & Expertise Suggested by Merchandising Order Management Compensation & Other Benefits As per company policy. Workplace Work at office Employment Status Full Time Job Location Narayanganj Company Information A reputed 100% Export Oriented Knit Composite Industry Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employ"
  },
  {
    "url": "https://bdjobs.com/h/details/1454869?ln=1",
    "company_name": "Greystar Limited",
    "job_title": "Personal Secretary (Female)",
    "location": "Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Personal Secretary (Female) : Greystar Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Greystar Limited Personal Secretary (Female) Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 30 years Location: Dhaka (Motijheel) Salary: Tk. 12000 - 15000 (Monthly) Published: 28 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age At least 30 years Basic computer knowledge Interest in providing official and personal assistance to the Managing Director Ability to politely and professionally receive and entertain guests visiting the MD Willingness to assist in serving tea, biscuits, or snacks when required Smart appearance, good manners, cleanliness, and strong sense of responsibility Ability to strictly follow all instructions and official decisions of the Managing Director Professional attitude and ability to maintain confidentiality Willingness to work outside the office when required Responsibilities & Context We are seeking to appoint a Female Personal Secretary for the Managing Director (MD) of our organization. Interested, well-mannered, responsible, confident, and self-motivated candidates are encouraged to apply. Office Hours 11:00 AM to 8:00 PM Office Location Motijheel, Dhaka Job Responsibilities Assisting the Managing Director (MD) in daily official and personal activities Receiving and properly entertaining guests visiting the MD Handling phone calls, basic official communication, and assisting with notes/documents Accompanying the Managing Director on visits and official travel inside and outside Dhaka Performing administrative and support tasks as required Following all instructions, guidelines, and official decisions of the Managing Director Assisting with office coordination in the absence of the MD when required Skills & Expertise Suggested by Computer Literacy Good Ms office and Emailing skill Meeting Management Office Management Personal Assistance Personal Secretary Compensation & Other Benefits Salary & Benefits Trainee salary 12,000 thousand (Salary increment based on performance, efficiency, and responsibility handling) Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Motijheel) Company Information Greystar Limited Follow More jobs from this company Address: Jibon Bima bhabon (4th), 80 Motijheel C/A, Dhaka 1000 Website: greystarbd.com Business: It is a real estate company. Housing is one of the basic human rights. I started the journey of our organization with the vow of building affordable housing for all in Dhaka. We build and sell flats in prime locations of Dhaka under joint ownership. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান"
  },
  {
    "url": "https://bdjobs.com/h/details/1457684?ln=1",
    "company_name": "The White Horse Pharmaceuticals Ltd.",
    "job_title": "Front Desk Executive",
    "location": "Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Front Desk Executive : The White Horse Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The White Horse Pharmaceuticals Ltd. Front Desk Executive Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 24 to 27 years Location: Dhaka (Motijheel) Salary: Negotiable Published: 07 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 24 to 27 years Responsibilities & Context Maintaining Front Desk. Call Receiving & Register Management. Skills & Expertise Suggested by Front Desk Register Maintenance Reception Compensation & Other Benefits Provident fund,Mobile bill Lunch Facilities: Full Subsidize Festival Bonus: 2 Salary Review: Yearly The successful candidates will get oriented remuneration package and excellent working environment for rapid career growth. Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Motijheel) Read Before Apply Please bring a updated copy of CV with recent passport size photography when come for interview Company Information The White Horse Pharmaceuticals Ltd. Follow More jobs from this company Address: 68, Dilkusha C/A (6th Floor), Dhaka-1000 Website: www.whitehorsepharma.com Business: The White Horse Pharmaceuticals Ltd. A Swiss Born Company started its journey since 1991 in Switzerland and activated in Bangladesh in 1996. Every smile is important. That`s why we work to protect you and your smile. We are a company which is working to ensure your happiness and safety. Our-state-of-the-art world class plant with modern facilities on a 4.5 acres land in Sreepur, Gazipur which complies with cGMP-WHO requirements is the perfect exposition of a proficient pharmaceuticals company. Presently, we are exporting to many countries and playing an important role in the global arena as well as domestic market, for the improvement of people`s health to see a face of full smile. As an integral part of this journey The White Horse Pharmaceuticals Ltd. is seeking dynamic, responsible & innovative individual. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্"
  },
  {
    "url": "https://bdjobs.com/h/details/1457834?ln=1",
    "company_name": "Epal IT Solutions",
    "job_title": "Flutter App Developer",
    "location": "Dhaka (Malibag Chowdhuripara)",
    "salary": "Tk. 30000 - 40000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Flutter App Developer : Epal IT Solutions Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Epal IT Solutions Flutter App Developer Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 25 to 35 years Location: Dhaka (Malibag Chowdhurip... Dhaka (Malibag Chowdhuripara) Salary: Tk. 30000 - 40000 (Monthly) Published: 08 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context Develop, maintain, and optimize high-quality mobile applications using Flutter. Integrate REST APIs and ensure smooth application performance. Collaborate with UI/UX designers and backend developers. Implement clean architecture and scalable code structure. Debug, test, and fix application issues efficiently. Publish and maintain applications on Google Play Store and Apple App Store. Participate in team discussions, planning, and progress reporting. Skills & Expertise Apple App store Laravel Framework RESTful API Flutter Flutter and Kotlin programming languages Flutter UI Git and Github Google Play store Kotlin Suggested by Flutter Flutter UI RESTful API Flutter and Kotlin programming languages Workplace Work at office Employment Status Full Time Job Location Dhaka (Malibag Chowdhuripara) Company Information Epal IT Solutions Follow Address: Feroza Tower, Level-9, 91/B, DIT Road, Malibagh, Chowdhurypara, Dahka-1219, Dhaka, Bangladesh. Business: Epal IT Solutions is a dynamic and innovative technology firm based in Dhaka, Bangladesh, specializing in comprehensive digital solutions. From digital marketing and web development to IT consultancy and software services, we empower businesses to thrive in the digital era. With a dedicated team of experts, we deliver tailored, results-driven strategies and cutting-edge technology to help clients achieve their goals. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid"
  },
  {
    "url": "https://bdjobs.com/h/details/1458712?ln=1",
    "company_name": "G A Foundation",
    "job_title": "Sales & Marketing Executive (Real Estate)",
    "location": "Dhaka (Mirpur)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Sales & Marketing Executive (Real Estate) : G A Foundation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List G A Foundation Sales & Marketing Executive (Real Estate) Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 25 to 35 years Location: Dhaka (Mirpur) Salary: Negotiable Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context We are looking for a reliable, dynamic, outstanding and organized Executive-Sales & Marketing person to join our organization. If you are looking for a role where you can continue to make an impression, then take the next step at G.A. Foundation Limited where your contribution will always be valued so this position is yours. Calling the customer information about the product. Ability to work in a team member or lead a team. Bring the customer to the office positively. Must have the mindset to convince the customer. Respond to incoming calls, providing courteous and efficient assistance. Identify and contact potential customers for new business opportunities. Creating customers and convincing them to buy products (real estate). Communicate with customers and manage customer relationships. Skills & Expertise flat sales Real Estate Marketing Sales & Marketing Suggested by Sales & Marketing Real Estate Marketing Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur) Company Information G A Foundation Follow Address: Road-1, House-5, Main Road Pallabi, Dhaka-1216. Website: gafoundationltd.com Business: G.A Foundation is a developers company which is well knowned by their devoted work since 2011. We`ve already handover our Many projects to this day. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT S"
  },
  {
    "url": "https://bdjobs.com/h/details/1458504?ln=1",
    "company_name": "Knowledge Share",
    "job_title": "English Language Trainer / IELTS Instructor",
    "location": "Dhaka (Baridhara J Block)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "English Language Trainer / IELTS Instructor : Knowledge Share Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Knowledge Share English Language Trainer / IELTS Instructor Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Dhaka (Baridhara J Block) Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements IELTS band score of 7.0 or above Prior teaching experience will be given preference Candidates who are confident in teaching are strongly encouraged to apply Responsibilities & Context Delivering classes as per the structured course plan Developing engaging and effective teaching materials Assessing and evaluating student progress through regular tests and assignments Maintaining student records and managing administrative tasks related to the course Assisting students in improving their reading, writing, speaking, and listening skills Providing feedback and guidance to students on areas of improvement Collaborating with the academic team to ensure the course is delivered effectively Adhering to institutional policies and ensuring a high standard of teaching Skills & Expertise Teaching/ Training Suggested by Lesson Planning FLUENCY IN ENGLISH LANGUAGE IELTS Instructor Employment Status Part Time Job Location Dhaka (Baridhara J Block) Company Information Knowledge Share Follow Address: Ga-7/4, Shajadpur, Dhaka-1212 Website: knowledgeshareltd.com Business: Knowledgeshare is a one stop Education Platform who provides all kinds of Educational fcilities including technology to the institutions Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to "
  },
  {
    "url": "https://bdjobs.com/h/details/1456515?ln=1",
    "company_name": "Sharif Properties Service",
    "job_title": "Personal Assistant",
    "location": "Dhaka (Gulshan)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Personal Assistant : Sharif Properties Service Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sharif Properties Service Personal Assistant Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 18 to 25 years Location: Dhaka (Gulshan) Salary: Tk. 15000 - 16000 (Monthly) Published: 03 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education SSC HSC Additional Requirements Age 18 to 25 years Good communication skill (Bangla; English is a plus) Must be able to use Smartphone, WhatsApp, Email Basic computer skill (Excel/Word) preferred Honest, punctual, and hardworking Responsibilities & Context We are looking for a smart, responsible and honest Female Personal Assistant to coordinate and manage day-to-day tasks related to rental property, Sale property,hotel operations and shoe business . Key Responsibilities Coordinate rental property tasks (tenant communication, rent follow-up, maintenance support) Hotel coordination (staff follow-up, supplier calls, booking support) Shoe business coordination (order tracking, customer/supplier communication) Manage phone calls, WhatsApp messages, and daily follow-up Keep records of expenses, payments, and task updates Reporting to owner daily Skills & Expertise Communication Suggested by Personal Secretary Personal Assistance Computer Literacy Compensation & Other Benefits T/A Festival Bonus: 2 Weekly Off: 1 day/week\nCasual Leave: 12 days/year\nPerformance-based increment possible\nMobile bill Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Gulshan) Company Information Sharif Properties Service Follow Address: Road-35,House-21B ,Gulshan -2,Dhaka-1212 &\r\nRoad-2/2,House-3,Block-L,Banani-1213 Website: https://sharif.com.bd/ Business: Property Management Company based on Dhaka Specially Gulshan,Bannai & Baridhara for Property Rent ,Office /Residence renting,Office maintenance, Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury "
  },
  {
    "url": "https://bdjobs.com/h/details/1459076?ln=1",
    "company_name": "META4 International",
    "job_title": "Assistant Manager / Senior Executive (Sales)",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Assistant Manager / Senior Executive (Sales) : META4 International Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List META4 International Assistant Manager / Senior Executive (Sales) Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 22 to 50 years Location: Dhaka (DOHS Mirpur) Salary: Negotiable Experience: 1 to 5 years Published: 14 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Masters Experience 1 to 5 years The applicants should have experience in the following business area(s): Developer, Direct Selling/Marketing Service Company, Real Estate Freshers are also encouraged to apply. Additional Requirements Age 22 to 50 years Responsibilities & Context Prepare and execute the Sales plan by discussing with higher management. Market survey / Market research with extensive field visits (if needed) & find out potential clients. Identify the product gap in the market and take initiative to fill up the gap. To look after customer quarries & counseling. Establish continuous product and market analysis & Daily, Monthly reporting on prescribed format. Sales data collection from market with all product and their alternatives, and disseminate information in weekly and monthly basis. Skills & Expertise Plot and Appartment sale Real Estate Real Estate Sales Suggested by Sales & Marketing Sales Target Achievement Strategic Planning Compensation & Other Benefits Performance bonus Lunch Facilities: Full Subsidize Salary Review: Yearly Workplace Work at office Employment Status Contractual Job Location Dhaka (DOHS Mirpur) Company Information META4 International Follow Address: House-684, Road-9, Avenue-6, Mirpur DOHS Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certi"
  },
  {
    "url": "https://bdjobs.com/h/details/1459431?ln=1",
    "company_name": "Rasu Jewellers",
    "job_title": "ই-কমার্স অপারেশন ম্যানেজার",
    "location": "Dhaka (Azimpur koborsthan, Iraqi math, Lalbagh)",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "ই-কমার্স অপারেশন ম্যানেজার : Rasu Jewellers Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rasu Jewellers ই-কমার্স অপারেশন ম্যানেজার Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: 20 to 30 years Location: Dhaka (Azimpur koborsthan... Dhaka (Azimpur koborsthan, Iraqi math, Lalbagh) Salary: Tk. 20000 - 25000 (Monthly) Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 30 years ই-কমার্স অপারেশন / অনলাইন সেলস ম্যানেজমেন্টে ন্যূনতম ২–৩ বছরের অভিজ্ঞতা Facebook Page, Website Order System ও Courier Management সম্পর্কে বাস্তব জ্ঞান Excel / Google Sheet-এ দক্ষতা শক্তিশালী কমিউনিকেশন ও সমস্যা সমাধান দক্ষতা সততা, নেতৃত্বগুণ ও চাপ সামলানোর সক্ষমতা Responsibilities & Context মূল দায়িত্বসমূহ (Key Responsibilities): ই-কমার্স প্ল্যাটফর্মের দৈনন্দিন অপারেশন পরিচালনা অনলাইন অর্ডার প্রসেসিং ও কাস্টমার কমিউনিকেশন তদারকি কুরিয়ার পার্টনারদের সাথে সমন্বয়, ডেলিভারি ও রিটার্ন ম্যানেজমেন্ট প্রোডাক্ট স্টক, ইনভেন্টরি ও সেলস ডাটা ম্যানেজমেন্ট দৈনিক, সাপ্তাহিক ও মাসিক রিপোর্ট প্রস্তুত ও উপস্থাপন অফিস স্টাফদের কাজের সমন্বয় ও মনিটরিং ব্যবসার কার্যক্রমে শৃঙ্খলা ও দক্ষতা নিশ্চিত করা Skills & Expertise COURIER SERVICE Facebook Business Manager Facebook marketing knowledge Google Sheets Microsoft Excel MS Excel Photo Editing Photography Web Browsing Suggested by E-Commerce products Production/ Operation Management Computer Literacy Workplace Work at office Employment Status Full Time Job Location Dhaka (Azimpur koborsthan, Iraqi math, Lalbagh) Company Information Rasu Jewellers Follow Address: New Polton Lane Azimpur Iraqi math, Lalbag Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Regist"
  },
  {
    "url": "https://bdjobs.com/h/details/1458584?ln=1",
    "company_name": "4th …D Development & Technology Ltd.",
    "job_title": "Design Engineer",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Design Engineer : 4th …D Development & Technology Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List 4th …D Development & Technology Ltd. Design Engineer Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (DOHS Mirpur) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experience in Steel & RCC design consulting organizations will be an added advantage. Steel knowledge is a must. Software Skills: STAAD.Pro / ETABS / SAP / Tekla. Independent designer for industrial shed & prefab steel buildings. Ability to work under pressure. Only male candidates are allowed to apply. Good communication skills in English. Positive attitude required. Responsibilities & Context Job Context 4th…D Development & Technology Ltd. is looking for competent and experienced Design Engineers for Steel & RCC Structure projects. Vacancy Several Job Responsibilities Capability to design Steel and RCC Structures (mainly). Preparation of project estimations. Project coordination and site supervision. Skills & Expertise Suggested by Engineering Estimating Project Management Compensation & Other Benefits Attractive salary package will be offered. As per company policy. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (DOHS Mirpur) Read Before Apply Apply directly, via courier, or email. Email: info@4thdbd.com Attach photograph with CV. Company Information 4th...D Development & Technology Ltd. House-226, Avenue-01, 1st Floor, Mirpur DOHS, Dhaka Web: www.4thdbd.com Apply Procedure Email Your CV Send your CV to the given email info@4thdbd.com or Email your CV from My Bdjobs account Company Information 4th …D Development & Technology Ltd. Follow Address: House No.226,(1st Floor), Road No.3, Avenue 1, Mirpur DOHS, Dhaka-1216. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Audit"
  },
  {
    "url": "https://bdjobs.com/h/details/1459372?ln=1",
    "company_name": "City Tech IT",
    "job_title": "Lecturer / Senior Lecturer - Mathematics",
    "location": "",
    "salary": null,
    "experience": "Lecturer: Fresh graduates are encouraged to apply.",
    "education": "MSc in Mathematics from a recognized university.",
    "deadline": "27 Feb 2026",
    "job_description": "Lecturer / Senior Lecturer - Mathematics : City Tech IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List City Tech IT Lecturer / Senior Lecturer - Mathematics Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (Uttara) Salary: Negotiable Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Experience Requirements Lecturer: Fresh graduates are encouraged to apply. Senior Lecturer: Minimum 2–5 years teaching experience preferred. Additional Requirements Strong communication skills in English and Bangla. Ability to teach Engineering Mathematics, Calculus, Algebra, Statistics, and Applied Mathematics. Proficiency in MS Office and online teaching platforms. Passion for teaching and student mentoring. Responsibilities & Context Organization: United College of Aviation Science and Management (UCASM) Position: Lecturer / Senior Lecturer – Mathematics Job Type: Full-time Workplace: Work at Office Job Location: Dhaka, Bangladesh Job Context United College of Aviation Science and Management (UCASM) invites applications from qualified and motivated candidates for the position of Mathematics Faculty. The selected candidate will teach Mathematics courses for students of the following departments: Job Responsibilities Conduct Mathematics lectures and tutorials for diploma and undergraduate students. Prepare lesson plans, course outlines, assignments, and examination questions. Evaluate student performance and provide academic guidance. Maintain academic records and ensure quality teaching standards. Participate in curriculum development and academic meetings. Support students in academic projects and institutional activities. Educational Requirements MSc in Mathematics from a recognized university. Strong academic background (minimum CGPA 3.50 or First Class preferred). Candidates with English medium or O/A Level teaching experience will receive preference. Skills & Expertise Suggested by Teaching/ Training Mathematics Teaching Compensation & Other Benefits Salary and Benefits\nAttractive salary (Negotiable).\nFestival bonus and annual increment.\nProfessional and supportive working environment.\nOpportunities for training and career development. Employment Status Full Time Job Location Dhaka (Uttara) Company Information City Tech IT Follow Address: 14 floor,Plot 34, Road 2, Sector 3, Uttara, Dhaka-1230, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক"
  },
  {
    "url": "https://bdjobs.com/h/details/1459848?ln=1",
    "company_name": "Banga Garments Ltd.",
    "job_title": "Commercial Executive (Export)",
    "location": "Dhaka (Mirpur 7)",
    "salary": "Tk. 25000 - 30000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Commercial Executive (Export) : Banga Garments Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Banga Garments Ltd. Commercial Executive (Export) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Age: 27 to 35 years Location: Dhaka (Mirpur 7) Salary: Tk. 25000 - 30000 (Monthly) Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 27 to 35 years Responsibilities & Context Handle all kinds of export-related commercial activities. Preparing Export Documents (Customs and Bank), Communication With C&F, Transport and Freight Forwarder. Collecting Bill of Lading and Submit bank Documents. Skills & Expertise Suggested by Commercial Operation Commercial/ Export-Import Freight Forwarding/ C&F Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur 7) Company Information Banga Garments Ltd. Follow Address: 29, Milk Vita Road, Section-7, Pallabi, Dhaka-1216. Website: https://bangagarmentsbd.com/ Business: Banga Garments Ltd is a 100% export oriented woven based readymade garments factory located in Mirpur, Dhaka, Bangladesh. Banga Garments is one of the oldest nominated vendor for H&M for the past 15 years. Our company established in 1985 is one the first garments manufacturing unit in Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certifi"
  },
  {
    "url": "https://bdjobs.com/h/details/1459086?ln=1",
    "company_name": "Syetech Solution",
    "job_title": "IT Executive - eCommerce",
    "location": "Dhaka (Mirpur 14)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "IT Executive - eCommerce : Syetech Solution Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Syetech Solution IT Executive - eCommerce Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 18 to 45 years Location: Dhaka (Mirpur 14) Salary: Tk. 12000 - 12000 (Monthly) Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 45 years Responsibilities & Context We are looking for a detail-oriented IT Executive to manage and monitor online inventory across multiple eCommerce platforms, including eBay, Amazon, and our website. This role involves updating stock levels and preventing inventory errors to support smooth daily operations. Responsibilities: Manage and update inventory on eBay, Amazon, and our website. Maintain accurate stock records. Monitor inventory to support smooth daily operations. Report any inventory issues to the team. Plus Points: Basic computer knowledge Good attention Being organized and reliable Ability to follow simple processes Skills & Expertise Online Marketing eCommerce Operation Inventory Management Compensation & Other Benefits Working Schedule: Working Hours: 9:00 AM – 7:00 PM Weekly Holiday: 1 day per week Workplace Work at office Employment Status Contractual Job Location Dhaka (Mirpur 14) Company Information Syetech Solution Follow Address: House 713, North Kafrul, Near Ibrahim Bazar Masjid or Adventist Mission School, Mirpur 14, Kafrul, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Profes"
  },
  {
    "url": "https://bdjobs.com/h/details/1460163?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "TSM / TSO",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "TSM / TSO : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD TSM / TSO Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 20 Age: 24 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 25000 (Monthly) Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 24 to 35 years Responsibilities & Context sells developed and marketing promotion Skills & Expertise Selling skills and strategies Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Agro Farm BD Follow More jobs from this company Address: Kathalbaria, Lakshmipur Hat, Natore Sadar, Natore Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video"
  },
  {
    "url": "https://bdjobs.com/h/details/1459770?ln=1",
    "company_name": "AIT RYZE Trailblazers",
    "job_title": "Sales & Marketing Officer",
    "location": "Dhaka (Dhanmondi, Kalabagan, Lalbagh, New Market)",
    "salary": "Tk. 15000 - 27000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Sales & Marketing Officer : AIT RYZE Trailblazers Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List AIT RYZE Trailblazers Sales & Marketing Officer Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Company Information Summary Vacancy: 30 Location: Dhaka (Dhanmondi, Kalabag... Dhaka (Dhanmondi, Kalabagan, Lalbagh, New Market) Salary: Tk. 15000 - 27000 (Monthly) Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Skills & Expertise Suggested by Sales & Marketing Workplace Work at office Employment Status Full Time Job Location Dhaka (Dhanmondi, Kalabagan, Lalbagh, New Market) Company Information AIT RYZE Trailblazers Follow Address: New Market,Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners St"
  },
  {
    "url": "https://bdjobs.com/h/details/1460130?ln=1",
    "company_name": "Sharif Flour & Food Industries",
    "job_title": "Factory Manager",
    "location": "Jhalakathi (Jhalokati Sadar)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Factory Manager : Sharif Flour & Food Industries Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sharif Flour & Food Industries Factory Manager Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 25 to 40 years Location: Jhalakathi (Jhalokati Sad... Jhalakathi (Jhalokati Sadar) Salary: Negotiable Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 40 years Responsibilities & Context প্রধান দায়িত্বসমূহ : দৈনিক উৎপাদন পরিকল্পনা তৈরি ও বাস্তবায়ন করা। কাঁচামাল (গম, ভূট্টা, সরিষা ইত্যাদি) সরবরাহ নিশ্চিত করা। উৎপাদন প্রক্রিয়া সঠিকভাবে চলছে কি না তা তদারকি করা। মেশিনের কার্যক্ষমতা পর্যবেক্ষণ করা ও সময়মতো রক্ষণাবেক্ষণের ব্যবস্থা নেওয়া। ময়দা, আটা, সুজি, ভূষি, ভূট্টার গুড়া, ভূট্টার 4K, সরিষার তৈল, খৈল ইত্যাদির মান পরীক্ষার ব্যবস্থা করা। প্যাকেজিং ও স্টোরেজে কোনো ধরনের দূষণ বা ক্ষতি না হয় তা নিশ্চিত করা। কর্মীদের দায়িত্ব বণ্টন ও শিফট নির্ধারণ করা। কর্মীদের প্রশিক্ষণ ও নিরাপত্তা বিষয়ক সচেতনতা বৃদ্ধি করা। কাজের শৃঙ্খলা বজায় রাখা ও সমস্যা সমাধান করা। উৎপাদন খরচ নিয়ন্ত্রণ করা। বিক্রয় ও সরবরাহের হিসাব তদারকি করা। কাঁচামাল (গম,ভূট্টা, সরিষা) মজুদ ও উৎপাদন ব্যবস্থাপনা দেখা। মিলে উৎপাদিত পণ্যের সঠিক রেকর্ড রাখা। বিক্রয় ও বাজারজাতকরণ টিমের সঙ্গে সমন্বয় করা। মিলের সামগ্রিক কার্যক্রম উন্নত করার পরিকল্পনা তৈরি করা। যোগাযোগ :- সকল প্রয়োজনীয় কাগজ পত্র সহ আগামী ২৫ ফেব্রুয়ারি ২০২৬ ইং তারিখ এর মধ্যে নিম্নলিখিত ঠিকানায় সরাসরি যোগাযোগ করুন অথবা জীবন বৃত্তান্ত ই-মেইল বা হোয়াটস্যাপ পাঠাতে পারেন। যোগাযোগের ঠিকানা :- ৯৮/১ আড়ৎদ্দারপট্টি রোড, ঝালকাঠি সদর, ঝালকাঠি। হেয়াটস্যাপ নম্বর 01312-405071, 01315-667071 ই-মেইল : sharifgroup.official1@ gmail.com Skills & Expertise Manager Workplace Work at office Employment Status Full Time Job Location Jhalakathi (Jhalokati Sadar) Company Information Sharif Flour & Food Industries Follow Address: 98/1, Arattdar Patti Road, Jhalokati Sadar, Jhalokati. Business: Sharif Flower and Food Industries is an industrial company that uses advanced quality machines to assist in the production of various types of food products. For example, wheat produces flour, flour, semolina, bran. Maize produces corn powder, corn four pieces. Mustard oil, khail etc. are made from mustard and these are sold wholesale and retail to various buyers. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com "
  }
]