[
  {
    "url": "https://bdjobs.com/h/details/1454793?ln=1",
    "company_name": "PalmPay Limited",
    "job_title": "Manager - FI Management & Co-Operation",
    "location": "Dhaka (GULSHAN 1)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Manager - FI Management & Co-Operation : PalmPay Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List PalmPay Limited Manager - FI Management & Co-Operation Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Dhaka (GULSHAN 1) Salary: Negotiable Published: 28 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Required Qualifications & Experience Experience 7–10 years of extensive hands-on experience working with MFIs in Bangladesh. Proven background in MFI operations, digital lending, credit programs, BNPL, or institutional partnership management. Strong working knowledge of MRA regulations, MFI lending methodologies, field operations, and recovery mechanisms. Skills & Competencies Strong understanding of microfinance operations and regulatory frameworks. Excellent stakeholder management and coordination skills. Strong analytical and problem-solving ability with execution focus. Ability to manage complex multi-party operational workflows. High integrity and compliance-driven mindset. Compensation & Benefits Competitive salary Festival bonuses and mobile/internet allowance Career growth opportunities in a fast-growing multinational fintech Opportunity to play a key role in scaling BNPL through MFI partnerships in Bangladesh Responsibilities & Context About PalmPay PalmPay is a leading neobank and fintech platform scaling financial inclusion across emerging markets. With over 40 million users, we are building a digital financial ecosystem that empowers individuals and businesses through accessible, easy-to-use, and rewarding financial services. Operating in Nigeria, Ghana, Tanzania, Bangladesh, Pakistan, and the Philippines, PalmPay has been recognised by CNBC as one of the Top 300 Global Fintech Companies and ranked #2 overall and #1 in financial services on the Financial Times’ Africa’s Fastest Growing Companies 2025 list. Position Overview PalmPay Bangladesh is seeking an experienced Manager – FI Management & Co-Operation to manage and scale Buy Now, Pay Later (BNPL) operations through Microfinance Institutions (MFIs) as the primary partner segment, with Banks and NBFIs as secondary stakeholders. This role is critical in ensuring smooth operational coordination, regulatory compliance under MRA guidelines, and scalable execution of BNPL programs through institution-led lending partnerships. Key Responsibilities MFI Partnership & Relationship Management (Primary Focus) Lead and manage PalmPay’s partnerships with licensed MFIs, acting as the key liaison for all operational and coordination matters. Drive onboarding of MFIs, including institutional due diligence, MRA compliance validation, and partnership documentation. Maintain strong working relationships w"
  },
  {
    "url": "https://bdjobs.com/h/details/1458922?ln=1",
    "company_name": "Studio Click House Ltd.",
    "job_title": "Creative Graphic Designer & Video Editor",
    "location": "Dhaka (Demra)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Creative Graphic Designer & Video Editor : Studio Click House Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Studio Click House Ltd. Creative Graphic Designer & Video Editor Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 12 Age: 18 to 30 years Location: Dhaka (Demra) Salary: Negotiable Experience: 1 to 3 years Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education HSC Bachelor/Honors Experience 1 to 3 years The applicants should have experience in the following business area(s): Advertising Agency, Design/Printing/Publishing, IT Enabled Service, Web Media/Blog, Professional Photographers, DTP House, E-commerce Freshers are also encouraged to apply. Additional Requirements Age 18 to 30 years Responsibilities & Context Create engaging video and image advertisements Design 3D mockups and motion graphics. Perform Clipping Path, Masking, Retouching, Color Correction, and Jewelry Retouching. Ensure high-quality work while meeting deadlines. Follow instructions and maintain accuracy. Ensure all final ads meet client specifications and formatting guidelines. Software Skills Required: Adobe Photoshop Adobe Illustrator Adobe InDesign Adobe After Effects Other relevant design and video editing tools Skills & Expertise Graphices Desiner Quality Control Video Editor Compensation & Other Benefits Provident fund,Tour allowance,Over time allowance,Performance bonus Lunch Facilities: Full Subsidize Salary Review: Yearly Festival Bonus: 2 Salary: Negotiable (based on education, experience, skills, and interview performance) Career growth and professional development opportunities. Other facilities as per industry standards. Workplace Work at office Employment Status Full Time Job Location Dhaka (Demra) Job Highlights HSC Bachelor/Honors Educational qualifications can be relaxed if you are an expert in the graphics industry. Apply Procedure Email Your CV Send your CV to the given email hr@studioclickhouse.com or Email your CV from My Bdjobs account Company Information Studio Click House Ltd. Follow Address: AB Tower, Holding: 112/11, West Boxnagar, Word: 67, Demra, Dhaka-1361 Website: https://studioclickhouse.com/ Business: LET’S INTRODUCE OURSELVES\n\nHey there! Welcome to Studio Click House, your go-to spot for top-notch image post-production. We consider ourselves the House of Experienced Graphic Designers! Since our launch in 2022, we’ve specialized in image editing, aiming to provide high-quality design services at affordable prices—all while saving you time.\n\nWe pride ourselves on our efficient work and focus on meeting our clients' needs. We embrace challenges and strive for complete client satisfaction. Our clients range from photographers and agencies to online shops and retaile"
  },
  {
    "url": "https://bdjobs.com/h/details/1459882?ln=1",
    "company_name": "Nest Landmark Ltd.",
    "job_title": "AGM / DGM - Customer Relation & Sales",
    "location": "Dhaka (Baridhara, Dhaka Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Mar 2026",
    "job_description": "AGM / DGM - Customer Relation & Sales : Nest Landmark Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nest Landmark Ltd. AGM / DGM - Customer Relation & Sales Application Deadline : 16 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 35 to 50 years Location: Dhaka (Baridhara, Dhaka S... Dhaka (Baridhara, Dhaka Sadar) Published: 16 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 35 to 50 years Strong leadership and team management skills Excellent communication and negotiation ability Customer-focused mindset Target-driven and performance-oriented Ability to work under pressure Responsibilities & Context Lead and manage Customer Relation & Sales teams Develop and implement customer retention and relationship strategies Achieve monthly, quarterly, and yearly sales targets Maintain strong relationships with existing and potential clients Handle customer complaints and ensure quick resolution Coordinate with Marketing and Project teams to ensure smooth client servicing Monitor sales pipeline and prepare performance reports Ensure high level of customer satisfaction and after-sales service Skills & Expertise After Sales Service Business Development Client Acquisition Customer Relationship Management Customer Retention Deal Closing Market Analysis Real Estate Sales and Marketing Sales Development Team Management and leadership Suggested by After Sales Service Business Development Client Acquisition Compensation & Other Benefits Mobile bill,Performance bonus Lunch Facilities: Partially Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Baridhara, Dhaka Sadar) Job Highlights Hye Nest Landmark, a reputed real estate company in Bangladesh, is seeking a dynamic and experienced professional for the position of AGM / DGM - Customer Relation & Sales to strengthen our customer engagement and drive sales growth. Company Information Nest Landmark Ltd. Follow Address: House # 6, Road # 2D, Block # J, (3rd Floor), Baridhara, Dhaka-1212. Website: https://nestlandmark.com/ Business: We provide every solutions related Land & Construction. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate co"
  },
  {
    "url": "https://bdjobs.com/h/details/1459956?ln=1",
    "company_name": "Zabs Medical services",
    "job_title": "Junior Medical Officer",
    "location": "Dhaka (Niketan)",
    "salary": "Tk. 30000 - 32000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Junior Medical Officer : Zabs Medical services Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Zabs Medical services Junior Medical Officer Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: At most 32 years Location: Dhaka (Niketan) Salary: Tk. 30000 - 32000 (Monthly) Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At most 32 years Minimum 1–2 years of clinical practice (experience in primary care/public health desirable). Strong interpersonal skills to engage with patients from disadvantaged backgrounds. Sensitivity to cultural, religious, and ethical considerations. Ability to work independently in a small team with limited resources. Commitment to social justice and service through Zakat. Responsibilities & Context The Zakat-Based Healthcare Project aims to provide free and subsidized healthcare services to low-income, Zakat-eligible populations working in or around Niketon, Dhaka. Individuals include housemaids, rickshaw pullers, guards, sweepers, day laborers, and their families The Medical Officer will lead the role in delivering compassionate, ethical, and accessible healthcare to underserved patients, ensuring adherence to Zakat principles and medical best practices. Key Responsibilities Conduct outpatient consultations for Zakat-eligible patients at the clinic. Perform basic medical checks & diagnosis. Provide maternal and child health consultations including antenatal and postnatal care. Prescribe and oversee the distribution of free and subsidized medicines . Maintain accurate medical records for each patient, ensuring data confidentiality. Collaborate with logistics officers and volunteers to support patient registration and follow-ups. Educate patients on preventive healthcare, hygiene, and nutrition . Support Doctors worldwide’s palliative care & all other project initiatives in Bangladesh Participate in regular meetings and provide reporting for monitoring, evaluation, and donor accountability. Uphold Islamic ethical values while serving patients with dignity and respect. Skills & Expertise Doctor Healthcare Medical Officer Suggested by Health/ Medical patients Care Workplace Work at office Employment Status Full Time Job Location Dhaka (Niketan) Company Information Zabs Medical services Follow Address: House No:151 ,Level-4,Road No:4,Niketan,Gulshan-1 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা"
  },
  {
    "url": "https://bdjobs.com/h/details/1460106?ln=1",
    "company_name": "A leading conglomerate in the garments industry",
    "job_title": "AGM/DMG/GM – Merchandising",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Mar 2026",
    "job_description": "AGM/DMG/GM – Merchandising : A leading conglomerate in the garments industry Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A leading conglomerate in the garments industry AGM/DMG/GM – Merchandising Application Deadline : 15 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 42 to 48 years Location: Dhaka Salary: Negotiable Published: 16 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 42 to 48 years Apparel Merchandising Responsibilities & Context ·       Lead, mentor and develop the merchandising all teams. ·       Lead the teams to drive order acquisition, flawless execution from proto to shipment, strong buyer relationships, cost optimization, and cross-functional coordination to achieve divisional targets for volume, margin, on-time delivery, and customer satisfaction in a highly competitive export RMG environment. ·       Overview the coordination of the teams closely with Production, Planning, Sourcing, Quality, Compliance, Finance and Accounts, Design, Technical, IE and Procurement department. ·       Maintain strong relationships with existing international buyers and premium brands. ·       Lead buyer negotiations on price, delivery timelines, product feasibility, and value-added services. ·       Identify opportunities for new buyer acquisition, business expansion, product diversification, and market penetration. ·       Represent the company to the buyers in buyer meetings, audits, and strategic discussions. ·       Ensure buyer satisfaction through proactive communication, trend forecasting, problem resolution, and high service levels. ·       Contribute to new business development and capacity expansion decisions. ·       Oversee the complete order lifecycle from inquiry to shipment, including proto/sample development, costing, order confirmation, production follow-up, final inspection, and shipment. ·       Lead the teams who manage proactively risks related to delays, fabric/accessory shortages, production bottlenecks, or quality issues. Ensure on-time, right-first-time delivery performance with achieving target and zero major quality claims. ·       Review and approve cost sheets ensuring competitive pricing with target margins. ·       Control material sourcing costs in coordination with Procurement, Sourcing teams, and internal vertical integration. ·       Analyze order profitability, take corrective actions when required, and drive margin improvement through value engineering, alternate sourcing, bulk negotiations, and waste reduction without compromising quality. Support Finance in LC, payment terms, and commercial documentation accuracy. ·       Lead product development initiatives aligned with buyer trends, seasonal requirements, and global fashion demands. Coordinate with Design, Sampling, R&D teams for"
  },
  {
    "url": "https://bdjobs.com/h/details/1460664?ln=1",
    "company_name": "Futureed Corporation Ltd",
    "job_title": "Application Officer (Study Abroad)",
    "location": "Dhaka (Banani)",
    "salary": "Tk. 30000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Application Officer (Study Abroad) : Futureed Corporation Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Futureed Corporation Ltd Application Officer (Study Abroad) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 22 to 36 years Location: Dhaka (Banani) Salary: Tk. 30000 - 35000 (Monthly) Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 36 years Responsibilities & Context Key Responsibilities: Review, verify, and organize student application documents including academic transcripts, certificates, CVs, passports, SOPs, reference letters, and financial documents. Ensure all documents meet university-specific admission requirements and submission deadlines. Create and manage student application files in the internal CRM system with accurate and updated information. Submit applications to universities via official portals and authorized channels. Communicate with university admissions offices regarding application status, missing documents, offers, and CAS issuance. Monitor application timelines and ensure timely progression of each case. Coordinate with counsellors to collect pending documents and resolve eligibility gaps. Maintain records of offer letters, CAS statements, tuition deposits, and official correspondence. Support visa processing teams by providing verified admission documents when required. Prepare internal reports related to application status and offer outcomes. Stay updated on admission cycles, intake deadlines, and partner university requirements. Perform other admissions-related duties assigned by management. Skills & Expertise Communication in English Data Entry Workplace Work at office Employment Status Full Time Job Location Dhaka (Banani) Job Highlights Join FutureEd - Bangladesh`s leading IELTS & Study Abroad center. Work in a dynamic team, impact global careers, and enjoy a supportive, growth-focused environment at the official IELTS & OET Test Centre. Company Information Futureed Corporation Ltd Follow Address: Ahmed Tower (6th Floor), Kemal Ataturk Avenue, Banani, Dhaka-1213 Website: https://www.ieltsbritishcouncilbd.com/ Business: Futureed English is the IELTS Official Test venue of British Council in Banani since 2013. We do have operations in Australia www.futureedenglish.com.au and in NZ www.futureedenglish.co.nz or www.britishcouncilielts.co.nz with strong focus on English Language testing. Recently, we have signed up a partnership to work with 1400 institution in 37 countries for using on UK, AUSTRALIA, USA, Canada  n New Zealand. Keeping that in mind, we are looking for few independent, ambitious yet honest, able to sell, able to create conviction in buyers mind. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্"
  },
  {
    "url": "https://bdjobs.com/h/details/1452694?ln=1",
    "company_name": "Tekvion",
    "job_title": "Cleaner",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 5000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Cleaner : Tekvion Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Tekvion Cleaner Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Tk. 5000 (Monthly) Published: 22 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Floors: Sweep, vacuum, mop, and polish various floor types. Surfaces: Dust, wipe, and polish furniture, countertops, light fittings, and windows. Sanitation: Scrub, disinfect, and sanitize restrooms, kitchens, and common areas. Waste Management: Empty and reline trash cans and dispose of waste. Restocking: Replenish soap, paper towels, toilet paper, and other hygiene supplies. Maintenance: Report maintenance issues (e.g., broken fixtures) and perform minor fixes. Deep Cleaning: Conduct periodic deep cleaning tasks like carpet cleaning or floor waxing. Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Tekvion Follow More jobs from this company Address: BDBL nihaadd Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 "
  },
  {
    "url": "https://bdjobs.com/h/details/1460663?ln=1",
    "company_name": "Ghumdhum Farming Limited.",
    "job_title": "Agro Manager",
    "location": "Bandarban",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Agro Manager : Ghumdhum Farming Limited. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ghumdhum Farming Limited. Agro Manager Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Bandarban Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 10 years' experience in farm management Strong knowledge of crop production & modern farming techniques. Leadership, decision-making & team management skills Responsibilities & Context Role Overview Lead and manage overall farm operations to ensure efficient, profitable and sustainable agricultural production. Oversee crop optimization, staff management and regulatory compliance. Key Responsibilities Oversee day-to-day farm operations (crops & livestock) Supervise and manage farm staff Plan planting, harvesting & livestock care schedules Monitor crop health & livestock wellbeing Ensure compliance with agricultural and animal welfare regulations Manage budget, cost control & operational reporting Skills & Expertise Suggested by Farm Management Crop protection Farming Employment Status Full Time Job Location Bandarban Company Information Ghumdhum Farming Limited. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skil"
  },
  {
    "url": "https://bdjobs.com/h/details/1460656?ln=1",
    "company_name": "The Bangladesh Red Crescent Society",
    "job_title": "Registration, Programme and Coordination Officer",
    "location": "Chattogram",
    "salary": null,
    "experience": "3 to 5 years",
    "education": null,
    "deadline": "26 Feb 2026",
    "job_description": "Registration, Programme and Coordination Officer : The Bangladesh Red Crescent Society Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The Bangladesh Red Crescent Society Registration, Programme and Coordination Officer Application Deadline : 26 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 35 years Location: Chattogram Salary: Tk. 70000 (Monthly) Experience: 3 to 5 years Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Minimum Bachelor’s degree in any relevant field from a reputed institute. Experience 3 to 5 years The applicants should have experience in the following business area(s): Development Agency, NGO Additional Requirements Age At most 35 years Age limit: 35 years (age limit will be relaxed in case of the potential candidate). At least 3–5 years of relevant experience in Rohingya Response in humanitarian ground or development organizations. Technical Skills Experience with registration databases, reporting trackers, or humanitarian information management systems is an asset. Ability to manage records, files, and documentation (both physical and digital). Ability to operate office equipment such as printers and scanners and support routine administrative tasks. Soft Skills Good communication skills in Bangla and English. Ability to coordinate with staff, vendors, and partners effectively. Organized, responsible, and able to manage routine tasks independently. Capable of working under pressure in a field-based operational environment. Experience: Experience working with donor-funded projects (UNHCR preferred) will be an asset. Personal Qualities: Adhere to the 7 fundamental principles of Red Cross and Red Crescent movement. Act at all times in accordance with the Code of Conduct. Able to work in a team and respect the opinions of others. Honest and high level of integrity. Responsibilities & Context Red Cross - Red Crescent (RCRC) Movement is the largest volunteer organization in the world.   Bangladesh Red Crescent Society (BDRCS) is a national society of the Movement, constituted on 31 March 1973 by the President`s Order No. 26 with retrospective effect from 16 December 1971. This is the biggest humanitarian organization in Bangladesh. As an auxiliary to the government in the Disaster Management field, BDRCS has provided humanitarian assistance to vulnerable people over the last 50+ years and has undertaken a wide range of activities in humanitarian response, disaster management, health, capacity building, Population movement/ displacement, and promoting Red Cross/ Red Crescent ideals and principles. Currently, the Bangladesh Red Crescent Society is looking for suitable Bangladeshi candidates for the following positions in its Bhasan Char Operation (BCO): Duration of c"
  },
  {
    "url": "https://bdjobs.com/h/details/1460658?ln=1",
    "company_name": "Amin Mohammad Holdings Ltd.",
    "job_title": "Executive / Sr. Executive - Marketing & Sales",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "1 to 5 years",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Executive / Sr. Executive - Marketing & Sales : Amin Mohammad Holdings Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Amin Mohammad Holdings Ltd. Executive / Sr. Executive - Marketing & Sales Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Tk. 35000 (Monthly) Experience: 1 to 5 years Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Business Administration (BBA) Master of Business Administration (MBA) BBA / MBA majoring in Marketing/ Business Administration from Public University or a well reputed private university. Experience 1 to 5 years The applicants should have experience in the following business area(s): Real Estate, Group of Companies, Developer Freshers are also encouraged to apply. Additional Requirements 1-5 years` experience in Land/Plot Sales Freshers with strong sales mindset may also apply Strong communication & negotiation skills Self-motivated & performance-oriented Responsibilities & Context Job Overview: Amin Mohammad Holdings Limited, a prominent and fast-growing land developer company of the country, is looking for energetic, ambitious and performance-driven professionals for its Marketing & Sales team. The selected candidates will be responsible for driving land plot sales, generating new business opportunities, maintaining strong client relationship and contributing directly to revenue growth. This role is ideal for individuals who thrive in a competitive, target-oriented environment and are passionate about sales excellence. Key Responsibilities: Achieve and exceed sales targets Conduct client meetings, project presentation and site visits Build strong referral and client networks to expand market opportunities Convert leads into confirmed sales Deliver premium client experience to enhance brand loyalty. Skills & Expertise Suggested by Land land Sales Plot Sales Compensation & Other Benefits Attractive Salary (Starting from Tk.35,000) Performance Bonuses & Incentives. Festival Bonuses. Mobile Facilities. Earn Leave Encashment. Friday - Saturday weekends. Performance based career progression. Other benefits as per organizational policy. Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Amin Mohammad Holdings Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627"
  },
  {
    "url": "https://bdjobs.com/h/details/1459695?ln=1",
    "company_name": "Nexus Fashion Ltd.",
    "job_title": "Manager (Marketing & Merchandising)",
    "location": "Gazipur (Gazipur Sadar)",
    "salary": null,
    "experience": "At least 8 years",
    "education": null,
    "deadline": "18 Mar 2026",
    "job_description": "Manager (Marketing & Merchandising) : Nexus Fashion Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nexus Fashion Ltd. Manager (Marketing & Merchandising) Application Deadline : 18 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 32 years Location: Gazipur (Gazipur Sadar) Salary: Negotiable Experience: At least 8 years Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Bachelor’s/Master’s degree in Textile Engineering, Fashion Technology, Marketing, or related field Experience At least 8 years The applicants should have experience in the following business area(s): Garments Additional Requirements Age At least 32 years Strong knowledge of buyer handling, merchandising, and export documentation. Clear understanding of BSCI, SEDEX, WRAP, ISO, Accord/Alliance, and buyer compliance standards Excellent communication, negotiation, and leadership skills Ability to work under pressure and meet shipment deadlines Responsibilities & Context Job Context: Nexus Fashion Ltd. is a 100% export-oriented, buyer-focused garments manufacturing company. We are seeking an experienced, proactive, and buyer-oriented professional for the position of Manager (Marketing & Merchandising) to handle international buyers and ensure smooth order execution with full compliance. Key Responsibilities: Handle international buyers and maintain long-term buyer relationships. Lead end-to-end merchandising activities from inquiry to shipment. Costing, price negotiation, order confirmation, and T&A management. Coordinate with production, IE, planning, quality, and commercial teams. Ensure on-time delivery and buyer compliance requirements. Develop new buyers and expand export business. Ensure adherence to buyer code of conduct, social compliance, and quality standards. Skills & Expertise Buyer Handling Export Documentation Leadership and Good Communication skill. Merchandising and Marketing Negotiation Skill Suggested by Sales & Marketing Compensation & Other Benefits As per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Gazipur Sadar) Company Information Nexus Fashion Ltd. Follow Address: Nexus Tower, Vogra Bazar, Bason, Gazipur Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 0"
  },
  {
    "url": "https://bdjobs.com/h/details/1460654?ln=1",
    "company_name": "Amin Mohammad Foundation Limited",
    "job_title": "Executive / Sr. Executive - Marketing & Sales",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Mar 2026",
    "job_description": "Executive / Sr. Executive - Marketing & Sales : Amin Mohammad Foundation Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Amin Mohammad Foundation Limited Executive / Sr. Executive - Marketing & Sales Application Deadline : 17 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Tk. 35000 (Monthly) Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements 2-7 years of relevant experience in Real Estate industry. Knowledge of real estate trends and local market philosophy. Strong communication and negotiation skills. Confident, persuasive and result-oriented personality. Ability to work under pressure and thrive in a performance-driven culture. Responsibilities & Context Amin Mohammad Foundation Limited, a leading Real Estate company in Bangladesh is seeking dynamic and target-driven professionals for its Marketing & Sales team. The selected candidates will be responsible for driving property sales, expanding market reach, converting prospects into clients and contributing directly to revenue growth. This role requires strong communication skills, sales expertise and the ability to per-form in a competitive, results-oriented environment. Key Responsibilities: Sales & Revenue Growth: Achieve sales targets as set by the Management. Promote and sell residential and commercial projects. Monitor market trends, competitor activities and customer preferences. Convert qualified leads into confirmed sales. Market Expansion & Lead Generation: Develop and implement strategic plans aligned with company goals. Maintain strong relationships with existing and potential clients. Contribute to branding initiatives and lead generation strategies. Build strong referral networks to identify new market opportunities. Client Management & Closing Excellence: Conduct client meetings, project presentations and site visits. Maintain strong follow-up with prospective buyers. Deliver premium client experience to strengthen brand loyalty. Support after-sales services in coordination with relevant departments. Skills & Expertise Suggested by Sales & Marketing Real Estate Sales Real Estate Marketing Compensation & Other Benefits Attractive Salary (Starting from Tk.35,000) Performance Bonuses & Incentives. Festival Bonuses. Mobile Facilities. Earn Leave Encashment. Friday Saturday weekends. Performance based career progression. Other benefits as per organizational policy. Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Amin Mohammad Foundation Limited Follow More jobs from this company Address: 752 , Satmosjid Road Dhanmondi, Dhaka -1205 Website: https://www.amflbd.com/ Business: Amin Mohammad Foundation Ltd (AMFL), began its journey as a"
  },
  {
    "url": "https://bdjobs.com/h/details/1460422?ln=1",
    "company_name": "Sigma Oil Industries Ltd.",
    "job_title": "Asst. Manager / Manager - Corporate Sales",
    "location": "Chattogram, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Asst. Manager / Manager - Corporate Sales : Sigma Oil Industries Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sigma Oil Industries Ltd. Asst. Manager / Manager - Corporate Sales Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 35 to 45 years Location: Chattogram, Dhaka Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 35 to 45 years 10 to 15 Years working experience in Corporate Sales. Strictly Mandatory: The candidate MUST have last 5 years’ experience in Corporate/B2B sales in national or multinational reputed company. Job Requirements: Good Health for frequent travelling. Innovative and well-mannered with attractive personality. Applicant should have valid driving license. Good inter-personal communication skills. Sound knowledge on MS Word, MS Excel and Power Point. Excellent and super-fast data analyzing and reporting skill. Unwilling to ride motorcycle are requested not to apply. Responsibilities & Context Job Responsibilities Operating sales to achieve monthly sales target of assigned zone. New customer acquisition for fruitful deal. Preparing daily, weekly & monthly reports as required by management. Analyzing market trends of competitor brands. Maintaining customer database. Skills & Expertise Suggested by Sales & Marketing Corporate Sales B2B Sales Compensation & Other Benefits Salary: Attractive salary based on skills & experience. Compensation & other benefits Two Festival Bonus Mobile Allowance Daily Allowance Yearly Salary Review Incentives Group Insurance Other Benefits as per company policy Employment Status Full Time Job Location Chattogram, Dhaka Company Information Sigma Oil Industries Ltd. Follow Address: Sena Kalyan Bahban (14th Floor), 195 Motijheel C/A, Dhaka-1000, Bangladesh. Website: https://www.sigma-oil.com/ Business: Sigma Oil Industries Ltd. the fast growing Lube Oil Manufacturing Company in Bangladesh started its journey since May 2004. Believing the Quality, its slogan is \"quality meets desires\". We always concentrated to this motto. Furnished with latest technologies & machineries, we engaged an expert team to produce quality lube oil for our valued clients. Continuous Customers satisfaction has hastened our movement to the picks of new horizons. Quality and Development is the same parameter to us. Our aim is to be the market leader not only in sales volume but also in quality measurement. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) "
  },
  {
    "url": "https://bdjobs.com/h/details/1459559?ln=1",
    "company_name": "Southern Park 06",
    "job_title": "Project Accounts Officer",
    "location": "Dhaka (Khilgaon)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Project Accounts Officer : Southern Park 06 Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Southern Park 06 Project Accounts Officer Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 25 years Location: Dhaka (Khilgaon) Salary: Negotiable Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 25 years Responsibilities & Context To maintain project accounts To communicate with members via phone call and email Skills & Expertise Language skills both in Bengali and English Microsoft Office Typing Skill - Bengali and English Suggested by Accounts and Finance Accounting Data Entry Project Management Financial Analysis Compensation & Other Benefits T/A,Mobile bill Festival Bonus: 2 Workplace Work at office Employment Status Contractual Gender Only males are allowed to apply. Job Location Dhaka (Khilgaon) Company Information Southern Park 06 Follow Address: Between Trimohoni and Nagdarpar Bridge, Rampura to Demra Main Road, Nondipara, Khilgaon, Dhaka Business: This is a construction project called Southern Park 06 which is a owner based project. Here we are constructing a G+15 Storied building. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রে"
  },
  {
    "url": "https://bdjobs.com/h/details/1460616?ln=1",
    "company_name": "Codeware Ltd.",
    "job_title": "Accountant",
    "location": "Dhaka (Adabor)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Accountant : Codeware Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Codeware Ltd. Accountant Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 30 years Location: Dhaka (Adabor) Salary: Negotiable Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 30 years Strong knowledge of accounting principles and financial reporting Hands-on experience with Accounting Software (ERP, Tally, Excel, etc.) Good understanding of VAT, Tax, and regulatory compliance Strong analytical and problem-solving skills Attention to detail and ability to work independently Good communication and reporting skills Responsibilities & Context Codeware Limited is a growing software development company providing modern IT solutions including software development, ERP systems, and digital services. We are looking for a responsible and experienced Accountant to manage our financial operations and ensure compliance with accounting standards. Record and maintain daily, monthly, and yearly financial transactions Manage Accounts Payable (AP) and Accounts Receivable (AR) Prepare and maintain Bank Reconciliation Statements Perform monthly and yearly account closing Handle VAT, Tax, and TDS related matters Verify and maintain invoices, bills, vouchers, and supporting documents Assist in budgeting, forecasting, and cost control activities Support internal and external audit processes Maintain proper financial documentation and records Prepare financial reports and analysis for management decision-making Ensure compliance with accounting standards, tax laws, and company policies Prepare financial statements including: Income Statement Balance Sheet Cash Flow Statement Skills & Expertise Suggested by Accounting Data Entry Accounts and Finance Financial Reporting Compensation & Other Benefits Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 Weekly 1 holiday Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Adabor) Company Information Codeware Ltd. Follow Address: House #629-685, Road # 12, Baitul Aman Housing Society, Adabor, Mohammadpur, Dhaka. Website: https://www.codewareltd.com/ Business: Codeware Limited is a Bangladesh and UK-based Software Company. This is a highly qualitative development of software, web and mobile apps Solution Company. Our services are Web Design and Development, Android and iOS, Social Media Marketing, App Development, ERP, CRM, e-commerce solutions. \nOur products are Bus Ticket Booking System, Education Management System, Event Ticketing system, Online Ordering Solutions, Hotel Booking System, HR- Payroll Management, Web Based Attendance System, Online Newspaper, Online Admission System, Social Media Solut"
  },
  {
    "url": "https://bdjobs.com/h/details/1365645?ln=1",
    "company_name": "SMG Animal Health Co. Ltd.",
    "job_title": "ন্যাশনাল সেলস ম্যানেজার (পোল্ট্রি, ডেইরী ও একুয়া মেডিসিন বিক্রয়ে পারদর্শী)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "ন্যাশনাল সেলস ম্যানেজার (পোল্ট্রি, ডেইরী ও একুয়া মেডিসিন বিক্রয়ে পারদর্শী) : SMG Animal Health Co. Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SMG Animal Health Co. Ltd. ন্যাশনাল সেলস ম্যানেজার (পোল্ট্রি, ডেইরী ও একুয়া মেডিসিন বিক্রয়ে পারদর্শী) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Responsibilities & Context কমপক্ষে অনার্স/ডিগ্রী পাশ হতে হবে। ভেটেরিনারি মেডিসিন সেক্টরে কমপক্ষে ১০ বছরের অভিজ্ঞতা থাকতে হবে। ভেটেরিনারি মেডিসিন পণ্য বিক্রয়ে পারদর্শী হতে হবে।ডিলার, ডাক্তার ও খামারিদের সাথে কথোপকথনে পারদর্শী হতে হবে। পণ্য বিক্রয় পরবর্তী ধাপে কালেকশন সংগ্রহে পারদর্শী হতে হবে। অধিনস্ত সকল কর্মীদের নিয়ন্ত্রনের ক্ষমতা থাকতে হবে। সকল ধরনের রিপোর্ট এবং বাজেট তৈরিতে পারদর্শী হতে হবে।অধিনস্ত সকল কর্মীদের ট্রেনিং করাতে পারদর্শী হতে হবে। প্রতিদিন নতুন নতুন মার্কেট এবং গ্রাহক তৈরি করতে হবে। ১০০% টার্গেট পূরণে সক্ষম হতে হবে এবং পজিটিভ মানসিকতা থাকতে হবে। Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information SMG Animal Health Co. Ltd. Follow More jobs from this company Address: Casa Serena, House # 25, Apt. No: B-2 (2nd Floor)  Gorib-E-Newaz Avenue, Sector # 11, Uttara, Dhaka-1230. Business: SMG Animal Health Co. Ltd. is an animal health care products provider in Bangladesh. Starting our journey in 2009 as a proprietor, we began our private limited company journey in 2012. Our head office is situated in Garib-E-Newaz Aveneu, Uttara, Dhaka. Currently we provide 35 different veterinary products throughout the country Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal a"
  },
  {
    "url": "https://bdjobs.com/h/details/1460176?ln=1",
    "company_name": "RK EXPORT IMPORT",
    "job_title": "Manager (Export & Import)",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 35000 - 45000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Manager (Export & Import) : RK EXPORT IMPORT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List RK EXPORT IMPORT Manager (Export & Import) Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 25 to 45 years Location: Anywhere in Bangladesh Salary: Tk. 35000 - 45000 (Monthly) Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 45 years Must have prior experience in garments export (minimum 1 year preferred) Strong understanding of international buyers and shipment processes Responsibilities & Context Manage the complete export process of garments products to international markets Communicate regularly with buyers and coordinate order-related activities Prepare and verify all export/import documentation (Commercial Invoice, Packing List, Bill of Lading/AWB, EXP, LC, UD, GSP, etc.) Handle banking and Letter of Credit (LC) related procedures Coordinate with Freight Forwarders, Shipping Lines, and C&F Agents Supervise customs clearance and shipment procedures Ensure on-time shipment and maintain delivery deadlines Manage import documentation and clearance of raw materials (fabric, accessories, trims, etc.) Stay updated with government regulations related to export-import (BGMEA, Customs, EPB, etc.) Maintain shipment records and prepare monthly export/import reports Ensure compliance with international trade policies and company standards Skills & Expertise Export & Import Knit garments woven Garments Suggested by Commercial Commercial/ Export-Import Employment Status Full Time Job Location Anywhere in Bangladesh Company Information RK EXPORT IMPORT Follow Address: 26/KA , Haricha Manjil, Sarkarbari road, Nodda , Gulshan-2 Business: Rk Export Import is a shipping and trading company that connects the USA and Bangladesh. We help Bangladeshi people in the USA send packages home, and we also send clothes (RMG) from Bangladesh to sell in the USA. We are growing and looking for friendly and hardworking people to join our team. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management ("
  },
  {
    "url": "https://bdjobs.com/h/details/1459697?ln=1",
    "company_name": "Nexus Sweater Ind. (Pvt.) Ltd.",
    "job_title": "Assistant Manager - IE & Planning",
    "location": "Gazipur (Gazipur Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Mar 2026",
    "job_description": "Assistant Manager - IE & Planning : Nexus Sweater Ind. (Pvt.) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nexus Sweater Ind. (Pvt.) Ltd. Assistant Manager - IE & Planning Application Deadline : 18 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 30 to 45 years Location: Gazipur (Gazipur Sadar) Salary: Negotiable Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 30 to 45 years Strong knowledge of IE tools, SMV, and capacity planning Leadership and team management skills Excellent analytical and reporting ability Proficient in MS Excel Ability to work under pressure and meet deadlines Responsibilities & Context Lead all Industrial Engineering & Production Planning activities for sweater operations Conduct time & motion study and SMV analysis Capacity planning, line balancing, and manpower optimization Prepare production plans, targets, and delivery schedules Monitor productivity, efficiency, and cost control Analyze production data and prepare MIS reports for management Coordinate with Production, HR, Merchandising, and Quality teams Drive continuous improvement initiatives in sweater manufacturing processes Skills & Expertise Analytical Skill Industrial Engineering Leadership and teamwork Microsoft Office Work Under Pressure Compensation & Other Benefits As per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Gazipur Sadar) Company Information Nexus Sweater Ind. (Pvt.) Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now I"
  },
  {
    "url": "https://bdjobs.com/h/details/1460672?ln=1",
    "company_name": "Grambangla Unnayan Committee",
    "job_title": "Social Development Interns",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Mar 2026",
    "job_description": "Social Development Interns : Grambangla Unnayan Committee Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Grambangla Unnayan Committee Social Development Interns Application Deadline : 19 Mar 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Tk. 10000 (Monthly) Published: 17 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements There is no age limit to apply for the posts of Social Development Intern. Responsibilities & Context Grambangla Unnayan Committee is going to appoint four (4) Social Development Interns for its social development projects. Grambangla Unnayan Committee is one of the prominent NGOs in Bangladesh working for the children in worst forms of child labour, street children, nomadic Bede community, urban informal sector workers including waste picker community, slum dwellers and low-income communities, tobacco control, public health, early childhood development, primary and technical education, primary health care, most at risk people of HIV and AIDS, etc. since 1993. Compensation & Other Benefits The duration of internship will be of 6 months. Selected candidates for internship will be given a monthly stipend of BDT 10,000 (Ten thousand Taka per month). After successful completion of the internship, candidates may be appointed to suitable posts with our ongoing development projects based on their professional achievements and interests. Employment Status Full Time Job Location Anywhere in Bangladesh Read Before Apply Interested candidates are encouraged to send their curriculum vitae to grambangla.bd@ gmail.com Contact Information: A K M Maksud Executive Director Grambangla Unnayan Committee House No. 93 (1st Floor-Right), Road No. 1 Mohammadia Housing Society Mohammadpur, Dhaka-1207, Bangladesh Phone: +8801715020055, Email: akmmaksud@gmail.com and grambangla@ yahoo.com Apply Procedure Email Your CV Send your CV to the given email grambangla.bd@gmail.com Company Information Grambangla Unnayan Committee Follow Address: House No. 93 (1st Floor), Road No. 1 Mohammadia Housing Society Mohammadpur, Dhaka-1207 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO"
  },
  {
    "url": "https://bdjobs.com/h/details/1459699?ln=1",
    "company_name": "Nexus Sweater Ind. (Pvt.) Ltd.",
    "job_title": "Quality Manager (Sweater Division)",
    "location": "Gazipur (Gazipur Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Mar 2026",
    "job_description": "Quality Manager (Sweater Division) : Nexus Sweater Ind. (Pvt.) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nexus Sweater Ind. (Pvt.) Ltd. Quality Manager (Sweater Division) Application Deadline : 18 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 32 years Location: Gazipur (Gazipur Sadar) Salary: Negotiable Published: 17 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 32 years Strong knowledge of sweater knitting, linking, washing, finishing, and packing processes Sound understanding of AQL, buyer standards, and compliance requirements Experience in handling international buyers and third-party inspections Excellent leadership, communication, and problem-solving skills Responsibilities & Context Overall responsibility for quality assurance and quality control of the Sweater Division Ensure product quality according to buyer requirements and approved standards Coordinate with Production, Merchandising, and Technical teams to maintain quality compliance Handle buyer inspections, audits, and QC processes (inline, final inspection) Identify quality issues and implement corrective and preventive actions (CAPA) Develop and monitor quality systems, SOPs, and training for QC staff Ensure on-time shipment with required quality standards Prepare and submit quality-related reports to management Skills & Expertise Suggested by AQL Compensation & Other Benefits As per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Gazipur Sadar) Apply Procedure Email Your CV Send your CV to the given email it@nexussweater.com Company Information Nexus Sweater Ind. (Pvt.) Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced L"
  }
]