[
  {
    "url": "https://bdjobs.com/h/details/1457492?ln=1",
    "company_name": "Eduproof",
    "job_title": "Student Counsellor",
    "location": "Dhaka (Uttara Sector 11)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Student Counsellor : Eduproof Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Eduproof Student Counsellor Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 22 to 30 years Location: Dhaka (Uttara Sector 11) Salary: Tk. 15000 - 20000 (Monthly) Published: 07 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 30 years Responsibilities & Context Counsel students and parents on overseas education opportunities based on academic background, career goals, and financial capacity Provide accurate information about universities, colleges, courses, entry requirements, tuition fees, scholarships, and intake timelines Assess student eligibility and recommend suitable study destinations (e.g., Australia, UK, USA, Canada, Europe, Malaysia) Guide students through the entire admission process, including course selection, application submission, and follow-ups with institutions Assist students in preparing required documents such as SOPs, CVs, academic transcripts, recommendation letters, and financial documents Advise students on visa requirements, Genuine Student (GS/GTE) statements, interview preparation, and compliance with immigration rules Coordinate with university representatives, partner institutions, and admissions teams to track application progress Maintain accurate student records, application status, and CRM updates Support students with offer letter acceptance, fee payment guidance, and enrollment confirmation Provide pre-departure briefings covering accommodation, travel, insurance, part-time work rules, and cultural adjustment Ensure ethical counselling practices and compliance with institutional and immigration policies Achieve individual and team recruitment targets while maintaining high student satisfaction Participate in education fairs, seminars, school visits, and marketing events Stay updated on changes in visa regulations, university policies, and international education trends Skills & Expertise Canva Pro Computer Literacy Digital Marketing (Social Media Marketing) MS Office Suggested by Education Counseling Immigration Consultant Student Counseling Visa Processing Compensation & Other Benefits Mobile bill,Performance bonus,Profit share Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Uttara Sector 11) Company Information Eduproof Follow Address: House 30, Sonargaon Janapath Road, Sector 11, Uttara Website: https://eduproof.io/ Business: Study Abroad guide and visa application guideline Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458540?ln=1",
    "company_name": "BAHADURPUR MODEL ACADEMY",
    "job_title": "Assistant Teacher",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Assistant Teacher : BAHADURPUR MODEL ACADEMY Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List BAHADURPUR MODEL ACADEMY Assistant Teacher Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 5 Location: Gazipur Salary: Negotiable Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context বাহাদুরপুর মডেল একাডেমীতে  শিক্ষক নিয়োগ দেয়া হবে। ইংরেজি ব্যবসায় শিক্ষা সামাজিক বিজ্ঞান Skills & Expertise Suggested by Lesson Planning Curriculum Development Teaching/ Training Compensation & Other Benefits Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Gazipur Company Information BAHADURPUR MODEL ACADEMY Follow Address: 22No. Ward, Bahadurpur, Gazipur city corporation, Gazipur. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458702?ln=1",
    "company_name": "Rarona International (pvt) Ltd.",
    "job_title": "Sales & Marketing Executive",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 8000 - 15000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Sales & Marketing Executive : Rarona International (pvt) Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Rarona International (pvt) Ltd. Sales & Marketing Executive Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 18 to 60 years Location: Anywhere in Bangladesh Salary: Tk. 8000 - 15000 (Monthly) Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 60 years Responsibilities & Context নিয়মিত ও নির্ধারিত সময়ে সাইট ভিজিট করতে হবে। গ্রাহকের সাথে সম্পর্ক স্থাপন করে ব্যাবসার উন্নয়ন নিশ্চিত করতে হবে। নতুন গ্রাহক বাড়ানো এবং নিয়মিত যোগাযোগ রাখতে হবে। কোম্পানী ফরমেট অনুযায়ী ডাটাবেজ তৈরী করে দৈনিক রিপোর্ট প্রদান করতে হবে। কর্মঠ, সৃজসমীল ও দায়িত্বশীল হতে হবে। Skills & Expertise ISP operation Suggested by Sales & Marketing Sales target Customer Service Client Service/ Marketing Workplace Work from home,Work at office Employment Status Freelance Job Location Anywhere in Bangladesh Company Information Rarona International (pvt) Ltd. Follow Address: 14 Nandipara Main Road (Chapa Khana), Khilgaon, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458861?ln=1",
    "company_name": "Preneur Lab",
    "job_title": "Full Stack Software Developer",
    "location": "Dhaka",
    "salary": "Tk. 25000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Full Stack Software Developer : Preneur Lab Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Preneur Lab Full Stack Software Developer Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 22 to 30 years Location: Dhaka Salary: Tk. 25000 - 35000 (Monthly) Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 30 years Responsibilities & Context Company Overview Preneur Lab Digital is a leading software development company specializing in web, AI, ERP, office management and interactive web applications. We work with local enterprises and international clients across the UK and Canada, delivering reliable, scalable and user focused digital products. Role Overview We are looking for a Full Stack Software Developer to join our core development team in our Dhaka office. Key Responsibilities Design, develop, and maintain front-end interfaces Build and maintain back-end applications and RESTful APIs Integrate front-end applications with back-end services securely and efficiently Optimize applications for performance, scalability, and security Write clean, reusable, and well-documented code Debug, troubleshoot, and resolve technical issues Qualifications Bachelor’s degree in Computer Science & Engineering or a related field Strong skills in HTML, CSS, and JavaScript Solid experience with React.js Back-end development experience using PHP, Python, Node.js Experience with RESTful APIs, JSON, and API integrations Understanding of authentication and authorization (JWT, OAuth, Laravel Sanctum) Experience with databases such as MySQL, PostgreSQL, or MongoDB Familiarity with Git, version control workflows, and deployment basics Strong understanding of responsive design principles Good communication skills and ability to work collaboratively in a team Details Employment Type: Full-time Experience: 1–3 years Vacancy: 2 Work Hours: Saturday – Thursday, 10:30 AM – 6:30 PM (WFH on Saturday) Work Modality: On-site (Dhanmondi 4/A, Dhaka, Bangladesh) Learn more: www.pl.digital Skills & Expertise HTML & CSS PHP Python JavaScript Node.js JSON RESTful API MySQL Employment Status Full Time Job Location Dhaka Company Information Preneur Lab Follow Address: Flat - 4/B, House - 13/B, Road -4/A, Dhanmondi, Dhaka - 1209 Website: https://www.preneurlab.com.bd Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন "
  }
]