[
  {
    "url": "https://bdjobs.com/h/details/1458357?ln=1",
    "company_name": "Golden Bricks",
    "job_title": "Front Desk Executive",
    "location": "Dhaka (Mirpur12)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Front Desk Executive : Golden Bricks Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Golden Bricks Front Desk Executive Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 20 to 33 years Location: Dhaka (Mirpur12) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 33 years ·        Well-groomed and presentable appearance ·        Polite, friendly, and professional behavior ·        Excellent communication & interpersonal skills ·        Hard-working, responsible, and punctual ·        Basic computer skills (appointments & client records) Responsibilities & Context Golden Bricks is seeking a female Front Desk Executive who is professional, presentable, and passionate about delivering an exceptional client experience. Responsibilities: ·    Welcome and assist clients warmly and professionally ·    Manage appointments, calls, and front desk operations ·     Maintain a calm, welcoming, and luxury environment ·      Coordinate with staff to ensure smooth  workflow Skills & Expertise Font Desk Compensation & Other Benefits asper company policy Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Mirpur12) Company Information Golden Bricks Follow Address: House 19 ,Block B, Mirpur 12, Pallabi ,Dhaka -1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Feature"
  },
  {
    "url": "https://bdjobs.com/h/details/1458915?ln=1",
    "company_name": "Megamind",
    "job_title": "Executive",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Executive : Megamind Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Megamind Executive Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 20 to 28 years Location: Dhaka (Banasree) Salary: Tk. 13000 - 18000 (Monthly) Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Additional Requirements Age 20 to 28 years Responsibilities & Context Education Bachelor/Honors Minimum undergraduate completed Additional Requirements Age 20 to 28 years Good English writing Moderate English speaking Good computer skills (MS Office, email, online work) Willing to go outside office for B2B programs/events Responsibilities & Context Office Time: 11:00 AM – 8:00 PM Working Days: 6 days/week Probation Period: 3–6 months (adjustable) Role: Assist students with study abroad processes Handle applications, emails, and documentation Support counselling and coordination tasks Skills & Expertise Communication in English Data Entry (Both English & Bengali) Microsoft Office Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka (Banasree) Company Information Megamind Follow Address: House#11, Main Road, Block-B, Banasree, Rampura, Dhaka-1219 Skills & Expertise Data Entry (Both English & Bengali) Good English communication skills (verbal and Written) Microsoft Office Compensation & Other Benefits Mobile bill,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Banasree) Company Information Megamind Follow Address: House#11, Main Road, Block-B, Banasree, Rampura, Dhaka-1219 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করু"
  }
]