[
  {
    "url": "https://bdjobs.com/h/details/1452215?ln=1",
    "company_name": "Bazlul Huq Khan School & College",
    "job_title": "Senior/Junior Teacher (English Version)",
    "location": "Dhaka (Uttar Khan)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Senior/Junior Teacher (English Version) : Bazlul Huq Khan School & College Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bazlul Huq Khan School & College Senior/Junior Teacher (English Version) Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Location: Dhaka (Uttar Khan) Salary: Tk. 15000 - 23000 (Monthly) Published: 21 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Responsibilities & Context All academic responsibilities related to students` exams, dealing with parents, and other duties as the position requires. Fulfilling teaching duties for all learners regarding the individual or institutionally defined curriculum, including encouraging critical thinking and free exchange of ideas. Preparing lesson plans, lecture materials, and digital content. Actively involved in developing curriculum. Student assessment: assessing class activity, testing, and other forms of qualitative and quantitative evaluation. Should have experience with the National Curriculum. Skills & Expertise Suggested by Education and Training students support Classroom management Compensation & Other Benefits Mobile bill,Provident fund Festival Bonus: 2 Employment Status Full Time Job Location Dhaka (Uttar Khan) Job Highlights We need: Science, BGS( Senior Section), English, Physics, Mathematics Apply Procedure Hard Copy Last date of application is 20.11.2024 (extended date) You are requested to submit your hard copy CV to \" Principal\" including photocopy of all academic certificates, two copies passport size color photo by the following address;courier or by hand. You have to attach bank draft named \" Bazlul Huq Khan School and College \" for Senior Teacher Taka 400(four hundred) and for Junior Teacher Taka 300(Three hundred) to the following address : \" Bazlul Huq Khan School & College\" 2470/1 College Taltola, Majar, Uttarkhan, Uttara, Dhaka-1230. Please call : 01708-416223, 01733-319154 Applicant must write ; a) the post name b) Subject c)Version on the top of the envelope. Company Information Bazlul Huq Khan School & College Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now "
  },
  {
    "url": "https://bdjobs.com/h/details/1457965?ln=1",
    "company_name": "Alphatech Mobile (BD) Limited",
    "job_title": "Mechanical Technicians",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Mechanical Technicians : Alphatech Mobile (BD) Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Alphatech Mobile (BD) Limited Mechanical Technicians Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Location: Dhaka Salary: Negotiable Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Candidates can be local or foreign nationals. Minimum qualification 1 year. Responsibilities & Context A mobile manufacturing company requires 10 Mechanical Technicians. Candidates can be local or foreign nationals. Minimum qualification 1 year. Salary is negotiable. Interested candidates should contact the following address within the next 10 days. Alphatech Mobile (BD) Limited Plot-25, Rajlakshmi Complex, 5th Floor, Room No.-14, Sector-03, Uttara, Dhaka-1230. Mobile : 01408753556 Email : alpha2023@ gmail.com Skills & Expertise Suggested by Mechanical Technician mechanical maintenance Repair and Maintenance Skills Mobile industry Compensation & Other Benefits Salary is negotiable. Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Alphatech Mobile (BD) Limited Follow Address: Plot-25, Rajlakshmi Complex, 5th Floor, Room No.-14, Sector-03, Uttara, Dhaka-1230 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates "
  },
  {
    "url": "https://bdjobs.com/h/details/1457979?ln=1",
    "company_name": "A leading Garments (Sweater) Buying House",
    "job_title": "GM / AGM Production and Operation (Sweater)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "GM / AGM Production and Operation (Sweater) : A leading Garments (Sweater) Buying House Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A leading Garments (Sweater) Buying House GM / AGM Production and Operation (Sweater) Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Must have a few years of managerial experience in Merchandising. Must have a few years of managerial experience in production. Responsibilities & Context Oversee the complete production as per TNA. Collaborate closely with the merchandising team from tech pack receiving to goods delivery. Coordinate production follow-ups with the QA team from sample development to shipment. Manage communication with the factory and implement risk management strategies for timely delivery. Skills & Expertise Buyer Sourcing Communication and Negotiation Skill Decision making capabilities Factory Sourcing Merchandising and Production. Production Follow up Production/ Operation Management Shipment follow up Team management Suggested by Buyer Sourcing Factory HR Administration Merchandising and Production. Compensation & Other Benefits T/A,Tour allowance,Mobile bill Salary Review: Yearly Festival Bonus: 2 Lunch Facilities: Full Subsidize Employment Status Full Time Job Location Dhaka Read Before Apply An applicant must mention the applied-for job post in the email subject line. Only shortlisted candidates will be contacted. Apply Procedure Email Your CV Send your CV to the given email hr@lynxdesignbd.com or Email your CV from My Bdjobs account Company Information A leading Garments (Sweater) Buying House Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course"
  },
  {
    "url": "https://bdjobs.com/h/details/1456125?ln=1",
    "company_name": "International Peace School & College, Rangpur",
    "job_title": "উপাধ্যক্ষ",
    "location": "Rangpur",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "উপাধ্যক্ষ : International Peace School & College, Rangpur Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List International Peace School & College, Rangpur উপাধ্যক্ষ Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Location: Rangpur Published: 10 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements ইংরেজি বিষয়ে দক্ষতাসহ ন্যূনতম ২ বছরের শিক্ষকতার অভিজ্ঞতা আবশ্যক। ইংরেজিতে অনর্গল করা বলার দক্ষতা থাকতে হবে। Responsibilities & Context ইন্টারন্যাশনাল পিস স্কুলল & কলেজ (ন্যাশনাল কারিকুলাম, ইংলিশ ভার্সন) আধুনিক ও ইসলামী শিক্ষার সমন্বয়ে পরিচালিত “ ইন্টারন্যাশনাল পিস স্কুল অ্যান্ড কলেজ, রংপুর \" (Only Tri-Lingual Caring School & College)-এ নিম্নলিখিত পদের জন্য দরখাস্ত আহ্বান করা হচ্ছে। উপাধ্যক্ষ- ১ জন Skills & Expertise Communication in English FLUENCY IN ENGLISH LANGUAGE Teaching and Training Suggested by Classroom management Education Education Administration/ Management Teaching/ Training Workplace Work at office Employment Status Full Time Job Location Rangpur Apply Procedure Hard Copy আগ্রহী প্রার্থীদেরকে জীবন বৃত্তান্ত, শিক্ষাগত যোগ্যতা ও অভিজ্ঞতার সনদের ফটোকপি এবং সদ্যতোলা পাসপোর্ট সাইজ ছবি ২ কপি (সত্যায়িত) সহ আবেদনপত্র আগামী ০৯/১০/২০২৫ ইং তারিখের মধ্যে নিম্ন ঠিকানায় পৌঁছাতে হবে। আবেদনপত্রের সাথে ইন্টারন্যাশনাল পিস স্কুল অ্যান্ড কলেজ, রংপুর এর অনুকূলে ইসলামী ব্যাংক বাংলাদেশ পিএলসি বাস টার্মিনাল উপশাখা বরাবর ৭০০/- টাকার পে-অর্ডার (অফেরতযোগ্য) সংযুক্ত করতে হবে। আবেদনপত্র জমাদানের ঠিকানা- নির্বাহী পরিচালক, ইন্টারন্যাশনাল পিস স্কুল অ্যান্ড কলেজ, রংপুর। ৭১/১ আর কে রোড, ইসলামবাগ, রংপুর মোবাইল: ০১৭১২-৬৬৫১৫৭, ০১৭১৭-০১৭৫১৫, ০১৭১৭-৫২৮০৩৪, ০১৭১৭-৯২৮২৭২ সকল পদের বয়স সরকারি বিধি মোতাবেক, তবে দক্ষ ও অভিজ্ঞ প্রার্থীদের জন্য বয়সসীমা শিথিলযোগ্য। চাকরিরত প্রার্থীদের যথাযথ কর্তৃপক্ষের মাধ্যমে আবেদন করতে হবে। পরীক্ষার সময় মূল সনদ দেখাতে হবে। শিক্ষাগত যোগ্যতার ক্ষেত্রে কোন তৃতীয় বিভাগ/শ্রেণী গ্রহণযোগ্য হবে না। প্রস্তাবিত ক্যাম্পাস-বাসা নং- ১৪, রোড নং-০১, ডিসি মোড়, রংপুর। Company Information International Peace School & College, Rangpur Follow Address: HOUSE # 14, ROAD # 01, DC MORE, RANGPUR Business: A TRILINGUAL CARING EDUCATION Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেত"
  },
  {
    "url": "https://bdjobs.com/h/details/1458052?ln=1",
    "company_name": "Flow Sleek",
    "job_title": "SEO Data Entry Executive (Part Time)",
    "location": "Khulna",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "SEO Data Entry Executive (Part Time) : Flow Sleek Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Flow Sleek SEO Data Entry Executive (Part Time) Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Age: 18 to 30 years Location: Khulna Salary: Tk. 5000 - 5000 (Monthly) Published: 12 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 30 years প্রথম ১৫ দিন আমরা আপনাকে কাজ শিখিয়ে নেব এই সময় ট্রায়িং পিরিয়ড হিশেবে গণ্য হবে। আগে থেকে কম্পিউটার চালানোতে পারদর্শী হলে তাকে প্রাধান্য দেয়া হবে। দৌলতপুর এর আশে পাশে বাসা হলে তাকে প্রাধান্য দেয়া হবে। Responsibilities & Context অফিসের সময় আমরা আপনাকে ট্রেনিং দিব, এবং আপনাদের প্র্যাক্টিকাল অফিসের কাজ করতে হবে। অফিস সময় সকাল ৯ টা থেকে দুপুর ২ টা পর্যন্ত অথবা ৩ টা থেকে ৮ টা পর্যন্ত । কেউ বেশি কাজ করলে সেই অনুযায়ী পেমেন্ট পাবে এসইও: অন-পেইজ , অফ-পেইজ , মেটা ট্যাগস, কীওয়ার্ড এনালাইসিস, এসইও টুলস, লিঙ্ক বিল্ডিং, ওয়েবসাইট বেসিক ডিজাইন, কেস স্টাডিজ এবং লাইভ প্রোজেক্ট। এই দুই শিফট এ কাজ করার সুযোগ আছে । Compensation & Other Benefits পার্ট টাইম কাজের সুযোগ আছে। দৌলতপুর এর আশে পাশে বাসা হলে তাকে প্রাধান্য দেয়া হবে। কম্পিউটার চালানোতে পারদর্শী হলে তাকে প্রাধান্য দেয়া হবে। Employment Status Part Time Gender Only males are allowed to apply. Job Location Khulna Company Information Flow Sleek Follow Address: Beside Daulotpur Sub-registry Office, Kulibagan, Daulotpur, Khulna Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter C"
  },
  {
    "url": "https://bdjobs.com/h/details/1459417?ln=1",
    "company_name": "Eproshnobank",
    "job_title": "Customer Care & Call Center Executive / Moderator",
    "location": "Mohasthan",
    "salary": "Tk. 10000 - 18000 (Monthly)",
    "experience": null,
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Customer Care & Call Center Executive / Moderator : Eproshnobank Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Eproshnobank Customer Care & Call Center Executive / Moderator Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 10 Age: 22 to 35 years Location: Bogura (Bogura Sadar) Salary: Tk. 10000 - 18000 (Monthly) Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 22 to 35 years Should be able to work under pressure. Must have basic typing skills. Experience in customer service is a plus (not mandatory). Responsibilities & Context Must have good communication skills (can speak clearly and politely). Must know how to use smartphone and basic computer. Must be friendly, patient, and helpful with customers. Should answer customer calls, messages, and emails. Must solve customer problems quickly and correctly. Must work well in a team. Job Location: Mohasthan , Bogura (Bogura Sadar) Skills & Expertise Call Center Operation Good comunication skill MS Office Workplace Work at office Employment Status Full Time Job Location Bogura (Bogura Sadar) Company Information Eproshnobank Follow More jobs from this company Address: Mohasthan, bogura sadar Website: eproshnobank.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management"
  },
  {
    "url": "https://bdjobs.com/h/details/1459449?ln=1",
    "company_name": "Dreamco Express",
    "job_title": "Junior Executive",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Junior Executive : Dreamco Express Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dreamco Express Junior Executive Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 20 to 35 years Location: Dhaka Salary: Tk. 15000 - 20000 (Monthly) Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 35 years Responsibilities & Context Office admin Documentation support Handling calls, emails and client coordination Skills & Expertise Communication Fluent in English Speaking Microsoft Office Suggested by Administration Documentation Management Compensation & Other Benefits Mobile bill Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information Dreamco Express Follow Address: House -15, Road-10, Sector -1 Uttara Dhaka Website: https://dreamcoexpressbd.com/ Business: Dreamco Express is a courier company with its head quarter found in Bangladesh. Core-specialty in providing personalized logistics solutions to its clients. Dreamco Express is effectively giving benefit to their important clients for more than 25 years. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now"
  },
  {
    "url": "https://bdjobs.com/h/details/1459678?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "Area Manager - Marketing And Sales",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 30000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Area Manager - Marketing And Sales : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD Area Manager - Marketing And Sales Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 30 Age: 25 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 30000 - 35000 (Monthly) Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context সারা দেশে বিক্রয় বৃদ্ধির জন্য জনবল নিয়োগ করা হবে Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Agro Farm BD Follow Address: Kathalbaria, Lakshmipur Hat, Natore Sadar, Natore Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account "
  },
  {
    "url": "https://bdjobs.com/h/details/1459518?ln=1",
    "company_name": "Hawker Limited",
    "job_title": "Data Entry & Operation Executive",
    "location": "Dhaka (Mohakhali)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Data Entry & Operation Executive : Hawker Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hawker Limited Data Entry & Operation Executive Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 35 years Location: Dhaka (Mohakhali) Salary: Tk. 10000 - 20000 (Monthly) Published: 15 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 35 years The Candidate must be a non-smoker Willingness to work long hours even on any national holidays. Skill in Internet Browsing and email correspondence. Good typing speed in both Bangla & English. Responsibilities & Context Data entry in Web based software and Media Monitoring Portal. Have to operate in Adobe Photoshop, Illustrator, MS Word, and Excel programs. Any other task assigns by the management. Should be dedicated to daily task completion. Keep close coordination with co-workers and update information. Skills & Expertise Internet browsing & online work ability. Suggested by Data Entry (Both English & Bengali) Fast typing skill Compensation & Other Benefits Festival Bonus: 2 Salary Review: Yearly Friendly Working Environment and Collaborative Work Culture Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mohakhali) Company Information Hawker Limited Follow Address: Richmond Concord (2nd Floor) 68, Gulshan Avenue, Gulshan-1, Dhaka Business: Hawker Limited - A leading Media Monitoring Organization in Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Registe"
  },
  {
    "url": "https://bdjobs.com/h/details/1456617?ln=1",
    "company_name": "ARAB JERUSALEM",
    "job_title": "Accountant Store Keeper",
    "location": "Dhaka (Turag)",
    "salary": "Tk. 20000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Accountant Store Keeper : ARAB JERUSALEM Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ARAB JERUSALEM Accountant Store Keeper Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 20 to 35 years Location: Dhaka (Turag) Salary: Tk. 20000 - 35000 (Monthly) Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Responsibilities & Context Job Duty and Responsibility # Store inventory record Receiving and inventory Goods of Input and Output Accountant Store data Goods Inventory by data wise with customer Shipment documents Packing documents Computer data entry excel, posting of Tally software. Record and reporting warehouse to office accountant. Bill of Inventory at Warehouse, warehouse staff, qc bill, warehouse bill, goods bill etc. data recorded. Skills & Expertise COMPUTER OFFICE MANAGEMENT Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Turag) Company Information ARAB JERUSALEM Follow Address: House - 27 Gasul azam avenue , sector -14 , dhaka - 1230 Business: Arab Jerusalem is a premier buying house dedicated to bridging the gap between global buyers and quality manufacturers. We specialize in sourcing, negotiating, and streamlining the procurement process to ensure our clients get the best products at competitive prices.\n?At Arab Jerusalem, we act as your trusted partner on the ground—managing everything from factory selection to quality control—so you can focus on growing your business with confidence. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das "
  },
  {
    "url": "https://bdjobs.com/h/details/1459656?ln=1",
    "company_name": "Enrich Business System",
    "job_title": "Executive , sales and marketing",
    "location": "Dhaka",
    "salary": "Tk. 15000 - 18000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Executive , sales and marketing : Enrich Business System Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Enrich Business System Executive , sales and marketing Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 10 Age: 20 to 40 years Location: Dhaka Salary: Tk. 15000 - 18000 (Monthly) Published: 15 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Additional Requirements Age 20 to 40 years Responsibilities & Context Resposibility 1.Identify and approach new customers 2.Promote and sell company imported products. 3Achieve sales target 4.Assist in digital marketing Skill 1.Good communication and negotiation skills 2.Customer handling ability 3.Confidence and honesty 4.Self driven and accept challenges Employment Status Full Time Job Location Dhaka Company Information Enrich Business System Follow Address: Planners Tower, Floor 16, Suit 1, Banglamotor, Dhaka Website: www.rmi-bd.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Conta"
  }
]