[
  {
    "url": "https://bdjobs.com/h/details/1456574?ln=1",
    "company_name": "Hireaxies Career Solution",
    "job_title": "Content & Marketing Executive",
    "location": "Dhaka (Shantinagar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Content & Marketing Executive : Hireaxies Career Solution Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hireaxies Career Solution Content & Marketing Executive Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 18 to 40 years Location: Dhaka (Shantinagar) Salary: Tk. 12000 - 20000 (Monthly) Published: 03 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 40 years Creativity, storytelling ability, and understanding of digital marketing trends. Ability to work independently and deliver results within deadlines. Proven experience in video recording & editing (using DSLR/phone camera and editing software). Strong skills in editing software such as Adobe Premiere Pro, Final Cut Pro, CapCut, Filmora, or similar tools. Knowledge of social media video formats, transitions, subtitles, and motion graphics. Ability to shoot professional-quality videos with proper lighting, framing, and audio. Basic graphic design skills will be an added advantage. Experience in social media video content creation & marketing Basic understanding of overseas jobs / visa / recruitment industry (preferred) Confident in front of camera (Bangla speaking mandatory, English a plus) Skills in video shooting & editing (mobile or camera-based) Creative mindset with result-oriented attitude Responsibilities & Context HireAxies is a growing overseas recruitment & visa consultancy company based in Bangladesh, working with Europe, Middle East & Asia markets. Team Size: 10+ dedicated professionals (Recruitment, Visa Processing, Marketing) Position: Visa Consultant – Content Creator & Social Media Video Marketer HireAxies is looking for a creative, energetic, and result-driven professional who can combine visa consultancy knowledge with social media video marketing . This role is focused on creating powerful short-form video content to attract candidates, promote overseas job opportunities, and directly build candidate pipelines for our recruitment & visa services. Key Responsibilities Create engaging short-form video content (Reels, TikTok, YouTube Shorts, Facebook, LinkedIn) for overseas job & visa promotion Present job circulars, visa updates, candidate stories, and HireAxies services through video Plan, script, shoot, and edit videos with clear call-to-action for candidate applications Coordinate with Recruitment & HR team to understand manpower requirements Actively promote overseas jobs, work permits, and visa consultancy services Manage HireAxies’ social media platforms with regular posting and engagement Research video trends to attract quality candidates Track campaign performance (views, leads, applications) and optimize content Maintain HireAxies brand image with pro"
  },
  {
    "url": "https://bdjobs.com/h/details/1456941?ln=1",
    "company_name": "The IBN SINA Pharmaceutical Industry PLC",
    "job_title": "Manager/ Sr. Manager/Assistant General Manager, Manufacturing Science & Technology",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Manager/ Sr. Manager/Assistant General Manager, Manufacturing Science & Technology : The IBN SINA Pharmaceutical Industry PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The IBN SINA Pharmaceutical Industry PLC Manager/ Sr. Manager/Assistant General Manager, Manufacturing Science & Technology Application Deadline : 19 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have experience in the following business area(s): Pharmaceutical Companies. Maximum age 45 years. Age and position may be relaxed in case of deserving candidates. Responsibilities & Context Scientific evolution and lifecycle management of manufacturing processes. Process validation, revalidation and continued process verification (CPV). Technology transfer activities (R&D to commercial scale and site-to-site transfer). Statistical data analysis, process capability evaluation and trend monitoring. Support in deviation investigations, root cause analysis and CAPA implementation. Quality Risk Management (QRM) in accordance with EU GMP and PIC/S expectations. Scientific assessment and justification of change control activates. Continuous process improvement based on GMP data, Scientific evidence and regulatory expectations. Preparation, review and maintenance of MS&T-related documents in compliance with EU GMP and PIC/S standards. Skills & Expertise Suggested by Microbiology SOP Process Validation Trend Analysis Compensation & Other Benefits Medical allowance,Profit share,Provident fund,Gratuity,Mobile bill Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 As per company rules. Workplace Work at office Employment Status Full Time Job Location Gazipur Read Before Apply Appeared candidates need not to apply. Departmental candidates having requisite qualifications and candidates those who are in job elsewhere will apply through proper channel. Incomplete or unsigned or wrong/false information applications will be rejected outright. Apply Procedure Hard Copy Candidates with good moral character, attractive personality, sound health & active nature are encouraged to apply with Cover letter, details & updated CV and copies of all academic/professional and experience certificates along with contact numbers & 3 copies of recent color photographs, copy of National ID card (all duly attested) mentioning the name of the applied post on the top of envelop latest by 19 February, 2026 during office hour to the following address. Human Resource Department. The IBN SINA Pharmaceutical Industry PLC. Tanin Center, 3 Asad Gate, Mirpur Road, Mohammadpur, Dhaka-1207 (Only short-listed candidates will be called for interview) Company Information The IBN SINA Ph"
  },
  {
    "url": "https://bdjobs.com/h/details/1456954?ln=1",
    "company_name": "The IBN SINA Pharmaceutical Industry PLC",
    "job_title": "Manager/ Sr. Manager/Assistant General Manager, Quality Control",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Manager/ Sr. Manager/Assistant General Manager, Quality Control : The IBN SINA Pharmaceutical Industry PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The IBN SINA Pharmaceutical Industry PLC Manager/ Sr. Manager/Assistant General Manager, Quality Control Application Deadline : 19 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have experience in the following business area(s): Pharmaceutical Companies. Maximum age 45 years. Age and position may be relaxed in case of deserving candidates. Responsibilities & Context Establishment, implementation, and maintenance of an effective Quality Control system in compliance with EU GMP and PIC/S. Approval, control, and review of analytical methods, specifications, test procedures, and standard operating procedures. Oversight of sampling, testing and release of raw materials, packaging materials, in-process samples, bulk and fished products. Review, investigation and approval of OOS,OOT, laboratory deviations and related CAPA. Ensuring qualification, calibration and maintenance of laboratory instruments and equipment. Oversight of method validation, verification and transfer activities. Ensuring compliance with data integrity principles, documentation practices and laboratory GMP requirements. Approval and monitoring of stability studies and review of stability data. Ensuring adequate training and GMP competence of QC personnel. Support to internal audits, self-inspections and regulatory inspections. Skills & Expertise Suggested by Microbiology SOP Process Validation Trend Analysis Compensation & Other Benefits Medical allowance,Profit share,Provident fund,Gratuity,Mobile bill Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 As per company rules. Workplace Work at office Employment Status Full Time Job Location Gazipur Read Before Apply Appeared candidates need not to apply. Departmental candidates having requisite qualifications and candidates those who are in job elsewhere will apply through proper channel. Incomplete or unsigned or wrong/false information applications will be rejected outright. Apply Procedure Hard Copy Candidates with good moral character, attractive personality, sound health & active nature are encouraged to apply with Cover letter, details & updated CV and copies of all academic/professional and experience certificates along with contact numbers & 3 copies of recent color photographs, copy of National ID card (all duly attested) mentioning the name of the applied post on the top of envelop latest by 19 February, 2026 during office hour to the following address. Human Resource Department. The IBN SINA Pharmaceutical Industry PLC. Tanin "
  },
  {
    "url": "https://bdjobs.com/h/details/1457113?ln=1",
    "company_name": "The IBN SINA Pharmaceutical Industry PLC",
    "job_title": "Manager/ Sr. Manager/Assistant General Manager, Quality Assurance",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Manager/ Sr. Manager/Assistant General Manager, Quality Assurance : The IBN SINA Pharmaceutical Industry PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The IBN SINA Pharmaceutical Industry PLC Manager/ Sr. Manager/Assistant General Manager, Quality Assurance Application Deadline : 19 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have experience in the following business area(s): Pharmaceutical Companies. Maximum age 45 years. Age and position may be relaxed in case of deserving candidates. Responsibilities & Context Establishment, implementation, and maintenance of an effective Pharmaceutical Quality system (PQS). Oversight and approval of GMP-related documents including SOPs, BMRs, BPRs, protocols and reports. Review and approval of deviations, OOS/OOT, change controls, risk assessments and related CAPA. Final disposition decisions for starting materials, packaging materials, intermediates, bulk and finished products. Oversight of process validation, cleaning validation, qualification activities and continued process verification. Ensuring implementation of quality Risk Management (QRM) principles as per EU GMP and PIC/S. Approval and monitoring of training programs to ensure persoonnel GMP competence. Oversight of self-inspections, internal audits and regulatory inspections. Review of product quality review (PQR/APQR) and ongoing quality performance trends. Ensuring data integrity, documentation compliance and GMP culture across all department. Compensation & Other Benefits Medical allowance,Profit share,Provident fund,Gratuity,Mobile bill Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 As per company rules. Workplace Work at office Employment Status Full Time Job Location Gazipur Read Before Apply Appeared candidates need not to apply. Departmental candidates having requisite qualifications and candidates those who are in job elsewhere will apply through proper channel. Incomplete or unsigned or wrong/false information applications will be rejected outright. Apply Procedure Hard Copy Candidates with good moral character, attractive personality, sound health & active nature are encouraged to apply with Cover letter, details & updated CV and copies of all academic/professional and experience certificates along with contact numbers & 3 copies of recent color photographs, copy of National ID card (all duly attested) mentioning the name of the applied post on the top of envelop latest by 19 February, 2026 during office hour to the following address. Human Resource Department. The IBN SINA Pharmaceutical Industry PLC. Tanin Center, 3 Asad Gate, Mirpur Road, Mohammadpur, Dhaka-1207 (Only short-li"
  },
  {
    "url": "https://bdjobs.com/h/details/1456851?ln=1",
    "company_name": "EDGE Education Bangladesh",
    "job_title": "Counselor / Sr. Counselor",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "14 Feb 2026",
    "job_description": "Counselor / Sr. Counselor : EDGE Education Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List EDGE Education Bangladesh Counselor / Sr. Counselor Application Deadline : 14 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 22 to 45 years Location: Dhaka Published: 04 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 22 to 45 years Minimum 1-2 years of experience in education consultancy or related fields. Strong knowledge of UK, Australia, Canada, Europe and USA university admission processes. Ability to assess students` academic and financial situations. Expertise in visa processing, SOP writing, and document preparation. Exceptional communication and interpersonal skills. Ability to work under pressure and meet deadlines. Responsibilities & Context Provide expert counseling services for students aspiring to study in the UK, Australia, Canada, Europe, and the USA. Assist with university selection, application submission, and visa procedures. Assess students` academic qualifications, English proficiency, and financial suitability. Conduct seminars, workshops, and information sessions on study abroad opportunities. Stay updated with university admission criteria, scholarships, and visa regulations. Support students with document preparation, including Statement of Purpose (SOP) and other required documents. Track and manage applications to ensure timely submission. Maintain strong relationships with universities, colleges, and partners. Skills & Expertise Education Counseling Student Counseling Student Visa Processing Suggested by study abroad Travel management UK Visa Processing Visa Processing Compensation & Other Benefits Negotiate Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information EDGE Education Bangladesh Follow More jobs from this company Address: Suite – 206 & 208, Hosna Center, Lift – 02, 106 Gulshan Ave, Dhaka – 1212, Bangladesh Website: https://myedgeeducation.com/ Business: Established with a commitment to empowering students to pursue their dreams of higher education abroad, EDGE Education Bangladesh stands as a beacon of guidance and support in the realm of international education consultancy. At EDGE Education Bangladesh, we understand the transformative power of education and the profound impact it can have on an individual`s life. With this ethos at our core, we strive to provide comprehensive and personalized consultancy services to students aspiring to study overseas. Our team comprises experienced professionals who possess in-depth knowledge of the global education landscape, ensuring that every student receives tailored guidance and assistance throughout their journey. From selecting the right acade"
  },
  {
    "url": "https://bdjobs.com/h/details/1456582?ln=1",
    "company_name": "Dream Life Travels",
    "job_title": "Receptionist (Female)",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Receptionist (Female) : Dream Life Travels Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dream Life Travels Receptionist (Female) Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 20 to 31 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 03 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 31 years Smart and Good Looking. Good Team Player. Self- Motivate and Problem Solving Skills. Multi-tasking Abilities. Excellent knowledge of MS Office (especially English and Bangla typing). Responsibilities & Context We are looking for a Receptionist who are smart, intelligent, ambitious, and must have Good communication skills. Handle phone calls incoming/outgoing with greetings in a professional way. Receive letters, messages, and documents and pass them to proper places/persons and keep records. Provide necessary information to the Client, and take messages. Internal & External clients handle with good smiley mannerism and well behavior. Maintains a safe and clean reception area by complying with procedures and rules. Received phone call & transfer it Skills & Expertise Suggested by Guest Relations Services MS Office Receptionist/ Front Desk Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Anywhere in Bangladesh Company Information Dream Life Travels Follow More jobs from this company Address: House # 18 (3rd Floor) ,Rabindra Sarani Road ,Sector # 11, Uttara,Dhaka-1230 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms"
  },
  {
    "url": "https://bdjobs.com/h/details/1456060?ln=1",
    "company_name": "Bug Finder",
    "job_title": "Flutter Developer",
    "location": "Bangladesh, Dhaka, Dhaka (Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Feb 2026",
    "job_description": "Flutter Developer : Bug Finder Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bug Finder Flutter Developer Application Deadline : 12 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Bangladesh, Dhaka, Dhaka ... Bangladesh, Dhaka, Dhaka (Uttara) Salary: Tk. 20000 - 35000 (Monthly) Published: 02 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Strong proficiency in Dart programming language Proven experience in mobile app development using Flutter framework. Solid understanding of object-oriented programming principles. Familiarity with RESTful APIs and integration techniques Knowledge of mobile app architecture patterns such as MVC or MVVM. Experience with version control systems, preferably Git. Understanding of UI/UX design principles and ability to work closely with designers. Strong problem-solving and analytical skills. Excellent communication and collaboration abilities. Responsibilities & Context Bug Finder is seeking a skilled Flutter developer to join our dynamic development team. As a Flutter developer, you will be responsible for designing, developing, and maintaining cross-platform mobile applications using the Flutter framework. You will work closely with our UI/UX designers and backend developers to create intuitive and performant mobile experiences for our clients. Core Responsibilities: Develop and maintain high-quality, cross-platform mobile applications using Flutter. Collaborate with UI/UX designers to create visually appealing and user-friendly interfaces Integrate with backend services and APIs to ensure seamless data flow and functionality. Implement and maintain state management solutions within the Flutter framework Write clean, efficient, and reusable code following best practices and design patterns. Conduct thorough testing and debugging to ensure app performance and stability. Stay up-to-date with the latest Flutter and mobile development trends and technologies. Participate in code reviews and provide constructive feedback to team members. Skills & Expertise Flutter iOS Mobile App Development Mobile apps developer Suggested by React NativeFlutter UI/UX Design Compensation & Other Benefits Tour allowance,Performance bonus Festival Bonus: 2 Salary Review: Yearly Friendly working environment with friendly teammates Flexible vacation and paid leave Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Bangladesh, Dhaka, Dhaka (Uttara) Company Information Bug Finder Follow Address: House# A3, Road# 14, Sector# 11, Uttara, Dhaka-1230 Website: https://bugfinder.net Business: We are totally focused on delivering high quality Cloud Service & software solution. We have completed development projects for international clients in many market sectors"
  },
  {
    "url": "https://bdjobs.com/h/details/1455538?ln=1",
    "company_name": "StudyMint",
    "job_title": "Student Counselor",
    "location": "Rajshahi (Rajshahi Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "08 Feb 2026",
    "job_description": "Student Counselor : StudyMint Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List StudyMint Student Counselor Application Deadline : 08 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 02 Location: Rajshahi (Rajshahi Sadar) Salary: Tk. 13000 - 18000 (Monthly) Published: 31 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 1 year of working experience in any Student Consultancy Firm Must have practical knowledge and counseling experience for UK, USA, Canada, Australia, Malaysia, and European countries Proven experience in student counseling (minimum 1 year) Strong communication and interpersonal skills Target-oriented and professional attitude Ability to work independently and as part of a team Responsibilities & Context Provide professional counseling to students regarding overseas study options Guide students on course selection, universities, and countries Assist with admission procedures and documentation Maintain proper communication with students and institutions Support visa application processes and follow-ups Skills & Expertise Suggested by Education Counseling Student Counseling Visa Processing Compensation & Other Benefits Mobile bill Salary Review: Half Yearly Festival Bonus: 1 Workplace Work at office Employment Status Full Time Job Location Rajshahi (Rajshahi Sadar) Company Information StudyMint Follow Address: 49, Level-04, Northern SR Tower, Old Airport Road, Tejkunipara, Dhaka-1215 Website: www.studymint.org Business: We are a student consultancy firm that supports students with their admission and scholarship. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (S"
  },
  {
    "url": "https://bdjobs.com/h/details/1456091?ln=1",
    "company_name": "Bonafide Group",
    "job_title": "Security Officer",
    "location": "Narayanganj",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "03 Mar 2026",
    "job_description": "Security Officer : Bonafide Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bonafide Group Security Officer Application Deadline : 03 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 4 Location: Narayanganj Published: 02 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Retired person from Army & above post from Honorary Captain. Responsibilities & Context Administrative Operations Assist in managing day-to-day administrative activities. Implement and follow admin policies, SOPs & office rules. Ensure smooth operation of office, factory, showroom & site offices. Maintain office discipline and work environment. Support Staff & Manpower Management Supervise support staff, drivers, security & housekeeping. Prepare duty rosters, attendance & leave records. Handle admin-related staff issues and welfare matters. Support recruitment logistics and employee onboarding (admin side). Facilities, Assets & Logistics Manage office facilities, furniture, equipment & utilities. Maintain records of company assets & inventory. Coordinate vehicle management, transport & maintenance. Oversee guest house, accommodation & travel arrangements. Security, Safety & Compliance Ensure security systems & access control are functional. Assist in implementing fire safety & workplace safety measures. Support compliance with Trade License, Fire License, Factory License, etc. Liaise with local authorities, service providers & utility offices. Cost Control & Procurement Assist in preparing and monitoring admin budget. Control admin expenses and recommend cost-saving measures. Procure office supplies and services following company policy. Verify bills, quotations & invoices before submission. Skills & Expertise Suggested by Security Security Management Workplace Work at office Employment Status Full Time Job Location Narayanganj Company Information Bonafide Group Follow More jobs from this company Address: 37, Box Culvert Road Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Mana"
  },
  {
    "url": "https://bdjobs.com/h/details/1456875?ln=1",
    "company_name": "New Modern Hospital {24/7}",
    "job_title": "পরিচর্যাকারী/আয়া",
    "location": "Rajshahi, Rajshahi (Tanore)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "পরিচর্যাকারী/আয়া : New Modern Hospital {24/7} Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List New Modern Hospital {24/7} পরিচর্যাকারী/আয়া Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 20 to 35 years Location: Rajshahi, Rajshahi (Tanor... Rajshahi, Rajshahi (Tanore) Salary: Negotiable Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience Additional Requirements Age 20 to 35 years অভিজ্ঞতা: শিশু বা রোগী পরিচর্যায় পূর্ব অভিজ্ঞতা থাকা বাঞ্ছনীয়। যোগ্যতা: শৃঙ্খলাপরায়ণ, দায়িত্বশীল এবং ধৈর্যশীল হতে হবে। Responsibilities & Context কাজের ক্ষেত্র: বাসা বা কেয়ার সেন্টার। Skills & Expertise Suggested by Nanny Compensation & Other Benefits সুবিধাদি: কাজের ধরন অনুযায়ী বেতন ও অন্যান্য সুযোগ-সুবিধা আলোচনা সাপেক্ষে। Employment Status Full Time Gender Only females are allowed to apply. Job Location Rajshahi, Rajshahi (Tanore) Company Information New Modern Hospital {24/7} Follow Address: Tanore Gollapara Bazer, Tanore, Rajshahi Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1455587?ln=1",
    "company_name": "Aster Lifestyle",
    "job_title": "Showroom Sales Executive (Female)",
    "location": "Dhaka (Dhanmondi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Feb 2026",
    "job_description": "Showroom Sales Executive (Female) : Aster Lifestyle Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Aster Lifestyle Showroom Sales Executive (Female) Application Deadline : 10 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 6 Age: 18 to 30 years Location: Dhaka (Dhanmondi) Salary: Tk. 12000 - 15000 (Monthly) Published: 31 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 30 years সেলস অভিজ্ঞতা থাকলে অগ্রাধিকার ফ্রেশ প্রার্থী আবেদন করতে পারবে শুধুমাত্র মহিলা প্রার্থী ভালো যোগাযোগ দক্ষতা দায়িত্বশীল ও পরিশ্রমী সেলস বিষয়ে আগ্রহ থাকতে হবে Responsibilities & Context শোরুমে কাস্টমারকে পণ্য দেখানো ও বিক্রয় করা অনলাইন অর্ডার সাপোর্ট করা (যদি প্রয়োজন হয়) কাস্টমারের সাথে ভদ্র ও প্রফেশনাল আচরণ করা পণ্যের বিস্তারিত তথ্য কাস্টমারকে বুঝানো শোরুম ডিসপ্লে ও পরিষ্কার-পরিচ্ছন্নতা বজায় রাখা Skills & Expertise Suggested by SHOWROOM SALESMAN Showroom Sales and Marketing Showroom operation Compensation & Other Benefits উৎসব বোনাস ওভারটাইম সুবিধা (প্রযোজ্য ক্ষেত্রে) অন্যান্য কোম্পানি সুবিধা Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Dhanmondi) Company Information Aster Lifestyle Follow Address: level 4, Mir Onyx Yakub Tower, Dhanmondi Road # 6, holding # 17, Dhaka 1205 Business: Aster Lifestyle Bd is a Woman Online Clothing Store. Our journey has started from 2019. We have been selling Sharee wholesale and retail with good reputation all over the country. You can find many kinds of three pieces here, Various attractive sarees of Bangladesh we sell wholesale.\nThese is our products:-\nAster 2 PCS Anarkoli, Aster 1 PCS Anarkoli, Aster 3 PCS Collection, Indian 2 PCS Kurti, Indian 1 PCS Kurti, Indian 2 PCS Grawoon.\n- 3 PCS Indian:- Indian Boutique Collection, Indian One Digital Print, Indian Arikaj, Indian luxurious Shifun, Dille Boutique Collection\n- Pakistani 3 Pcs:- Pakistani Brand 3 Pcs, Pakistani Boutique, Pakistani, Digital Print, Ladies Pant Collection.\n- Plazu :- Kurti Plazu, Tops Plazu, Skart Plazu, Plazu Pants\n- Sharee :- Jamdani sharee, Tangail sharee, Dhakaiya Sharee, Designer Sharee, Silk Sharee, Katan Sharee Etc. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Y"
  },
  {
    "url": "https://bdjobs.com/h/details/1456983?ln=1",
    "company_name": "The IBN SINA Pharmaceutical Industry PLC",
    "job_title": "Manager/ Sr. Manager/ Assistant General Manager, R&D",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Manager/ Sr. Manager/ Assistant General Manager, R&D : The IBN SINA Pharmaceutical Industry PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The IBN SINA Pharmaceutical Industry PLC Manager/ Sr. Manager/ Assistant General Manager, R&D Application Deadline : 19 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have experience in the following business area(s): Pharmaceutical Companies. Maximum age 45 years. Age and position may be relaxed in case of deserving candidates. Responsibilities & Context Establishment, implementation and maintenance of analytical development systems in alignment with EU GMP & PIC/S. Development, optimization and lifecycle management of analytical methods for APIs intermediates and finished products. Planning, execution and approval of analytical method validation, verification and robustness studies. Analytical support for technology transfer, process validation and commercial manufacturing. Scientific evaluation & investigation support for OOS, OOT, deviation and root cause analysis. Ensuring compliance with data integrity principles (ALCO+) in analytical development activities. Preparation, review and approval of AR&D protocols, reports, specification and related documentation. Collaboration with QA,QC Regulatory Affairs, and MS&T for regulatory submission and responses. Ensuring appropriate training, qualification and GMP awareness of AR&D personnel. Support to internal audits, self-inspection, and regulatory inspections related to analytical development activities. Skills & Expertise Suggested by Microbiology SOP Process Validation Trend Analysis Compensation & Other Benefits Medical allowance,Profit share,Provident fund,Gratuity,Mobile bill Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 As per company rules. Workplace Work at office Employment Status Full Time Job Location Gazipur Read Before Apply Appeared candidates need not to apply. Departmental candidates having requisite qualifications and candidates those who are in job elsewhere will apply through proper channel. Incomplete or unsigned or wrong/false information applications will be rejected outright. Apply Procedure Hard Copy Candidates with good moral character, attractive personality, sound health & active nature are encouraged to apply with Cover letter, details & updated CV and copies of all academic/professional and experience certificates along with contact numbers & 3 copies of recent color photographs, copy of National ID card (all duly attested) mentioning the name of the applied post on the top of envelop latest by 19 February, 2026 during office hour to the following address. Human Resource Depart"
  },
  {
    "url": "https://bdjobs.com/h/details/1456899?ln=1",
    "company_name": "IDiO IT",
    "job_title": "Digital Marketing Manager",
    "location": "Dhaka (GULSHAN 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "14 Feb 2026",
    "job_description": "Digital Marketing Manager : IDiO IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List IDiO IT Digital Marketing Manager Application Deadline : 14 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 26 to 38 years Location: Dhaka (GULSHAN 1) Salary: Tk. 35000 - 40000 (Monthly) Published: 04 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 38 years Hands-on experience in Google Ads, Facebook Ads, LinkedIn Ads, YouTube Strong SEO, SEM, PPC & analytics knowledge CRM & marketing automation experience Strong content, ad copy & creative planning skills Knowledge of video marketing & drone videography (real estate) Excellent communication & reporting skills Ability to handle pressure & multiple campaigns Responsibilities & Context Plan, develop, and execute the overall Digital Marketing Strategy of the company. Manage and optimize digital marketing campaigns on Facebook, Google, YouTube, LinkedIn, and other platforms . Ensure effective lead generation with strong focus on lead quality and conversion . Analyze and optimize ROI (Return on Investment) and CPL (Cost Per Lead) . Develop strategies to generate high-quality leads for residential and commercial real estate projects . Plan, execute, and optimize SEO, SEM, PPC, display advertising, and email marketing campaigns . Implement and monitor retargeting and remarketing campaigns . Optimize landing pages and ad creatives for maximum conversion rate. Lead, supervise, and guide content creation and creative strategy (video, banner, copy, social content). Manage social media platforms including Facebook, Instagram, YouTube, LinkedIn, Twitter , etc. Coordinate closely with the Sales Team to improve lead-to-site visit and lead-to-booking ratios. Analyze performance data using Google Analytics, Meta Insights, and other tools . Prepare regular reports on traffic, engagement, leads, conversions, ROI, and CPL. Integrate digital marketing campaigns with CRM systems for lead nurturing and follow-up. Monitor online reviews, messages, and customer feedback to enhance brand reputation. Stay updated with the latest digital marketing trends, tools, and best practices. Skills & Expertise Digital Marketing Campaign Hospitality marketing or digital advertising Market Research and analysis Social Media Campaign Social Media Management Suggested by Digital Marketing (Social Media Marketing) Market Research and Development Search Engine Optimization (SEO) SEO and SEM Strategic Planning Compensation & Other Benefits Salary Review: Half Yearly Festival Bonus: 2 Other Benefits: As per company policy Workplace Work at office Employment Status Full Time Job Location Dhaka (GULSHAN 1) Company Information IDiO IT Follow Address: Office Location:\nLotus Kamal Tower-02, Plot No: 59 & 61, Level 10,"
  },
  {
    "url": "https://bdjobs.com/h/details/1457194?ln=1",
    "company_name": "REBUILD COMPUTER",
    "job_title": "Sales Executive",
    "location": "Dhaka (Elephant Road)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Sales Executive : REBUILD COMPUTER Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List REBUILD COMPUTER Sales Executive Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Age: 18 to 30 years Location: Dhaka (Elephant Road) Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 30 years Responsibilities & Context Identify and develop new customers for IT products and solutions Promote and sell IT hardware, software, and related services Understand customer requirements and recommend suitable IT solutions Prepare and follow up on quotations, proposals, and sales orders Maintain strong relationships with existing clients to ensure repeat business Achieve assigned sales targets and contribute to company revenue growth Conduct product presentations and explain technical features to customers Coordinate with technical, support, and logistics teams for smooth order execution Keep records of sales activities, customer data, and follow-up reports Monitor market trends, competitor activities, and pricing strategies Handle corporate, retail, and B2B clients professionally Skills & Expertise Dhaka Sales & Marketing Suggested by Sales target Customer Service Client Service/ Marketing Client Relationship Management Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Elephant Road) Company Information REBUILD COMPUTER Follow Address: ELEPHANT ROAD, DHAKA-1205 Website: www.rebuildbd.com Business: COMPUTER ACCESSORIES IMPORTER AND WHOLESALER Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 018976"
  },
  {
    "url": "https://bdjobs.com/h/details/1455858?ln=1",
    "company_name": "Nobojatra Overseas",
    "job_title": "Marketing Officer/ Counselor",
    "location": "Dhaka (Ashkona)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Marketing Officer/ Counselor : Nobojatra Overseas Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nobojatra Overseas Marketing Officer/ Counselor Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 03 Location: Dhaka (Ashkona) Salary: Tk. 15000 - 25000 (Monthly) Published: 02 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Previous experience in a travel agency, marketing, or customer service role is an advantage. Strong communication and interpersonal skills. Knowledge of visa processes, and tourism trends is a plus. Proficiency in MS Office. Ability to work independently and as part of a team. Friendly, confident, customer-focused and well-organized. Able to multitask and work under pressure. Responsibilities & Context Promote, visa services and other agency offerings through online and offline channels. Assist in planning and executing marketing campaigns, promotions, and events. Manage and update social media platforms and assist with digital marketing content. Counsel clients on travel options, destinations, visa requirements. Maintain accurate client records and follow up on leads. Handle customer inquiries, complaints, and feedback professionally. Present and record company announcements, promotional messages, and marketing content on video. Represent the company professionally in video content for social media, website, and other digital platforms. Skills & Expertise Travel Agency Suggested by Visa Processing Sales & Marketing Compensation & Other Benefits Medical allowance,Mobile bill,Performance bonus Lunch Facilities: Full Subsidize Festival Bonus: 2 Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Ashkona) Company Information Nobojatra Overseas Follow More jobs from this company Address: SS tower(9th floor), askona, dakshinkhan,Dhaka Website: http://nobojatra.net Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities Accessible documentation and alternative formats Assistive Software, communication and computer devices Workstation or seating adaptations for easy use Offering Work from home Accessible Washrooms / Toilets Available Flexibl"
  },
  {
    "url": "https://bdjobs.com/h/details/1456936?ln=1",
    "company_name": "The IBN SINA Pharmaceutical Industry PLC",
    "job_title": "Manager/ Sr. Manager/ Assistant General Manager, Engineering (Maintenance & Utility)",
    "location": "Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Manager/ Sr. Manager/ Assistant General Manager, Engineering (Maintenance & Utility) : The IBN SINA Pharmaceutical Industry PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The IBN SINA Pharmaceutical Industry PLC Manager/ Sr. Manager/ Assistant General Manager, Engineering (Maintenance & Utility) Application Deadline : 19 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Gazipur Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements The applicants should have experience in the following business area(s): Pharmaceutical Companies. Maximum age 40 years. Age and position may be relaxed in case of deserving candidates. Responsibilities & Context Establishment, implementation and maintenance of GMP-compliant engineering and facility management system. Ensuring qualification, validation and lifecycle management of facilities, utilities and equipment (HVAC, water systems, compressed air, gases, electrical systems, etc.). Planning execution and control of preventive, breakdown, and predictive maintenance activities. Management of calibration, monitoring and control of critical instruments and utility parameters. Planning and execution of GMP-compliant engineering projects, renovation, expansions and new installations. Ensuring GMP-compliant facility and equipment design, layout, material/personnel flow, and contamination control. Oversight of change control, deviation management and CAPA related to engineering utilities and projects. Preparation, review and approval of engineering SOPs, URS, DQ, IQ, OQ, PQ protocols, reports and maintenance records. Application of Quality Risk Management (QRM) principles in engineering and project activities. Ensuring training, qualification and GMP awareness of engineering and project personnel. Support to validation activities, internal audits, self-inspection and regulatory inspections. Ensuring data integrity, documentation accuracy and logbook compliance for engineering systems. Skills & Expertise Suggested by Microbiology SOP Process Validation Trend Analysis Compensation & Other Benefits Medical allowance,Profit share,Provident fund,Gratuity,Mobile bill Salary Review: Yearly Lunch Facilities: Full Subsidize Festival Bonus: 2 As per company rules. Workplace Work at office Employment Status Full Time Job Location Gazipur Read Before Apply Appeared candidates need not to apply. Departmental candidates having requisite qualifications and candidates those who are in job elsewhere will apply through proper channel. Incomplete or unsigned or wrong/false information applications will be rejected outright. Apply Procedure Hard Copy Candidates with good moral character, attractive personality, sound health & active nature are encouraged to apply with Cover letter, details & updated "
  },
  {
    "url": "https://bdjobs.com/h/details/1457162?ln=1",
    "company_name": "Orfactor",
    "job_title": "PHP/Laravel Developer (Full-Time, On-Site)",
    "location": "Dhaka",
    "salary": "Tk. 25000 - 50000 (Monthly)",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "PHP/Laravel Developer (Full-Time, On-Site) : Orfactor Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Orfactor PHP/Laravel Developer (Full-Time, On-Site) Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 5 Location: Dhaka Salary: Tk. 25000 - 50000 (Monthly) Experience: 1 to 3 years Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience 1 to 3 years Responsibilities & Context Job Title: PHP/Laravel Developer (Full-Time, On-Site) Location: 50, lake circus, Kalabagan- Dhaka Experience Required: 1–2 years Job Description: We are looking for a motivated PHP/Laravel Developer to join our team. The ideal candidate will have hands-on experience in building and maintaining web applications using PHP and Laravel framework. This is an on-site position requiring collaboration with our development team to deliver high-quality software solutions. Responsibilities: Develop, maintain, and enhance web applications using PHP and Laravel framework. Write clean, efficient, and well-documented code. Collaborate with UI/UX designers, front-end developers, and other team members to implement new features. Troubleshoot and debug applications to optimize performance and security. Participate in code reviews and team meetings. Stay updated with the latest trends and technologies in web development. Requirements: Develop, maintain, and optimize web applications using the Laravel (PHP) framework. Write clean, secure, maintainable, and efficient code following best practices and Laravel standards. Collaborate with UI/UX designers, product managers, and frontend developers to implement new features. Design and integrate RESTful APIs for web and mobile applications. Ensure application performance, security, scalability, and reliability. Work with databases such as MySQL / PostgreSQL, including query optimization. Debug, troubleshoot, and fix application issues; continuously improve system performance. Implement authentication, authorization, and role-based access control. Participate in code reviews, provide constructive feedback, and maintain coding standards. Stay up to date with the latest Laravel, PHP, and web development trends. Benefits: Competitive salary. Friendly and collaborative work environment. Opportunities for professional growth and skill development. Skills & Expertise JavaScript JS JQuery AJAX Laravel Framework PHP (OOP) Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Orfactor Follow More jobs from this company Address: 50 lake circus,kalabagan, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানস"
  },
  {
    "url": "https://bdjobs.com/h/details/1457670?ln=1",
    "company_name": "mohasagor.com",
    "job_title": "Office Assistant",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Office Assistant : mohasagor.com Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List mohasagor.com Office Assistant Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Salary: Tk. 12000 - 15000 (Monthly) Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Skills & Expertise Suggested by Peon Office Assistance Compensation & Other Benefits Festival Bonus: 2 Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information mohasagor.com Follow Address: House-02, Lane-11, Block-A, Section-10, Mirpur (Benaroshi Palli), Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1457480?ln=1",
    "company_name": "Hope Visa Center",
    "job_title": "Counsellor",
    "location": "Dhaka (Agargaon, Badda, Banani, Kallyanpur, Kazipara, Mirpur, Mohakhali, Mohammadpur, Shewrapara, Shyamoli, Uttara)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Counsellor : Hope Visa Center Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hope Visa Center Counsellor Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 22 to 27 years Location: Dhaka (Agargaon, Badda, B... Dhaka (Agargaon, Badda, Banani, Kallyanpur, Kazipara, Mirpur, Mohakhali, Mohammadpur, Shewrapara, Shyamoli, Uttara) Salary: Negotiable Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 22 to 27 years Responsibilities & Context Provide personalized guidance and support to clients throughout the visa application process for study, work, or immigration purposes. Communicate with clients professionally via phone calls, WhatsApp, email, and in-person meetings. Assess clients’ profiles to determine visa eligibility and recommend suitable programs or destinations. Develop and nurture strong, trust-based relationships with clients to ensure high satisfaction and referral rates. Follow up with clients regularly to provide updates, clarify queries, and ensure smooth processing. Skills & Expertise Counseling Good communications Skill Hardworking and Passionate. Punctual Telecommunication Visa Processing Suggested by Education Counseling Student Counseling Compensation & Other Benefits Mobile bill,Performance bonus Festival Bonus: 2 Lunch Facilities: Full Subsidize Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Agargaon, Badda, Banani, Kallyanpur, Kazipara, Mirpur, Mohakhali, Mohammadpur, Shewrapara, Shyamoli, Uttara) Company Information Hope Visa Center Follow Address: 43/2, (3rd Floor), Ring Road, Shyamoli, Dhaka-1207. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employabil"
  },
  {
    "url": "https://bdjobs.com/h/details/1457632?ln=1",
    "company_name": "Canadian University of Bangladesh",
    "job_title": "Officer/Senior Officer - Registrar Office",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "·         Officer:",
    "education": "·         Master’s degree in any discipline (Business Administration preferred).",
    "deadline": "20 Feb 2026",
    "job_description": "Officer/Senior Officer - Registrar Office : Canadian University of Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Canadian University of Bangladesh Officer/Senior Officer - Registrar Office Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Published: 07 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Job Responsibilities: 1. Maintain and update student academic records (admission, registration, grades, and transcripts). 2. Prepare transcripts, certificates, testimonials, and other official documents. 3. Ensure accuracy and confidentiality of student data. 4. Process course registration and enrollment records. 5. Coordinate semester-wise student data and course offerings. 6. Assist in academic calendar implementation. 7. Compile and publish examination results. 8. Coordinate with departments for grade submission. 9. Maintain result archives and verification records. 10.  Verify student documents for admission and graduation. 11.  Respond to verification requests from external organizations. 12.  Issue official letters. 13.  Process graduation clearance. 14.  Prepare final transcripts and certificates. 15.  Assist in organizing convocation programs. 16.  Liaise with academic departments, accounts, admission office, and examination committee. 17.  Provide information and support to students regarding academic policies. 18.  Handle student queries and complaints professionally. 19.  Ensure compliance with UGC and university regulations. 20.  Prepare reports related to student enrollment, graduation statistics, etc. 21.  Maintain proper filing and documentation systems. Job Qualifications: Educational Qualification - ·         Master’s degree in any discipline (Business Administration preferred). ·         Good academic background. ·         Computer proficiency (MS Office, Excel, University ERP/LMS systems). Experience - ·         Officer: 1–3 years of experience in academic administration (freshers may apply in some cases). ·         Senior Officer: 3–5+ years of relevant experience in registrar/academic affairs. ·         Strong understanding of university academic policies. Applicants can apply through email if find any difficulties: career@cub.edu.bd Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Canadian University of Bangladesh Follow Address: RANGS RL SQUARE, Pragati Sharani (Bir Uttam Rafiqul Islam Avenue), Dhaka 1212, Bangladesh. Business: University Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানক"
  },
  {
    "url": "https://bdjobs.com/h/details/1457656?ln=1",
    "company_name": "STAR VISA CONSULTANCY",
    "job_title": "IT Executive",
    "location": "Dhaka",
    "salary": "Tk. 15000 - 17000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "IT Executive : STAR VISA CONSULTANCY Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List STAR VISA CONSULTANCY IT Executive Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 19 to 25 years Location: Dhaka Salary: Tk. 15000 - 17000 (Monthly) Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 19 to 25 years Responsibilities & Context Strategic Planning : Develop and implement IT strategies, policies, and procedures to support overall business objectives. Infrastructure Management : Oversee the setup, maintenance, and performance of servers, networks, hardware, and software systems. Security & Data : Administer network security, data backups, access controls, firewalls, and ensure compliance with security policies. IT Support & Helpdesk : Provide technical assistance to employees, manage helpdesk tickets, and troubleshoot issues. Project Management : Lead or coordinate IT projects, including system upgrades, new software implementations (like ERPs), and new user setups. Budget & Vendor Management : Manage IT budgets, negotiate with external vendors, and oversee service providers. Team Leadership : Recruit, train, and mentor IT staff, fostering a culture of innovation. Skills & Expertise Project Management Suggested by Project Management Strategic Planning Suppliers and Vendor Management Technical Infrastructure Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Company Information STAR VISA CONSULTANCY Follow More jobs from this company Address: Star Tour & Travels is one of Bangladesh’s leading and most trusted travel companies, offering expert travel solutions since its inception. We specialize in domestic and international tours, flight and hotel bookings, visa processing, and customized travel packages for individuals. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 B"
  },
  {
    "url": "https://bdjobs.com/h/details/1457626?ln=1",
    "company_name": "Canadian University of Bangladesh",
    "job_title": "Professor/Associate Professor - School of Business",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "Professor:",
    "education": null,
    "deadline": "20 Feb 2026",
    "job_description": "Professor/Associate Professor - School of Business : Canadian University of Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Canadian University of Bangladesh Professor/Associate Professor - School of Business Application Deadline : 20 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Job responsibilities 1.      Deliver high-quality lectures at undergraduate and postgraduate levels (e.g., BBA, MBA, and EMBA). 2.      Develop and update course outlines, lesson plans, and teaching materials. 3.      Use innovative teaching methods (case studies, simulations, research-based learning). 4.      Supervise student research projects, theses, and internships. 5.      Conduct assessments, prepare question papers, and evaluate answer scripts. 6.      Provide academic advising and mentoring to students. 7.      Conduct high-quality research in the field of Business (e.g., HRM, Finance, Marketing, Management, Accounting, and Entrepreneurship). 8.      Publish research articles in peer-reviewed and indexed journals (Scopus, Web of Science, etc.). 9.      Present research findings at national and international conferences. 10.  Apply for research grants and funded projects. 11.  Lead curriculum development and academic program review. 12.  Participate in academic committees (Academic Council, Board of Studies, and Research Committee). 13.  Guide junior faculty members and support their professional development. 14.  Participate in departmental meetings and university activities. 15.  Assist in student admissions interviews and viva boards. 16.  Support quality assurance and institutional ranking initiatives. 17.  Maintain academic records and ensure compliance with university policies. 18.  Organize seminars, workshops, guest lectures, and industry collaboration programs. 19.  Build partnerships with industry for internships and placement opportunities. 20.  Engage in consultancy and executive training programs. 21.  Contribute to community development and corporate social responsibility initiatives. Job Qualifications Professor: 1.      PhD in Business Administration or relevant discipline (HRM, Finance, Marketing, Management, Accounting, Entrepreneurship, etc.) from a recognized university. 2.      Master’s degree (MBA/EMBA/Master’s in relevant field) with strong academic record. 3.      Consistent good academic results throughout (as per UGC/university requirements). Associate Professor: 1.      PhD in Business Administration or relevant discipline from a recognized university. 2.      Master’s degree (MBA/EMBA/Master’s in relevant field) with good academic record. 3.      Strong academic background preferred. Experience"
  },
  {
    "url": "https://bdjobs.com/h/details/1457184?ln=1",
    "company_name": "Orfactor",
    "job_title": "Junior Project Manager/Coordinator",
    "location": "Anywhere in Bangladesh",
    "salary": "",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Junior Project Manager/Coordinator : Orfactor Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Orfactor Junior Project Manager/Coordinator Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Experience: 1 to 2 years Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience 1 to 2 years Responsibilities & Context We’re looking for a technically-savvy Junior Project Manager/Coordinator to support the delivery of high-quality software products. This role bridges the gap between engineering teams and stakeholders, ensuring projects are delivered on time, within scope, and with clear documentation. Location: 50, lake circus, Kalabagan- Dhaka Type: Full-time Responsibilities: Assist in planning, executing, and tracking software development projects. Collaborate with developers, and UI/UX designers to maintain sprint schedules. Support Agile ceremonies (Scrum meetings, sprint planning, retrospectives). Maintain project artifacts: product backlog, timelines, roadmaps, and status reports. Monitor KPIs, task completion, and risk management metrics. Assist in identifying bottlenecks and proposing process improvements. technical Documentation Required Skills & Qualifications: Bachelor’s degree in Computer Science, IT, Software Engineering, or related field. Familiarity with software development life cycle (SDLC) and Agile/Scrum frameworks. Basic understanding of tools like Jira, Trello, Asana, or ClickUp, Redmine Strong technical communication: able to translate requirements between stakeholders and dev teams. Problem-solving mindset with attention to detail. 0–2 years of experience in software project coordination, QA, or development support. What We Offer: Hands-on experience managing software development projects. Exposure to Agile practices and modern tech stacks. Career growth into Senior Project Manager roles. Collaborative and learning-focused environment. Skills & Expertise B.Com./ Bachelors Communication in English Documentation Software Testing Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Orfactor Follow More jobs from this company Address: 50 lake circus,kalabagan, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 compla"
  },
  {
    "url": "https://bdjobs.com/h/details/1457658?ln=1",
    "company_name": "Limpid Travels",
    "job_title": "Junior Sales Executive (Reservation Desk)",
    "location": "Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Junior Sales Executive (Reservation Desk) : Limpid Travels Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Limpid Travels Junior Sales Executive (Reservation Desk) Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 25 to 35 years Location: Dhaka (Motijheel) Salary: Tk. 10000 - 20000 (Monthly) Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 25 to 35 years Basic computer knowledge (email, WhatsApp, internet browsing) Good communication skills and polite manners Honest, disciplined, and willing to learn Technically adaptable and fast learner Prior experience is not mandatory Responsibilities & Context Limpid Travels is looking for motivated and honest individuals to join our team as Junior Sales Executives (Reservation Desk). This role is ideal for candidates who are interested in building a career in the travel industry and earning through sales performance rather than depending only on a fixed salary. This is a learning-first, performance-based role where income growth is directly linked to individual sales contribution. The position operates under close supervision and structured guidance to ensure proper skill development and professional discipline. Key Responsibilities: Handle inbound customer queries via phone, WhatsApp, and online platforms Assist customers with air ticket options and basic travel-related information Process ticket sales under senior approval and guidance Follow pricing rules, approval flow, and internal sales procedures strictly Coordinate with internal team members for ticket issuance and confirmations Maintain basic customer follow-up and sales records Important Context: Fixed salary is modest, but a strong emphasis is placed on direct sales commission Earnings increase with every confirmed ticket sale No aggressive sales target pressure – performance-based commission only No independent pricing or decision-making authority at the beginning All activities will be done under the direct supervision of senior management Training and mentorship will be provided on ticketing systems and real business operations Salary will be reviewed once after three months of joining and every six months thereafter. This role is best suited for individuals who are confident, disciplined, and motivated to earn more by learning skills and delivering results. Skills & Expertise Customer Relations Customer Support through Phone Data Entry Facebook marketing Familiarity with online application system GDS SYSTEM Google Sheets PDF Editing Sales & Marketing whatsapp Compensation & Other Benefits Profit share,Performance bonus Festival Bonus: 2 Salary Review: Half Yearly Lunch Facilities: Partially Subsidize Direct sales commission on eve"
  },
  {
    "url": "https://bdjobs.com/h/details/1457724?ln=1",
    "company_name": null,
    "job_title": null,
    "location": null,
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": null,
    "job_description": "Error Cannot GET /h/details/1457724"
  },
  {
    "url": "https://bdjobs.com/h/details/1457723?ln=1",
    "company_name": "Stepnextgen AI",
    "job_title": "Social Media Manager",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Social Media Manager : Stepnextgen AI Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Stepnextgen AI Social Media Manager Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Location: Anywhere in Bangladesh Salary: Negotiable Experience: At least 1 year Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 1 year The applicants should have experience in the following business area(s): Software Company, Artificial Intelligence (AI) Startup, Direct Selling/Marketing Service Company, Online Retail Startup Freshers are also encouraged to apply. Responsibilities & Context NakshiBari (a concern of StepNextGen AI) is looking for a creative Social Media Manager to join our growing team. If you’re passionate about digital storytelling, audience engagement, and building strong online communities, we’d love to hear from you! Requirements: -Strong understanding of Facebook, Instagram and TikTok platforms -Experience in content planning and social media strategy -Basic knowledge of Canva/Adobe tools for quick creatives -Ability to write engaging captions and copy -Understanding of trends, hashtags, and audience behavior -Ability to meet deadlines and work collaboratively Responsibilities: -Plan, create, and manage content across social media platforms -Write engaging captions and post copies aligned with the brand voice -Schedule posts and maintain a content calendar -Monitor messages, comments, and audience engagement -Track performance and prepare monthly reports -Call to merchant/customers to know the insights and plan accordingly. -Generate lead and build a community for NakshiBari ** Having a good sense of trends and visualization ability is a plus (freshers are encouraged to apply) Salary - Negotiable. How to Apply: Send your CV to career@ stepnextgenai.com Skills & Expertise Digital Marketing (Social Media Marketing) Digital content Merchant Acquisition Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Stepnextgen AI Follow More jobs from this company Address: Stepnextgen AI is a dynamic Bangladeshi software company at the forefront of artificial intelligence innovation. Focused on building scalable, AI-powered infrastructure solutions, the company leverages cutting-edge machine learning and intelligent automation to empower businesses across industries. Website: https://stepnextgenai.com Business: Stepnextgen AI is a dynamic Bangladeshi software company at the forefront of artificial intelligence innovation. Focused on building scalable, AI-powered infrastructure solutions, the company leverages cutting-edge machine learning and intelligent automation to empower businesses across industries. Report this"
  }
]