[
  {
    "url": "https://bdjobs.com/h/details/1461819?ln=1",
    "company_name": "Baolee Overseas Ltd.",
    "job_title": "Interpreter (Chinese-English-Bengali)",
    "location": "Narayanganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "04 Mar 2026",
    "job_description": "Interpreter (Chinese-English-Bengali) : Baolee Overseas Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Baolee Overseas Ltd. Interpreter (Chinese-English-Bengali) Application Deadline : 04 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Narayanganj Salary: Negotiable Published: 22 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Chinese proficiency minimum HSK5 or HSK6 Level. Responsibilities & Context Job Description: Baolee Security Service & Property Management Ltd. is looking for a qualified and bilingual Interpreter with a Civil Engineering degree or any other bachelor degree to bridge communication between our local team and Chinese project partners. The ideal candidate must have a strong civil engineering background and be fluent in Chinese (Mandarin) and English, with excellent interpretation, communication & written skills. Responsibilities: Interpret verbal conversations, technical discussions, and instructions between Chinese engineers and local site teams during meetings, site inspections, and day-to-day operations. Translate engineering drawings, construction manuals, safety protocols, and contractual documents from Chinese to English and vice versa. Act as a cultural bridge to avoid miscommunication and ensure mutual understanding between all parties. Assist project engineers and managers in planning, scheduling, and reporting progress to Chinese stakeholders. Translate written communication, including emails, memos, and reports, ensuring technical accuracy. Interpret safety procedures and ensure they are correctly understood and implemented by all team members. Participate in design and review meetings and prepare bilingual meeting minutes. Coordinate and accompany Chinese delegates or consultants during site visits and official meetings. Support the procurement team by interpreting technical specifications during negotiations with Chinese suppliers and manufacturers. Maintain accurate records of all interpreted meetings and translated documents for documentation and audit purposes. Provide technical advice to ensure engineering compliance according to project standards and specifications. Assist in preparing bilingual training or orientation materials for staff related to technical work, safety, and compliance. Serve as backup or support for civil site engineers in basic supervision, inspections, and follow-ups when required. Directly supervise and manage all on-site construction activities from start to finish. Oversee the work of subcontractors to ensure their adherence to project timelines and quality standards. Prepare daily, weekly, and monthly reports on project progress for management. Resolve any on-site technical issues or challenges that may arise. Maintain liaison with the local law enforcement agencies."
  },
  {
    "url": "https://bdjobs.com/h/details/1462265?ln=1",
    "company_name": "Madrasatul Hasanah, Savar",
    "job_title": "English Teacher",
    "location": "Dhaka (Savar city)",
    "salary": "Tk. 15000 - 20000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "English Teacher : Madrasatul Hasanah, Savar Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Madrasatul Hasanah, Savar English Teacher Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 2 Location: Dhaka (Savar city) Salary: Tk. 15000 - 20000 (Monthly) Published: 22 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Lesson Planning and Preparation Develop lesson plans aligned with curriculum standards. Design activities to enhance reading, writing, speaking, and listening skills. Choose appropriate materials, such as textbooks, literary works, articles, videos, etc. Teaching and Instruction Deliver engaging and clear instruction in grammar, vocabulary, reading comprehension, and writing. Teach literary analysis and critical thinking skills through novels, poetry, and other texts. Adapt teaching methods to suit different learning styles and levels. Assessment and Evaluation Design and administer quizzes, tests, essays, and oral presentations. Provide timely and constructive feedback. Track student progress and maintain accurate records of performance and attendance. Classroom Management Create a respectful, inclusive, and safe classroom environment. Enforce classroom rules and school policies. Encourage student participation and maintain discipline. Student Support Offer extra help during office hours or tutorials. Identify students needing additional support or enrichment. Communicate with parents/guardians regarding student progress and concerns. Professional Development Attend workshops, training sessions, or conferences. Stay up to date with educational best practices and curriculum changes. Collaborate with colleagues for interdisciplinary or team teaching. Administrative Duties Participate in faculty meetings and school committees. Assist in curriculum development and improvement. Prepare reports or documentation as required by school leadership or education boards. Skills & Expertise Suggested by Education Workplace Work at office Employment Status Full Time Job Location Dhaka (Savar city) Company Information Madrasatul Hasanah, Savar Follow Address: D-28/1, Bank Colony, Savar, Dhaka. Website: https://www.madrasatulhasanah.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Regis"
  },
  {
    "url": "https://bdjobs.com/h/details/1463208?ln=1",
    "company_name": "Epal IT Solutions",
    "job_title": "Air Ticketing And Reservation Executive",
    "location": "Dhaka (Khilgaon)",
    "salary": "Tk. 30000 - 40000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Air Ticketing And Reservation Executive : Epal IT Solutions Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Epal IT Solutions Air Ticketing And Reservation Executive Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 26 to 35 years Location: Dhaka (Khilgaon) Salary: Tk. 30000 - 40000 (Monthly) Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 26 to 35 years Responsibilities & Context Core Operations: Execute domestic and international air ticket bookings via Sabre, Amadeus, and Galileo . Financial Handling: Manage complex Fare Quotations , Re-issues , and Refund Processing with 100% accuracy. IATA Maintenance: Ensure all agency operations strictly adhere to IATA standards and BSP regulations. Technical Expertise: Utilize advanced GDS commands to optimize routing and pricing for clients. Consultancy: Provide professional travel advice and itinerary planning to corporate and walk-in clients. Skills & Expertise Sabre GDS GDS expert GDS (GalileoTravelport GDS SYSTEM Air Ticketing On Amadeus Galileo IATA expert Refund Reissue Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Khilgaon) Company Information Epal IT Solutions Follow Address: Feroza Tower, Level-9, 91/B, DIT Road, Malibagh, Chowdhurypara, Dahka-1219, Dhaka, Bangladesh. Business: Epal IT Solutions is a dynamic and innovative technology firm based in Dhaka, Bangladesh, specializing in comprehensive digital solutions. From digital marketing and web development to IT consultancy and software services, we empower businesses to thrive in the digital era. With a dedicated team of experts, we deliver tailored, results-driven strategies and cutting-edge technology to help clients achieve their goals. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রে"
  },
  {
    "url": "https://bdjobs.com/h/details/1463587?ln=1",
    "company_name": "Hassle Free Education",
    "job_title": "Virtual Sales Executive",
    "location": "United Kingdom",
    "salary": null,
    "experience": "Fluent in English Speaking",
    "education": null,
    "deadline": "27 Feb 2026",
    "job_description": "Virtual Sales Executive : Hassle Free Education Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hassle Free Education Virtual Sales Executive Application Deadline : 27 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 20 to 36 years Location: United Kingdom Salary: Tk. 12000 - 12000 (Monthly) Published: 25 Feb 2026 Application Insights View Requirements Education Higher Secondary Diploma Bachelor/Honors Masters Candidates with IELTS certification will be given preference during the selection process. Additional Requirements Age 20 to 36 years IELTS 6.5 or Equivalent English Proficiency(especially strong Listening & Speaking Skill) Responsibilities & Context About Hassle Free Education Hassle Free Education is a leading student consultancy firm based in the UK, with offices in London, Birmingham, Manchester, Leeds, Dhaka, Barishal, and Lagos . We specialize in providing expert guidance and comprehensive support for higher education opportunities in the UK, USA, Canada, Malta, and Finland . Our team assists students in securing admission to top universities, ensuring a smooth, transparent, and hassle-free application process. Our mission is to create accessible and affordable pathways for students to achieve their academic and career goals overseas. Working Hours Office Hours: 🕙 10:00 AM – 06:00 PM (UK Time) Key Responsibilities Communicate with prospective students and clients, providing detailed information about university study opportunities. Support the UK office in managing student recruitment, enrollments, and the admissions process. Follow up on incoming leads and inquiries efficiently and convert them into confirmed applications. Track and manage student documentation and monitor application progress. Maintain clear and professional communication with the UK office team. Achieve sales targets and provide regular performance reports. Respond promptly to student queries and provide effective problem-solving support. Guide students in selecting suitable courses and programs based on their academic background and career objectives. Skills & Expertise Computer Literacy Customer Service Data Entry Experience in English Medium School Fluent in English Speaking IELTS Problem solving and decision making Sales & Marketing Student Admission Telesales Compensation & Other Benefits Performance bonus Festival Bonus: 2 Salary Review: Yearly Competitive Salary Salary will be reviewed after the 3-month probation period based on performance. Quarterly Bonus Performance-based bonus of BDT 100,000–150,000 every 3 months (per intake). Workplace Work from home Employment Status Full Time Job Location United Kingdom Company Information Hassle Free Education Follow Address: Suite No: 636, Level 6, RH Home Centre, Green Road, Panthapath, Dhaka-1212 Website: https://hasslefreeeducation.co.uk/ B"
  },
  {
    "url": "https://bdjobs.com/h/details/1464007?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464100?ln=1",
    "company_name": "Ecruise Corporation",
    "job_title": "Accounting Assistant",
    "location": "Dhaka, Dhaka (DOHS Mirpur)",
    "salary": "Tk. 20000 - 25000 (Monthly)",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "08 Mar 2026",
    "job_description": "Accounting Assistant : Ecruise Corporation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ecruise Corporation Accounting Assistant Application Deadline : 08 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 28 to 35 years Location: Dhaka, Dhaka (DOHS Mirpur... Dhaka, Dhaka (DOHS Mirpur) Salary: Tk. 20000 - 25000 (Monthly) Experience: 1 to 3 years Published: 26 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Master of Business Administration (MBA) in Accounting Master of Business Administration (MBA) in Accounting & Information System Master of Business Administration (MBA) in Cost & Management Accounting Experience 1 to 3 years The applicants should have experience in the following business area(s): Telecommunication, Software Company, IT Enabled Service, Multinational Companies, Group of Companies, Battery, Storage cell, Importer, Industrial Machineries (Generator, Diesel Engine etc.), Motor Vehicle body manufacturer, E-commerce Additional Requirements Age 28 to 35 years Responsibilities & Context ### 1. Daily Financial Recordkeeping * Record all financial transactions (sales, expenses, receipts, payments) * Maintain general ledger and chart of accounts * Reconcile bank accounts, credit cards, and digital payment platforms * Track EV sales (vehicle sales, battery sales, accessories, service revenue) ## 2. Accounts Payable & Receivable * Process vendor invoices (battery suppliers, parts vendors, logistics, charging infrastructure) * Manage payments to suppliers and contractors * Generate and track customer invoices * Monitor outstanding receivables and follow up on overdue payments ### 3. Inventory & Asset Tracking (EV-Specific) * Track inventory of: * EV units * Batteries * Spare parts * Charging equipment * Maintain records of fixed assets (charging stations, machinery, tools, demo vehicles) * Assist in cost tracking per vehicle model ### 4. Payroll Support * Maintain employee payroll records * Track commissions (if applicable to EV sales team) * Process reimbursements * Ensure compliance with tax deductions and statutory payments ### 5. Tax & Compliance Support * Maintain records for GST/VAT (if applicable) * Prepare data for tax filings * Track input/output taxes on EV purchases and sales * Assist auditors with documentation ### 6. Financial Reporting * Prepare monthly financial statements: * Profit & Loss * Balance Sheet * Cash Flow Summary * Track burn rate (especially important for growing EV startups) * Monitor cost of goods sold (COGS) per vehicle ### 7. Expense Monitoring & Cost Control * Track R&D expenses (if developing EV technology) * Monitor marketing campaign spending * Analyze operational costs (warehousing, charging stations, servicing) Skills & Expertise Key Account Management Accounts and Finance Accountability Workp"
  },
  {
    "url": "https://bdjobs.com/h/details/1464117?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  }
]