[
  {
    "url": "https://bdjobs.com/h/details/1457084?ln=1",
    "company_name": "Christian Mission Hospital, Rajshahi",
    "job_title": "Driver",
    "location": "Rajshahi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Driver : Christian Mission Hospital, Rajshahi Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Christian Mission Hospital, Rajshahi Driver Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 20 to 35 years Location: Rajshahi Salary: Negotiable Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Valid professional driving license for light/heavy vehicle as applicable. At least two (2) years driving experience. Willingness to work in shifts and emergency situations. Responsibilities & Context Christian Mission Hospital, Rajshahi (CMHR) is a value-based healthcare institution committed to compassionate, ethical, and high-quality patient care. Guided by its Mission and Core Values, the Hospital strives to deliver safe, respectful, and patient-centered services across all departments through professionalism, accountability, and teamwork. In this context, CMHR invites applications from qualified, competent, and service-oriented individuals who share a commitment to patient welfare, institutional discipline, and the values of the Hospital Workstation: CMHR Key Responsibilities: Drive hospital vehicles safely in compliance with traffic laws, hospital rules, and duty schedules. Support patient transport, emergency services, and official hospital movements as assigned. Maintain vehicle condition, records, and promptly report any accidents or faults. Skills & Expertise Suggested by Driving Traffic Rules Traffic Safety Compensation & Other Benefits Salary: Negotiable based on qualifications and experience. Employment Status Full Time Job Location Rajshahi Apply Procedure Email Your CV Send your CV to the given email cmhrajshahi1926@gmail.com Hard Copy http://gmail.com Company Information Christian Mission Hospital, Rajshahi Follow More jobs from this company Address: Shreerampur, Rajshahi-6000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Prof"
  },
  {
    "url": "https://bdjobs.com/h/details/1457092?ln=1",
    "company_name": "Christian Mission Hospital, Rajshahi",
    "job_title": "Mission Trained Nurse",
    "location": "Rajshahi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Mission Trained Nurse : Christian Mission Hospital, Rajshahi Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Christian Mission Hospital, Rajshahi Mission Trained Nurse Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Age: 20 to 35 years Location: Rajshahi Salary: Negotiable Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 35 years Willingness to work in shifts, including night duty. Prior experience in patient care preferred. Responsibilities & Context Christian Mission Hospital, Rajshahi (CMHR) is a value-based healthcare institution committed to compassionate, ethical, and high-quality patient care. Guided by its Mission and Core Values, the Hospital strives to deliver safe, respectful, and patient-centered services across all departments through professionalism, accountability, and teamwork. In this context, CMHR invites applications from qualified, competent, and service-oriented individuals who share a commitment to patient welfare, institutional discipline, and the values of the Hospital. Workstation: CMHR Key Responsibilities: Provide attendant-less basic patient care support, including hygiene, feeding, mobility assistance, comfort, and observation under supervision. Assist registered nurses and doctors in routine patient care activities and emergency situations as instructed. Observe patient conditions and promptly report any changes or concerns to senior nursing staff or supervisors. Skills & Expertise Suggested by Nurse Health/ Medical Midwifery Medical Record Keeping Compensation & Other Benefits Salary: Negotiable based on qualifications and experience. Employment Status Full Time Gender Only females are allowed to apply. Job Location Rajshahi Company Information Christian Mission Hospital, Rajshahi Follow More jobs from this company Address: Shreerampur, Rajshahi-6000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT"
  },
  {
    "url": "https://bdjobs.com/h/details/1457087?ln=1",
    "company_name": "Christian Mission Hospital, Rajshahi",
    "job_title": "Senior Staff Nurse",
    "location": "Rajshahi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Senior Staff Nurse : Christian Mission Hospital, Rajshahi Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Christian Mission Hospital, Rajshahi Senior Staff Nurse Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Age: 20 to 35 years Location: Rajshahi Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 35 years Willingness to work in shifts and provide attendant-less patient care. Relevant experience preferred. Responsibilities & Context Christian Mission Hospital, Rajshahi (CMHR) is a value-based healthcare institution committed to compassionate, ethical, and high-quality patient care. Guided by its Mission and Core Values, the Hospital strives to deliver safe, respectful, and patient-centered services across all departments through professionalism, accountability, and teamwork. In this context, CMHR invites applications from qualified, competent, and service-oriented individuals who share a commitment to patient welfare, institutional discipline, and the values of the Hospital. Workstation: CMHR Key Responsibilities: Provide complete attendant-less patient care services, ensuring patient comfort, safety, and continuity of nursing care. Deliver nursing services following hospital policies and infection control standards. Monitor patients and maintain nursing documentation. Assist doctors during clinical procedures and emergencies. Skills & Expertise Suggested by Health/ Medical Staff Nurse patients Care Compensation & Other Benefits Salary: Negotiable based on qualifications and experience. Workplace Work at office Employment Status Full Time Job Location Rajshahi Company Information Christian Mission Hospital, Rajshahi Follow More jobs from this company Address: Shreerampur, Rajshahi-6000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল"
  },
  {
    "url": "https://bdjobs.com/h/details/1457178?ln=1",
    "company_name": "Christian Mission Hospital, Rajshahi",
    "job_title": "Cleaner (ক্লিনার / পরিচ্ছন্নতা কর্মী)",
    "location": "Rajshahi (Rajshahi Sadar)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Cleaner (ক্লিনার / পরিচ্ছন্নতা কর্মী) : Christian Mission Hospital, Rajshahi Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Christian Mission Hospital, Rajshahi Cleaner (ক্লিনার / পরিচ্ছন্নতা কর্মী) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 5 Age: 20 to 35 years Location: Rajshahi (Rajshahi Sadar) Salary: Negotiable Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 35 years Physically fit and disciplined. Responsibilities & Context Maintain the cleanliness and hygiene of hospital wards, premises, and facilities following infection control guidelines. Handle waste disposal and sanitation tasks safely as per hospital procedures. Perform assigned cleaning duties responsibly under supervision. Skills & Expertise Suggested by Cleaning Cleaner Operation Workplace Work at office Employment Status Full Time Job Location Rajshahi (Rajshahi Sadar) Company Information Christian Mission Hospital, Rajshahi Follow More jobs from this company Address: Shreerampur, Rajshahi-6000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1457082?ln=1",
    "company_name": "Christian Mission Hospital, Rajshahi",
    "job_title": "Computer Typist cum Note Writer",
    "location": "Rajshahi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Computer Typist cum Note Writer : Christian Mission Hospital, Rajshahi Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Christian Mission Hospital, Rajshahi Computer Typist cum Note Writer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: 20 to 35 years Location: Rajshahi Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 35 years Excellent English and Bangla handwriting skills. Any formal recognition, certification, or institutional endorsement of handwriting skills will be given priority. Responsibilities & Context Christian Mission Hospital, Rajshahi (CMHR) is a value-based healthcare institution committed to compassionate, ethical, and high-quality patient care. Guided by its Mission and Core Values, the Hospital strives to deliver safe, respectful, and patient-centered services across all departments through professionalism, accountability, and teamwork. In this context, CMHR invites applications from qualified, competent, and service-oriented individuals who share a commitment to patient welfare, institutional discipline, and the values of the Hospital Workstation: CMHR Key Responsibilities: Prepare and type medical, clinical, and administrative documents, Birth Registers, in English and Bangla with accuracy and confidentiality. Ensure clarity, proper formatting, timely submission, and secure handling of official records. Maintain organized filing and documentation systems as per hospital standards. Skills & Expertise Suggested by Data Entry (Both English & Bengali) Good Ms office and Emailing skill Typing Skill - Bengali and English Compensation & Other Benefits Salary: Negotiable based on qualifications and experience. Workplace Work at office Employment Status Full Time Job Location Rajshahi Apply Procedure Email Your CV Send your CV to the given email cmhrajshahi1926@gmail.com Hard Copy http://gmail.com Company Information Christian Mission Hospital, Rajshahi Follow More jobs from this company Address: Shreerampur, Rajshahi-6000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Em"
  },
  {
    "url": "https://bdjobs.com/h/details/1457078?ln=1",
    "company_name": "Christian Mission Hospital, Rajshahi",
    "job_title": "Medical Officer",
    "location": "Rajshahi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Medical Officer : Christian Mission Hospital, Rajshahi Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Christian Mission Hospital, Rajshahi Medical Officer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 5 Age: 25 to 35 years Location: Rajshahi Salary: Negotiable Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Minimum 2 (two) years of clinical experience in a hospital setting. Fresh graduates are discouraged from applying. Responsibilities & Context Christian Mission Hospital, Rajshahi (CMHR) is a value-based healthcare institution committed to compassionate, ethical, and high-quality patient care. Guided by its Mission and Core Values, the Hospital strives to deliver safe, respectful, and patient-centered services across all departments through professionalism, accountability, and teamwork. In this context, CMHR invites applications from qualified, competent, and service-oriented individuals who share a commitment to patient welfare, institutional discipline, and the values of the Hospital. Total Position: 5 (2 Male and 3 Female) Workstation: CMHR Key Responsibilities Provide medical care in accordance with hospital rules, treatment protocols, medical ethics, patient safety standards, documentation requirements, and assigned duty rosters. Treat and monitor admitted (IPD) patients following hospital protocols and medical ethics. Provide emergency and on-call medical services as assigned. Maintain clinical records and conduct regular ward rounds. Skills & Expertise Suggested by Health/ Medical Medical Record Keeping patients Care Compensation & Other Benefits Salary: Negotiable based on qualifications and experience. Workplace Work at office Employment Status Full Time Job Location Rajshahi Apply Procedure Email Your CV Send your CV to the given email cmhrajshahi1926@gmail.com Hard Copy http://gmail.com Company Information Christian Mission Hospital, Rajshahi Follow More jobs from this company Address: Shreerampur, Rajshahi-6000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability"
  },
  {
    "url": "https://bdjobs.com/h/details/1456793?ln=1",
    "company_name": "Importer",
    "job_title": "Officer - Accounts & Finance",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Officer - Accounts & Finance : Importer Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Importer Officer - Accounts & Finance Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: 25 to 35 years Location: Dhaka Salary: Tk. 28000 - 32000 (Monthly) Published: 07 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 35 years Responsibilities & Context Major Duties & Responsibilities: Maintain petty cash & prepare all kind of vouchers, cash book, bill register, general ledger & different register related to finance & accounts. Strong and proficient in use of MS office and working experience in accounting Tally Software. Accounts data entry into all level of accounting in the company. Prepare and check all kinds of bill vouchers, Journal entries as per rules and regulation. Prepare monthly salary, bonus sheet preparation. Practical knowledge about TAX & VAT Compliance, SRO, Customs Law. Practical knowledge about banking. VAT, TAX & other Challan preparation. Photo shop, Graphics design, PPT Presentation. Any other tasks assigned by management. Skills & Expertise Accounting Accounting Data Entry Accounts and Finance Computer Literacy Fluency in English speaking and writing General Banking Tally Prime VAT and Tax xero Suggested by Financial Management Financial Reporting Compensation & Other Benefits T/A,Mobile bill,Insurance Salary Review: Yearly Festival Bonus: 3 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka Job Highlights We are looking for a person who is strong and proficient in use of MS office and working experience in accounting Tally Software. Who experience in VAT, TAX, Customs & SRO. Who like to work indoor & outdoor. Company Information Importer Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhur"
  },
  {
    "url": "https://bdjobs.com/h/details/1461284?ln=1",
    "company_name": "Dhaka Progressive Lions Eye Hospital",
    "job_title": "ICT Officer",
    "location": "Dhaka (Gulshan)",
    "salary": "Negotiable",
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "20 Mar 2026",
    "job_description": "ICT Officer : Dhaka Progressive Lions Eye Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Dhaka Progressive Lions Eye Hospital ICT Officer Application Deadline : 20 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka (Gulshan) Salary: Negotiable Experience: 1 to 3 years Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Bachelor of Science (BSc) in Computer Science & Engineering Bachelor of Science (BSc) in Information Technology Bachelor/Honors Bachelor`s degree in CSE/ IT/ ICT or related field. Experience 1 to 3 years The applicants should have experience in the following business area(s): Hospital Freshers are also encouraged to apply. Additional Requirements At least 1-3 years of relevant experience (freshers may apply if skilled). Strong knowledge of Windows OS, networking, and basic server management. Experience in troubleshooting hardware/software issues. Basic understanding of network devices (router, switch, firewall). Ability to work under pressure and respond to urgent IT issues quickly. Responsibilities & Context Install, configure, and maintain computer systems, networks, printers, and software. Provide technical support to all departments for hardware, software, and network-related issues. Monitor and troubleshoot LAN, WAN, Wi-Fi, CCTV, and related IT infrastructure. Ensure data security, backup, and system recovery procedures. Manage user accounts, email systems, and access permissions. Update and maintain IT asset inventory. Coordinate with vendors for IT equipment purchase and maintenance. Support hospital management systems (HMS) and other software used in the organization. Ensure minimal downtime and smooth functioning of all IT services. Skills & Expertise Suggested by ICT Windows OS Employment Status Full Time Job Location Dhaka (Gulshan) Company Information Dhaka Progressive Lions Eye Hospital Follow Address: Madaripur,137/2,Madaripur Sadar. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is"
  },
  {
    "url": "https://bdjobs.com/h/details/1463055?ln=1",
    "company_name": "Medi Mystery",
    "job_title": "অ্যাসিস্টেন্ট ম্যানেজার",
    "location": "Rangpur (Rangpur Sadar)",
    "salary": "Tk. 7000 - 14000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "অ্যাসিস্টেন্ট ম্যানেজার : Medi Mystery Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Medi Mystery অ্যাসিস্টেন্ট ম্যানেজার Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 18 to 32 years Location: Rangpur (Rangpur Sadar) Salary: Tk. 7000 - 14000 (Monthly) Published: 24 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Age 18 to 32 years চমৎকার বাচনভঙ্গি এবং মানুষকে প্রভাবিত করার ক্ষমতা। ​ধৈর্য ও হাসিমুখে কথা বলার মানসিকতা।​ চাপের মধ্যে কাজ করার ক্ষমতা। Responsibilities & Context মেডি মিস্ট্রি কোচিং সেন্টারে চটপটে, ধৈর্যশীল এবং যোগাযোগে দক্ষ একজন অ্যাসিস্টেন্ট ম্যানেজার নিয়োগ দেয়া হবে। আপনি যদি মানুষের সাথে কথা বলতে পছন্দ করেন এবং ম্যানেজমেন্টে ক্যারিয়ার গড়তে আগ্রহী হন, তবে আবেদন করতে পারেন। আবেদনকারীকে অবশ্যই রংপুর শহরের হতে হবে। প্রধান দায়িত্বসমূহ: ​অফিস অ্যাডমিন : অফিসের দৈনন্দিন প্রশাসনিক কাজ দেখাশোনা করা এবং শৃঙ্খলা বজায় রাখা। Skills & Expertise good comunication Good management skills Suggested by Assistant Branch Manager Communication Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Rangpur (Rangpur Sadar) Company Information Medi Mystery Follow Address: Bangladesh Bank more, Rangpur.\nMobile: 01315743441 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now Good Manufacturing Practices (GMP) 3000 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্"
  },
  {
    "url": "https://bdjobs.com/h/details/1463877?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463991?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1463883?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1461748?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464187?ln=1",
    "company_name": "Hector Technologies",
    "job_title": "জেনারেল ওয়ার্কার",
    "location": "Saudi Arabia",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "29 Mar 2026",
    "job_description": "জেনারেল ওয়ার্কার : Hector Technologies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Hector Technologies জেনারেল ওয়ার্কার Application Deadline : 29 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 100 Age: 21 to 40 years Location: Saudi Arabia Salary: Negotiable Published: 27 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Experience Additional Requirements Age 21 to 40 years Only Male প্রয়োজনীয় যোগ্যতা সংশ্লিষ্ট পদে চাকুরী করার অভিজ্ঞতা থাকতে হবে। বিদেশে কাজের অভিজ্ঞতা থাকলে সুবিধা পাবেন। বিশেষ করে জিসিসি দেশ সমুহে (Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates) চাকুরী করার অভিজ্ঞতা থাকলে অগ্রাধিকার। ট্রেনিং বা সার্টিফিকেট থাকলে ভালো। ইংরেজি বা আরবি ভাষায় কথা বলতে পারলে অগ্রাধিকার। মিনিমাম এসএসসি পাস হতে হবে। Responsibilities & Context যে পদে নিয়োগ দেওয়া হবে কনস্ট্রাকশন ওয়ার্কার, ম্যাশন (টাইলস/ইট), কাঠমিস্ত্রি (কার্পেইন্টার), স্টিল ফিক্সার, ওয়েল্ডার, স্ক্যাফোল্ডার, পেইন্টার, প্লাম্বার, ক্লিনার, হাউসকিপার, সার্ভিস ক্রু, ডিশওয়াশার, ট্রলি বয়, গুদাম কর্মী, কৃষি শ্রমিক ইত্যাদি। Skills & Expertise Construction Steel Building Mason Carpenter Cleaning Welder Scaffolding Plumber Warehouse Agriculture Compensation & Other Benefits Over time allowance Lunch Facilities: Full Subsidize বেতন ও সুবিধা বেতন: ৩৫,০০০ - ১,২০,০০০ টাকা (পদ ও অভিজ্ঞতা অনুযায়ী) খাবার: বিনামূল্যে বাসস্থান: বিনামূল্যে ওভারটাইম: আছে Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Saudi Arabia Apply Procedure Hard Copy সরাসরি অফিসে নিম্নে উল্লেখিত ডুকোমেন্ট সহ যোগাযোগ করুন: আপডেট করা সিভি পাসপোর্টের মূল কপি প্রয়োজনীয় কাগজপত্র ও ছবি এটি একটি বিদেশে চাকুরির বিজ্ঞাপন। সার্ভিস ফি আছে। বিস্তারিত জেনে  আবেদন করার অনুরোধ রইল। প্রয়োজনে হোয়াটসঅ্যাপে মেসেজ করুন: +8801953331789 Company Information Hector Technologies Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register N"
  },
  {
    "url": "https://bdjobs.com/h/details/1464210?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1464196?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "Sales Officer & sales representative",
    "location": "Chandpur, Chattogram, Chattogram (Chakbazar Chittagong, Chittagong Sadar Firozshah, Chittagong Sadar Middle Patenga), Cox`s Bazar, Cox`s Bazar (Cox's Bazar Sadar, Teknaf), Cumilla, Feni (Feni Sadar), Lakshmipur (Raipur), Narayanganj, Noakhali (Noakhali Sadar)",
    "salary": "Tk. 17000 - 25000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "05 Mar 2026",
    "job_description": "Sales Officer & sales representative : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD Sales Officer & sales representative Application Deadline : 05 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 200 Age: 22 to 45 years Location: Chandpur, Chattogram, Cha... Chandpur, Chattogram, Chattogram (Chakbazar Chittagong, Chittagong Sadar Firozshah, Chittagong Sadar Middle Patenga), Cox`s Bazar, Cox`s Bazar (Cox's Bazar Sadar, Teknaf), Cumilla, Feni (Feni Sadar), Lakshmipur (Raipur), Narayanganj, Noakhali (Noakhali Sadar) Salary: Tk. 17000 - 25000 (Monthly) Published: 28 Feb 2026 Application Insights View Requirements Education Experience Additional Requirements Age 22 to 45 years Responsibilities & Context ডিলার ওপেন করা,অর্ডার কালেকশন ও ডেলিভারি নিশ্চিত করা,দোকানদারের সাথে সুসম্পর্ক স্থাপন করা। বিঃদ্রঃ নিজ উপজেলায় কাজের সুযোগ । Workplace Work at office Employment Status Full Time Job Location Chandpur, Chattogram, Chattogram (Chakbazar Chittagong, Chittagong Sadar Firozshah, Chittagong Sadar Middle Patenga), Cox`s Bazar, Cox`s Bazar (Cox's Bazar Sadar, Teknaf), Cumilla, Feni (Feni Sadar), Lakshmipur (Raipur), Narayanganj, Noakhali (Noakhali Sadar) Company Information Agro Farm BD Follow More jobs from this company Address: Mirpur 6,Block D,Orchid Community Centere ,House 24, Lift 7. Dhaka 1216 Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul"
  }
]