[
  {
    "url": "https://bdjobs.com/h/details/1451604?ln=1",
    "company_name": "No Chinta Home Healthcare",
    "job_title": "Customer Care Executive",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Customer Care Executive : No Chinta Home Healthcare Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List No Chinta Home Healthcare Customer Care Executive Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Age: 20 to 35 years Location: Dhaka Salary: Negotiable Published: 19 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Strong communication and interpersonal skills. Ability to handle customer inquiries with patience and professionalism. Previous experience in customer service, healthcare, or a related field is a plus. Proficiency in MS Office and CRM systems is preferred. Ability to work in a fast-paced environment and handle multiple tasks efficiently. Responsibilities & Context Serve as the first point of contact for clients, addressing inquiries and concerns with professionalism and empathy. Provide information on our services, including home nursing, physiotherapy, caregiving, and pet care. Assist clients in scheduling appointments and coordinating with healthcare professionals. Ensure timely follow-up with clients, ensuring their needs are met and that they are satisfied with our services. Maintain accurate records of client interactions and services provided. Collaborate with the team to resolve client issues promptly and effectively. Any other task assigned by the management as and when required. Skills & Expertise Suggested by Client Relationship Management Customer Care Customer Service Record Keeping Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information No Chinta Home Healthcare Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 0963"
  },
  {
    "url": "https://bdjobs.com/h/details/1456766?ln=1",
    "company_name": "Nature Fresh Agro Park Ltd",
    "job_title": "Farm Manager",
    "location": "Manikganj (Singair)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Farm Manager : Nature Fresh Agro Park Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nature Fresh Agro Park Ltd Farm Manager Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 45 years Location: Manikganj (Singair) Salary: Tk. 40000 - 50000 (Monthly) Published: 03 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 45 years A DVM Doctor having Experience of Working in a Dairy Farm. Minimum 1 Year Experience. Responsibilities & Context Skills & Expertise Management Suggested by Dairy Farm Management Farm Management Compensation & Other Benefits Lunch Facilities: Full Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Manikganj (Singair) Company Information Nature Fresh Agro Park Ltd Follow Address: Fordnagor,Dhalla,Singair,Manikganj Website: www.naturefreshagropark.com Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1449474?ln=1",
    "company_name": "Epyllion Group",
    "job_title": "Executive - GPQ (BESTSELLER) for Narayanganj Factory",
    "location": "Narayanganj",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "12 Feb 2026",
    "job_description": "Executive - GPQ (BESTSELLER) for Narayanganj Factory : Epyllion Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Epyllion Group Executive - GPQ (BESTSELLER) for Narayanganj Factory Application Deadline : 12 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: At least 26 years Location: Narayanganj Salary: Negotiable Published: 13 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 26 years Practical knowledge of garment quality control, GPQ, and compliance standards. Familiarity with BESTSELLER buyer requirements will be an added advantage. Ability to analyze quality issues and support corrective actions. Good interpersonal and reporting skills. Positive attitude with a strong sense of responsibility. Willingness to travel and work in a fast-paced environment. Responsibilities & Context Need to participate in PP meeting.·Need to participate QCO meeting. Should follow up pre production activities-from the size set stage. Follow-up (TOP, Shipping, rack, testing etc.) samples. Should ensure organized workstation in the floor. Should maintain iron standard. Should maintain get up and price ticket check. Follow-up the line feeding checklist. First output review against the sample and follow up first output garment measurement report. If any discrepancies happen need to inform QA Deputy Manager/Asst manager to get action. Need to finalize the critical operation, quality points and explain to Team Members and Team Leaders. If any style runs in more than one line approved duplicate trim card for each line. Buying office Inline inspection findings should discuss with respective Production, IE & QA team to get the corrective actions. Monitor the DHU report to identify the continuous defects and work with respective Production team to get the output correctly. Check the process monitoring check list. Co-ordinate with management on any requirement can’t meet. Follow up the Team Leader’s Daily routine & their work actions. Skills & Expertise Buyer Handling GPQ Quality Management System Total Quality Management Suggested by Quality Assurance Compensation & Other Benefits Mobile bill,Medical allowance,Insurance,Gratuity Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Narayanganj Job Highlights Executed GPQ activities for a Bestseller Brand , ensuring quality compliance, process adherence, defect reduction, and smooth high-volume operations with consistent on-time delivery. Apply Procedure Email Your CV Send your CV to the given email career@epylliongroup.com or Email your CV from My Bdjobs account Company Information Epyllion Group Follow More jobs from this company Address:"
  },
  {
    "url": "https://bdjobs.com/h/details/1457403?ln=1",
    "company_name": "BJIT Ltd.",
    "job_title": "Design & DX Promotion Engineer (Architecture & Construction)",
    "location": "Dhaka",
    "salary": "Tk. 10000 (Monthly)",
    "experience": null,
    "education": null,
    "deadline": "10 Feb 2026",
    "job_description": "Design & DX Promotion Engineer (Architecture & Construction) : BJIT Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List BJIT Ltd. Design & DX Promotion Engineer (Architecture & Construction) Application Deadline : 10 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Dhaka Salary: Tk. 10000 (Monthly) Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Architecture (B.Arch) Bachelor in Engineering (BEngg) Responsibilities & Context Job Overview: We are seeking an engineer who will be involved in enhancing design operations and promoting digital transformation (DX) in the architecture and construction field through the use of IT and digital technologies. In this position, you will collaborate with Japanese designers and engineers to work on the digital utilization of design data, improvement of business processes, and exploration of new approaches to design and construction. Responsibilities: Support for organizing and digitizing architectural design data (drawings, 3D models, etc.) Design assistance using BIM, CAD, and related tools Analysis of design and construction processes and proposals for improvement to promote DX Online technical communication with internal design and construction team members In the future, participation in planning and consideration of design DX initiatives and business system implementation Required Qualifications & Experience Currently majoring in or having completed studies in IT, engineering, architecture, or a related field Basic understanding of programming, data processing, or digital tools Willingness to collaborate with Japanese team members and maintain a continuous learning mindset Basic business communication skills in English Willingness to obtain qualifications required in the construction industry Skills & Expertise 3D modeling and rendering BIM CAD Workplace Work from home Employment Status Full Time Job Location Dhaka Job Highlights Practical DX experience in Japanese construction and design workplaces Hands-on project experience through collaboration with Japanese engineers Potential opportunities for future employment in Japan and long-term partnerships Company Information BJIT Ltd. Follow Address: House # 2275, 2279, Pachkhola, Dhaka-1212 Business: ICT software production Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ "
  },
  {
    "url": "https://bdjobs.com/h/details/1457677?ln=1",
    "company_name": "Yameen Tours and Travels",
    "job_title": "General Manager",
    "location": "Dhaka (Banani)",
    "salary": "Tk. 30000 - 50000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "General Manager : Yameen Tours and Travels Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Yameen Tours and Travels General Manager Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 01 Age: 26 to 40 years Location: Dhaka (Banani) Salary: Tk. 30000 - 50000 (Monthly) Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 40 years Retired Army background will be highly encouraged. Responsibilities & Context Provide stategic leadershiop and operational oversight to ensure business profitability , distribution excellence, and organizational efficiecncy . The General Manager will drive long term growth initiatives, ensure financial discipline,and maintain high operational standards across the entire office key Responsibilities: Formulate and execute day to day business and opearational strategies to align with corporate goals and market priorities . Oversee implementation of distribution plans, ensuring channel efficiency, territory coverage and commercial growth. Conduct periodic business review and evaluate performance and adjust strategies . Approve major decision in office . Lead the marketing including structure ,succesion, planning and strategies . Skills & Expertise Administration Management Monitoring and Reporting Supervision Team management Team Management & Supervision Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Banani) Company Information Yameen Tours and Travels Follow More jobs from this company Address: House-79,Block-J,Chairmanbari, Banani,Dhaka-121 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from "
  },
  {
    "url": "https://bdjobs.com/h/details/1458010?ln=1",
    "company_name": "T.Hussain & Co.",
    "job_title": "CA Articleship",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "CA Articleship : T.Hussain & Co. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List T.Hussain & Co. CA Articleship Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Location: Dhaka Salary: Tk. 7000 - 14000 (Monthly) Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Assist in statutory audit, internal audit, and special audit assignments Perform vouching, verification, checking of books of accounts, and physical inspection Prepare audit working papers, schedules, and supporting documents Assist in preparation of financial statements and accounts as per applicable standards Assist in income tax and VAT matters, including return preparation and assessment support Maintain books of accounts and prepare management and statutory reports Collect necessary information and documents from clients as instructed Assist seniors and partners in day-to-day professional assignments Maintain proper records and ensure confidentiality of client information Perform other duties as assigned by the firm from time to time Skills & Expertise Accounting Dedication Good comunication skill MS Office Suggested by Accounts and Finance Taxation VAT and Tax Compensation & Other Benefits Allowance and increment will be paid as per ICAB Guidelines. Firm may also offer higher allowance than ICAB prescribed allowance based on educational qualification, results and competence      and firm`s policy. Two weekly holidays subject to reporting deadlines of clients  and in house training Sufficient exam leaves complying with ICAB circular Internal and external trainings on IAS, IFRS, Taxation, IT and contemporary matters Sufficient guidance for ICAB exam preparation from experienced Chartered Accountants Job placement facilities after completion of CC Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information T.Hussain & Co. Follow Address: H. B. Tower, 1st Floor, 23/G/1 Panthapath, (Opposite of Bashundhara Shopping Mall)  Dhaka-1205 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে"
  },
  {
    "url": "https://bdjobs.com/h/details/1458319?ln=1",
    "company_name": "American Wellness Center (Bashundhara)",
    "job_title": "Call Center Executive",
    "location": "Dhaka",
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "14 Feb 2026",
    "job_description": "Call Center Executive : American Wellness Center (Bashundhara) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List American Wellness Center (Bashundhara) Call Center Executive Application Deadline : 14 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Location: Dhaka Salary: Tk. 10000 - 14000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Excellent communication skills in Bangla and basic English Good listening and problem-solving skills Basic computer knowledge (MS Word, Excel, CRM tools) Ability to work under pressure and meet targets Professional attitude and customer-centric mindset Experience Requirements Freshers are encouraged to apply Prior call center or customer service experience will be an advantage Responsibilities & Context We are looking for enthusiastic and customer-focused Call Center Executives to handle inbound and outbound calls, provide accurate information to customers, and ensure high levels of customer satisfaction. The ideal candidate should have strong communication skills and a professional attitude. Office Time: 12 PM - 8 PM Job Responsibilities Handle inbound and outbound customer calls professionally Respond to customer inquiries, complaints, and requests effectively Provide accurate information about products and services Maintain proper call records and customer data Follow company policies, scripts, and quality standards Escalate complex issues to the concerned department when necessary Achieve individual and team performance targets Skills & Expertise Call Center Call Center Operation Customer Care Customer Handling Customer Relationship Management Customer Service Management Customer Support Outbound and Inbound Calls Outbound calls Social Media Management Suggested by Call Center Operation Client Relationship Management Customer Service Good Ms office and Emailing skill Compensation & Other Benefits Over time allowance Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information American Wellness Center (Bashundhara) Follow Address: 11/5 Progoti Soroni Bashundhara Main Gate Vatara, Dhaka-1229 Website: https://awc.clinic/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq "
  },
  {
    "url": "https://bdjobs.com/h/details/1458222?ln=1",
    "company_name": "AspireX study abroad consultant",
    "job_title": "Junior Counselor",
    "location": "Dhaka (Baridhara J Block)",
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Junior Counselor : AspireX study abroad consultant Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List AspireX study abroad consultant Junior Counselor Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Location: Dhaka (Baridhara J Block) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Experience Requirements: Freshers are welcome. 6 months of experience in counseling, customer service, or a similar role will be an advantage. Additional Requirements: Must be proficient in English (speaking & writing). Good communication and interpersonal skills. Basic computer skills (MS Word, Excel, Email) and data entry proficiency. Positive attitude, self-motivated, and target-oriented. Responsibilities & Context Junior Counselor – Study Abroad (AspireX Immigration & Education Consultancy) Counsel students about study abroad opportunities, courses, universities, tuition fees, and visa procedures. Assist in application preparation and documentation. Communicate professionally with students via phone, email, and in-person meetings. Maintain accurate student records and ensure timely follow-up. Demonstrate expertise in SOP (Statement of Purpose) writing – priority will be given to strong writers. Support marketing and promotional campaigns. Perform data entry and maintain the client database. Work with the team to achieve monthly and quarterly targets. Skills & Expertise Communication Counseling Suggested by Client Service Immigration Consultant Visa Processing Compensation & Other Benefits Attractive and high commission structure based on performance. 2 yearly festival bonuses. Mobile bill allowance. Workplace Work at office Employment Status Full Time Job Location Dhaka (Baridhara J Block) Company Information AspireX study abroad consultant Follow Address: AspireX is a fast-growing immigration and education consultancy firm specializing in study abroad opportunities. We are looking for passionate and energetic individuals to join our team as Junior Counselors and Interns. Freshers are encouraged to apply. Website: https://www.aspirexadmission.org/ Business: AspireX is a trusted immigration and education consultancy firm dedicated to guiding students towards their dream of studying abroad. We offer personalized counseling, university selection, application assistance, visa processing, and pre-departure support for destinations including the USA, UK, Canada, Australia, and more. With a professional and student-friendly approach, AspireX ensures transparent, reliable, and result-oriented services to help students achieve global education success. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাক"
  },
  {
    "url": "https://bdjobs.com/h/details/1458338?ln=1",
    "company_name": "Brahmaputra International University",
    "job_title": "Lecturer (Department of Law)",
    "location": "Jamalpur (Jamalpur Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Lecturer (Department of Law) : Brahmaputra International University Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Brahmaputra International University Lecturer (Department of Law) Application Deadline : 15 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Jamalpur (Jamalpur Sadar) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Deliver lectures, tutorials, and seminars in assigned law courses in accordance with the approved curriculum and academic calendar. Prepare lesson plans, course outlines, teaching materials, and assessment tools to ensure effective learning outcomes. Evaluate studentsʼ performance through examinations, assignments, presentations, and research work with fairness and transparency. Provide academic guidance, mentoring, and consultation to students to support their academic and professional development. Encourage critical thinking, legal reasoning, ethical awareness, and research-oriented learning among students. Skills & Expertise Suggested by Curriculum Development Legal Affairs Lesson Planning Teaching/ Training Compensation & Other Benefits Weekly 2 holidays Festival Bonus: 2 Salary Review: Yearly Other benefits as per BRIU policy. Excellent working environment. Scope for continuous learning and career development Workplace Work at office Employment Status Full Time Job Location Jamalpur (Jamalpur Sadar) Read Before Apply Interested candidates are requested to submit their CV with cover letter and attach file of all academic certificates and marksheets, photograph (passport size) by email or hard copy. Location: Jamalpur (Jamalpur Sadar) The Registrar, Brahmaputra International University, Foujdari Morh, Jamalpur- 2000. Email: sfmu.job@gmail.com Apply Procedure Email Your CV Send your CV to the given email sfmu.job@gmail.com Company Information Brahmaputra International University Follow Address: Foujdari Morh, Jamalpur Sadar, Jamalpur-2000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Regist"
  }
]