[
  {
    "url": "https://bdjobs.com/h/details/1458687?ln=1",
    "company_name": "A Reputed Company",
    "job_title": "HR Manager (Gaming / iGaming Industry)",
    "location": "Bangladesh, India, Nepal, Pakistan",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "HR Manager (Gaming / iGaming Industry) : A Reputed Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Company HR Manager (Gaming / iGaming Industry) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 26 to 40 years Location: Bangladesh, India, Nepal,... Bangladesh, India, Nepal, Pakistan Salary: Tk. 50000 - 100000 (Monthly) Published: 10 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 26 to 40 years Responsibilities & Context Manage the full recruitment and selection process for an iGaming site Source, screen, and hire candidates for technical, marketing, support, and operations teams Develop and implement HR policies, procedures, and compliance Handle employee onboarding, attendance, leave, and performance management Maintain employee records and HR documentation Support management with workforce planning and HR strategy Ensure confidentiality and professionalism in all HR matters Skills & Expertise Communication in English Digital content Digital Marketing Gaming HR and Payroll multinational company Office Management Sports Suggested by Administration HR Human Resource Management Management Compensation & Other Benefits Weekly 2 holidays,Tour allowance,Performance bonus,Mobile bill Salary Review: Half Yearly Festival Bonus: 2 Workplace Work from home Employment Status Full Time Job Location Bangladesh, India, Nepal, Pakistan Job Highlights Proven experience in hiring for iGaming / gaming companies (mandatory) Strong understanding of Igaming site operations and roles Minimum 3-5 years of experience in HR or Human Resources Management Company Information A Reputed Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills C"
  },
  {
    "url": "https://bdjobs.com/h/details/1461032?ln=1",
    "company_name": "Inan Medicals Limited",
    "job_title": "Sr Officer",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Sr Officer : Inan Medicals Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Inan Medicals Limited Sr Officer Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 3 Age: 23 to 30 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 25000 (Monthly) Experience: 1 to 3 years Published: 18 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Experience 1 to 3 years Additional Requirements Age 23 to 30 years Responsibilities & Context Operational Leadership: Supervise team members, monitor day-to-day operations, and take quick decisions to manage crises. Administration & Management: Oversee documentation, filing, asset management, and ensure compliance with internal policies and government/donor regulations. Human Resources: Assist in recruitment, onboarding, performance appraisals, training, and managing employee attendance or leave records. Procurement & Inventory: Manage vendor relationships, negotiate contracts, issue purchase orders (PO), and manage store inventory (e.g., ensuring FIFO stock management). Finance & Reporting: Prepare financial reports, manage budgets, process payments, and prepare for audits. Communication: Act as a liaison for internal and external communication and prepare reports for management. Skills & Expertise Suggested by HR Policy Human Resource Management Labor Law Compensation & Other Benefits T/A,Tour allowance,Medical allowance,Mobile bill Festival Bonus: 3 Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Inan Medicals Limited Follow Address: 137/10, S. R. Plaza (Level-7), Mazar Road, 2nd Colony, Mirpur-1, Dhaka-1216. Website: https://imlbd.com/ Business: Import, Sales, Distribution and assembling Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE!"
  },
  {
    "url": "https://bdjobs.com/h/details/1461097?ln=1",
    "company_name": "Sitexzen LTD",
    "job_title": "Customer Relation Officer",
    "location": "Dhaka (Mirpur12)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "Customer Relation Officer : Sitexzen LTD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sitexzen LTD Customer Relation Officer Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 19 to 27 years Location: Dhaka (Mirpur12) Salary: Negotiable Published: 19 Feb 2026 Application Insights View Requirements Education Additional Requirements Age 19 to 27 years No experience needed (Training will be provided) Previous experience will be considered an advantage Ability to speak English fluently is Mandatory Good communication & listening skills Basic/Advance computer knowledge Positive attitude and willingness to learn Responsibilities & Context WE ARE HIRING – Customer Relationship Officer (CRO) Shift: Night Job Responsibilities : Call potential and existing clients Book appointments and follow up with leads Collect and update client information in the system Manage and maintain strong client relationships Handle inbound and outbound calls professionally Coordinate with internal team regarding client needs Ability to speak English fluently is mandatory Skills & Expertise Computer Literacy Fluent in English Speaking Tech Savvy Suggested by Client Relationship Management Customer Service Client Service Compensation & Other Benefits Performance bonus Benefits : Monthly Performance-Based Bonuses Dinner & Snacks Provided Sehri during Ramadan Career growth opportunities Supportive & collaborative team environment Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur12) Company Information Sitexzen LTD Follow Address: Mirpur 12 D Block Website: https://lead.sitexzen.com/ Business: Sitexzen Ltd is a UK-based technology company, officially registered and incorporated in the United Kingdom. We specialize in delivering advanced business automation, lead generation, and AI-powered digital solutions designed to help small and medium-sized businesses scale efficiently and streamline their operations.Our mission is to empower organizations with intelligent, results-driven technology that automates critical business functions — from lead acquisition and customer relationship management to communication handling and appointment scheduling — enabling business owners and teams to focus on strategic growth rather than repetitive administrative tasks.We proudly serve clients across multiple international markets, including: United Kingdom, United States of America, Australia,New Zealand Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থ"
  },
  {
    "url": "https://bdjobs.com/h/details/1461576?ln=1",
    "company_name": "Agro Farm BD",
    "job_title": "অফিস সহকারী",
    "location": "Dhaka (Mirpur 6)",
    "salary": "Tk. 9000 - 14000 (Monthly)",
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "অফিস সহকারী : Agro Farm BD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Agro Farm BD অফিস সহকারী Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 10 Age: 19 to 33 years Location: Dhaka (Mirpur 6) Salary: Tk. 9000 - 14000 (Monthly) Experience: 1 to 2 years Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education SSC Experience 1 to 2 years The applicants should have experience in the following business area(s): Agro based firms (incl. Agro Processing/Seed/GM), Farming, Science Laboratory, Dairy, Agro based Startup, Travel Startup Freshers are also encouraged to apply. Additional Requirements Age 19 to 33 years Responsibilities & Context অফিসের প্রয়োজনীয় কাজ করতে হবে। কম্পিউটার ও মোবাইল অপারেটিং জানতে হবে। বাংলা ও ইংলিশ লিখতে ও পড়তে জানতে হবে । কথা বার্তায় নর্ম ও ভদ্র হতে হবে। Employment Status Full Time Job Location Dhaka (Mirpur 6) Company Information Agro Farm BD Follow Address: Kathalbaria, Lakshmipur Hat, Natore Sadar, Natore Website: https://agrofarmbd.com/ Business: All kinds of Herbs supplyier company in bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Internal auditor certificate course on ISO 14001:2015 Enviro... 3000 BDT Joyshree Das Register Now Internal Auditor certificate course on ISO 9001:2015 4000 BDT Joyshree Das Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now Internal Auditor Certificate Course on Compliance Management 3500 BDT Joyshree Das Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am t"
  },
  {
    "url": "https://bdjobs.com/h/details/1461330?ln=1",
    "company_name": "Asia Tours & Travels",
    "job_title": "Visa Counselor",
    "location": "Chattogram, Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "01 Mar 2026",
    "job_description": "Visa Counselor : Asia Tours & Travels Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Asia Tours & Travels Visa Counselor Application Deadline : 01 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 15 Location: Chattogram, Dhaka Salary: Negotiable Published: 19 Feb 2026 Applicants are encouraged to submit Video CV. Application Insights View Requirements Education Experience Additional Requirements Demonstrated experience managing a significant number of clients efficiently with professionalism, skill, and due diligence. Regularly follow up with prospective leads to ensure proper guidance, build relationships, and achieve successful client conversion. Professionally assist in both online and offline marketing activities to support business growth. Provide appropriate consultation and advice based on clients` goals, needs, and expectations. Maintain accurate client records, update information regularly, and ensure proper follow-up. Assist clients with required documentation, application procedures, and related formalities. Clearly explain service details, processes, and requirements in a professional manner. Coordinate effectively with marketing and operations teams to ensure smooth service delivery. Participate actively in meetings, workshops, training sessions, and professional development activities. Maintain and update client communications through phone calls, Facebook, WhatsApp, email, and other relevant platforms. Responsibilities & Context Short description: We are looking for an energetic and professional Counselor to join our team. The candidate must be confident, able to communicate clearly and enthusiastic about providing the right guidance and support to clients. The key responsibilities of this position are to understand the needs of clients, provide appropriate advice and ensure a pleasant and satisfactory service. Responsibilities : Provide accurate visa counseling for different countries Guide students and clients on visa requirements and documentation Prepare, review, and follow up visa files Analyze visa refusal cases and suggest solutions Maintain professional service standards of the organization Skills & Expertise Call Center Communication Counseling Sales & Marketing Student Counseling Telemarketing Suggested by Student Visa Processing Visa Processing Compensation & Other Benefits T/A,Tour allowance,Mobile bill,Profit share Salary Review: Yearly Workplace Work at office Employment Status Full Time Job Location Chattogram, Dhaka Company Information Asia Tours & Travels Follow More jobs from this company Address: Jamuna Future Park Level #3, Shop #3A-043 KA-244, Kuril Pragati Sharani Bashundhara R/A, Dhaka-1229, Dhaka, Bangladesh, 1229 Business: We provide all country`s Visa, Air Ticket, student consultancy Etc. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরি"
  }
]