[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20591",
    "job_id": "20591",
    "company_name": "Alfina Corporation ",
    "job_title": "Office Assistant",
    "location": "Chittagong",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-15",
    "date_posted": "2026-02-23",
    "industry": "General Management/Admin",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Performing clerical tasks, managing correspondence, maintaining records, and providing receptionist duties.\n\nPerforming clerical tasks, managing correspondence, maintaining records, and providing receptionist duties."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20599",
    "job_id": "20599",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান(সাইকেলিস্ট)",
    "location": "Uttara, Dhanmondi, Panthapath, Rampura, Shewrapara",
    "salary": "TK. 9,834-13,434",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: In the areas of Panthapath, Shahidabad, Rampura, Hazaribagh, and Uttarkhan, there are vacancies.\n\nSalary:\nCyclist: 9,834 - 13,434 BDT. (Having a bicycle is necessary)\n- Shifts from 7 am, 9 am, and 10:45 am.\n- 12 hours of duty.\n- 1 day off every 3 consecutive days, 8 days off per month.\n- Monthly mobile bill provided.\n- Delivery bonus:\n  - 10 BDT bonus for each delivery from 18 to 24.\n  - 15 BDT bonus for all deliveries after 24.\nIncentive system in place.\nOther facilities:\n- Salary increment after six months.\n- Festival allowance given twice a year.\n- 14 days sick leave per year from six months onwards.\n- 11 days festival leave per year from six months onwards.\n- 12 days paid leave per year from six months onwards.\n- 10 days casual leave per year from six months onwards.\n\nJoin now, contact today:\n01401153402\n\nRequirements: Terms and Conditions:\nCyclist must have a bicycle in the post.\nMust be 18 years old.\n\nপান্থপথ, শেওড়াপাড়া, রামপুরা, হাজারীবাগ, উত্তরখান এই এরিয়াগুলোতে ভ্যাকেন্সি আছে. বেতন: সাইক্লিস্টঃ ৯,৮৩৪ - ১৩,৪৩৪ টাকা। (সাইকেল থাকা আবশ্যক) · সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । · ৩ দিন পর পর ১ দিন ছুটি, মাসে ৮ দিন ছুটি . মাসিক মোবাইল বিল প্রদান করা হয়। -> ডেলিভারি বোনাসঃ · ১৮ থেকে ২৪ প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস, · ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস। ইনসেন্টিভ এর ব্যবস্থা রয়েছে ->অন্যান্য সুবিধা সমুহঃ · ছয় মাস পর বেতন বৃদ্ধি পাবে। · বছরে দুইবার উৎসব ভাতা দেয়া হয়। · ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় যোগদান করতে আজই আজ ই যোগাযোগ করুন: 01401153402"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20596",
    "job_id": "20596",
    "company_name": "Best All-Baby Mart ",
    "job_title": "অপারেশন ম্যানেজার",
    "location": "Demra",
    "salary": "TK. 18,000-25,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-20",
    "date_posted": "2026-02-23",
    "industry": "Management Staff",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Best All-Baby Mart is a rapidly growing multi-faceted business establishment (operating online baby food, children's products, and other goods). The organization is looking to hire an experienced and leadership-oriented Operations Manager to oversee the overall operations with expertise in management, team management, and operational development. Main Responsibilities: Supervision of all office staff's work efficiency, task distribution, and performance monitoring Ensuring proper control and record-keeping of attendance, leaves, and office hours Monitoring the complete process from order taking to delivery Ensuring proper order processing, invoice generation, and packaging Regular communication with courier partners and follow-up on delivery status Managing returns and customer complaints ensuring swift resolution Stock management, inventory control, and reconciliation Planning purchases and coordinating with suppliers Preparing daily, weekly, and monthly sales and operation reports in Excel Expense analysis, budget monitoring, and operational cost reduction planning Team training and performance evaluation Developing and implementing new processes/Standard Operating Procedures (SOP) Planning sales trends and business development through data analysis Presenting reports to the owner/management daily Educational Qualifications: Minimum Bachelor's degree (Honors/BBA/MBA in Management, Marketing, Finance, or related field) Additional training or courses in Operations Management/Supply Chain Management will be advantageous Experience and Skills: At least 1-3 years of experience in supervision or operations management (e-commerce experience is a plus) Proficiency in MS Excel (VLOOKUP, HLOOKUP, IF, Pivot Table, Data Analysis, etc.) Skills in team management and problem-solving Ability to make quick decisions and work under pressure Honest, hardworking, and responsible attitude Salary and Benefits: Monthly salary: 18,000 - 25,000 BDT (based on experience) Performance-based bonus 3-month probation period Potential for future promotion Duty Hours: 9:00 AM to 9:00 PM Workplace: Dhaka - Demra, Staff Quarter, Baro Bhanga Application Process: Interested candidates can email their CV to: (mention email address) Write in the subject line: Operation Manager Application Contact: (mention mobile number)\n\nBest All-Baby Mart একটি দ্রুত বর্ধনশীল বহুমুখী ব্যবসা প্রতিষ্ঠান (অনলাইন বেবি ফুড, শিশু পণ্য ও অন্যান্য পণ্য) পরিচালনা করছে। প্রতিষ্ঠানের সার্বিক কার্যক্রম দক্ষতার সাথে পরিচালনা, টিম ম্যানেজমেন্ট ও অপারেশনাল উন্নয়নের জন্য একজন অভিজ্ঞ ও নেতৃত্বগুণসম্পন্ন অপারেশন ম্যানেজার নিয়োগ দেওয়া হবে। প্রধান দায়িত্বসমূহ: অফিসের সকল স্টাফের কাজ তদারকি, দায়িত্ব বণ্টন ও পারফরম্যান্স মনিটরিং উপস্থিতি, ছুটি ও অফিস সময় সঠিকভাবে নিয়ন্ত্রণ ও রেকর্ড সংরক্ষণ অর্ডার গ্রহণ থেকে ডেলিভারি পর্যন্ত সম্পূর্ণ প্রসেস মনিটরিং অর্ডার প্রসেসিং, ইনভয়েস তৈরি ও প্যাকেজিং সঠিকভাবে সম্পন্ন হচ্ছে কিনা নিশ্চিত করা কুরিয়ার পার্টনারদের সাথে নিয়মিত যোগাযোগ ও ডেলিভারি স্ট্যাটাস ফলোআপ রিটার্ন "
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20601",
    "job_id": "20601",
    "company_name": "Singer Bangladesh Limited",
    "job_title": "অপারেটর",
    "location": "Narayanganj",
    "salary": "TK. 11,935-17,000",
    "experience": "Fresher",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-18",
    "date_posted": "2026-02-23",
    "industry": "Manufacturing",
    "vacancy": 100,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Located in Narayanganj, a prestigious multinational electronics product manufacturer is urgently hiring operators/assistant operators. 🏢 Job Description: Title: Operator Age: 18 to 35 years Experience: Both freshers and experienced candidates can apply Job Location: Bangladesh Special Economic Zone (BSEZ), Sonargaon, Araihazar, Narayanganj 💰 Salary and Benefits: Salary (8-hour duty): 11,935 – 15,000 BDT Overtime (OT): 49 BDT per hour (mandatory for 4 hours OT per month) Night Shift Allowance: 75 BDT per night Total Potential Income: 16,000 – 18,000 BDT (including OT) Shifts: One week day shift (8 am – 8 pm) One week night shift (8 pm – 8 am) 🛠️ Benefits: Overtime opportunities Night shift allowance Double attendance on working holidays Eid bonuses (twice a year, as per company policy) Life insurance Company T-shirt, uniform, safety shoes, tiffin box, bag, water bottle Transportation facilities from Gauchia and Araihazar 📅 Other Information: Weekly holiday: Friday (government holidays applicable) Double attendance on working holidays Accommodation and meals: Self-responsibility ✅ Additional Requirements: Regular attendance must be ensured Mandatory use of 100% safety shoes (provided by the company) ⏳ Apply: This is a great opportunity to shape your career. Interested candidates should apply quickly and ensure their future! Job Type Full-time Working Hours 8 hours\n\nআড়াইহাজার, নারায়ণগঞ্জে অবস্থিত একটি স্বনামধন্য বহুজাতিক ইলেকট্রনিক্স পণ্য প্রস্তুতকারক প্রতিষ্ঠান জরুরি ভিত্তিতে অপারেটর/সহকারী অপারেটর নিয়োগ দিচ্ছে। 🏢 পদের বিবরণ: পদবী: অপারেটর বয়স: ১৮ থেকে ৩৫ বছর অভিজ্ঞতা: ফ্রেশার এবং অভিজ্ঞ উভয়েই আবেদন করতে পারবেন জব লোকেশন: বাংলাদেশ স্পেশাল ইকোনমিক জোন (BSEZ), ছনপাড়া, আড়াইহাজার, নারায়ণগঞ্জ 💰 বেতন ও সুবিধাদি: বেতন (৮ ঘন্টা ডিউটি): ১১,৯৩৫ – ১৫,০০০ টাকা ওভারটাইম (OT): প্রতি ঘণ্টায় ৪৯ টাকা (মাসে ৪ ঘন্টা ওটি বাধ্যতামূলক) নাইট শিফট ভাতা: প্রতি নাইট ৭৫ টাকা মোট সম্ভাব্য ইনকাম: ১৬,০০০ – ১৮,০০০ টাকা (OT সহ) শিফটিং:এক সপ্তাহ ডে শিফট (সকাল ৮টা – রাত ৮টা) এক সপ্তাহ নাইট শিফট (রাত ৮টা – সকাল ৮টা) 🛠️ সুবিধা সমূহ: ওভারটাইমের সুযোগ নাইট শিফট ভাতা ছুটির দিনে কাজ করলে ডাবল হাজিরা ঈদ বোনাস (বছরে ২টি, কোম্পানি পলিসি অনুযায়ী) লাইফ ইনস্যুরেন্স কোম্পানির টি-শার্ট, ইউনিফর্ম, সেফটি সু, টিফিন বাটি, ব্যাগ, পানির পট গাউছিয়া ও আড়াইহাজার থেকে পরিবহন সুবিধা 📅 অন্যান্য তথ্য: সাপ্তাহিক ছুটি: শুক্রবার (সরকারি ছুটিও পাবেন) ছুটির দিনে কাজ করলে ডাবল হাজিরা থাকা ও খাওয়া: নিজের দায়িত্বে ✅ অতিরিক্ত শর্তাবলী: সঠিকভাবে নিয়মিত হাজিরা নিশ্চিত করতে হবে ১০০% সেফটি সু ব্যবহার বাধ্যতামূলক (কোম্পানির সরবরাহ) ⏳ আবেদন করুন: এটি আপনার ক্যারিয়ার গঠনের একটি দারুণ সুযোগ। আগ্রহী প্রার্থীরা দ্রুত আবেদন করুন এবং নিশ্চিত করুন আপনার ভবিষ্যৎ! চাকরির ধরন ফুল-টাইম কাজের সময় ৮ ঘন্টা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20598",
    "job_id": "20598",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান(সাইকেলিস্ট)",
    "location": "Uttara, Notun Bajar, Mirpur DOHS, Jatrabari, Lalbagh",
    "salary": "TK. 9,834-13,434",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: In the areas of Jatrabari, Lalbagh, Fakirbadi, Dhalibari (Vatara), and Uttara, there are vacancies. Salary: Cyclist: 9,834 - 13,434 taka. (Having a bicycle is necessary) · Shifts from 7 am, 9 am, and 10:45 am. 12-hour duty. · One day off after every 3 days, 8 days off per month. Monthly mobile bill provided. -> Delivery bonus: · 10 taka bonus for each delivery from 18 to 24, · 15 taka bonus for all deliveries after 24. Incentive system available. -> Other facilities: · Salary increment after six months. · Festival allowance given twice a year. · Sick leave of 14 days per year after six months. · 11 days of festival leave per year after six months. · 12 days of earned leave per year after six months. · 10 days of casual leave per year after six months Contact today to join: 01401153402\n\nRequirements: Terms and Conditions:\nCyclist must have a bicycle in the post.\nMust be at least 18 years old.\n\nযাত্রাবাড়ী, লালবাগ, ফকিরবাড়ি, ঢালীবাড়ি(ভাটারা), উত্তরা এই এরিয়াগুলোতে ভ্যাকেন্সি আছে. বেতন: সাইক্লিস্টঃ ৯,৮৩৪ - ১৩,৪৩৪ টাকা। (সাইকেল থাকা আবশ্যক) · সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । · ৩ দিন পর পর ১ দিন ছুটি, মাসে ৮ দিন ছুটি . মাসিক মোবাইল বিল প্রদান করা হয়। -> ডেলিভারি বোনাসঃ · ১৮ থেকে ২৪ প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস, · ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস। ইনসেন্টিভ এর ব্যবস্থা রয়েছে ->অন্যান্য সুবিধা সমুহঃ · ছয় মাস পর বেতন বৃদ্ধি পাবে। · বছরে দুইবার উৎসব ভাতা দেয়া হয়। · ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় যোগদান করতে আজই আজ ই যোগাযোগ করুন: 01401153402"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20603",
    "job_id": "20603",
    "company_name": "Nirvor (An authorized distributor of bKash Limited) ",
    "job_title": "Senior Merchant Development Officer ( MDO )",
    "location": "Uttara",
    "salary": "TK. 16,500-24,500",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Sales/Marketing",
    "vacancy": 14,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Opportunity to work as a Merchant Officer at bKash! Position: Merchant Development Officer (MDO) Location: Uttara An opportunity to work with a leading local MFS technology company in Bangladesh. Job Description - Regular merchant visits Onboard new merchants Create awareness among merchants Only males can apply. Salary: 16,500 - 24,500 BDT Prior experience working in the field will be given preference.\n\nবিকাশের মার্চেন্ট অফিসার হিসেবে কাজের সুযোগ! পদের নামঃ Merchant Development Officer ( MDO ) কর্মস্থলঃ উত্তরা বাংলাদেশের একটি শীর্ষস্থানীয় MFS প্রযুক্তি কোম্পানির সাথে কাজ করার সুযোগ। কাজের বিবরণ - রেগুলার মার্চেন্ট ভিজিট করা নতুন মার্চেন্ট অনবোর্ড করা মার্চেন্টদের মধ্যে সচেতনতা তৈরি করা শুধুমাত্র পুরুষরা আবেদন করতে পারবেন। বেতন - ১৬৫০০ - ২৪৫০০ টাকা ফিল্ডে কাজ করার অভিজ্ঞতা থাকলে অগ্রাধিকার পাবেন।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20602",
    "job_id": "20602",
    "company_name": "New Era Consultancy",
    "job_title": "Counselor – Visa Consultancy",
    "location": "Gulshan-Banani",
    "salary": "TK. 15,000-35,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: New Era Consultancy, a leading visa and immigration consultancy firm, is seeking dynamic, self-motivated, and customer-oriented individuals for the position of Counselor. The ideal candidate should have previous experience in visa consultancy services, excellent communication skills, and a dedication to assisting clients in achieving their international goals.\n\nKey Responsibilities:\n- Provide professional counseling and guidance to clients on visa applications, studying abroad, and immigration processes.\n- Maintain positive communication with clients and promptly respond to inquiries and follow-ups.\n- Prepare and manage documentation accurately, ensuring all records are up to date.\n- Coordinate with the operations and processing team to ensure a seamless client experience.\n- Stay informed about visa regulations, embassy guidelines, and country-specific requirements.\n- Contribute to achieving team and company objectives through proactive engagement.\n\nRequirements: Freshers with a strong willingness to learn and adapt are also encouraged to apply. Excellent verbal and written communication skills (English proficiency preferred). Strong organizational and problem-solving abilities. Office Hours: 10:00 a.m. – 6:00 p.m.\n\nNew Era Consultancy, a leading visa and immigration consultancy firm, is looking for dynamic, self-motivated, and customer-oriented individuals for the position of Counselor. The ideal candidate will have prior experience in visa consultancy services, excellent communication skills, and a passion for helping clients achieve their international goals. Key Responsibilities: Provide professional counseling and guidance to clients regarding visa applications, study abroad, and immigration processes. Maintain positive communication with clients and promptly respond to inquiries and follow-ups. Prepare and manage documentation accurately, ensuring all records are up to date. Coordinate with the operations and processing team to ensure a smooth client experience. Stay updated on visa rules, embassy guidelines, and country-specific requirements. Contribute to achieving team and company targets through proactive engagement."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20592",
    "job_id": "20592",
    "company_name": "Alfina Corporation ",
    "job_title": "Video Editor",
    "location": "Chittagong",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-15",
    "date_posted": "2026-02-23",
    "industry": "Graphics/Video Editor",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Review raw footage and select appropriate shots based on project requirements and scripts.\nEdit and assemble video content for marketing campaigns, corporate communications, social media, training materials, and promotional projects.\nEnsure smooth transitions, logical sequencing, and professional pacing.\nPerform audio editing, including synchronization, sound balancing, and background music integration.\nApply color correction and grading to maintain visual consistency and brand standards.\nIncorporate motion graphics, titles, captions, and visual effects where necessary.\nCollaborate with marketing, creative, and management teams to understand project objectives.\nImplement feedback and revisions promptly to ensure stakeholder satisfaction.\nExport and optimize final videos for various platforms and distribution channels.\nMaintain organized archives of project files and assets.\n\nReview raw footage and select appropriate shots based on project requirements and scripts. Edit and assemble video content for marketing campaigns, corporate communications, social media, training materials, and promotional projects. Ensure smooth transitions, logical sequencing, and professional pacing. Perform audio editing, including synchronization, sound balancing, and background music integration. Apply color correction and grading to maintain visual consistency and brand standards. Incorporate motion graphics, titles, captions, and visual effects where necessary. Collaborate with marketing, creative, and management teams to understand project objectives. Implement feedback and revisions promptly to ensure stakeholder satisfaction. Export and optimize final videos for various platforms and distribution channels. Maintain organized archives of project files and assets."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20595",
    "job_id": "20595",
    "company_name": "Alfina Corporation ",
    "job_title": "Assistant Manager",
    "location": "Chittagong",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-15",
    "date_posted": "2026-02-23",
    "industry": "General Management/Admin",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Assist in managing day-to-day office operations to ensure efficiency and productivity.\nSupervise and coordinate administrative staff activities.\nManage office schedules, appointments, and meeting arrangements.\nMaintain accurate documentation, records, and confidential files.\nMonitor office supplies, procurement processes, and vendor relationships.\nAssist in budget preparation, expense tracking, and invoice processing.\nEnsure compliance with company policies, procedures, and operational standards.\nHandle internal and external communications professionally.\nPrepare reports, presentations, and operational summaries for management.\nSupport HR functions such as attendance tracking and onboarding coordination (if applicable).\nIdentify operational issues and recommend solutions for process improvement.\nAssist in organizing company meetings, training sessions, and corporate events.\n\nAssist in managing day-to-day office operations to ensure efficiency and productivity. Supervise and coordinate administrative staff activities. Manage office schedules, appointments, and meeting arrangements. Maintain accurate documentation, records, and confidential files. Monitor office supplies, procurement processes, and vendor relationships. Assist in budget preparation, expense tracking, and invoice processing. Ensure compliance with company policies, procedures, and operational standards. Handle internal and external communications professionally. Prepare reports, presentations, and operational summaries for management. Support HR functions such as attendance tracking and onboarding coordination (if applicable). Identify operational issues and recommend solutions for process improvement. Assist in organizing company meetings, training sessions, and corporate events."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20549",
    "job_id": "20549",
    "company_name": "Rokomari.com",
    "job_title": "কুকিং স্টাফ",
    "location": "Arambag, Motijheel",
    "salary": "TK. 30,000-40,000",
    "experience": "5-10 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-21",
    "date_posted": "2026-02-23",
    "industry": "Restaurant staff",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibilities:\n- Food Preparation: Cooking according to the daily menu of the office. Prepare healthy and nutritious food following health regulations.\n- Stock Management: Ensure proper collection, storage, and quantity verification of raw materials to ensure availability of necessary food items.\n- Team Management: Supervise the assistant chef and other staff in the kitchen and ensure the quality of work.\n- Taste and Quality Control: Regular monitoring to maintain the taste, aroma, and quality of the food.\n- Official Events: Arrange food for special events or meetings.\n\nRequirements: Required Qualifications and Skills: Minimum 5 years of experience (as a senior chef) Completion of chef training/course from a recognized institute Proficiency in various types of cooking (raw, vegetables, fish, meat, pilaf, lentils, mashed dishes, etc.) Ability in team management and leadership Deep knowledge of health regulations and kitchen hygiene Ability to coordinate with the office team Educational Qualifications: Passed eighth grade Other Requirements: Gender: Male Age: Maximum 35 years Non-smoker (not eligible for smokers) Must have a mindset to comply with the organization's culture Other Benefits: Opportunity for long-term career development in the organization Free lunch and dinner Annual salary review and two festival bonuses per year Friendly and collaborative work environment Professional development and learning opportunities Prayer room and office library facilities Free snacks and unlimited tea Weekly MBBS doctor check-up and physiotherapy facilities Internal blood group database Approval for religious visits three days a month Consolidated leave policy: Medical (14-28 days), Casual (10 days), Marriage (7 days), Paternity (2x5 days), Family (1 day), and Festival leave (Eid-ul-Fitr: 7-8 days, Eid-ul-Adha: 7-8 days) Government holidays as per government gazette and organization's decision Exclusive employee discount on company products\n\nদায়িত্বসমূহ: খাবারের প্রস্তুতি: অফিসের দৈনিক মেন্যু অনুযায়ী রান্না করা। স্বাস্থ্যবিধি মেনে সুষম ও স্বাস্থ্যকর খাবার প্রস্তুত করা। স্টক ম্যানেজমেন্ট: কাঁচামাল সংগ্রহ, সংরক্ষণ এবং পরিমাণ যাচাই করে প্রয়োজনীয় খাবারের জোগান নিশ্চিত করা। টিম পরিচালনা: রান্নাঘরের সহকারী বাবুর্চি ও অন্যান্য কর্মীদের পরিচালনা এবং কাজের মান নিশ্চিত করা। স্বাদ ও গুণমান নিয়ন্ত্রণ: খাবারের স্বাদ, গন্ধ ও গুণমান বজায় রাখতে নিয়মিত মনিটরিং করা। অফিসিয়াল ইভেন্ট: বিশেষ ইভেন্ট বা মিটিংয়ের জন্য খাবারের ব্যবস্থা করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20597",
    "job_id": "20597",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান (বাইকার)",
    "location": "Uttara, Nikunjo, Badda, Rajarbagh, Rampura",
    "salary": "TK. 10,846-14,446",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: In Badda, Uttara, Rajarbag, Nikunja, Rampura areas, there are vacancies available.\n\nSalary:\nCompany Biker: 10,846 - 18,446 BDT (Driving license required)\nFuel cost: 210 BDT\n\nDelivery Bonus:\nFor each delivery from 18 to 24, a bonus of 10 BDT is given.\nAfter 24, a bonus of 15 BDT is given for all deliveries.\n\nFacilities Available:\nEvery 3 days off, 8 days off per month.\nShifts from 7 AM, 9 AM, and 10:45 AM. 12-hour duty.\n\nOther Facilities:\nSalary increment after six months.\nFestival allowance given twice a year.\n14 days sick leave per year after six months.\n11 days festival leave per year after six months.\n12 days leave for salary earners per year after six months.\n10 days casual leave per year after six months.\n\nNecessary Documents:\n5 copies of passport-sized photos.\n1 copy of national identity card.\n1 copy of bio-data (CV).\n1 copy of nominee's national identity card.\nValid driving license (only for the biker post).\nCitizenship certificate (only if birth registration is submitted).\n1 copy of nominee's photo.\n\nContact: 01401153402 (Whatsapp)\n\nRequirements: Terms and Conditions:\nDriving license required\nMust be at least 21 years old\n\nবাড্ডা, উত্তরা, রাজারবাগ, নিকুঞ্জ, রামপুরা এই এরিয়াগুলোতে ভ্যাকেন্সি আছে. বেতন: কোম্পানি বাইকারঃ ১০,৮৪৬ - ১8,৪৪৬ টাকা । (ড্রাইভিং লাইসেন্স আবশ্যক) ফুয়েল কোস্ট ২১০ টাকা ডেলিভারি বোনাসঃ ১৮ থেকে ২৪ টা পর্যন্ত প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস দেওয়া হয়। ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস দেওয়া হয়। যে সকল সুবিধা পাওয়া যাবেঃ ৩ দিন পর পর ১ দিন, মাসে ৮ দিন ছুটি। সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । অন্যান্য সুবিধা সমুহঃ ছয় মাস পর বেতন বৃদ্ধি পাবে। বছরে দুইবার উৎসব ভাতা দেয়া হয়। ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় প্রয়োজনীয় ডকুমেন্ট সমুহঃ ৫ কপি পাসপোর্ট সাইজের ছবি। নিজস্ব জাতীয় পরিচয় পত্রের এক কপি ফটোকপি। ১ কপি বায়োডাটা (CV)। একজন নমিনি এর জাতীয় পরিচয়পত্রের ফটোকপি। বৈধ ড্রাইভিং লাইসেন্স (শুধুমাত্র বাইকার পোস্টের জন্য)। নাগরিক সনদ (শুধুমাত্র জন্ম নিবন্ধন সাবমিট করলে)। ১  কপি নমিনির ছবি। যোগাযোগঃ 01401153402 (Whatsapp)"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20593",
    "job_id": "20593",
    "company_name": "HealthOS Limited",
    "job_title": "Distribution Operator",
    "location": "Mohammadpur",
    "salary": "TK. 10,500-12,500",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Supply Chain/Procurement",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: HealthOS Ltd. is looking for a reliable and responsible Distribution Operator for their team, who will manage data entry and barcode scanning tasks in the Morning Shift . Main Responsibilities: Inputting data and information accurately into the system Updating product or document barcodes correctly through scanning Monitoring discipline and daily activities in the office during morning hours Keeping necessary information reports organized Duty Hours: Morning Shift: 6 AM to 3 PM Special Benefits: Safe and comfortable office environment Career growth opportunities for regular and reliable employees Training and support facilities Must have to know MS Power Point, XL, Google Sheet.\n\nHealthOS Ltd. তার টিমে একজন বিশ্বস্ত ও দায়িত্বশীল Distribution Operator খুঁজছে, যিনি Morning Shift -এ ডেটা এন্ট্রি ও বারকোড স্ক্যান সংক্রান্ত কাজ পরিচালনা করবেন। মূল দায়িত্ব: ডেটা এন্ট্রি এবং তথ্য সঠিকভাবে সিস্টেমে ইনপুট করা প্রোডাক্ট বা ডকুমেন্ট বারকোড স্ক্যান করে সঠিকভাবে আপডেট রাখা অফিসে সকালের সময় শৃঙ্খলা ও দৈনন্দিন কার্যক্রম পর্যবেক্ষণ প্রয়োজনীয় তথ্য রিপোর্ট আকারে সংরক্ষণ ডিউটির সময়: সকাল ৬টা থেকে দুপুর ৩টা (Morning Shift) বিশেষ সুবিধা: নিরাপদ ও আরামদায়ক অফিস পরিবেশ নিয়মিত ও নির্ভরযোগ্য কর্মীদের জন্য ক্যারিয়ার গ্রোথ সুযোগ প্রশিক্ষণ ও সহায়তার ব্যবস্থা Must have to know MS Power Point, XL, Google Sheet."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20594",
    "job_id": "20594",
    "company_name": "Triangle Services Ltd",
    "job_title": "Team Member (ISP Fiber Team)",
    "location": "Dhaka",
    "salary": "TK. 9,000-11,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Technical",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Team Members: 1. Fiber splicing and termination, cable laying, installation of TE boxes, etc. 2. Assist in any task as per the team leader's instructions. 3. Work for the company in case of any emergency situation. 4. Learn various tasks from the team leader and co-team leader. 5. Adhere to office rules and regulations. Job Type Full-time Working Hours 9 hours Shift Day shift Company Benefits Lunch Facilities: Partially Subsidized Salary Review: Half Yearly\n\nটীম মেম্বার : ১। ১। ফাইবার টানা ও খোলা, মই ধরা, টিজে বক্স বেধে দেওয়া ইত্যাদি। ২। টিম লিডার এর নির্দেশ অনুযায়ী যে কোন কাজে সহযোগীতা করা। ৩।  যেকোন ইমার্জেন্সি মুহুর্তে কোম্পানীর প্রয়োজনে কাজ করা। ৪। টিম লিডার ও কো-টিম লিডার এর কাছ বিভিন্ন কাজ শিখে নেওয়া। ৫। অফিসের নিয়ম কানুন সঠিকভাবে মানা। চাকরির ধরন ফুল-টাইম কাজের সময় ৯ ঘন্টা কাজের শিফট ডে শিফট কোম্পানীর সুযোগ সুবিধাদি Lunch Facilities: Partially Subsidize Salary Review: Half Yearly"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20613",
    "job_id": "20613",
    "company_name": "Lion Industrious Security Service Ltd. Dhaka",
    "job_title": "সিকিউরিটি গার্ড (চেকার ম‍্যান)",
    "location": "Dhaka, Jatrabari",
    "salary": "TK. 16,500",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Security/Support Service",
    "vacancy": 12,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kajla Bridge, Demra Road, Jatrabari, Jatrabari, Bangladesh",
    "job_description": "Responsibilities: Registered and licensed establishments will hire a significant number of security guards to ensure the security and surveillance of domestic and foreign Chinese and Indian projects, mills, industries, factories, houses, showrooms, banks, and ATM booths.\n\nRequirements: No need for guarantee or experience here. Other facilities: Free accommodation. Bonus is given by the 10th of each month. Adequate overtime benefits available. Free medical treatment, bonus for 2 festivals per year. Attendance bonus equivalent to 1 day's attendance. Salary will increase in the first 6 months and annually thereafter. Those who are willing to work can contact the office directly or contact on WhatsApp. Contact: 01329666015 Yatrabari Kajla Bridge.\n\nরেজিস্ট্রিকৃত ও লাইসেন্স প্রাপ্ত প্রতিষ্ঠান এর অধীনে দেশি বিদেশি চাইনা ও ইন্ডিয়ান প্রজেক্টে, মিল, শিল্প, কারখানা, হাউস, শোরুম, ব্যাংক এটিএম বুথ এর নিরাপত্তা বাস্তবায়ন ও দেখাশোনা করার জন্য বেশ কিছু সংখ্যক সিকিউরিটি গার্ড নিয়োগ করা হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20614",
    "job_id": "20614",
    "company_name": "Hishabee Technologies Limited ",
    "job_title": "Assistant Manager (Customer Success – Telesales)",
    "location": "Jessore",
    "salary": "TK. 22,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Level 2, 145/1 Green Road (Crescent Plaza), Farmgate, Dhaka, Bangladesh , Dhaka, Bangladesh, Dhaka, Bangladesh",
    "job_description": "Responsibilities: We are looking for a proactive and results-driven Assistant Manager – Customer Success (Telesales) to support sales growth, lead generation, and customer relationship management initiatives.\n\n🎯 Key Responsibilities\n\n1️⃣ Support Sales Strategy\n- Assist in developing and executing sales plans to acquire new customers.\n- Identify business opportunities and contribute to achieving sales targets.\n\n2️⃣ Customer Relationship Management\n- Build and maintain strong customer relationships.\n- Ensure customer satisfaction and resolve queries effectively.\n\n3️⃣ Lead Generation & Outreach\n- Reach out to potential customers via calls, emails, and social platforms.\n- Understand customer needs and present suitable product/service solutions.\n\n4️⃣ Sales Team Collaboration\n- Work closely with the sales team to achieve team goals.\n- Share customer insights and feedback to improve service offerings.\n\n5️⃣ Reporting & Analysis\n- Maintain accurate sales records and activity reports.\n- Analyze sales data to identify trends and improve performance.\n- Prepare structured reports (Daily/Weekly/Monthly).\n\nRequirements: - Bachelor's degree in Business, Marketing, or a related field.\n- 5-6 years of experience in Sales/Telesales (including Team Lead or Leadership role).\n- Strong communication, negotiation, and interpersonal skills.\n- Self-motivated, adaptable, and capable of working independently or in a team.\n- Strong reporting and data analysis skills (Report making expert).\n\nLocation: Jessore IT Park, Level-7 (Work at Office)\nWorking Hours: 10:30 AM – 7:30 PM\nWorkdays: 6 Days a Week\nJob Type: Full-Time\n\nCompensation & Benefits\n- Basic Salary: BDT 22,000/month (During 6-month probation)\n- Salary Review: After successful completion of probation\n- Performance Bonus: Monthly leadership-based incentives\n- Mobile Bill Allowance\n- Total Earning Potential: Attractive & Growth-Oriented\n\nWe are looking for a proactive and results-driven Assistant Manager – Customer Success (Telesales) to support sales growth, lead generation, and customer relationship management initiatives. 🎯 Key Responsibilities 1️⃣ Support Sales Strategy Assist in developing and executing sales plans to acquire new customers. Identify business opportunities and contribute to achieving sales targets. 2️⃣ Customer Relationship Management Build and maintain strong customer relationships. Ensure customer satisfaction and resolve queries effectively. 3️⃣ Lead Generation & Outreach Reach out to potential customers via calls, emails, and social platforms. Understand customer needs and present suitable product/service solutions. 4️⃣ Sales Team Collaboration Work closely with the sales team to achieve team goals. Share customer insights and feedback to improve service offerings. 5️⃣ Reporting & Analysis Maintain accurate sales records and activity reports. Analyze sales data to identify trends and improve performance. Prepare structured reports (Daily/Weekly/Monthly)."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20612",
    "job_id": "20612",
    "company_name": "Lion Industrious Security Service Ltd. Dhaka",
    "job_title": "ভিআইপি গার্ড (শোরুম)",
    "location": "Dhaka, Jatrabari",
    "salary": "TK. 16,500-18,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Security/Support Service",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kajla Bridge, Demra Road, Jatrabari, Jatrabari, Bangladesh",
    "job_description": "Responsibilities: Recruiting a considerable number of security guards with registered and licensed organizations for the security and surveillance of domestic and foreign Chinese and Indian projects, mills, industries, factories, houses, showrooms, banks, and ATM booths.\n\nRequirements: No need for experience or guarantee here. Other facilities: Free accommodation. Bonus is given by the 10th of each month. Adequate overtime benefits available. Free medical treatment, two festival bonuses per year. Attendance bonus equivalent to one day's attendance. Salary will increase in the first 6 months and annually thereafter. Those who are willing to work can contact the office directly or via WhatsApp. Contact: 01911131063 Yatrabari Kajla Bridge.\n\nরেজিস্ট্রিকৃত ও লাইসেন্স প্রাপ্ত প্রতিষ্ঠান এর অধীনে দেশি বিদেশি চাইনা ও ইন্ডিয়ান প্রজেক্টে, মিল, শিল্প, কারখানা, হাউস, শোরুম, ব্যাংক এটিএম বুথ এর নিরাপত্তা বাস্তবায়ন ও দেখাশোনা করার জন্য বেশ কিছু সংখ্যক ভিআইপি গার্ড নিয়োগ করা হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20589",
    "job_id": "20589",
    "company_name": "HealthOS Limited",
    "job_title": "সহকারী লজিস্টিক অফিসার (Night-shift)",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-10,500",
    "experience": "6 months - 1 year",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Supply Chain/Procurement",
    "vacancy": 10,
    "shift": "Night Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Before applying, make sure to read the complete post,\n\nOur main goal at HealthOS company is to deliver our products to our esteemed customers with great care.\n\nJob Description,\n\n1. Understand the products correctly according to the correct invoice from the supervisor\n2. After understanding the product correctly, arrange the product in the designated place\n3. After the product is ordered, package the correct product by checking the invoice\n\nWork Hours:\nMorning Shift: 11 pm to 7 am.\n\n*The location of the workplace is on the fourth floor of Prime Bank Building, just ahead of Baitul Aman Tower, Adabor Thana.\n\nEducational qualification from at least JSC to SSC, primarily the ability to package the product by understanding the product name is the main goal.\n\nআবেদন করার পূর্বে অবশ্যই সম্পূর্ণ পরে দেখবেন, আমাদের HealthOS কোম্পানি এর মূল লক্ষই হচ্ছে আমাদের প্রোডাক্ট সমূহ খুবই যত্নের সাথে আমাদের সম্মানিত গ্রাহকের নিকট পৌঁছে দেওয়া। কাজের বিবরণ, সুপারভাইজার থেকে সঠিক ইনভয়েস অনুযায়ী প্রোডাক্ট বুঝে নেওয়া পণ্য সঠিকভাবে বুঝে পাওয়ার পর নির্ধারিত স্থানে প্রোডাক্ট কে সাজিয়ে রাখতে হবে পণ্য অর্ডার হওয়ার পরে ইন ভয়েস দেখে সঠিক পণ্য প্যাকেজিং করতে হবে কাজের সময় : Morning Shift: রাত ১১টা থেকে সকাল ৭টা পর্যন্ত । *কর্মক্ষেত্রের লোকেশন হচ্ছে বাইতুল আমান টাওয়ার আদাবর থানার একটু সামনে প্রাইম ব্যাংক ভবনের চতুর্থ তলা শিক্ষাগত যোগ্যতা সর্বনিম্ন জেএসসি থেকে এসএসসি পর্যন্ত,মূলত প্রোডাক্টের নাম বুঝে প্যাকেজিং করতে পারাটাই মূল লক্ষ্য।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20586",
    "job_id": "20586",
    "company_name": "HealthOS Limited",
    "job_title": "সহকারী লজিস্টিক অফিসার (Morning-shift)",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-10,500",
    "experience": "6 months - 1 year",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Supply Chain/Procurement",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Before applying, make sure to read the complete post,\n\nOur main goal at HealthOS company is to deliver our products to our esteemed customers with great care.\n\nJob description,\n\n1. Understand the products correctly according to the correct invoice from the supervisor\n2. After understanding the product correctly, arrange the product in the designated place\n3. After the product is ordered, pack the correct product by checking the invoice\n\nWork time:\nMorning Shift: 6 am to 4 pm.\n\n*The location of the workplace is on the fourth floor of the Prime Bank building, just ahead of Baitul Aman Tower, Adabar Thana.\n\nEducational qualification: Minimum from JSC to SSC, primarily the ability to understand the product name for packaging is the main goal.\n\nআবেদন করার পূর্বে অবশ্যই সম্পূর্ণ পরে দেখবেন, আমাদের HealthOS কোম্পানি এর মূল লক্ষই হচ্ছে আমাদের প্রোডাক্ট সমূহ খুবই যত্নের সাথে আমাদের সম্মানিত গ্রাহকের নিকট পৌঁছে দেওয়া। কাজের বিবরণ, সুপারভাইজার থেকে সঠিক ইনভয়েস অনুযায়ী প্রোডাক্ট বুঝে নেওয়া পণ্য সঠিকভাবে বুঝে পাওয়ার পর নির্ধারিত স্থানে প্রোডাক্ট কে সাজিয়ে রাখতে হবে পণ্য অর্ডার হওয়ার পরে ইন ভয়েস দেখে সঠিক পণ্য প্যাকেজিং করতে হবে কাজের সময় : Morning Shift: সকাল ৬টা থেকে দুপুর ৪টা পর্যন্ত । *কর্মক্ষেত্রের লোকেশন হচ্ছে বাইতুল আমান টাওয়ার আদাবর থানার একটু সামনে প্রাইম ব্যাংক ভবনের চতুর্থ তলা শিক্ষাগত যোগ্যতা সর্বনিম্ন জেএসসি থেকে এসএসসি পর্যন্ত,মূলত প্রোডাক্টের নাম বুঝে প্যাকেজিং করতে পারাটাই মূল লক্ষ্য।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20615",
    "job_id": "20615",
    "company_name": "Agritech International Trading",
    "job_title": "Key Accounts Executive(Corporate Sales Department)",
    "location": "Gazipur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Sales/Marketing",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Key Accounts Executive will be responsible for generating B2B sales for IT solutions (software, SaaS, system integration) and HR services (recruitment, staffing, payroll, RPO). The role focuses on acquiring new corporate clients, maintaining strong relationships, and driving revenue growth.\n\nIdentify and approach potential corporate clients for IT and HR service solutions.\n\nGenerate qualified B2B leads through cold calling, networking, LinkedIn, and referrals.\n\nConduct client meetings, needs analysis, and solution presentations.\n\nPrepare proposals, service agreements, and pricing quotations.\n\nNegotiate contracts and close deals.\n\nAchieve monthly, quarterly, and annual sales targets.\n\nDevelop long-term partnerships with HR heads, IT managers, and decision-makers.\n\nCoordinate with technical and HR operations teams to ensure smooth service delivery.\n\nMaintain CRM database and prepare regular sales reports.\n\nJob Location: Gazipur\n\nRequirements: - Bachelor's degree in Business, Marketing, or related field\n- 2-5 years of experience in B2B sales (IT solutions or HR services preferred)\n- Strong understanding of corporate sales cycle and consultative selling\n- Excellent communication and negotiation skills\n- Ability to present technical or service-based solutions confidently\n- Proficiency in MS Office and CRM software\n\nSkills we need:\n- Knowledge of SaaS products, recruitment process outsourcing (RPO), or staffing solutions\n- Strong lead generation and closing ability\n- Relationship-building with corporate decision-makers\n- Target-driven and self-motivated mindset\n\nKey Accounts Executive will be responsible for generating B2B sales for IT solutions (software, SaaS, system integration) and HR services (recruitment, staffing, payroll, RPO). The role focuses on acquiring new corporate clients, maintaining strong relationships, and driving revenue growth. Identify and approach potential corporate clients for IT and HR service solutions Generate qualified B2B leads through cold calling, networking, LinkedIn, and referrals Conduct client meetings, needs analysis, and solution presentations Prepare proposals, service agreements, and pricing quotations Negotiate contracts and close deals Achieve monthly, quarterly, and annual sales targets Develop long-term partnerships with HR heads, IT managers, and decision-makers Coordinate with technical and HR operations teams to ensure smooth service delivery Maintain CRM database and prepare regular sales reports Job Location: Gazipur"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20611",
    "job_id": "20611",
    "company_name": "AZ Fashion Tradings",
    "job_title": "সেলস গার্ল",
    "location": "Uttara",
    "salary": "TK. 12,000-15,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No 7, Uttara, Dhaka",
    "job_description": "Responsibilities: Need to sell clothes in the showroom Work according to the directions of the supervisor to achieve sales targets Provide the best service to customers through proper communication Ensure customer satisfaction through customer service Arrange and display merchandise Proper packaging must be done according to the rules Adhere to rules and laws related to cleanliness and hygiene in the workplace Increase sales through informing customers about offers and promotions Regularly inspect the expiry date of products and report to the supervisor Assist in receiving goods from warehouse and suppliers (loading) and arranging them at designated locations and in the sales area Duty from 10 am to 9 pm Handle customers with care and good behavior\n\nRequirements: Educational Qualification: HSC and SSC Goal-oriented Sales Incentive Eid Bonus: 2 (Annual) Salary Review: Annual Excellent Working Environment\n\nশোরুমে কাপড় বিক্রি করতে হবে সেলস টার্গেট অর্জনের জন্য সুপারভাইজার এর দিক নির্দেশনা অনুযায়ী কাজ করা গ্রাহকদের সাথে সঠিক যোগাযোগের মাধ্যমে সর্বোত্তম সেবা প্রদান করা। গ্রাহক সেবা প্রদানের মাধ্যমে গ্রাহক সন্তুষ্টি নিশ্চিত করা। পণ্যদ্রব্য সাজানো এবং প্রদর্শন করা। নিয়ম অনুযায়ী সঠিক প্যাকেজিং করতে হবে। কর্মক্ষেত্রে পরিষ্কার পরিচ্ছন্নতা সংক্রান্ত নিয়ম কানুন মেনে চলা। গ্রাহকদের অফার ও প্রমোশন সর্ম্পকে অবহিত করার মাধ্যমে বিক্রয় বৃদ্ধি করা পণ্যের মেয়াদোত্তীর্ণের তারিখ নিয়মিত পরীক্ষা করা এবং সুপারভাইজারকে রিপোর্ট করা ওয়্যারহাউস ও সাপ্লায়ারের থেকে পণ্যদ্রব্য গ্রহণে সহায়তা (আনলোডিং) ও নির্দিষ্ট স্থানে রাখা এবং সেলভ এ সাজানো। সকাল ১০টা থেকে রাত ৯ টা পর্যন্ত ডিউটি কাস্টোমারদের সাথে যত্নের সাথে ভাল ব্যাবহার করতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20590",
    "job_id": "20590",
    "company_name": "R K Force Security Service (Pvt) Ltd",
    "job_title": "সিকিউরিটি সুপারভাইজার",
    "location": "Uttara, Gazipur, Mirpur, Jatrabari, Rampura",
    "salary": "TK. 19,500-21,500",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Security/Support Service",
    "vacancy": 30,
    "shift": "Other",
    "country": null,
    "company_address": "Bagdad Tanjna Tower, Gazipur Chowrasta, Dhaka",
    "job_description": "Responsibilities: Educational Qualification: JSC/SSC/HSC. Duty: 12 hours. Salary: 19,500 to 21,500 taka. Number of Positions: 30 Age: 18 to 60 years. Preference will be given to retired defense candidates. No experience required. It is our responsibility to train you for the job. Benefits: Free accommodation, food arrangements, one day off per week, three days off per month, two Eid bonuses, and overtime pay. We will call selected candidates for verification. Joining is mandatory for the company's match in the first month. Candidates who are called must bring necessary documents, wear uniform, and bring 30,000 taka for food expenses for the first month. Selected candidates will be informed directly via SMS or WhatsApp about joining details. Documents required for joining: 1. Educational certificates. 2. Copy of birth certificate or national ID card. 3. Two passport-sized photos. Salary is paid from the 5th to the 7th of each month. We do not take any financial transactions or money as security for employment in our company. Interested candidates must be mentally prepared to work at any location mentioned. Workplace: Jatrabari, Rampura, Uttara, Mirpur Gazipur Dhaka. Work Areas: Showroom, construction sites, garments, apartments, houses, garages, metro rail, markets. Contact directly for any information about the job and send your CV via WhatsApp: 📞 01727052574 Interview location: Gazipur Chowrasta Baghdad Tower.\n\nRequirements: ‎ Retired defense candidates will be given priority.\n\nশিক্ষাগত ‎যোগ্যতা: JSC/SSC/HSC. ‎ডিউটি :১০ ঘন্টা। ‎বেতন :১৯,৫০০ থেকে ২১,৫০০ টাকা পর্যন্ত । ‎পদ সংখ্যা:৩০ জন ‎বয়স :১৮ থেকে ৬০ বছর। ‎ অবসরপ্রাপ্ত ডিফেন্স প্রার্থীদেরকে  অগ্রাধিকার দেওয়া হবে। অভিজ্ঞতার প্রয়োজন নেই। কাজ শেখানোর  দায়িত্ব আমাদের। সুবিধা : থাকা ফ্রি,খাবারের সুব্যবস্থা রয়েছে, সাপ্তাহিক ছুটি একদিন,মাসিক ছুটি তিন দিন, দুই  ঈদ বোনাস এবং ওভারটাইমের সুবিধা রয়েছে।আমরা যাচাই-বাছাই করে লোক ডাকবো। কাগজ পত্র ঠিক থাকলে আসা মাত্র জয়েন, প্রথম মাসে থাকা-খাওয়া কোম্পানির ম্যাচে  বাধ্যতামূলক। যে সকল প্রার্থীকে ডাকা হবে কাগজপত্র জামাকাপড় এবং এক মাসের ৩০০০ হাজার টাকা খাবার খরচ নিয়ে একবারে চলে আসবেন জয়নিং এর প্রিপারেশন নিয়ে। ‎বাছাইকৃত প্রার্থীদের কে সরাসরি  নাম্বারে এসএমএস দিয়ে জানিয়ে দেওয়া হবে অথবা হোয়াটসঅ্যাপে এসএমএস দেওয়া হবে। ‎ ‎চাকরিতে জয়েনিং এর জন্য যে সকল প্রয়োজনীয় কাগজপত্র লাগবেঃ ‎১. শিক্ষাগত যোগ্যতার সনদপত্র। ‎২.জন্ম নিবন্ধন  অথবা ন্যাশনাল আইডি কার্ডের ফটোকপি। ‎৩.দুই কপি পাসপোর্ট সাইজের ছবি। ‎ ‎প্রতি মাসের ০৫থেকে ৭তারিখ বেতন প্রদান করা হয়। ‎আমাদের কোম্পানিতে চাকরির  জন্য আমরা কোনো আর্থিক লেনদেন করিনা জামানত বাবদ কোনো টাকা নেওয়া হয়না। ‎ ‎আগ্রহী প্রার্থীগণ উল্লেখিত স্থানে যে কোনো জায়গায় কাজ করার মন মানসিকতা থাকতে হবে। কর্মস্থলঃ যাত্রাবাড়ী, রামপুরা, উত্তরা, মিরপুর গাজীপুর ঢাকা। ‎ কর্মক্ষেত্রঃ শোরুম,কনস্ট্রাকশন সাইট, গার্মেন্টস, এপারমেন্ট, হাউস, গ্যারেজ, মেট্রোরেল, মার্কেট ‎চাকরির বিষয়ে ️যে কোনো তথ্য জানতে সরাসরি নাম্বারে যোগাযোগ করুন ও WhatsApp cv পাঠানঃ 📞 01727052574‎ ইন্টারভিউ এর ঠিকানা গাজীপুর চৌরাস্তা বাগদাদ টাওয়ার।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20608",
    "job_id": "20608",
    "company_name": "Zas Study Abroad",
    "job_title": "Student Counsellor",
    "location": "Uttara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Education/Training/Consultant",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road: 2, House: 33, Uttara, Dhaka",
    "job_description": "Responsibilities: 6-12 months of experience in study abroad counseling or education consultancy Strong communication skills in English and Bangla Strong counseling, persuasion, and follow-up skills Basic computer skills (MS Office, Email, CRM) Knowledge of international study destinations (UK, Australia, Canada, Europe, Asia - preferred) Strong counseling, persuasion, and follow-up skills Basic computer skills (MS Office, Email, CRM) Knowledge of international study destinations (UK, Australia, Canada, Europe, Asia - preferred)\n\nRequirements: Provide professional counseling to prospective students regarding courses, programs, and career pathways Assist students with admission procedures, documentation, and enrollment processes Maintain regular follow-up with students and guardians Support students with academic guidance and career planning Maintain accurate student records and prepare regular reports Coordinate with internal departments and management Participate in counseling sessions, seminars, and promotional activities\n\n6–12 months of experience in study abroad counseling or education consultancy Strong communication skills in English and Bangla Strong counseling, persuasion, and follow-up skills Basic computer skills (MS Office, Email, CRM) Knowledge of international study destinations (UK, Australia, Canada, Europe, Asia – preferred) Strong counseling, persuasion, and follow-up skills Basic computer skills (MS Office, Email, CRM) Knowledge of international study destinations (UK, Australia, Canada, Europe, Asia – preferred)"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20584",
    "job_id": "20584",
    "company_name": "MK Travels Tourism Pvt. Ltd.",
    "job_title": "Marketing Executive",
    "location": "Paltan",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Ridge Ahmed Squre ,level 6 ,50/1 vip road ,naya paltan ,dhaka",
    "job_description": "Responsibilities: - Promote Work Visa and Air Ticketing services through various marketing channels.\n- Manage online and offline client communications effectively.\n- Develop and execute marketing strategies to attract new clients.\n- Build and maintain relationships with travel partners and agents.\n- Assist customers with inquiries related to visa and ticketing services.\n- Achieve monthly marketing and sales targets set by the management.\n- Prepare promotional content and support digital campaigns when needed.\n\nRequirements: - Bachelor’s degree in Marketing, Business Administration, or a related field (preferred).\n- Minimum 1 year of experience in travel agency marketing, ticketing, or visa services.\n- Strong knowledge of travel, visa processing, and ticketing systems.\n- Excellent communication, negotiation, and client relationship skills.\n- Dedicated, target-oriented, and self-motivated; able to work under pressure.\n- Proficiency in social media platforms (Facebook, WhatsApp, Instagram) for marketing purposes.\n- Basic computer skills (MS Office, Email, Internet browsing).\n\nPromote Work Visa and Air Ticketing services through various marketing channels. Manage online and offline client communications effectively. Develop and execute marketing strategies to attract new clients. Build and maintain relationships with travel partners and agents. Assist customers with inquiries related to visa and ticketing services. Achieve monthly marketing and sales targets set by the management. Prepare promotional content and support digital campaigns when needed."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20588",
    "job_id": "20588",
    "company_name": "Padma Courier service ",
    "job_title": "বিতরণ কর্মী",
    "location": "Paltan",
    "salary": "TK. 10,000-15,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Deliveryman",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "18 Purana Paltan line, Dhaka",
    "job_description": "Responsibilities: Job Title: Adult Distribution Worker (Bank Job)\nNumber of Positions: 07\nAge Limit: 35 - 50 years\n\n🔹 Qualifications:\n✔ Minimum SSC pass\n✔ Must have a smartphone\n✔ Priority will be given if you have your own bicycle\n💰 Salary and Benefits:\n✔ Starting from 10,000 BDT per month\n✔ Daily allowance\n✔ Commission benefits\n👉 Salary increment based on job skills and experience\n\n📌 Job Conditions:\n✔ No security deposit required for the job\n✔ Must work regularly in bank and courier-related tasks\n\n🏢 Workplace:\nPadma Courier Service\n50/1 Purana Paltan Lane, Dhaka\n(In front of Bot-tola Mosque)\n\n📞 Contact:\n01552-477709\n\nপদের নাম: বয়স্ক বিতরণ কর্মী (ব্যাংকের কাজ) পদের সংখ্যা: ০৭ জন বয়সসীমা: ৩৫ – ৫০ বছর 🔹 যোগ্যতা: ✔ ন্যূনতম এসএসসি পাস ✔ স্মার্ট মোবাইল থাকতে হবে ✔ নিজস্ব সাইকেল থাকলে অগ্রাধিকার দেওয়া হবে 💰 বেতন ও সুবিধা: ✔ মাসিক ১০,০০০ টাকা থেকে শুরু ✔ দৈনিক ভাতা ✔ কমিশন সুবিধা 👉 কাজের দক্ষতা ও অভিজ্ঞতা অনুযায়ী বেতন বৃদ্ধি করা হবে 📌 চাকরির শর্তাবলী: ✔ চাকরির জন্য কোনো জামানত লাগবে না ✔ নিয়মিত ব্যাংক ও কুরিয়ার সংশ্লিষ্ট কাজ করতে হবে 🏢 কর্মস্থল: পদ্মা কুরিয়ার সার্ভিস ৫০/১ পুরানা পল্টন লাইন, ঢাকা (বটতলা মসজিদের সামনে) 📞 যোগাযোগ: ০১৫৫২-৪৭৭৭০৯"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20600",
    "job_id": "20600",
    "company_name": "Shwapno",
    "job_title": "Field Officer",
    "location": "Dhaka",
    "salary": "TK. 20,000-25,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": "NOVO TOWER, LEVEL 9 270, Tejgaon I/A, Dhaka-1208, Bangladesh",
    "job_description": "Responsibilities: Assist category managers in selecting products, planning stock, and managing day-to-day operations to ensure smooth execution and sales growth. Regularly visit markets to monitor consumer trends, competitor pricing, and identify new product opportunities with a market-aware approach. Work with suppliers to procure products, negotiate promotional terms, and ensure timely availability for campaigns and peak demand. Monitor sales and inventory levels for assigned accounts, prepare concise weekly performance reports to guide decision-making. Identify and approach new corporate clients for bulk orders, create customized proposals and accurate quotations to secure business. Maintain organized records of clients and suppliers, track order progress, and proactively follow up to ensure timely delivery and satisfaction. Negotiate terms and address client concerns with a customer-centric approach to foster strong, long-term relationships. Collaborate with internal teams to implement merchandising and promotional initiatives that boost product visibility and drive results.\n\nRequirements: - Minimum Bachelor's degree (any discipline).\n- Basic computer skills (MS Excel, Word).\n- Strong communication and negotiation ability.\n- Ability to travel locally and work in markets.\n- Honest, proactive, and eager to learn.\n- Preference for candidates from the same locality or surrounding area.\n\nWe offer a collaborative work culture, professional growth opportunities, and performance-linked benefits for the right candidate.\nOther Benefits: Two Festival Bonus, Mobile Allowance, Subsidized Lunch, LFA, Gratuity, and PF.\n\nAssist category managers with product selection, stock planning, and day‑to‑day operations to support smooth execution and sales growth. Visit markets regularly to track consumer trends, competitor pricing, and emerging product opportunities with an attentive, market‑aware approach. Coordinate with suppliers to source products, negotiate promotional terms, and ensure timely availability for campaigns and peak demand. Monitor sales and inventory levels across assigned accounts, compiling concise weekly performance reports to inform decisions. Identify and pursue new corporate clients for bulk orders, preparing tailored proposals and accurate quotations to win business. Maintain organized client and supplier records, track order progress, and proactively follow up to ensure timely delivery and satisfaction. Negotiate terms and resolve client concerns with a customer‑focused attitude to build strong, long‑term relationships. Collaborate with internal teams to implement merchandising and promotional initiatives that enhance product visibility and drive results."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20609",
    "job_id": "20609",
    "company_name": "Impel Service & Solutions Ltd.",
    "job_title": "গ্রাহক সেবা প্রতিনিধি – কল সেন্টার",
    "location": "Uttara",
    "salary": "TK. 9,000-12,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Call Center",
    "vacancy": 500,
    "shift": "Other",
    "country": null,
    "company_address": "House: 71, Road: 7, Sector: 4, Uttara, Dhaka",
    "job_description": "Responsibilities: Receiving inbound calls from customers and making outbound calls when necessary Maintaining respectful, professional, and effective communication with customers Presenting products, services, or necessary information clearly to customers Skillfully resolving customer questions, requests, and complaints Accurately maintaining and updating records related to customer information and calls Following designated scripts and company guidelines while working\n\nRequirements: 🎓 Educational Qualifications Minimum HSC pass or equivalent University students can also apply 🗣 Language Skills Ability to speak Bengali fluently Formal and professional communication skills 💻 Computer Skills Basic knowledge of computers (typing, data entry, etc.) 👤 Other Requirements Age: 18 - 45 years Both male and female can apply Training facilities available for freshers CV not required\n\nগ্রাহকদের ইনবাউন্ড কল রিসিভ করা এবং প্রয়োজনে আউটবাউন্ড কল করা গ্রাহকদের সাথে ভদ্র, পেশাদার ও কার্যকরভাবে যোগাযোগ বজায় রাখা পণ্য, সেবা বা প্রয়োজনীয় তথ্য স্পষ্টভাবে গ্রাহকদের কাছে উপস্থাপন করা গ্রাহকদের প্রশ্ন, অনুরোধ ও অভিযোগ দক্ষতার সাথে সমাধান করা গ্রাহকদের তথ্য ও কল সংক্রান্ত রেকর্ড সঠিকভাবে সংরক্ষণ ও হালনাগাদ করা নির্ধারিত স্ক্রিপ্ট ও কোম্পানির গাইডলাইন অনুসরণ করে কাজ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20607",
    "job_id": "20607",
    "company_name": "Al Arabia Overseas",
    "job_title": "সৌদি আরবে চাকরির সুযোগ (কফি শপ কর্মী)",
    "location": "Saudi Arabia",
    "salary": "TK. 52,000-54,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Restaurant staff",
    "vacancy": 5,
    "shift": "Other",
    "country": "Saudi Arabia",
    "company_address": "House : 79, Block : J (8th floor) , New Airport road chairman bari, Banani",
    "job_description": "Responsibilities: Job Circular - Job Opportunity in Saudi Arabia Company Name: Barns Cafe Location: Saudi Arabia Salary: 1450 - 1650 Saudi Riyal Barns Cafe, a renowned coffee chain company in Saudi Arabia, is urgently hiring personnel. Interested candidates are invited to apply. 🔹 Responsibilities of the position: Welcome customers and take orders Prepare and serve coffee, tea, and other beverages Manage cash counter and process bills Maintain cleanliness, hygiene, and health regulations of the cafe Ensure polite and professional behavior with customers Complete daily tasks as per supervisor's instructions Provide quick and quality service through teamwork\n\nRequirements: 🔹 Required Qualifications:\nAge 21-30 years\nMinimum HSC pass\nPhysically fit and hardworking\nMust have good behavior and a learning attitude\nExperience working in a food/coffee shop is preferred\n\n🔹 Benefits:\nProvided with accommodation, medical care, and insurance\nFree meals during duty hours\nOvertime and other allowances will be provided according to Saudi labor law\nUpon completion of 2 years, the company will provide a 2-month vacation with round-trip air tickets.\n\nজব সার্কুলার – সৌদি আরবে চাকরির সুযোগ কোম্পানির নাম: Barns Cafe কর্মস্থল: Saudi Arabia বেতন: ১৪৫০ – ১৬৫০ সৌদি রিয়াল সৌদি আরবের স্বনামধন্য কফি চেইন কোম্পানি Barns Cafe-এ জরুরি ভিত্তিতে জনবল নিয়োগ করা হবে। আগ্রহী প্রার্থীদের নিকট হতে আবেদন আহ্বান করা যাচ্ছে। 🔹 পদের দায়িত্বসমূহ: গ্রাহকদের স্বাগত জানানো ও অর্ডার গ্রহণ করা কফি, চা ও অন্যান্য পানীয় প্রস্তুত ও পরিবেশন করা ক্যাশ কাউন্টার পরিচালনা ও বিল প্রসেস করা ক্যাফের পরিষ্কার-পরিচ্ছন্নতা ও স্বাস্থ্যবিধি বজায় রাখা গ্রাহকদের সাথে ভদ্র ও পেশাদার আচরণ নিশ্চিত করা সুপারভাইজারের নির্দেশনা অনুযায়ী দৈনন্দিন কাজ সম্পন্ন করা টিমওয়ার্কের মাধ্যমে দ্রুত ও মানসম্মত সার্ভিস প্রদান করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20606",
    "job_id": "20606",
    "company_name": "Genex Infosys Ltd.",
    "job_title": "কাস্টমার সার্ভিস এক্সিকিউটিভ (ফ্রেশার)",
    "location": "Khilkhet",
    "salary": "TK. 10,000-13,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-23",
    "date_posted": "2026-02-23",
    "industry": "Call Center",
    "vacancy": 500,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Nitol Niloy tower, Nikunjo-2, Khilkhet, Dhaka",
    "job_description": "Responsibilities: - Answering incoming calls from customers and ensuring instant customer satisfaction.\n- Responding to customer inquiries.\n- Receiving customer complaints and inputting them into the system for necessary measures, and providing information about the resolution.\n- Troubleshooting and helping to resolve customer service problems.\n- Providing general information.\n- Maintaining a high standard of call quality as per the organization's requirements.\n\nAnswering incoming calls from customers and ensuring instant customer satisfaction. Respond to customer inquiries. Receiving customer complaints and inputting those in the system for necessary measures and providing them information about the resolution of the same. Troubleshoot/ helping to resolve customer service problems. Provide general information. Maintaining a high standard of call quality as per the requirement of the organization."
  }
]