[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20005",
    "job_id": "20005",
    "company_name": "Shopping Zone BD Limited",
    "job_title": "Interior Designer ",
    "location": "Mohammadpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-22",
    "industry": "Engineer",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "45,Probal  Tower, Ring Road Mohammadpur",
    "job_description": "Responsibilities: - Capable of creating creative Layout Plans, Furniture Layouts using AutoCAD and 3D designs using SketchUp, 3D MAX, Vary, and Photoshop, etc.\n- Prepare 2D/3D designs, drawings, and presentations.\n- Coordinate with clients to understand design requirements.\n- Select materials, colors, furniture, lighting, and finishes.\n- Supervise project execution and site work.\n- Work closely with vendors, contractors, and project team.\n- Ensure designs are completed within the timeline and budget.\n\nRequirements: - Bachelor's degree in Interior Design / Architecture or relevant field\n- Minimum 2-4 years of experience in interior design\n- Proficiency in AutoCAD, SketchUp, 3ds Max, V-Ray, Photoshop\n- Strong creativity and attention to detail\n- Good communication and client-handling skills\n- Ability to manage multiple projects\n\n• Capable to prepare creative Layout Plan, Furniture Layout by Auto CAD and 3D designs by Sketch up, 3D MAX, Vary and Photoshop etc. • Prepare 2D/3D designs, drawings, and presentations. • Coordinate with clients to understand design requirements • Select materials, colors, furniture, lighting, and finishes • Supervise project execution and site work • Work closely with vendors, contractors, and project team • Ensure designs are completed within timeline and budget"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19875",
    "job_id": "19875",
    "company_name": "BYSL Global Technology Group",
    "job_title": "Office Support Assistant",
    "location": "Gulshan-Banani, Nikunjo, Badda, Baridhara",
    "salary": "TK. 12,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-19",
    "industry": "General Management/Admin",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 💼 Responsibilities: Performing daily administrative tasks in the office Maintaining files, documents, and records Receiving phone calls and providing necessary information Assisting with other office tasks\n\nRequirements: ```html ⏰ Working Hours: 10 hours per day Overtime facility available 💰 Salary: 12,000 Taka 🎓 Qualifications: Minimum SSC Prior knowledge about office work is preferred Experience in computer operation is a plus ```\n\n💼 দায়িত্বসমূহ: অফিসের দৈনন্দিন প্রশাসনিক কাজ সম্পাদন ফাইল, ডকুমেন্ট ও রেকর্ড সংরক্ষণ ফোন কল রিসিভ ও প্রয়োজনীয় তথ্য প্রদান অফিসের অন্যান্য সহায়ক কাজ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19872",
    "job_id": "19872",
    "company_name": "Shwapno",
    "job_title": "Field Officer",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "<1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-19",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": "NOVO TOWER, LEVEL 9 270, Tejgaon I/A, Dhaka-1208, Bangladesh",
    "job_description": "Responsibilities: - Assist Category Managers with product selection, stock planning, and daily operations.\n- Visit markets to track trends, competitor pricing, and product opportunities while coordinating with suppliers for sourcing and promotions.\n- Monitor sales and stock levels and prepare weekly performance reports.\n- Identify new corporate clients for bulk orders and prepare proposals and quotations.\n- Maintain client records, negotiate terms, and follow up to ensure timely delivery and customer satisfaction.\n\nRequirements: Minimum Bachelor's degree (any discipline).\nBasic computer skills (MS Excel, Word).\nStrong communication and negotiation ability.\nAbility to travel locally and work in markets.\nHonest, proactive, and eager to learn.\nPreference for candidates from the same locality or surrounding area.\n\nWe offer a collaborative work culture, professional growth opportunities, and performance-linked benefits for the right candidate.\nOther Benefits: Two Festival Bonus, Mobile Allowance, Subsidized Lunch, LFA, Gratuity, and PF.\n\nAssist Category Managers with product selection, stock planning, and daily operations. Visit markets to track trends, competitor pricing, and product opportunities while coordinating with suppliers for sourcing and promotions. Monitor sales and stock levels and prepare weekly performance reports. Identify new corporate clients for bulk orders and prepare proposals and quotations. Maintain client records, negotiate terms, and follow up to ensure timely delivery and customer satisfaction."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19868",
    "job_id": "19868",
    "company_name": " IFixFast",
    "job_title": "HR Admin Assistant (Female)  ",
    "location": "Hatirpool",
    "salary": "TK. 15,000-20,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-19",
    "industry": "Human Resource Management (HR)",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Rupayan Trade Center 17 Floor, 114 Kazi Nazrul Islam Avenue Banglamotor, Dhaka 1000, Dhaka, Bangladesh",
    "job_description": "Responsibilities: - Assist the HR & Admin team in daily operations \n- Maintain employee records, attendance, and basic documentation \n- Work with MS Word, Excel, and handle basic office files \n- Internet browsing, form handling, and web-based tasks \n- Support in recruitment, scheduling, and general HR activities\n\nRequirements: - Must have good knowledge of Microsoft Excel,\n- Previous experience in admin/HR support will be an advantage \n- Punctual, responsible, and organized\n\nOnly experienced candidates can apply for this position. Freshers are requested not to apply.\n\n- Assist the HR & Admin team in daily operations - Maintain employee records, attendance, and basic documentation - Work with MS Word, Excel, and handle basic office files - Internet browsing, form handling, and web-based tasks - Support in recruitment, scheduling, and general HR activities"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19869",
    "job_id": "19869",
    "company_name": " IFixFast",
    "job_title": "HR Officer",
    "location": "Hatirpool",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-19",
    "industry": "Human Resource Management (HR)",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Rupayan Trade Center 17 Floor, 114 Kazi Nazrul Islam Avenue Banglamotor, Dhaka 1000, Dhaka, Bangladesh",
    "job_description": "Responsibilities: We are searching for a proactive and detail-oriented HR Officer who will be responsible for carrying out day-to-day HR operations, ensuring smooth hiring processes, and managing employees across IFixFast and its sister concern, Amdox Operation. The ideal candidate should possess strong communication skills, organizational abilities, and a solid understanding of HR practices.\n\nKey Responsibilities:\n- Manage end-to-end recruitment: job posting, screening, shortlisting, interviewing, and onboarding.\n- Maintain accurate employee records, attendance, and HR documentation.\n- Support daily HR operational tasks and ensure timely execution of all HR activities.\n- Coordinate and manage employees working under IFixFast and Amdox Operation.\n- Assist in implementing HR policies, procedures, and compliance requirements.\n- Handle employee queries, provide grievance support, and maintain a positive workplace environment.\n- Monitor training sessions, performance updates, and staff development activities.\n- Prepare HR reports and provide HR-related insights to management.\n- Ensure smooth coordination between both companies for operational HR needs.\n\nEmployment Details:\nJob Location: IFixFast & Amdox Operation\nWorking Hours: As per company policy\nSalary: Negotiable (based on experience)\nEmployment Type: Full-time\n\nRequirements: - Bachelor's degree in HRM, Business Administration, or a related field.\n- 1-3 years of experience in HR or recruitment roles (preferred).\n- Strong communication and interpersonal skills.\n- Ability to manage multiple tasks and meet deadlines.\n- Proficiency in MS Office and HR tools/software.\n- Strong understanding of HR operations and compliance.\n- Good Knowledge of Excel\n\nWe are looking for a proactive and detail-oriented HR Officer who will be responsible for executing day-to-day HR operations, ensuring smooth hiring processes, and managing employees across IFixFast and its sister concern, Amdox Operation. The ideal candidate must have strong communication skills, organizational ability, and a solid understanding of HR practices. Key Responsibilities: Manage end-to-end recruitment: job posting, screening, shortlisting, interviewing, and onboarding. Maintain employee records, attendance, and HR documentation accurately. Support daily HR operational tasks and ensure timely execution of all HR activities. Coordinate and manage employees working under IFixFast and Amdox Operation. Assist in implementing HR policies, procedures, and compliance requirements. Handle employee queries, grievance support, and maintain a positive workplace environment. Monitor training sessions, performance updates, and staff development activities. Prepare HR reports and assist management with HR-related insights. Ensure smooth coordination between both companies for operational HR needs. Employment Details: Job Location: IFixFast & Amdox Operation Working Hours: As per company policy Salary: Negotiable (based on experience) Employment Type: Full-t"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19879",
    "job_id": "19879",
    "company_name": "Ronju Electronic",
    "job_title": "CCTV & Access Control Technician",
    "location": "Mohakhali",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-19",
    "industry": "Technician",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "k-63 (2nd floor), Mohakhali warless gate , Mohakhali",
    "job_description": "Responsibilities: Job Responsibilities - Install, configure, and maintain CCTV camera systems\n- Troubleshoot and repair CCTV systems\n- Install and support access control and attendance systems\n- Perform system testing after installation\n- Ensure proper system operation and client satisfaction\n- Maintain basic installation and service records\n- Provide technical support at customer sites Preferred Business Areas - Electric Wire / Cable\n- Bank\n- Software Company\n- IT Enabled Service Skills & Expertise - CCTV Cameras\n- CCTV Installation\n- Access Control Systems\n- Technical Troubleshooting\n\nRequirements: - Age 18 to 40 years\n- At most 2 years of experience\n- Minimum 2 years of practical experience in CCTV, access control, and security systems\n- Practical experience with access control systems such as ZKTeco, Anviz, Nitgen, VIRDI, or similar brands\n- Experience with CCTV systems including Analog and IP cameras\n- Knowledge of structured cabling and basic networking\n- Experience in installing access control devices, PABX systems, and computer hardware\n- Ability to communicate properly with clients\n- Candidates with door-to-door sales or digital marketing experience will be given preference\n\nJob Responsibilities Install, configure, and maintain CCTV camera systems Troubleshoot and repair CCTV systems Install and support access control and attendance systems Perform system testing after installation Ensure proper system operation and client satisfaction Maintain basic installation and service records Provide technical support at customer sites Preferred Business Areas Electric Wire / Cable Bank Software Company IT Enabled Service Skills & Expertise CCTV Cameras CCTV Installation Access Control Systems Technical Troubleshooting"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20001",
    "job_id": "20001",
    "company_name": "Dominos Pizza Bangladesh",
    "job_title": "Delivery Rider with Driving License",
    "location": "Uttara, Comilla, Gulshan-Banani, Chittagong, Mirpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Part Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-23",
    "industry": "Deliveryman",
    "vacancy": 100,
    "shift": "Other",
    "country": null,
    "company_address": "Dhaka, Bangladesh",
    "job_description": "Responsibilities: Deliver food within a specified time frame to guests without driving recklessly Responsible for Pre-Rush preparation (PRP) Getting cross-trained for self-improvement Maintain all quality and safety standards while operating Expected to follow the company's code of conduct and embody Domino's culture of Hustle\n\nRequirements: Age 18 to 30 years\nMust have a valid driving license\nMust have smartphone\nWilling to work in flexible hours\n\nDeliver food within a time frame to the guest without rash driving Responsible for Pre-Rush preparation (PRP) Getting cross-trained for self-advancement Maintain all quality & Safety standards while operating Expected to follow the company's code of conduct and live Domino's culture of Hustle."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19878",
    "job_id": "19878",
    "company_name": "Ronju Electronic",
    "job_title": "AC Technician ",
    "location": "Mohakhali",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-19",
    "industry": "Technician",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "k-63 (2nd floor), Mohakhali warless gate , Mohakhali",
    "job_description": "Responsibilities: Install, maintain, service, and repair split, cassette, ductable, VRF/VRV, and package AC systems. Diagnose electrical and mechanical faults and perform corrective maintenance. Conduct routine preventive maintenance to ensure optimal performance of AC units. Handle gas charging, leakage detection, compressor issues, and wiring works. Maintain service records, maintenance logs, and spare parts usage. Ensure proper operation of HVAC systems in hospitals, diagnostics, offices, and other facilities. Respond promptly to breakdown calls and emergency maintenance issues. Follow safety guidelines and company maintenance SOPs. Coordinate with vendors and suppliers when required. Support energy-efficient operation and cost control initiatives\n\nRequirements: - Age 18 to 60 years\n- Strong troubleshooting and problem-solving skills\n- Ability to work independently and in a team\n- Willingness to work on shift or emergency calls\n- Honest, disciplined, and responsible\n\nInstall, maintain, service, and repair split, cassette, ductable, VRF/VRV, and package AC systems. Diagnose electrical and mechanical faults and perform corrective maintenance. Conduct routine preventive maintenance to ensure optimal performance of AC units. Handle gas charging, leakage detection, compressor issues, and wiring works. Maintain service records, maintenance logs, and spare parts usage. Ensure proper operation of HVAC systems in hospitals, diagnostics, offices, and other facilities. Respond promptly to breakdown calls and emergency maintenance issues. Follow safety guidelines and company maintenance SOPs. Coordinate with vendors and suppliers when required. Support energy-efficient operation and cost control initiatives"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19932",
    "job_id": "19932",
    "company_name": "Hashtag broadband",
    "job_title": "Executive (Retail Sales)",
    "location": "Uttara, Gulshan, Panthapath, Bashundhara R/A, Mohammadpur",
    "salary": "TK. 14,000-25,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-20",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Motijheel, Dhaka",
    "job_description": "Responsibilities: Identifying new business opportunities through networking, cold calling, and lead generation and following up on them. Visiting designated areas to find and acquire new clients. Regularly conducting meetings with potential customers to promote services. Keeping customers informed about progress and timely follow-up calls or communications. Maintaining high professionalism and ethical standards, fulfilling responsibilities, and performing other tasks assigned by management.\n\nRequirements: Bachelor's/ Honors degree in any subject. Freshers are also encouraged to apply.\n\nনেটওয়ার্কিং, কলিং এবং লিড জেনারেশনের মাধ্যমে নতুন ব্যবসার সুযোগ চিহ্নিত করা ও তা অনুসরণ করা। নির্ধারিত এলাকায় ভিজিট করে নতুন ক্লায়েন্ট খুঁজে বের করা এবং যুক্ত করা। সম্ভাব্য গ্রাহকদের সাথে নিয়মিত সাক্ষাৎ করে সেবাসমূহ প্রচার করা। গ্রাহকদের অগ্রগতির বিষয়ে অবহিত রাখা এবং সময়মতো ফলো-আপ কল বা যোগাযোগ করা। উচ্চ পেশাদারিত্ব ও নৈতিক মান বজায় রেখে দায়িত্ব পালন করা এবং ব্যবস্থাপনা কর্তৃক প্রদত্ত অন্যান্য কাজ সম্পাদন করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19941",
    "job_id": "19941",
    "company_name": "Vertex Telecom Solutions (Authorized Distributior of  RYZE)",
    "job_title": "Campaign Connector ",
    "location": "Keraniganj, Khilgaon, Old Dhaka, Mirpur",
    "salary": "TK. 10,000-30,000",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-20",
    "industry": "Sales/Marketing",
    "vacancy": 39,
    "shift": "Day Shift",
    "country": null,
    "company_address": "৪১ নীলাম্বার শাহা রোড, হাজারীবাগ ঢাকা ১২০৫।  ( নগর মাতৃসদন এর অপর পাশে)",
    "job_description": "Responsibilities: We are hiring some Campaign Connectors (CC) for our team. 🔹 Job Description: Selling SIM cards in densely populated areas with a chair-table setup Engaging with customers and providing product information 🕙 Office Hours: From 10:00 AM to 6:00 PM\n\nRequirements: 🎯 Qualifications: Age: Minimum 18 years, Maximum 35 years Educational Qualification: Minimum SSC Pass Prior experience in Campaign/Field Marketing will be given priority 💼 Job Type: Full Time 📍 Work Area: Mirpur, Khilgaon, Hazaribagh, Keraniganj. (Field-based work) Salary Structure: Basic: 10,000 BDT Variable: Up to 20,000 BDT Sales Quality: 8,000 BDT Phone Bill: 1,000 BDT\n\nআমরা আমাদের টিমে কিছু সংখ্যক CC (Campaign Connector ) নিয়োগ দিচ্ছি। 🔹 কাজের বিবরণ: চেয়ার–টেবিল নিয়ে জনবহুল এলাকায় বসে SIM sales করা কাস্টমারের সাথে কথা বলে প্রোডাক্ট পরিচিতি দেওয়া 🕙 অফিস টাইম: সকাল ১০:০০টা থেকে সন্ধ্যা ৬:০০টা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19930",
    "job_id": "19930",
    "company_name": "Birds Eye Fashion ",
    "job_title": " অনলাইন অপারেশনস এক্সিকিউটিভ ",
    "location": "Shahbagh",
    "salary": "TK. 12,000-15,000",
    "experience": "6 months - 1 year",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-20",
    "industry": "Graphics/Video Editor",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Shahbagh , Dhaka 1000",
    "job_description": "Responsibilities: Job Announcement: Online Operations Executive Company: Birds Eye Fashion Are you interested in working with fashion and online marketing? We are looking for a skilled and hardworking member to expand our current online business. Job Responsibilities: Video and Photo Editing: Capture images of daily new collections and edit them beautifully. Create attractive videos or reels for social media (Facebook/TikTok). Campaign and Boosting: Set up ad campaigns on Facebook and other platforms and manage boosting according to budget. Customer Service: Respond to customers' messages and comments online and confirm orders with courtesy. Sales Growth: Understand customers' demands, suggest the right products, and strive to increase online sales. Please apply.\n\nRequirements: Required Qualifications: Must know how to edit high-quality photos and videos on a smartphone or PC (such as CapCut, Canva, Adobe Photoshop, or related apps). Should have an understanding of Facebook page management and ad boosting. Proficiency in speaking and writing clearly in Bengali and English. Patience in handling online sales and customer service. Salary and Benefits: Salary: Negotiable (attractive salary based on qualifications). Special bonus or commission on achieving sales targets. Opportunity for promotion along with company growth. Contact us quickly if interested: Your name, address, and if you have any samples of editing work done before, please inbox us.\n\nনিয়োগ বিজ্ঞপ্তি: অনলাইন অপারেশনস এক্সিকিউটিভ প্রতিষ্ঠান: বার্ডস আই ফ্যাশন (Birds Eye Fashion) আপনার কি ফ্যাশন এবং অনলাইন মার্কেটিং নিয়ে কাজ করার আগ্রহ আছে? আমাদের ক্রমবর্ধমান অনলাইন ব্যবসার পরিধি বাড়াতে আমরা একজন দক্ষ এবং পরিশ্রমী সদস্য খুঁজছি। কাজের দায়িত্বসমূহ: ভিডিও ও ফটো এডিটিং: প্রতিদিনের নতুন কালেকশনের ছবি তোলা এবং সেগুলোকে সুন্দর করে এডিট করা। সোশ্যাল মিডিয়ার (Facebook/TikTok) জন্য আকর্ষণীয় ভিডিও বা রিলস তৈরি করা। ক্যাম্পেইন ও বুস্টিং: ফেসবুক ও অন্যান্য প্ল্যাটফর্মে অ্যাড ক্যাম্পেইন সেট-আপ করা এবং বাজেট অনুযায়ী বুস্টিং ম্যানেজ করা। কাস্টমার সার্ভিস: অনলাইনে কাস্টমারদের ইনবক্স ও কমেন্টের উত্তর দেওয়া এবং বিনয়ের সাথে কথা বলে অর্ডার কনফার্ম করা। সেলস বৃদ্ধি: কাস্টমারদের ডিমান্ড বুঝে সঠিক পণ্য সাজেস্ট করা এবং অনলাইন সেলস বাড়ানোর চেষ্টা করা। করুন।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20003",
    "job_id": "20003",
    "company_name": "Next Online Limited",
    "job_title": "Deputy Manager- Sales & Marketing",
    "location": "Gulshan",
    "salary": "TK. 25,000-45,000",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-19",
    "date_posted": "2026-01-22",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Zohurul Tower, plot-09, Road-113/A, level-6,Gulshan 2",
    "job_description": "Responsibilities: - Built and maintain a successful relationship with customers.\n- Maintain composure and patience in face-off difficult customer situations.\n- Keep customers informed of progress during the issue life cycle and make follow-up calls or communications in a timely manner.\n- Outstanding customer service skills and a dedication to the customer service experience.\n- Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution. Adhering to Incident Management procedures.\n- Ability to prepare reports, documentation and provide formal training to users.\n- Perform the duties & responsibilities to a high professional and ethical standard and Perform any other tasks assigned by the management.\n\nRequirements: - Proven experience in sales and marketing activities.\n- Strong understanding of sales strategies, market research and customer behavior.\n- Ability to identify new business opportunities and generate leads.\n- Experience in achieving sales targets and meeting deadlines.\n- Good communication and interpersonal skills.\n- Ability to maintain strong relationships with clients.\n- Willingness to work under pressure and in a target-oriented environment.\n\nBuilt and maintain a successful relationship with customers. Maintain composure and patience in face-off difficult customer situations. Keep customers informed of progress during the issue life cycle and make follow-up calls or communications in a timely manner. Outstanding customer service skills and a dedication to the customer service experience. Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution. Adhering to Incident Management procedures. Ability to prepare reports, documentation and provide formal training to users. Perform the duties & responsibilities to a high professional and ethical standard and Perform any other tasks assigned by the management."
  }
]