[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20381",
    "job_id": "20381",
    "company_name": "R.F. Fashion ",
    "job_title": "শোরুম সিকিউরিটি সুপারভাইজার",
    "location": "Anywhere in Dhaka Division",
    "salary": "TK. 19,500-22,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Security/Support Service",
    "vacancy": 12,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 🖊️Job Description: 1- Provide guidance to those working inside the warehouse. 2- Maintain inventory records. 3- Monitor CCTV and supervise security personnel. 🔜 Benefits: Free accommodation, provision of meals, one day off per week, three days off per month, two Eid bonuses. We will call selected candidates for verification. You can start working with just your joining letter if all documents are in order. Accommodation and meals are mandatory for the first month at the company mess. All candidates who are called must come prepared with a photocopy of their documents and 3000 taka for one month's food expenses for joining preparation. 🖊️ Selected candidates will be informed directly via SMS or WhatsApp. 🔜 Requirements for Joining: 1. Educational certificates, certificates, or mark sheets. 2. Photocopy of birth certificate or national ID card. 3. Two passport-sized photos. We do not take any financial transactions or take any money as a guarantee for a job in our company. 🔜 Interested candidates must be mentally prepared to work at any location mentioned: Uttara, Mirpur, Jatrabari, Gazipur, Dhaka. Salaries are paid between the 5th and 7th of each month. 🔜 Interview location: Gazipur Chowrasta, New Chakbazar area. Contact directly and send CV on WhatsApp: 01340 846801\n\nRequirements: Qualification: JSC/SSC. Duty: 10 hours. Salary: 19,500/22,000 taka. Age: 18 to 50 years old.\n\nNo experience required. Teaching is our responsibility.\n\nCandidates who are called must come with necessary documents, a set of clothes, and 3,000 taka for food expenses for one month for joining preparation.\n\nSelected candidates will be informed directly via SMS or WhatsApp.\n\nContact directly and send CV on WhatsApp: 01348 46801.\n\n🖊️কাজের বিবরনঃ ১- শোরমের ভিতরে যারা কাজ করে তাদের দিকনির্দেশনা দেওয়া। ২-মালামালের হিসাব রাখা। ৩- সিসিটিভি মনিটরিং করা এবং নিরাপত্তা কর্মীদের  পরিচালনা করা। ‎ 🔜 সুবিধাঃ থাকা ফ্রি,খাবারের সুব্যবস্থা রয়েছে, সাপ্তাহিক ছুটি একদিন,মাসিক ছুটি তিন দিন, দুই  ঈদ বোনাস। আমরা যাচাই-বাছাই করে লোক ডাকবো। কাগজ পত্র ঠিক থাকলে আসা মাত্র জয়েন দিয়ে কাজ শুরু করতে পারবেন থাকা-খাওয়া কোম্পানির মেসে প্রথম মাস  বাধ্যতামূলক। যে সকল প্রার্থীকে ডাকা হবে কাগজপত্র জামাকাপড় এবং এক মাসের ৩ হাজার টাকা খাবার খরচ নিয়ে একবারে চলে আসবেন জয়নিং এর প্রিপারেশন নিয়ে। ‎🖊️ বাছাইকৃত প্রার্থীদের কে সরাসরি  নাম্বারে এসএমএস দিয়ে জানিয়ে দেওয়া হবে অথবা হোয়াটসঅ্যাপে এসএমএস দেওয়া হবে। ‎ ‎🔜 জয়েন্টের জন্য যা যা লাগবেঃ ‎১. শিক্ষাগত যোগ্যতার সনদপত্র।সার্টিফিকেট অথবা মার্কশিট। ‎২.জন্ম নিবন্ধন  অথবা ন্যাশনাল আইডি কার্ডের ফটোকপি। ‎৩.দুই কপি পাসপোর্ট সাইজের ছবি। ‎ ‎আমাদের কোম্পানিতে জবের জন্য আমরা কোনো আর্থিক লেনদেন করিনা জামানত বাবদ কোনো টাকা নেওয়া হয়না। ‎ ‎🔜আগ্রহী প্রার্থীগণ উল্লেখিত স্থানে যে কোনো জায়গায় কাজ করার মন মানসিকতা থাকতে হবেঃ উত্তরা, মিরপুর, যাত্রাবাড়ী , গাজীপুর ঢাকা। ‎ ‎প্রতি মাসের ০৫থেকে ৭তারিখের মাঝে বেতন প্রদান করা হয়। ‎🔜 ইন্টারভিউ এর ঠিকানা গাজীপুর চৌরাস্তা নিউ চকবাজার সংলগ্ন। সরাসরি যোগাযোগ করুন ও হোয়াটসএপে সিভি পাঠানঃ 01340-846801 ‎"
  }
]