[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20282",
    "job_id": "20282",
    "company_name": "Impel Service & Solutions Ltd.",
    "job_title": "গ্রাহক সেবা প্রতিনিধি – কল সেন্টার",
    "location": "Uttara",
    "salary": "TK. 9,000-12,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-04",
    "industry": "Call Center",
    "vacancy": 500,
    "shift": "Other",
    "country": null,
    "company_address": "House: 71, Road: 7, Sector: 4, Uttara, Dhaka",
    "job_description": "Responsibilities: Receiving inbound calls from customers and making outbound calls when necessary Maintaining respectful, professional, and effective communication with customers Presenting products, services, or necessary information clearly to customers Skillfully resolving customer questions, requests, and complaints Accurately maintaining and updating records related to customer information and calls Following designated scripts and company guidelines while working\n\nRequirements: 🎓 Educational Qualifications Minimum HSC pass or equivalent University students can also apply 🗣 Language Skills Ability to speak Bengali fluently Formal and professional communication skills 💻 Computer Skills Basic knowledge of computers (typing, data entry, etc.) 👤 Other Requirements Age: 18 - 45 years Both male and female can apply Training facilities available for freshers No CV required\n\nগ্রাহকদের ইনবাউন্ড কল রিসিভ করা এবং প্রয়োজনে আউটবাউন্ড কল করা গ্রাহকদের সাথে ভদ্র, পেশাদার ও কার্যকরভাবে যোগাযোগ বজায় রাখা পণ্য, সেবা বা প্রয়োজনীয় তথ্য স্পষ্টভাবে গ্রাহকদের কাছে উপস্থাপন করা গ্রাহকদের প্রশ্ন, অনুরোধ ও অভিযোগ দক্ষতার সাথে সমাধান করা গ্রাহকদের তথ্য ও কল সংক্রান্ত রেকর্ড সঠিকভাবে সংরক্ষণ ও হালনাগাদ করা নির্ধারিত স্ক্রিপ্ট ও কোম্পানির গাইডলাইন অনুসরণ করে কাজ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19589",
    "job_id": "19589",
    "company_name": "Impel Service & Solutions Ltd.",
    "job_title": "Call Center Associate (𝗨𝘁𝘁𝗮𝗿𝗮)",
    "location": "Uttara",
    "salary": "TK. 9,000-12,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-04",
    "industry": "Call Center",
    "vacancy": 500,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Receiving inbound calls from customers and making outbound calls when necessary Maintaining respectful, professional, and effective communication with customers Presenting products, services, or necessary information clearly to customers Handling customer questions, requests, and complaints with skill Accurately maintaining and updating records related to customer information and calls Following designated scripts and company guidelines while working\n\nRequirements: 🎓 Educational Qualifications Minimum HSC pass or equivalent Students currently studying at universities can also apply 🗣 Language Skills Ability to speak Bengali fluently Formal and professional communication skills 💻 Computer Skills Basic knowledge of computers (typing, data entry, etc.) 👤 Other Requirements Age: 18 - 45 years Both male and female candidates can apply Training facilities available for freshers CV not required\n\nগ্রাহকদের ইনবাউন্ড কল রিসিভ করা এবং প্রয়োজনে আউটবাউন্ড কল করা গ্রাহকদের সাথে ভদ্র, পেশাদার ও কার্যকরভাবে যোগাযোগ বজায় রাখা পণ্য, সেবা বা প্রয়োজনীয় তথ্য স্পষ্টভাবে গ্রাহকদের কাছে উপস্থাপন করা গ্রাহকদের প্রশ্ন, অনুরোধ ও অভিযোগ দক্ষতার সাথে সমাধান করা গ্রাহকদের তথ্য ও কল সংক্রান্ত রেকর্ড সঠিকভাবে সংরক্ষণ ও হালনাগাদ করা নির্ধারিত স্ক্রিপ্ট ও কোম্পানির গাইডলাইন অনুসরণ করে কাজ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20551",
    "job_id": "20551",
    "company_name": "Genex Infosys Ltd.",
    "job_title": "কাস্টমার সার্ভিস এক্সিকিউটিভ (ফ্রেশার)",
    "location": "Khilkhet",
    "salary": "TK. 10,000-13,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-28",
    "date_posted": "2026-02-21",
    "industry": "Call Center",
    "vacancy": 500,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Nitol Niloy tower, Nikunjo-2, Khilkhet, Dhaka",
    "job_description": "Responsibilities: - Answering incoming calls from customers and ensuring instant customer satisfaction.\n- Responding to customer inquiries.\n- Receiving customer complaints and entering them into the system for necessary actions, and providing information about the resolution.\n- Troubleshooting and helping to resolve customer service problems.\n- Providing general information.\n- Maintaining a high standard of call quality as required by the organization.\n\nAnswering incoming calls from customers and ensuring instant customer satisfaction. Respond to customer inquiries. Receiving customer complaints and inputting those in the system for necessary measures and providing them information about the resolution of the same. Troubleshoot/ helping to resolve customer service problems. Provide general information. Maintaining a high standard of call quality as per the requirement of the organization."
  }
]