[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20443",
    "job_id": "20443",
    "company_name": "HN INTERNATIONAL",
    "job_title": "Customer Relations & Digital Marketing",
    "location": "Bashundhara R/A, Badda, Baridhara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-16",
    "date_posted": "2026-02-16",
    "industry": "Media/Advertisement/Event Mgt.",
    "vacancy": 6,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House-1/B, Road-2/1, Block-J, Baridhara, Dhaka-1212.",
    "job_description": "Responsibilities: We are a leading manpower recruitment agency looking for a dynamic, energetic, and self-motivated Female Executive to join our team. If you have excellent communication skills and a knack for digital marketing, we want to hear from you!\n\nRequirements: Key responsibilities and deliverables\n- Manage end-to-end customer interactions across channels: handle inbound and outbound calls, social media messages, and direct inquiries; follow up promptly to convert leads and resolve issues.\n- Develop, implement and maintain a content calendar for social platforms (Facebook, Instagram, TikTok, LinkedIn), including post concepts, captions, visuals, and publishing schedule.\n- Execute community management: respond to comments, moderate conversations, escalate complaints, and maintain a positive brand voice online.\n- Support digital campaign setup and monitoring: assist with organic campaigns, coordinate with paid advertising teams, prepare ad copy suggestions, and track basic campaign metrics.\n- Maintain accurate records in CRM or lead-tracking tools: log conversations, update lead status, set reminders, and produce basic follow-up reports.\n- Collaborate with internal teams (sales, recruitment, creative) to align messaging, share feedback from customers, and refine lead nurturing strategies.\n- Contribute to performance improvement by suggesting A/B tests for posts/ads, refining targeting, and documenting what content formats drive the best engagement.\n\nRequired technical skills\n- Social media management: hands-on experience publishing posts, scheduling content, and monitoring engagement across major platforms (examples: Facebook Business Suite, Creator Studio, Instagram tools).\n- Content creation basics: ability to write clear, audience-appropriate captions and produce simple visual assets (examples: Canva, basic image editing); knowledge of post format best practices for engagement.\n- Analytics and reporting: familiarity with basic metrics (reach, impressions, engagement rate, click-through, conversion indicators) and ability to compile simple weekly performance summaries using spreadsheets or dashboards.\n- CRM and lead management: experience with lead logging, follow-up workflows, and simple segmentation (examples: HubSpot, Zoho, Google Sheets-based trackers).\n- Digital communication tools: comfortable using email, chat platforms, video calls, and phone systems; ability to maintain professional written and verbal records of interactions.\n- Basic technical literacy: comfortable learning new SaaS tools, troubleshooting common issues (login, permissions, media upload), and following step-by-step platform guides.\n- Lead response time and follow-up completion rate.\n- Engagement metrics for social content (likes, comments, shares, saves) and follower growth trends.\n- Conversion or qualification rate from social and tele-outreach to next-stage action (appointment, application, demo).\n- Accuracy and completeness of CRM records and timely reporting o"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20456",
    "job_id": "20456",
    "company_name": "BYSL Global Technology Group",
    "job_title": "Driver",
    "location": "Dhaka",
    "salary": "TK. 20,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-16",
    "date_posted": "2026-02-16",
    "industry": "Transportation",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 🔹 Salary and Benefits: Salary: 20,000 BDT + Overtime (Total estimated 30,000-35,000 BDT) Lunch fully subsidized Snacks and breakfast provided ✅ Qualifications and Requirements: Educational Qualification: SSC or equivalent / above Experience: Experienced driver preferred Age: Mid-range (appropriate working age) Special Qualifications (mandatory): Must have a valid driving license Must be capable of driving all types of vehicles Must be responsible and punctual\n\n🔹 বেতন ও সুবিধা: বেতন: ২০,০০০ টাকা + ওভারটাইম (মোট আনুমানিক ৩০,০০০–৩৫,০০০ টাকা) লাঞ্চ সম্পূর্ণ সাবসিডাইজড স্ন্যাকস ও ব্রেকফাস্ট সুবিধা ✅ যোগ্যতা ও প্রয়োজনীয়তা: শিক্ষাগত যোগ্যতা: SSC বা সমমান / তার উপরে অভিজ্ঞতা: অভিজ্ঞ ড্রাইভার অগ্রাধিকারযোগ্য বয়স: মিড রেঞ্জ (উপযুক্ত কর্মক্ষম বয়স) বিশেষ যোগ্যতা (অবশ্যই প্রয়োজন): বৈধ ড্রাইভিং লাইসেন্স থাকতে হবে সব ধরনের গাড়ি চালাতে সক্ষম হতে হবে দায়িত্বশীল ও সময়ানুবর্তী হতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20753",
    "job_id": "20753",
    "company_name": "JR IT Solutions",
    "job_title": "Software Engineer",
    "location": "Banani",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-28",
    "date_posted": "2026-02-28",
    "industry": "IT/Telecommunication",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No: 19/A, Hou; 287, Blo: E, Banani",
    "job_description": "Responsibilities: - Develop and maintain Android applications using Java or Kotlin.\n- Collaborate with UI/UX designers and backend engineers to build clean, high-performance apps.\n- Write readable, modular, and scalable code following best engineering practices.\n- Test, debug, and optimize app performance across devices and OS versions.\n- Continuously learn new tools, frameworks, and technologies to improve product quality.\n- Participate in daily stand-ups, code reviews, and agile development cycles.\n- Familiarity with iOS development is considered good, but not mandatory.\n\nRequirements: Bachelor of Science (BSc) in Computer Science & Engineering Students from Rajshahi University of Engineering and Technology, Khulna University of Engineering and Technology, Bangladesh University of Engineering and Technology, and Chittagong University of Engineering and Technology will be given preference.\n\nDevelop and maintain Android applications using Java or Kotlin . Collaborate with UI/UX designers and backend engineers to build clean, high-performance apps. Write readable, modular, and scalable code following best engineering practices. Test, debug, and optimize app performance across devices and OS versions. Continuously learn new tools, frameworks, and technologies to improve product quality. Participate in daily stand-ups, code reviews, and agile development cycles. Familiarity with iOS development is considered good, but not mandatory"
  }
]