[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19968",
    "job_id": "19968",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Moulvibazar, Sylhet, Anywhere in Sylhet Division, Sunamganj, Habiganj",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are - Tester, Energy Saving Bulb, LED Bulb, Clear Bulb, Multiplug, Gang Switch, Mosquito Coil, Super Glue, Tennis Ball, and Chanachur. Job Responsibilities Conducting market research and sales activities for the company's products Building and maintaining good relationships with new and existing customers Working towards achieving set sales targets Market visits and providing necessary reports Job Type Full-time Part-time Contractual Educational Qualifications SSC / HSC Pass Required Skills for the Job Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile Bill Performance Bonus Lunch Facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19967",
    "job_id": "19967",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Chapai Nawabganj, Naogaon, Natore, Anywhere in Rajshahi Division, Sirajganj",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are - Tester, Energy Saving Bulb, LED Bulb, Clear Bulb, Multiplug, Gang Switch, Mosquito Coil, Super Glue, Tennis Ball, and Chanachur. Job Responsibilities Conducting market research and sales activities for the company's products Building and maintaining good relationships with new and existing customers Working towards achieving set sales targets Market visits and providing necessary reports Job Type Full-time Part-time Contractual Educational Qualifications SSC/HSC Pass Required Job Criteria Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile Bill Performance Bonus Lunch Facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19966",
    "job_id": "19966",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Jhalokati, Patuakhali, Barguna, Barisal, Anywhere in Barisal Division",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are— tester, energy-saving bulb, LED bulb, clear bulb, multi-plug, gang switch, mosquito coil, super glue, tennis ball, and chanachur. Job Responsibilities Conducting market research and sales activities for the company's products Building and maintaining good relationships with new and existing customers Working towards achieving set sales targets Market visits and providing necessary reports Job Type Full-time Part-time Contract-based Educational Qualifications SSC/HSC pass Required Job Criteria Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile bill Performance bonus Lunch facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19965",
    "job_id": "19965",
    "company_name": "Kashban Business Point",
    "job_title": "Showroom Executive",
    "location": "Tejgaon, Badda, Mohakhali, Malibagh, Mohammadpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: ```html Candidate Qualifications: Must be hardworking and responsible Must have smart and alert presence Responsibilities: Regular field work Work 6 days a week Must have physical endurance and patience Cannot use motorcycle/bicycle Must have a good understanding of Dhaka city ```\n\nপ্রার্থী যোগ্যতা: পরিশ্রমী ও দায়িত্বশীল হতে হবে স্মার্ট ও পরিপাটি উপস্থিতি থাকতে হবে দায়িত্বসমূহ: নিয়মিত ফিল্ড ওয়ার্ক করা সপ্তাহে ৬ দিন কাজ করতে হবে শারীরিক সহনশীলতা ও ধৈর্যশীলতা থাকতে হবে মোটরসাইকেল/বাইসাইকেল ব্যবহার করা যাবে না ঢাকা শহর সম্পর্কে ভালো ধারণা থাকতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19877",
    "job_id": "19877",
    "company_name": "Primexbd",
    "job_title": "Field Marketing Executive (Education App)",
    "location": "All over Bangladesh",
    "salary": "TK. 12,000",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-19",
    "industry": "Sales/Marketing",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Mirpur 11, Dhaka",
    "job_description": "Responsibilities: For the marketing campaign of an educational mobile app designed for primary school students in Bangladesh, skilled and responsible Field Marketing Executives will be recruited on a district/sub-district basis. Salary and Benefits: Monthly salary: 12,000 BDT (based on achieving set targets) Additional incentives and other benefits: Provided based on job performance and mutual discussions Upon successful completion of the designated Probation Period , a permanent (Fixed) salary will be effective Opportunity for career advancement and taking on more responsibilities in the future based on good performance Job Responsibilities: Work at the field level in their designated district or sub-district Establish direct communication with schools and parents of students Ensure app subscriptions at parents' homes Acquire a minimum of 500 subscriptions or a total of 20,000 BDT worth of subscriptions per month Regularly update the Daily Report of work on a designated Google Sheet Qualifications and Requirements: Candidates must have their own Android smartphone Must have regular internet connectivity Must have the mentality to work at the field level Good communication skills to interact with people Must have the habit of being punctual, responsible, and providing timely reports 🔹 Educational qualifications are flexible 🔹 Preference will be given to candidates with prior experience Work Area: Respective district/sub-district\n\nবাংলাদেশের প্রাইমারি স্কুলের শিক্ষার্থীদের জন্য তৈরি একটি শিক্ষামূলক মোবাইল অ্যাপের মার্কেটিং কার্যক্রম পরিচালনার জন্য জেলা/উপজেলা ভিত্তিতে দক্ষ ও দায়িত্বশীল Field Marketing Executive নিয়োগ দেওয়া হবে। বেতন ও সুযোগ-সুবিধা: মাসিক বেতন: ১২,০০০ টাকা (নির্ধারিত টার্গেট পূরণ সাপেক্ষে) অতিরিক্ত ইনসেনটিভ ও অন্যান্য সুবিধা: কাজের পারফরম্যান্স ও পারস্পরিক আলোচনার ভিত্তিতে প্রদান করা হবে নির্ধারিত Probation Period সফলভাবে সম্পন্ন করার পর স্থায়ী (Fixed) বেতন কার্যকর হবে ভালো পারফরম্যান্সের ভিত্তিতে ক্যারিয়ার উন্নয়ন এবং ভবিষ্যতে অধিক দায়িত্ব গ্রহণের সুযোগ থাকবে কাজের দায়িত্ব: নিজ নিজ নির্ধারিত জেলা বা উপজেলায় মাঠপর্যায়ে কাজ করা স্কুল ও শিক্ষার্থীদের অভিভাবকদের সাথে সরাসরি যোগাযোগ স্থাপন অভিভাবকদের বাসায় বাসায় গিয়ে অ্যাপটির সাবস্ক্রিপশন নিশ্চিত করা প্রতি মাসে ন্যূনতম ৫০০টি বা মোট ২০,০০০ টাকা সমপরিমাণ মূল্যমানের সাবস্ক্রিপশন অর্জন করা প্রতিদিনের কাজের Daily Report নির্ধারিত Google Sheet -এ নিয়মিত আপডেট করা যোগ্যতা ও শর্তাবলি: প্রার্থীর নিজস্ব একটি Android স্মার্টফোন থাকতে হবে নিয়মিত ইন্টারনেট সংযোগ থাকতে হবে মাঠপর্যায়ে কাজ করার মানসিকতা থাকতে হবে মানুষের সাথে কথা বলার ভালো যোগাযোগ দক্ষতা থাকতে হবে সততা, দায়িত্ববোধ এবং সময়মতো রিপোর্ট দেওয়ার অভ্যাস থাকতে হবে 🔹 শিক্ষাগত যোগ্যতা শিথিলযোগ্য 🔹 পূর্ব অভিজ্ঞতা থাকলে অগ্রাধিকার দেওয়া হবে কাজের এলাকা: নিজ নিজ জেলা / উপজেলা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19874",
    "job_id": "19874",
    "company_name": "Comfort Furniture Solution",
    "job_title": "Junior Sales & Customer Support Executive",
    "location": "Uttara",
    "salary": "TK. 15,000-20,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-19",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "3rd floor, 4th floor & 5th floor, House# 18 সোনারগাঁ জনপথ, ঢাকা 1230",
    "job_description": "Responsibilities: We are looking for a Junior Sales and Customer Support Executive to join our furniture showroom team. The ideal candidate will provide excellent customer service, answer customer inquiries, handle complaints, and ensure a seamless shopping experience.\n\nResponsibilities:\n- Welcome customers to the showroom and assist with product selection\n- Provide detailed information about furniture accessories, design, and pricing\n- Respond to customer inquiries and concerns directly, over the phone, or via email\n- Process orders, track delivery progress, and ensure post-sales services\n- Coordinate with sales and logistics teams to facilitate transactions\n- Handle customer complaints professionally and strive for quick resolutions\n- Maintain customer records and feedback for service improvement\n- Assist in showroom operations, including keeping the showroom clean and organized\n\n**Extra hours will be compensated separately**\n\n**Salary:** 15,000 BDT\n\n**KPI Bonus:** Based on monthly sales and performance (unlimited)\n\n**Work Location:** Uttara House Building\n\n**Training Location:** Panthapath\n\nRequirements: Completed BBA or MBA (preferable) Good communication skills Interested in professional behavior and sales/customer service\n\nআমরা আমাদের ফার্নিচার শোরুম টিমে একজন জুনিয়র সেলস ও কাস্টমার সাপোর্ট এক্সিকিউটিভ নিয়োগের জন্য খুঁজছি। আদর্শ প্রার্থীকে চমৎকার কাস্টমার সার্ভিস প্রদান করতে হবে, কাস্টমারদের জিজ্ঞাসার উত্তর দিতে হবে, অভিযোগ মোকাবেলা করতে হবে এবং একটি নিরবিচ্ছিন্ন কেনাকাটার অভিজ্ঞতা নিশ্চিত করতে হবে। মূল দায়িত্বসমূহ: • শোরুমে আসা কাস্টমারদের স্বাগত জানানো এবং পণ্যের নির্বাচন করতে সহায়তা করা • ফার্নিচারের উপকরণ, ডিজাইন ও মূল্য সম্পর্কে বিস্তারিত তথ্য প্রদান করা • কাস্টমারদের জিজ্ঞাসা ও উদ্বেগের উত্তর সরাসরি, ফোনে অথবা ইমেইলের মাধ্যমে প্রদান করা • অর্ডার প্রক্রিয়াকরণ, ডেলিভারির অগ্রগতি ট্র্যাক করা এবং বিক্রয়-পরবর্তী সেবা নিশ্চিত করা • বিক্রয় ও লজিস্টিক টিমের সঙ্গে সমন্বয় করে লেনদেনকে সহজতর করা • কাস্টমারদের অভিযোগ পেশাদারভাবে মোকাবেলা করা এবং দ্রুত সমাধানের চেষ্টা করা • কাস্টমার রেকর্ড ও প্রতিক্রিয়া সংরক্ষণ করা যেন সেবার মানোন্নয়ন করা যায় • শোরুমের কার্যক্রমে সহায়তা করা, যার মধ্যে শোরুম পরিস্কার-পরিচ্ছন্ন ও সজ্জিত রাখা অন্তর্ভুক্ত **অতিরিক্ত কাজের ঘণ্টার জন্য আলাদা ভাতা প্রদান করা হবে** --বেতন: ১৫,০০০ টাকা --কেপিআই বোনাস: মাসিক বিক্রয় ও পারফরম্যান্স অনুযায়ী (unlimited) **কাজের স্থান: উত্তরা হাউজ বিল্ডিং **প্রশিক্ষণের স্থান: পান্থপথ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19829",
    "job_id": "19829",
    "company_name": "Lamia Overseas Ltd.",
    "job_title": "Civil Engineer",
    "location": "Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "5-10 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Engineer",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Location: Aftabnagar, Rampura\n\nJob Description: We are seeking a dedicated and experienced Site Engineer - Civil to oversee construction projects, ensure quality standards, and coordinate with various teams on-site. The ideal candidate will have a strong background in civil engineering, excellent problem-solving skills, and the ability to manage multiple tasks efficiently.\n\nRequirements: Key Responsibilities:\n- Managing parts of construction projects.\n- Overseeing construction work.\n- Undertaking surveys.\n- Setting out sites.\n- Checking technical designs and drawings for accuracy and to ensure that they are followed correctly.\n- Supervising contracted staff.\n- Ensure project packages meet the agreed specifications, budgets, and timescales.\n\nRequirements:\n- Education: B.Sc in Civil Engineering or related field.\n- Experience: At least 5 years. The applicants should have experience in the following business area(s): Resort.\n- Additional Requirements: Age 25 to 35 years. Proven experience as a Site Engineer or similar role in civil construction. Knowledge of construction methods, safety regulations, and quality standards. Strong communication and leadership skills. Ability to work under pressure and meet deadlines.\n\nLocation: Aftabnagar, Rampura Job Description: We are seeking a dedicated and experienced Site Engineer - Civil to oversee construction projects, ensure quality standards, and coordinate with various teams on-site. The ideal candidate will have a strong background in civil engineering, excellent problem-solving skills, and the ability to manage multiple tasks efficiently."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20083",
    "job_id": "20083",
    "company_name": "Ashbo Communication World",
    "job_title": "Campus Connector Banglalink RYZE",
    "location": "Gulshan, Gulshan-Banani, Notun Bajar, Banani, Bashundhara R/A",
    "salary": "TK. 22,000-32,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-31",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "1. Ta-161/4,Middle badda(Gutharaghat),Gulshan-1 2. Ka-20/2,Nadda Sarkar bari,Gulshan-2",
    "job_description": "Responsibilities: Highly attractive salary package (one of the best in Bangladesh telecom industry). Achieve daily, weekly, and monthly SIM & GA (General Acquisition) targets as set by the Banglalink RYZE Program. Ensure a minimum of 150 GA per month as per program guidelines. (29K Monthly Payout) Ensure 100% SIM activation using a smartphone and successful signup through the RYZE App . Maintain at least 25 days of attendance per month . Handle customer queries professionally and provide support within campus and adjacent areas . Maintain strong sales discipline, accurate reporting, and compliance with company policies. Use RYZE SIM exclusively for all official communications. Work closely with supervisors to improve sales performance and achieve monthly projections.\n\nHighly attractive salary package (one of the best in Bangladesh telecom industry). Achieve daily, weekly, and monthly SIM & GA (General Acquisition) targets as set by the Banglalink RYZE Program. Ensure a minimum of 150 GA per month as per program guidelines. (29K Monthly Payout) Ensure 100% SIM activation using a smartphone and successful signup through the RYZE App . Maintain at least 25 days of attendance per month . Handle customer queries professionally and provide support within campus and adjacent areas . Maintain strong sales discipline, accurate reporting, and compliance with company policies. Use RYZE SIM exclusively for all official communications. Work closely with supervisors to improve sales performance and achieve monthly projections."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20109",
    "job_id": "20109",
    "company_name": "SKRP Group",
    "job_title": "Executive, Telemarketing, Dhaka",
    "location": "Kakrail",
    "salary": "TK. 12,000-15,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-27",
    "industry": "Sales/Marketing",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "80/1,Vip Road,Kakrail,Dhaka",
    "job_description": "Responsibilities: Requirements\nEducation\n- Bachelor of Business Administration (BBA)/ Graduate\n\nExperience\n- Fresher’s are also encouraged to apply.\n\nJob Description / Responsibility\n- Offer in-depth product information (Water Purifier) to the clients.\n- Answer customer queries about products and services relating to the company.\n- Provide product information & taking feedback to the prospective clients.\n- Understand customer requirements and suggest as per requirements.\n- Manage customer information.\n\nCompensation & Other Benefits\n- 2 Festival Bonus\n- Yearly Increment\n- Provident Fund\n\nJob Location\n- Dhaka (Kakrail)\n\nJob Highlights\n- Looking for good communication & computer skills.\n- Client support over phone experienced candidates are encouraged to apply.\n\nGender\n- Only Female\n\nRequirements Education Bachelor of Business Administration (BBA)/ Graduate Experience Fresher’s are also encouraged to apply. Job Description / Responsibility · Offer in depth product information(Water Purifier) to the clients. · Answer customer queries about products and services relating to the company. · Provide product information & taking feed back to the prospective clients · Understand customer requirements and suggest as per requirements · Manage customer information. Compensation & Other Benefits · 2 Festival Bonus , · Yearly Increment , · Provident Fund Job Location · Dhaka (Kakrail) Job Highlights · Looking for-good communication & computer skill · Client support over phone experienced candidates are encouraged to apply Gender · Only Female"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19856",
    "job_id": "19856",
    "company_name": "Live Shopping",
    "job_title": "Video Editor (Pro-Level CapCut Expertise Required)",
    "location": "Dhaka",
    "salary": "TK. 25,000-30,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Graphics/Video Editor",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banglamotor, Dhaka",
    "job_description": "Responsibilities: - Edit and assemble raw footage into polished videos that communicate clear stories and meet campaign objectives.\n- Utilize advanced CapCut skills to create engaging short-form and long-form content tailored for social media platforms.\n- Employ Adobe Premiere Pro, After Effects, and other tools to incorporate motion graphics and visual effects as necessary.\n- Implement color correction and grading to maintain a consistent, professional appearance across all outputs.\n- Mix and balance audio, add sound effects, and ensure clear dialogue and music levels for an immersive viewer experience.\n- Generate accurate subtitles and captions to enhance accessibility and viewer engagement.\n- Develop transitions, lower thirds, and on-screen graphics that enhance storytelling while adhering to brand guidelines.\n- Collaborate closely with marketing and content teams to generate ideas, incorporate feedback, and align videos with campaign objectives.\n- Organize, tag, and manage a structured asset library with reliable backups and version control.\n- Prioritize tasks and effectively manage time to deliver high-quality videos within tight deadlines.\n- Maintain brand consistency and cohesive storytelling across all video content and formats.\n- Create and maintain an impressive demo reel showcasing technical skills, creative versatility, and successful projects.\n\nRequirements: Proficient use of CapCut for advanced short-form and social-first editing, including multi-track timelines, speed ramping, smart transitions, and template customization.\n\nAdvanced proficiency in Adobe Premiere Pro: timeline editing, multicam workflows, native format handling, proxies, sequence nesting, and export optimization for multiple platforms.\n\nStrong skills in Adobe After Effects for motion graphics, keyframing, compositing, green-screen keying, 2D/3D text animation, and visual effects integration with Premiere Pro.\n\nFamiliarity with complementary tools and plugins (audio restoration tools, color grading panels, LUT workflows, and motion-graphics templates) to enhance production value.\n\nAbility to shape narrative and pacing: craft coherent stories from raw footage; choose compelling shots, and structure edits to meet campaign objectives and audience intent.\n\nExperience producing both short-form (reels, TikTok, Shorts) and long-form content (web, broadcast, branded long-form) with platform-specific framing, captioning, and pacing strategies.\n\nDesign and implement creative transitions, lower thirds, bumpers, and on-screen graphics that support messaging while aligning with brand guidelines.\n\nDeliver polished motion-graphics sequences and animated elements that elevate storytelling without distracting from the core message.\n\nEdit and assemble raw footage into polished videos that communicate clear stories and meet campaign objectives. Leverage pro-level CapCut expertise to craft engaging short-form and long-form content optimized for social platforms. Use Adobe Premiere Pro, "
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19847",
    "job_id": "19847",
    "company_name": "Azizul Home Electro",
    "job_title": "Sales Executive",
    "location": "Uttara",
    "salary": "TK. 15,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 53, Road No: 11, Uttara, Dhaka",
    "job_description": "Responsibilities: Identify potential clients and generate leads through field visits, phone calls, and networking.\nPresent and promote company products/services to prospective customers.\nMaintain regular communication with existing clients to ensure satisfaction and repeat business.\nPrepare and deliver sales pitches, proposals, and quotations.\nAchieve monthly and quarterly sales targets set by the management.\nMaintain accurate records of sales activities, client interactions, and follow-ups.\nConduct market research to understand customer needs and market trends.\nCollaborate with internal teams to ensure smooth client onboarding and product delivery.\nResolve customer issues and provide after-sales support when required.\nParticipate in promotional activities, campaigns, and events.\n\nStrong communication, negotiation, and presentation skills.\n\nAbility to work under pressure and meet sales targets.\n\nBasic understanding of sales and marketing principles.\n\nProficiency in MS Office & digital communication tools.\n\nMust be self-motivated, result-oriented, and well-organized.\n\nWilling to travel for field visits when necessary.\n\nIdentify potential clients and generate leads through field visits, phone calls, and networking. Present and promote company products/services to prospective customers. Maintain regular communication with existing clients to ensure satisfaction and repeat business. Prepare and deliver sales pitches, proposals, and quotations. Achieve monthly and quarterly sales targets set by the management. Maintain accurate records of sales activities, client interactions, and follow-ups. Conduct market research to understand customer needs and market trends. Collaborate with internal teams to ensure smooth client onboarding and product delivery. Resolve customer issues and provide after-sales support when required. Participate in promotional activities, campaigns, and events. Strong communication, negotiation, and presentation skills. Ability to work under pressure and meet sales targets. Basic understanding of sales and marketing principles. Proficiency in MS Office & digital communication tools. Must be self-motivated, result-oriented, and well-organized. Willing to travel for field visits when necessary."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20061",
    "job_id": "20061",
    "company_name": "SL ELECTRONICS",
    "job_title": "AC Technician",
    "location": "Mohammadpur",
    "salary": "TK. 15,000-23,000",
    "experience": "1-3 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-25",
    "industry": "Technician",
    "vacancy": 12,
    "shift": "Day Shift",
    "country": null,
    "company_address": "1/A/2 , Ring Road, Shyamoli , Mohammadpur, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Installation, maintenance, and monitoring of air conditioners (AC) Diagnosing and promptly resolving issues with AC units Installing new AC units Regular servicing and maintenance of old AC units Testing the performance of AC units Replacing components of AC units as needed Providing necessary advice to customers regarding the use of AC Benefits: Yearly Eid bonus and other bonus benefits A daily lunch allowance of 100 taka will be provided Opportunity for additional tips earnings\n\nRequirements: Experience in practical work of AC installation, maintenance, and supervision Good understanding of electrical and mechanical work Skill in using necessary equipment Must have good communication skills Ability to quickly solve problems Must be physically fit\n\nএয়ার কন্ডিশনার (AC) ইনস্টলেশন, মেরামত ও রক্ষণাবেক্ষণ করা AC ইউনিটের সমস্যা নির্ণয় ও দ্রুত সমাধান করা নতুন AC ইউনিট ইনস্টল করা পুরাতন AC ইউনিটের নিয়মিত সার্ভিসিং ও মেইনটেন্যান্স করা AC ইউনিটের পারফরম্যান্স পরীক্ষা করা প্রয়োজন অনুযায়ী AC ইউনিটের যন্ত্রাংশ পরিবর্তন করা গ্রাহকদের AC ব্যবহারের বিষয়ে প্রয়োজনীয় পরামর্শ প্রদান করা সুযোগ-সুবিধা : বাৎসরিক ঈদ বোনাস ও অন্যান্য বোনাস সুবিধা প্রতিদিন লাঞ্চ বাবদ ১০০ টাকা প্রদান করা হবে অতিরিক্ত টিপস আয়ের সুযোগ রয়েছে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19842",
    "job_id": "19842",
    "company_name": "Azgar Ahmed Packaging",
    "job_title": "প্যাকেজিং ম্যান",
    "location": "Uttara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No: 10, Sector: 15, Uttara, Dhaka",
    "job_description": "Responsibilities: Ensure proper packaging according to the product specifications Provide inventory team with reports for monitoring packaging material stock and placing necessary orders Ensure packaging is done in a quality-conscious manner maintaining product standards Quickly resolve production-related issues on the packaging line Prepare daily work reports and provide them to management Follow safety and health regulations in the packaging process Ensure timely completion of packaging as per delivery schedule\n\nপণ্যের স্পেসিফিকেশন অনুযায়ী সঠিকভাবে প্যাকেজিং সম্পন্ন করা প্যাকেজিং ম্যাটেরিয়ালের স্টক পর্যবেক্ষণ এবং প্রয়োজনীয় অর্ডারের জন্য ইনভেন্টরি টিমকে রিপোর্ট প্রদান পণ্যের গুণগত মান বজায় রেখে মানসম্মত প্যাকেজিং নিশ্চিত করা প্যাকেজিং লাইনে উৎপাদনগত সমস্যা শনাক্ত করে দ্রুত সমাধান নিশ্চিত করা দৈনন্দিন কাজের রিপোর্ট প্রস্তুত ও ম্যানেজমেন্টকে প্রদান করা প্যাকেজিং প্রক্রিয়ার নিরাপত্তা ও স্বাস্থ্যবিধি অনুসরণ করা ডেলিভারি শিডিউল অনুযায়ী সময়মতো প্যাকেজিং সম্পন্ন নিশ্চিত করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20133",
    "job_id": "20133",
    "company_name": "Aastha Home Care & Training Centre",
    "job_title": "Caregiver",
    "location": "Chittagong",
    "salary": "TK. 15,000-22,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-28",
    "industry": "Healthcare/Medical/Hospital",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "125,k.b Fazlul kader road, chawkbazar , Chattogram",
    "job_description": "Responsibilities: COMPANY NAME: Aastha Home Care and Training Centre Educational Qualification: Minimum SSC pass. Job Responsibilities: ✨Level 01 Care (Male and Female Caregivers) Assisting patients in their daily activities such as feeding, walking, assisting in bathing and toilet, dressing, medication management, vital sign monitoring, etc. ✨Level 02 Care (Male and Female Caregivers) Additional skills and medical knowledge are required along with the basic tasks of Level 01 such as tube feeding, catheter care, dressing, nebulization, etc. 🛑 Note: Male caregivers will take care of male patients and female caregivers will take care of female patients. Duty Time: 12 hours and 8 hours (Day shift or Night shift) Duty Location: Patients' homes. (Only within the city of Chittagong) Salary and Benefits: -Tk. 15,000-22,000. -Transportation allowance, -Festival bonus (once a year), -Performance bonus, -Overtime payment facility ‼️ATTENTION‼️ If you have the patience to work for 12 hours, empathy towards elderly individuals, and willingness to work as a caregiver at patients' homes, then you should apply! Contact Address: 125 K.B. Fazlul Quader Road, Panchlaish, Chittagong. Submit hard copy of CV at the office, timing- 10 am to 6 pm. To submit soft copy of CV- Email to aasthahomecare@gmail.com or WhatsApp at +8801332513541\n\n✨ লেভেল–০১ কেয়ারগিভার (পুরুষ ও মহিলা) রোগীর দৈনন্দিন কাজে সহায়তা করা— খাওয়ানো, হাঁটা-চলা, গোসল ও টয়লেট সহায়তা, সাজসজ্জা, ওষুধ ব্যবস্থাপনা, ভাইটাল সাইন পরীক্ষা ইত্যাদি। ✨ লেভেল–০২ কেয়ারগিভার (পুরুষ ও মহিলা) লেভেল–০১ এর কাজের পাশাপাশি অতিরিক্ত চিকিৎসা দক্ষতা প্রয়োজন— টিউব ফিডিং, ক্যাথেটার কেয়ার, ড্রেসিং, নেবুলাইজেশন ইত্যাদি। 🛑 দ্রষ্টব্য: পুরুষ কেয়ারগিভার পুরুষ রোগীর এবং মহিলা কেয়ারগিভার মহিলা রোগীর যত্ন নিবেন।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19983",
    "job_id": "19983",
    "company_name": "Kashban Business Point",
    "job_title": "Area Manager",
    "location": "Anywhere in Dhaka Division",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Management Staff",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Job Context Products established by the company - testers, energy-saving bulbs, LED bulbs, clear bulbs, multi-plugs, gang switches, mosquito coils, super glue, tennis balls, and incense sticks. Candidate Qualifications Must have own motorcycle Must be hardworking and responsible Work Hours and Shift 8 hours per day Day shift Educational Qualifications Graduate / Masters pass Job Requirements Age: 25 to 30 years Both male and female can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile bill Performance bonus Lunch facility: Half subsidy Salary Review: Once a year\n\nজব কনটেক্সট কোম্পানির প্রতিষ্ঠিত পণ্যসমূহ— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপারগ্লু, টেনিস বল এবং চানাচুর। প্রার্থী যোগ্যতা নিজস্ব মোটরসাইকেল থাকতে হবে পরিশ্রমী ও দায়িত্বশীল হতে হবে কাজের সময় ও শিফট প্রতিদিন ৮ ঘণ্টা ডে শিফট শিক্ষাগত যোগ্যতা স্নাতক / মাস্টার্স পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ২৫ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: অর্ধেক ভর্তুকি Salary Review: বছরে একবার"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19981",
    "job_id": "19981",
    "company_name": "Kashban Business Point",
    "job_title": "Office Executive (female)",
    "location": "Kawran Bazar",
    "salary": "TK. 9,000-20,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Job Details Pack designated parcels Attach paper invoice and sketch tape to the package Measure the weight of the package and provide online entry Educational Qualifications Minimum HSC pass Preference will be given to candidates studying in honors Payment Based on work Monthly income: Estimated from 9,000 to 20,000 taka Office Hours 6 days a week 9-hour shift per day Friday weekly holiday Workplace Fargate\n\nকাজের বিস্তারিত আমাদের নির্ধারিত পার্সেল প্যাকেট করা প্যাকেটের গায়ে কাগজের ইনভয়েজ স্কচ টেপ দিয়ে সংযুক্ত করা প্যাকেটের ওজন মাপা এবং অনলাইনে এন্ট্রি প্রদান করা শিক্ষাগত যোগ্যতা ন্যূনতম এইচএসসি পাস অনার্সে অধ্যয়নরত প্রার্থীদের অগ্রাধিকার দেওয়া হবে পেমেন্ট কাজের ভিত্তিতে মাসিক আয়: আনুমানিক ৯,০০০ থেকে ২০,০০০ টাকা অফিস টাইম সপ্তাহে ৬ দিন প্রতিদিন ৯ ঘণ্টার শিফট শুক্রবার সাপ্তাহিক ছুটি কর্মস্থল ফার্মগেট"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19977",
    "job_id": "19977",
    "company_name": "Kashban Business Point",
    "job_title": "Packaging Man",
    "location": "Kawran Bazar",
    "salary": "TK. 6,000-10,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Warehouse",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Job Details Preparing designated parcel packets Attaching paper invoice sketch tape to the packet Measuring the weight of the packet and entering it online Educational Qualifications Minimum SSC pass Payment Based on work Monthly income: Estimated 6,000 to 10,000 taka Office Hours 6 days a week 9-hour shifts per day Friday weekly off Workplace Fargate\n\nকাজের বিস্তারিত নির্ধারিত পার্সেল প্যাকেট করা প্যাকেটের গায়ে কাগজের ইনভয়েজ স্কচ টেপ দিয়ে সংযুক্ত করা প্যাকেটের ওজন মাপা এবং অনলাইনে এন্ট্রি দেওয়া শিক্ষাগত যোগ্যতা ন্যূনতম এসএসসি পাস পেমেন্ট কাজের ভিত্তিতে মাসিক আয়: আনুমানিক ৬,০০০ থেকে ১০,০০০ টাকা অফিস টাইম সপ্তাহে ৬ দিন প্রতিদিন ৯ ঘণ্টার শিফট শুক্রবার সাপ্তাহিক ছুটি কর্মস্থল ফার্মগেট"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19975",
    "job_id": "19975",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Khulna, Narail, Bagerhat, Jessore, Satkhira",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are - tester, energy-saving bulb, LED bulb, clear bulb, multi-plug, gang switch, mosquito coil, super glue, tennis ball, and chanachur. Job Responsibilities Conducting market research and sales activities for the company's products Building and maintaining good relationships with new and existing customers Working towards achieving specified sales targets Market visits and providing necessary reports Job Type Full-time Part-time Contractual Educational Qualifications SSC/HSC pass Required Job Criteria Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile bill Performance bonus Lunch facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19857",
    "job_id": "19857",
    "company_name": "Live Shopping",
    "job_title": "Sales Executive",
    "location": "Anywhere in Chittagong Division, Anywhere in Dhaka Division, Anywhere in Rajshahi Division, Anywhere in Sylhet Division",
    "salary": "TK. 12,000-18,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Sales/Marketing",
    "vacancy": 40,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banglamotor, Dhaka",
    "job_description": "Responsibilities: ```html Maintain friendly and professional behavior with customers, understand their needs, and provide appropriate product recommendations. Actively work towards achieving set individual and team-based sales targets and regularly exceed them. Maintain long-term and positive relationships through customer inquiries and follow-ups to ensure customer satisfaction. Provide product demonstrations and explain product features and benefits in an easy and customer-friendly language. Present relevant products or services to customers by highlighting upselling and cross-selling opportunities. Keep product information and knowledge updated and assist customers in making informed decisions. Gather customer feedback and responses to inform the relevant department for product, service, and overall customer experience improvement. ```\n\nRequirements: Understanding customer needs and providing friendly and professional customer service, as well as offering appropriate products or solutions. Presenting product features and benefits in a simple, understandable, and customer-centric manner through effective product demonstrations. Highlighting upselling and cross-selling opportunities during customer communication to present relevant additional or complementary products. Maintaining long-term customer relationships through timely follow-ups, active communication, and post-sales support. Gathering customer feedback and market-related information to provide reports to the relevant team for product, service, and overall customer experience improvement. Collaborating with colleagues to work towards team goals, share leads, and exchange effective skills and best practices.\n\nগ্রাহকদের সাথে বন্ধুসুলভ ও পেশাদার আচরণ বজায় রেখে তাদের প্রয়োজন বুঝে উপযুক্ত পণ্য পরামর্শ প্রদান করা। নির্ধারিত ব্যক্তিগত ও টিমভিত্তিক বিক্রয় লক্ষ্যমাত্রা অর্জন এবং নিয়মিতভাবে তা অতিক্রম করার জন্য সক্রিয়ভাবে কাজ করা। গ্রাহকের জিজ্ঞাসা ও ফলো-আপের মাধ্যমে দীর্ঘমেয়াদি ও সুসম্পর্ক বজায় রাখা এবং গ্রাহক সন্তুষ্টি নিশ্চিত করা। পণ্যের ডেমোনস্ট্রেশন প্রদান এবং পণ্যের বৈশিষ্ট্য ও সুবিধাসমূহ সহজ ও গ্রাহকবান্ধব ভাষায় ব্যাখ্যা করা। আপসেলিং ও ক্রস-সেলিংয়ের সুযোগ চিহ্নিত করে গ্রাহকের জন্য প্রাসঙ্গিক পণ্য বা সেবা উপস্থাপন করা। পণ্যের সর্বশেষ তথ্য ও জ্ঞান হালনাগাদ রাখা এবং গ্রাহকদের সচেতন সিদ্ধান্ত নিতে সহায়তা করা। গ্রাহকদের মতামত ও প্রতিক্রিয়া সংগ্রহ করে পণ্য, সেবা এবং সার্বিক গ্রাহক অভিজ্ঞতা উন্নয়নে সংশ্লিষ্ট বিভাগকে অবহিত করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19855",
    "job_id": "19855",
    "company_name": "Live Shopping",
    "job_title": "QC Officer",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banglamotor, Dhaka",
    "job_description": "Responsibilities: ```html Supervise and oversee the end-to-end quality control process to ensure consistent adherence to company standards. Conduct regular inspections at production sites and retail locations, performing sample checks and final product verification. Apply quality inspection tools and standard operating procedures to identify defects and maintain product consistency. Lead root-cause analysis for quality issues and coordinate corrective actions with production and sourcing teams. Train, mentor, and guide QC team members to strengthen inspection skills and promote best practices. Document inspection findings clearly and prepare timely reports for management review and decision-making. Communicate effectively with suppliers, production staff, and retail partners to resolve quality concerns promptly. Recommend process improvements and preventive measures to reduce defects and enhance product reliability. Maintain and calibrate inspection tools and ensure compliance with SOPs and safety requirements. Manage QC records and documentation to support traceability and audit readiness. Travel for field inspections as required, representing the company professionally and ensuring consistent quality across locations. Support continuous improvement initiatives by sharing feedback and contributing to quality-focused projects. ```\n\nRequirements: Key responsibilities\n- Define and maintain factory quality standards aligned with buyer requirements and internal policies.\n- Develop, implement, and update standard operating procedures (SOPs) for production and preparatory processes to ensure right-first-time quality.\n- Design and operate a Management Information System (MIS) for capturing quality metrics, trends, and nonconformance records.\n- Perform routine and sample inspections across production stages; verify final product quality before dispatch.\n- Lead root-cause analysis and corrective/preventive action (CAPA) processes to resolve recurring defects.\n- Train, coach, and onboard new quality personnel on company quality policies, inspection techniques, and quality tools.\n- Coordinate with production, sourcing, and supplier teams to ensure quality requirements are understood and met.\n- Maintain inspection instruments, and ensure calibration schedules are followed and documented.\n- Prepare clear, timely inspection reports and communicate findings to relevant stakeholders for decision-making.\n- Support internal and external audits and maintain traceable quality documentation for audit readiness.\n\nSupervise and oversee the end-to-end quality control process to ensure consistent adherence to company standards. Conduct regular inspections at production sites and retail locations, performing sample checks and final product verification. Apply quality inspection tools and standard operating procedures to identify defects and maintain product consistency. Lead root-cause analysis for quality issues and coordinate corrective actions with production and sourc"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19972",
    "job_id": "19972",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Jamalpur, Netrokona, Mymensingh, Anywhere in Mymensingh Division, Sherpur",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are - testers, energy-saving bulbs, LED bulbs, clear bulbs, multi-plugs, gang switches, mosquito coils, super glue, tennis balls, and chanachur. Job Responsibilities Conducting market research and sales activities for the company's products Building and maintaining good relationships with new and existing customers Working towards achieving set sales targets Market visits and providing necessary reports Job Type Full-time Part-time Contractual Educational Qualifications SSC/HSC Pass Required Job Criteria Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile bill Performance bonus Lunch facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19853",
    "job_id": "19853",
    "company_name": "Debidar Al-haj Zobeda Khatun Mohila College",
    "job_title": "নাইট গার্ড",
    "location": "Comilla",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Security/Support Service",
    "vacancy": 5,
    "shift": "Night Shift",
    "country": null,
    "company_address": "লোকেশান: কুমিল্লা সিলেট মহাসড়ক উপজেলা",
    "job_description": "Responsibilities: Responsibility Area:\nDebidwar Alhaj Jobeda Khatun Women's College Campus\nResponsibilities and Duties:\nEnsuring security at the college campus\nProviding regular patrols at night\nMonitoring college property, buildings, and gates\nInforming authorities of any suspicious situations\nEnsuring prompt entry and exit of authorized individuals\nAdhering to security-related policies\n\nRequirements: Applicant's Qualifications:\nMinimum SSC pass\nPhysically fit, honest, and responsible\nPreference will be given to those with experience in maintaining security responsibilities\nSpecial privileges will be given to retired members of the armed forces / air force / navy / police / Ansar / BGB\nSalary:\nNegotiable based on experience and qualifications\nHow to apply:\nInterested candidates can contact the following mobile number for details or apply directly at the college.\n📞 Mobile: 01913064712\n\nদায়িত্ব স্থান: দেবিদ্বার আলহাজ্ব জোবেদা খাতুন মহিলা কলেজ ক্যাম্পাস দায়িত্ব ও কর্তব্যসমূহ: কলেজ ক্যাম্পাসের নিরাপত্তা নিশ্চিত করা রাতকালীন সময়ে নিয়মিত টহল প্রদান কলেজের সম্পদ, ভবন ও গেট পর্যবেক্ষণ যে কোনো সন্দেহজনক পরিস্থিতি কর্তৃপক্ষকে অবহিত করা আগত ব্যক্তিদের প্রবেশ ও প্রস্থান তদারকি নিরাপত্তা সংক্রান্ত নিয়মনীতি মেনে চলা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19969",
    "job_id": "19969",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Cox's Bazar, Anywhere in Chittagong Division, Chandpur, Brahmanbaria, Lakshmipur",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are - tester, energy-saving bulb, LED bulb, clear bulb, multi-plug, gang switch, mosquito coil, super glue, tennis ball, and chanachur. Job Responsibilities Conducting market research and sales activities for the company's products Creating new customers and maintaining good relationships with existing customers Working to achieve specified sales targets Market visits and providing necessary reports Job Types Full-time Part-time Contractual Educational Qualifications SSC/HSC Pass Required Job Criteria Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile bill Performance bonus Lunch facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19841",
    "job_id": "19841",
    "company_name": "Helium",
    "job_title": "Waiter/Senior Waiter",
    "location": "Khulna, Bogra, Rajshahi",
    "salary": "TK. 8,000-14,000",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Restaurant staff",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Niketon, Gulshan-1, Dhaka",
    "job_description": "Responsibilities: Job Title: Waiter/Senior Waiter Number of Positions: 10 💰 Salary: ৮,০০০ – ১৪,০০০ BDT 🎁 Benefits: Accommodation Tips Sales bonus Provident fund Free meals Daily snack allowance of 40 BDT 2 Eid bonuses per year 📌 Responsibilities: Prompt and courteous service to guests Taking orders accurately and meeting customer needs Setting and maintaining clean tables Behaving respectfully with customers Ensuring coordinated service with staff 📌 Qualifications: Preference given to candidates with previous experience as a waiter Good behavior and customer service skills Mentality to work quickly and diligently 📩 Interested candidates send CV to the address below: 📱 WhatsApp: 01898403048\n\nপদের নাম: ওয়েটার/সিনিওর ওয়েটার পদসংখ্যা: ১০ জন 💰 বেতন: ৮,০০০ – ১৪,০০০ টাকা 🎁 সুযোগ-সুবিধা: থাকা–খাওয়ার ব্যবস্থা (Accommodation) টিপস সেলস বোনাস প্রভিডেন্ট ফান্ড ফ্রি খাবার প্রতিদিন নাস্তার জন্য ৪০ টাকা বছরে ২টি ঈদ বোনাস 📌 দায়িত্বসমূহ: অতিথিদের জন্য দ্রুত এবং সুন্দরভাবে খাবার পরিবেশন করা অর্ডার ঠিকভাবে নেয়া এবং কাস্টমারদের প্রয়োজন মেটানো টেবিল সাজানো ও পরিষ্কার রাখা কাস্টমারদের সাথে ভদ্র আচরণ করা স্টাফদের সাথে সমন্বয় করে সেবা প্রদান নিশ্চিত করা 📌 যোগ্যতা: ওয়েটার হিসেবে পূর্ব অভিজ্ঞতা থাকলে অগ্রাধিকার ভালো আচরণ ও কাস্টমার সার্ভিস স্কিল দ্রুত ও পরিশ্রমীভাবে কাজ করার মানসিকতা 📩 আগ্রহী প্রার্থীরা নিচের ঠিকানায় জীবনবৃত্তান্ত (CV) পাঠান: 📱 হোয়াটসঅ্যাপ: 01898403048"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20197",
    "job_id": "20197",
    "company_name": "Nondinir Boson",
    "job_title": "Customer Relationship Officer",
    "location": "Mohammadpur",
    "salary": "TK. 12,000-18,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-30",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Lalmatia, Mohammadpur",
    "job_description": "Responsibilities: ```html Job Summary: Customer Relationship Officer Act as the primary point of contact for customers, ensuring their needs are met and concerns addressed promptly. Build and maintain strong, long-lasting relationships with clients to enhance customer loyalty. Understand customer requirements and provide tailored solutions to meet their needs. Promote company products or services to generate interest and increase customer engagement. Resolve customer inquiries and complaints in a professional and efficient manner. Collaborate with internal teams to ensure seamless service delivery and customer satisfaction. Maintain accurate records of customer interactions and transactions for future reference. Continuously gather customer feedback to identify areas for improvement and enhance customer experience. Stay updated on company offerings, policies, and industry trends to provide effective support. Exhibit strong communication, problem-solving, and interpersonal skills to manage customer relationships effectively. ```\n\nJob Summary: Customer Relationship Officer Act as the primary point of contact for customers, ensuring their needs are met and concerns addressed promptly. Build and maintain strong, long-lasting relationships with clients to enhance customer loyalty. Understand customer requirements and provide tailored solutions to meet their needs. Promote company products or services to generate interest and increase customer engagement. Resolve customer inquiries and complaints in a professional and efficient manner. Collaborate with internal teams to ensure seamless service delivery and customer satisfaction. Maintain accurate records of customer interactions and transactions for future reference. Continuously gather customer feedback to identify areas for improvement and enhance customer experience. Stay updated on company offerings, policies, and industry trends to provide effective support. Exhibit strong communication, problem-solving, and interpersonal skills to manage customer relationships effectively."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19843",
    "job_id": "19843",
    "company_name": "Karim and Brother Traders",
    "job_title": "Sales Representative",
    "location": "Uttara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-18",
    "industry": "Sales/Marketing",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 26-1, Road No: 5, Uttara, Dhaka",
    "job_description": "Responsibilities: - Make daily field visits for sales to customers to retain existing business, increase volume, and pursue new customers.\n- Daily field visits to retail shops and trading offices.\n- Maintain relationships with clients/customers.\n- Provide day-end sales report and new customer acquisition report to the leader.\n- Achieve short-term and long-term sales goals for the company.\n- Handle customer queries.\n- Good communication skills.\n- Ability to work under pressure.\n- Positive and professional attitude.\n- Basic computer skills.\n- Must be physically fit.\n\nMake daily field visits for sales to customer to retain existing business, increase volume & pursue new Customers. Daily field Visit to sit to retail shops and trading office. Maintain relationships with clients/customers. Provide day end sales report and new customer acquisition report to leader. Achieve short term and long-term sales goal for the company. To look after customer queries. Good Communication Skill Ability to work under pressure Positive and professional attitude. Basic Computer skill Must be Physically Fit"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19973",
    "job_id": "19973",
    "company_name": "Kashban Business Point",
    "job_title": "Sales Representative",
    "location": "Thakurgaon, Dinajpur, Nilphamari, Anywhere in Rangpur Division, Lalmonirhat",
    "salary": "TK. 12,600-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-15",
    "date_posted": "2026-01-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Among the products established by the company are - Tester, Energy Saving Bulb, LED Bulb, Clear Bulb, Multiplug, Gang Switch, Mosquito Coil, Super Glue, Tennis Ball, and Chanachur. Job Responsibilities Conducting market research and sales activities for company products Building and maintaining relationships with new and existing customers Working towards achieving set sales targets Market visits and providing necessary reports Job Type Full-time Part-time Contractual Educational Qualifications SSC/HSC Pass Required Job Criteria Age: 18 to 30 years Both male and female candidates can apply Preference will be given to candidates with experience in marketing or sales Salary Negotiable Company Benefits T/A (Travel Allowance) Mobile bill Performance bonus Lunch facility: 50% subsidy\n\nকোম্পানির প্রতিষ্ঠিত পণ্যসমূহের মধ্যে রয়েছে— টেস্টার, এনার্জি সেভিং বাল্ব, এলইডি বাল্ব, ক্লিয়ার বাল্ব, মাল্টিপ্লাগ, গ্যাং সুইচ, মশার কয়েল, সুপার গ্লু, টেনিস বল ও চানাচুর। চাকরির দায়িত্বসমূহ কোম্পানির পণ্যসমূহ বাজারজাতকরণ ও বিক্রয় কার্যক্রম পরিচালনা করা নতুন গ্রাহক তৈরি ও বিদ্যমান গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা নির্ধারিত সেলস টার্গেট অর্জনে কাজ করা মার্কেট ভিজিট ও প্রয়োজনীয় রিপোর্ট প্রদান করা চাকরির ধরন ফুল টাইম পার্ট টাইম চুক্তিভিত্তিক শিক্ষাগত যোগ্যতা এসএসসি / এইচএসসি পাস চাকরির প্রয়োজনীয় বিষয়সমূহ বয়স: ১৮ থেকে ৩০ বছর নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন মার্কেটিং বা সেলসে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে বেতন আলোচনা সাপেক্ষ কোম্পানির সুযোগ-সুবিধা T/A (যাতায়াত ভাতা) মোবাইল বিল পারফরম্যান্স বোনাস লাঞ্চ সুবিধা: ৫০% ভর্তুকি"
  }
]