[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20401",
    "job_id": "20401",
    "company_name": "Good Men",
    "job_title": "কাস্টমার রিলেশনশিপ অফিসার",
    "location": "Dhaka, Mohammadpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-06",
    "date_posted": "2026-02-14",
    "industry": "Sales/Marketing",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Type of organization: E-commerce business\nJob type:\nCommunication with customers to discuss products and manage sales or courier management.\nExperience:\nPriority will be given to experienced candidates, otherwise I will make the utmost effort to train you.\nMust have an interest in learning new things.\n\nRequirements: 👉 Eligibility: Minimum H.S.C pass. New interest in education Office Time: 10 am - 8 pm Salary: 10,000 - 14,000 taka (negotiable) 👉 Benefits: Opportunity to increase skills and experience directly through training programs in a friendly environment. Two annual bonuses Evening snacks Sales performance bonus 👉 Joining Date: 22nd February 2026 Location: Mohammadiya Housing Limited, Main Road, Gate No. 4 📌 Contact: For details and CV inbox. 01840 638000 (WhatsApp) goodmanbd.info@gmail.com (CV Here) { N.B. = Please apply after reading the job post thoroughly. Thank you. }\n\nপ্রতিষ্ঠানের ধরণ: ই-কমার্স বিজনেস কাজের ধরন: কাস্টমারের সাথে যোগাযোগ করে প্রোডাক্ট সম্পর্কে কথা বলতে হবে এবং সেল জেনারেট বা কুরিয়ার ম্যানেজমেন্ট করতে হবে। অভিজ্ঞতাঃ অভিজ্ঞতা থাকলে প্রায়োরিটি পাবেন অন্যথায় আমি আপনাকে শেখানোর জন্য সর্বোচ্চ চেষ্টা করবো। নতুন কিছু শিক্ষার আগ্রহ থাকতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20394",
    "job_id": "20394",
    "company_name": "Organic Ponno",
    "job_title": "কাস্টমার সাপোর্ট এক্সিকিউটিভ (পার্ট-টাইম)",
    "location": "Mohammadpur",
    "salary": "TK. 8,000-10,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "",
    "deadline": "2026-02-20",
    "date_posted": "2026-02-14",
    "industry": "Call Center",
    "vacancy": 28,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibilities:\n- Communicate with customers over the phone\n- Confirm and verify orders\n- Provide necessary information to customers when needed\n- Complete tasks at the office within specified time\n\nQualifications and Conditions:\n- Only male candidates can apply\n- Age: 18-24 years\n- Priority will be given to student candidates\n- Residents of Mohammadpur area will have priority\n- Must have the ability to communicate clearly and confidently\n\nWorking Hours:\n5 hours per day (part-time) directly at the office\n\nSalary:\n8000-10000 BDT (negotiable)\n\nApplication Process:\nInterested candidates are requested to contact promptly.\n\nContact Number: 01854996956\n\n📌দায়িত্বসমূহ (Job Responsibilities): ➡️কাস্টমারের সাথে ফোনে যোগাযোগ করা ➡️অর্ডার কনফার্ম ও ভেরিফিকেশন সম্পন্ন করা ➡️প্রয়োজনে কাস্টমারকে প্রয়োজনীয় তথ্য প্রদান করা ➡️অফিসে উপস্থিত থেকে নির্ধারিত সময়ে কাজ সম্পন্ন করা 📌যোগ্যতা ও শর্তাবলি: ➡️শুধুমাত্র পুরুষ প্রার্থীগণ আবেদন করতে পারবেন ➡️বয়স: ১৮ – ২৪ বছর ➡️স্টুডেন্ট প্রার্থীদের অগ্রাধিকার প্রদান করা হবে ➡️মোহাম্মদপুর এলাকায় বসবাসকারীদের অগ্রাধিকার ➡️স্পষ্ট ও সাবলীলভাবে কথা বলার দক্ষতা থাকতে হবে ⏰কর্মঘণ্টা: প্রতিদিন ৫ ঘণ্টা (পার্ট-টাইম) সরাসরি অফিসে উপস্থিত থেকে কাজ করতে হবে। 💵বেতন: ৮০০০ – ১০০০০ টাকা (আলোচনা সাপেক্ষে) 📝আবেদন প্রক্রিয়া: আগ্রহী প্রার্থীদের দ্রুত যোগাযোগ করার জন্য অনুরোধ করা হচ্ছে। ☎️সরাসরি কল করুন: 01854996956"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20407",
    "job_id": "20407",
    "company_name": "Yunyi Trading Limited",
    "job_title": "Consultant (Sales)",
    "location": "Khilgaon",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-21",
    "date_posted": "2026-02-14",
    "industry": "Law/ Legal",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: \"Yunyi Trading Limited\" A well-reputed trading company in Bangladesh requires immediate appointment as \"Quality Controller\" & \"Consultant (Sales)\" located at Holding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219, Bangladesh.\n\nPosition: Consultant (Sales)\nPost: 10 (NOS)\n\nJob Responsibilities:\nAble to identify and develop new market opportunities for a company, including analyzing market trends, identifying potential customer segments, creating strategies to expand the customer base, and executing marketing campaigns aimed at capturing new market share.\n\nEducational Requirements:\nThe candidate must be qualified Secondary/Higher Secondary Certificate or 03 (Three) years Diploma Course in a relevant subject.\n\nExperience:\nMinimum of 3-5 years' experience in the relevant area.\nExperience using MS Windows & MS Office packages, Browsing, Emailing, Internet, etc.\n\nSalary: Negotiable\nJob Status: Full-Time\nAge: Maximum of 30-60+ years\nApplicant: Male/Female both are encouraged to apply, also Local & Foreigners can apply.\n\nOther benefits are as per the company's rules. Cover letter must be included with CV with a photograph respective Email Address: yunyitradingltd0@gmail.com\n\nDeadline: Within 21st February 2026.\n\nYunyi Trading Limited.\nHolding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219.\n\nRequirements: Able to identifying and developing new market opportunities for a company, including analyzing market trends, identifying potential customer segments, creating strategies to expand the customer base, and executing marketing campaigns aimed at capturing new market share.\n\n“Yunyi Trading Limited ” A well Reputed Trading Company in Bangladesh required immediate appointment as “Quality Controller” & “Consultant (Sales)” Located at Holding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219,Bangladesh. Position: Consultant (Sales) Post: 10 (NOS) Job Responsibilities: n Able to identifying and developing new market opportunities for a company, including analyzing market trends, identifying potential customer segments, creating strategies to expand the customer base, and executing marketing campaigns aimed at capturing new market share. Educational Requirements: n The candidate must be qualified Secondary/Higher Secondary Certificate or 03 (Three) years Diploma Course relevant subject. Experience: n Minimum of n 3 - 5 Years ’ Experience in the relevant area. n Experience using MS Windows & MS Office packages, Browsing, Emailing, Internet etc. Salary : Negotiable Job Status : Full-Time Age : Maximum of 30 - 60+ years Applicant : Male/Female both are encouraged to apply also Local & Foreigners can be apply. Others Benefits are as per Company's rules. Cover letter must be included with CV with photograph respective Email Address: yunyitradingltd0@gmail.com Within 21 st February, 2026. Yunyi Trading Limited . Holding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20406",
    "job_id": "20406",
    "company_name": "Yunyi Trading Limited",
    "job_title": "Quality Controller",
    "location": "Khilgaon",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-21",
    "date_posted": "2026-02-14",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: \"Yunyi Trading Limited\" A well-reputed trading company in Bangladesh requires immediate appointment as \"Quality Controller\" & \"Consultant (Sales)\" located at Holding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219, Bangladesh.\n\nPosition: Quality Controller\nPost: 10 (NOS)\n\nJob Responsibilities:\nAble to manage and coordinate various business operations within an organization, including tasks like scheduling meetings, managing project timelines, communicating with clients and vendors, inspecting products for defects, maintaining documentation, managing vendor quality compliance, and coordinating with logistics to resolve quality issues, all while providing administrative support to key stakeholders.\n\nEducational Requirements:\nThe candidate must be qualified Secondary/Higher Secondary Certificate or 03 (Three) years Diploma Course.\n\nExperience:\nMinimum of 3-5 Years' Experience in the relevant area.\nExperience using MS Windows & MS Office packages, Browsing, Emailing, Internet, etc.\n\nSalary: Negotiable\nJob Status: Full-Time\nAge: Maximum of 25-60+ years\nApplicant: Male/Female both are encouraged to apply, also Local & Foreigners can apply.\n\nOther Benefits are as per the Company's rules. Cover letter must be included with CV with a photograph respective Email Address: yunyitradingltd0@gmail.com Within 21st February, 2026.\n\nYunyi Trading Limited.\nHolding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219.\n\nRequirements: Able to managing and coordinating various business operations within an organization, including tasks like scheduling meetings, managing project timelines, communicating with clients and vendors, inspecting products for defects, maintaining documentation, managing vendor quality compliance, and coordinating with logistics to resolve quality issues, all while providing administrative support to key stakeholders.\n\n“Yunyi Trading Limited ” A well Reputed Trading Company in Bangladesh required immediate appointment as “Quality Controller” & “Consultant (Sales)” Located at Holding-1005, Plot-B10 (North) Malibagh Chowdhury Para, Dhaka-1219,Bangladesh. Position: Quality Controller Post: 10 (NOS) Job Responsibilities: n Able to managing and coordinating various business operations within an organization, including tasks like scheduling meetings, managing project timelines, communicating with clients and vendors, inspecting products for defects, maintaining documentation, managing vendor quality compliance, and coordinating with logistics to resolve quality issues, all while providing administrative support to key stakeholders. Educational Requirements: n The candidate must be qualified Secondary/Higher Secondary Certificate or 03 (Three) years Diploma Course. Experience: n Minimum of 3 - 5 Years ’ Experience in the relevant area. n Experience using MS Windows & MS Office packages, Browsing, Emailing, Internet etc. Salary : Negotiable Job Status : Full-Time Age : Maximum of 25 - 60+ years Applicant : Male/Femal"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20385",
    "job_id": "20385",
    "company_name": "Basic Education Care",
    "job_title": "অফিস সহায়ক",
    "location": "Bangshal",
    "salary": "TK. 14,000-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-14",
    "industry": "General Management/Admin",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: At a prestigious coaching center, the following position is available for hiring:\n\nPosition: Office Assistant\nNumber of Positions: 2\nEducational Qualification: Minimum HSC pass\n\nResponsibilities:\n- Ensuring regular attendance and maintenance of students\n- Making calls to absent students\n- Assisting in daily activities of the management team\n- Handling office documents and keeping them organized\n- Collaborating with parents and students as needed\n\nQualifications:\n- Honest, punctual, and responsible\n- Capable of learning quickly and cooperative\n- Must be able to speak fluent Bengali\n\nAge Limit: 18 to 30 years\nWorkplace: Basic Education Care, Armanitola, Dhaka\nWorking Hours: 9 am to 9 pm\n\nএকটি স্বনামধন্য কোচিং সেন্টারে নিম্নবর্ণিত পদে একজন অফিস সহায়ক নিয়োগ দেওয়া হবে: পদের নাম: অফিস সহায়ক পদসংখ্যা: ২ জন শিক্ষাগত যোগ্যতা: ন্যূনতম HSC পাশ দায়িত্বসমূহ: শিক্ষার্থীদের নিয়মিত হাজিরা গ্রহণ ও সংরক্ষণ অনুপস্থিত শিক্ষার্থীদের কল দেয়া। ম্যানেজমেন্ট কর্মকর্তাদের দৈনন্দিন কার্যক্রমে সহায়তা করা অফিস কাগজপত্র বহন ও সাজিয়ে রাখা আগত অভিভাবক ও শিক্ষার্থীদের সহযোগিতা করা যোগ্যতা: সৎ, সময়ানুবর্তী ও দায়িত্বশীল দ্রুত শিখতে সক্ষম ও সহযোগিতাপরায়ণ শুদ্ধ বাংলা বলতে পারদর্শী হতে হবে। বয়সসীমা: ১৮ থেকে ৩০ বছর কর্মস্থল: বেসিক এডুকেশন কেয়ার আরমানিটোলা,ঢাকা। কর্মঘণ্টা: সকাল ৯টা থেকে রাত ৯টা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20411",
    "job_id": "20411",
    "company_name": "Padma Courier service ",
    "job_title": "সাইকেল বিতরণ কর্মী",
    "location": "Paltan",
    "salary": "TK. 12,000-15,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-14",
    "date_posted": "2026-02-14",
    "industry": "Deliveryman",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 📢 Job Announcement Position: Bicycle Distribution Worker (Bank Job) Qualifications: Minimum SSC pass Must have own bicycle Must have a smartphone Salary: Starting from 12,000 BDT per month (increment based on work and experience) Job Conditions: No security deposit required for the job Must work on regular bank and courier related tasks Workplace: Padma Courier Service 50/1 Purana Paltan Lane, Dhaka In front of Bot-tola Mosque Contact: 📞 0155247709\n\n📢 চাকরির বিজ্ঞপ্তি পদ: সাইকেল বিতরণ কর্মী (ব্যাংকের কাজ) যোগ্যতা: ন্যূনতম এসএসসি পাস নিজস্ব সাইকেল থাকতে হবে স্মার্ট মোবাইল থাকতে হবে বেতন: মাসিক ১২,০০০ টাকা থেকে শুরু (কাজ ও অভিজ্ঞতা অনুযায়ী বৃদ্ধি পাবে) চাকরির শর্তাবলী: চাকরির জন্য কোনো জামানত লাগবে না নিয়মিত ব্যাংক ও কুরিয়ার সংশ্লিষ্ট কাজ করতে হবে কর্মস্থল: পদ্মা কুরিয়ার সার্ভিস ৫০/১ পুরানা পল্টন লাইন, ঢাকা বটতলা মসজিদের সামনে যোগাযোগ: 📞 ০১৫৫২৪৭৭৭০৯"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20403",
    "job_id": "20403",
    "company_name": "Tahoor Studio",
    "job_title": "Sales Executive  (Eid Package)",
    "location": "Wari, Gulshan, Dhanmondi, Banani",
    "salary": "TK. 10,000-13,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Contractual",
    "working_hours": "",
    "deadline": "2026-03-12",
    "date_posted": "2026-02-14",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Sales Girl Job Advertisement for Eid Package Tahoor Studio is a modest fashion brand. We are looking for an energetic, presentable, and motivated sales girl to work in our showroom. If you believe you have the necessary qualifications and enthusiasm, we are ready to welcome you for an interview. Responsibilities: Ensure customers can try on shoes/products comfortably and provide direct assistance when needed Welcome incoming customers to the showroom with confidence Interact with customers in a polite, professional, and sincere manner and address their questions and concerns Provide friendly, hospitable, and efficient service Adhere to the company's etiquette and professional code of conduct Gain a good understanding of products and services Recommend relevant products to customers based on their needs to enhance their shopping experience Maintain cleanliness in the showroom Display products attractively Maintain a positive attitude at all times and prioritize customer satisfaction\n\nRequirements: Additional Requirements: Age: 20 to 28 years Excellent communication skills Interest in learning new subjects and a mindset for self-improvement Ability to handle multiple customers with skill\n\nঈদ প্যাকেজের জন্য সেলস গার্ল নিয়োগ বিজ্ঞপ্তি Tahoor Studio একটি মোডেস্ট ফ্যাশন ব্র্যান্ড। আমাদের শোরুমে কাজ করার জন্য আমরা একজন এনার্জেটিক, প্রেজেন্টেবল ও মোটিভেটেড সেলস গার্ল খুঁজছি। আপনি যদি মনে করেন আপনার মধ্যে প্রয়োজনীয় যোগ্যতা ও উৎসাহ রয়েছে, আমরা আপনাকে সাক্ষাৎকারে স্বাগত জানাতে প্রস্তুত। দায়িত্বসমূহ (Job Responsibilities): ক্রেতারা যাতে স্বাচ্ছন্দ্যে জুতা/পণ্য ট্রাই করতে পারেন, সে বিষয়টি নিশ্চিত করা এবং প্রয়োজনে সরাসরি সহায়তা প্রদান শোরুমে আগত ক্রেতাদের আত্মবিশ্বাসের সঙ্গে স্বাগত জানানো ক্রেতাদের সাথে ভদ্র, পেশাদার ও আন্তরিক আচরণ করা এবং তাদের প্রশ্ন ও সমস্যার সমাধান করা বন্ধুত্বপূর্ণ, আতিথেয়তাপূর্ণ ও দক্ষ সেবা প্রদান প্রতিষ্ঠানের শিষ্টাচার ও পেশাদার আচরণবিধি মেনে চলা পণ্য ও সেবাসমূহ সম্পর্কে ভালো ধারণা অর্জন করা ক্রেতাদের প্রয়োজন অনুযায়ী সংশ্লিষ্ট পণ্য রিকমেন্ড করা, যাতে তাদের কেনাকাটার অভিজ্ঞতা আরও ভালো হয় শোরুমের পরিচ্ছন্নতা বজায় রাখা পণ্যসমূহ আকর্ষণীয়ভাবে ডিসপ্লে করা সব সময় ইতিবাচক মনোভাব বজায় রাখা এবং কাস্টমার স্যাটিসফ্যাকশনের উপর গুরুত্ব দেওয়া"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20287",
    "job_id": "20287",
    "company_name": "Sustodeho",
    "job_title": "Tele Sales Executive",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-14,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-14",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibilities of Customer Service and Sales Executives:\n- Outbound and inbound call management: Making calls to potential customers and receiving calls from interested customers.\n- Providing product and service information: Clearly and professionally explaining the company's products and services to customers.\n- Lead follow-up and sales conversion: Maintaining regular communication with potential leads and converting them into permanent customers.\n- Data management and reporting: Updating daily work tasks and accurately storing customer information on Google Sheets or CRM.\n- Providing answers to inquiries: Resolving any customer questions or doubts and assisting with accurate information.\n- Achieving sales targets: Meeting the company's defined daily, weekly, and monthly sales targets.\n- Maintaining customer support and relationships: Ensuring post-sales services are provided and building long-term business relationships.\n- Team coordination: Coordinating with other departments for the smooth running of tasks.\n- Participation in training: Attending regular training sessions to learn about products, services, and sales skills.\n\nCourier and Delivery Management:\n- Order processing and booking: Booking orders correctly on the courier portal after ensuring customer's order confirmation.\n- Delivery tracking: Tracking the current location of the parcel in transit and providing regular updates to the customer.\n- Return or parcel follow-up: Resolving any delivery issues or non-receipt of parcels by contacting the courier service and the customer.\n- Cash on delivery (COD) coordination: Managing payment received from the courier and promptly resolving any payment-related issues.\n- Parcel packing supervision: Ensuring products are packed correctly and sent through the appropriate courier service.\n\nRequirements: Essential Qualifications and Skills (Requirements): HSC/Equivalent pass. Prior experience in tele sales or call center-related work preferred. Excellent verbal and written communication skills. Strong mentality and self-confidence to achieve sales targets. Customer-centric attitude and problem-solving skills. Ability to learn quickly and work under pressure. Additional Skills (Good to Have): Presentation Skills. Problem-Solving Skills. Negotiation Skills. Time management and multitasking abilities. Proficiency in computer and CRM software usage. Experience in customer management through email and social media. Preference given to candidates with proficiency in communication in Bengali and English alongside other languages.\n\nকাস্টমার সার্ভিস ও সেলস এক্সিকিউটিভের দায়িত্বসমূহ: আউটবাউন্ড ও ইনবাউন্ড কল পরিচালনা: সম্ভাব্য ক্রেতাদের কল করা এবং আগ্রহী ক্রেতাদের কল রিসিভ করা। পণ্য ও সেবা সম্পর্কে ধারণা প্রদান : কাস্টমারদের কাছে প্রতিষ্ঠানের পণ্য এবং সেবাগুলো পরিষ্কার ও পেশাদারভাবে ব্যাখ্যা করা। লিড ফলো-আপ ও সেলস কনভার্সন: সম্ভাব্য ক্রেতাদের (Leads) সাথে নিয়মিত যোগাযোগ রাখা এবং তাদের স্থায়ী ক্রেতায় রূপান্তর করা। ডেটা ম্যানেজমেন্ট ও রিপোর্ট"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20402",
    "job_id": "20402",
    "company_name": "Demra Law College",
    "job_title": "অফিস সহকারী",
    "location": "Shonir Akhra",
    "salary": "TK. 6,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "",
    "deadline": "2026-02-21",
    "date_posted": "2026-02-14",
    "industry": "General Management/Admin",
    "vacancy": 1,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: An educated, online and computer savvy employee is needed as an office assistant in a college. Job Responsibilities: Work Hours: * 6 days a week (except Fridays). * From 4:00 PM to 9:00 PM daily. Salary: Monthly 6000/- (six thousand) taka. Responsibilities: * Assist in daily office work. * Collect student fees. * Provide various information to students over the phone. * Ensure proper completion of all admission-related activities. * Gather and maintain all necessary information for audits. * Inform teachers of the college's class schedule (over the phone). * Provide answers to various questions on all online pages. * Work as a principle executive in the overall management of the college. * Create skills for following and increasing followers and members on various social media platforms, content creation, establishing communication with customers, and conducting online presence management through effectiveness analysis. * Run promotions on social media. * Create promotional banners and short video clips. Leave: * The college will be closed on all general government holidays. * Other existing holidays in educational institutions can be enjoyed normally. Special Condition: * Selected candidates must commit to working in this institution for a minimum of three years. Application Process: * Interested and qualified candidates must send their CV online. (Under no circumstances should you call, contact will be made if the CV is found suitable) Note: Female candidates can apply\n\nএকটি কলেজে অফিস সহকারী হিসাবে শিক্ষিত, অনলাইন ও কম্পিউটারে পারদর্শী কর্মচারী প্রয়োজন। Job Responsibilities: কাজের সময়: * সপ্তাহে ৬ দিন (শুক্রবার ব্যতীত)। * প্রতিদিন বিকাল ৪:০০ থেকে রাত ৯:০০টা পর্যন্ত। বেতন: মাসিক ৬০০০/- (ছয় হাজার) টাকা। দায়িত্ব ও কর্তব্যসমূহ: * অফিসের দৈনন্দিন কাজে সহযোগিতা করা। * শিক্ষার্থীদের বেতন সংগ্রহ করা। * শিক্ষার্থীদেরকে ফোনে বিভিন্ন তথ্য প্রদান করা। * ভর্তি সংক্রান্ত সকল কার্যক্রম সুষ্ঠুভাবে সম্পন্ন করা। * অডিটের জন্য প্রয়োজনীয় সকল তথ্য সংগ্রহ ও সংরক্ষণ করা। * কলেজের শিক্ষকদের ক্লাসের সময়সূচী সম্পর্কে (ফোনে) অবহিত করা। * সকল অনলাইন পেজে আসা বিভিন্ন প্রশ্নের উত্তর প্রদান করা। * সামগ্রিকভাবে কলেজ পরিচালনায় তত্ত্বাবধায়ক হিসেবে কাজ করা। * ভর্তি ফরম ফিলাপ প্রিন্টিং ইত্যাদি রেগুলার কাজ সহ বিভিন্ন সোশ্যাল মিডিয়া প্ল্যাটফর্মে  কৌশল তৈরি করার মাধ্যমে ফলোয়ার এবং মেম্বার বৃদ্ধি করা, কনটেন্ট তৈরি, গ্রাহকদের সাথে যোগাযোগ স্থাপন এবং কার্যকারিতা বিশ্লেষণ-এর মাধ্যমে অনলাইন উপস্থিতি পরিচালনা করা। * সোশ্যাল মিডিয়ায় প্রচারণা চালানো। *প্রমোশনাল ব্যানার এবং ছোটখাটো ভিডিও ক্লিপ তৈরি করা। ছুটি: *সাধারণত সকল সরকারি ছুটির দিন কলেজ বন্ধ থাকবে। *সাধারণত শিক্ষা প্রতিষ্ঠানের বিদ্যমান অন্যান্য ছুটিগুলো উপভোগ করা যাবে। বিশেষ শর্ত: * নির্বাচিত প্রার্থীকে ন্যূনতম তিন বছর এই প্রতিষ্ঠানে কাজ করার প্রতিশ্রুতি দিতে হবে। আবেদন প্রক্রিয়া: * আগ্রহী ও যোগ্য প্রার্থীগণকে  অনলাইন এ সিভি পাঠাতে হবে। (কোন অবস্থাতেই ফোন করা যাবে না, সিভি দেখে যোগ্য মনে হলে যোগাযোগ করা হবে) বিশেষ দ্রষ্টব্য: মহিলা  প্রার্থী আবেদন করতে পারবেন"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20410",
    "job_id": "20410",
    "company_name": "SteadFast Courier",
    "job_title": "Customer Service Executive",
    "location": "Dhanmondi",
    "salary": "TK. 13,000-15,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-14",
    "date_posted": "2026-02-14",
    "industry": "Call Center",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Handle large volumes of high-pressure inbound customer calls Provide instant and effective on-call solutions Record customer complaints and issues clearly and accurately in the system Maintain a polite, empathetic, and customer-centric attitude during every interaction Maintain confidentiality of customer information and strictly follow company SOPs Work effectively under pressure to meet operational requirements Achieve daily performance targets and maintain call quality standards\n\nRequirements: Running undergraduate or graduate student (any discipline) Excellent communication skills in both Bangla and English (speaking and writing) Strong listening skills with the ability to understand and address customer needs Ability to remain calm, confident, and solution-focused during high-pressure situations Positive attitude with a strong willingness to learn and adapt Good typing speed and basic computer proficiency (MS Office, Google Workspace) Ability to work in rotational shifts and weekends during peak operational hours Previous experience in customer service, call center, courier, or food delivery sector is an added advantage, but freshers are also welcome\n\nHandle large volumes of high pressure inbound customer calls Provide instant and effective on call solutions Record customer complaints and issues clearly and accurately in the system Maintain a polite, empathetic, and customer centric attitude during every interaction Maintain confidentiality of customer information and strictly follow company SOPs Work effectively under pressure to meet operational requirements Achieve daily performance targets and maintain call quality standards"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20405",
    "job_id": "20405",
    "company_name": "Ashik international",
    "job_title": "সেলাই অপারেটর (শীলা কাজ)",
    "location": "All over Bangladesh",
    "salary": "TK. 12,000-14,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-14",
    "date_posted": "2026-02-14",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kishoreganj sadar, Bangladesh",
    "job_description": "Responsibilities: We are hiring experienced and skilled sewing operators for our organization. Job Type: Full-time Candidates: Male only Qualifications and Skills: Candidates with experience in garment sewing will be given preference Must have practical experience operating Jack Five and Juki sewing machines Ability to work on Maki digital auto and overlock machines Must be responsible and punctual in work\n\nআমাদের প্রতিষ্ঠানে শীলা কাজের জন্য অভিজ্ঞ ও দক্ষ সেলাই অপারেটর নিয়োগ দেওয়া হবে। চাকরির ধরন: ফুল টাইম প্রার্থী: শুধু পুরুষ যোগ্যতা ও দক্ষতা: গার্মেন্টস ফেরত অভিজ্ঞ প্রার্থী অগ্রাধিকার পাবে জ্যাক ফাইভ,ও জোজি সেলাই মেশিন চালানোর বাস্তব অভিজ্ঞতা থাকতে হবে মেকি ডিজিটাল অটো ওভারলক মেশিনে কাজ করার দক্ষতা থাকতে হবে কাজের প্রতি দায়িত্বশীল ও সময়নিষ্ঠ হতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20404",
    "job_id": "20404",
    "company_name": "Ashik international",
    "job_title": "কাস্টমার কেয়ার এক্সিকিউটিভ ",
    "location": "All over Bangladesh",
    "salary": "TK. 13,000-14,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-14",
    "date_posted": "2026-02-14",
    "industry": "General Management/Admin",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kishoreganj sadar, Bangladesh",
    "job_description": "Responsibilities: Responsibilities of the job:\n- Communicate professionally with customers via phone calls, WhatsApp, and in person.\n- Take customer orders and note necessary information.\n- Address customer questions, complaints, and issues with patience and provide solutions.\n- Accurately write and store information related to orders on the computer.\n- Maintain daily reports in accordance with office regulations.\n\nRequirements: Required Qualifications: Minimum SSC pass Basic knowledge of computer usage (typing, file management, etc.) Neat handwriting and ability to read easily written text Proficiency in clear communication in the Bengali language Respectful, patient, and responsible behavior with customers Punctuality and sincerity in work Extra skills (will receive preference) Previous experience in customer care or sales support Quick learning mentality Ability to work calmly under pressure Teamwork skills Salary and Benefits First Month ( Qualification Verification Period ): ১৩ , ০০০ Taka Upon Permanent Employment : ১৪ , ০০০ Taka Experienced candidates will be provided with additional benefits in the future\n\nচাকরির দায়িত্ব: ফোন কল , হোয়াটসঅ্যাপ ও সরাসরি কাস্টমারের সাথে পেশাদারভাবে যোগাযোগ করা কাস্টমারের অর্ডার নেওয়া ও প্রয়োজনীয় তথ্য নোট করা কাস্টমারের প্রশ্ন , অভিযোগ ও সমস্যা ধৈর্যের সাথে সমাধান করা অর্ডার সংক্রান্ত তথ্য সঠিকভাবে লিখে ও কম্পিউটারে সংরক্ষণ করা অফিসের নিয়ম অনুযায়ী দৈনন্দিন রিপোর্ট আপডেট রাখা"
  }
]