[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20769",
    "job_id": "20769",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Gulshan-Banani, Banani, Bashundhara R/A, Badda, Rampura",
    "salary": "TK. 18,500-35,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-29",
    "date_posted": "2026-02-28",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Collect medicine from the hub at a designated time every day Supply collected medicine to the pharmacy in a timely manner Collect cash from customers Deposit collected cash into the company's designated bank account through CRM Participate in the campaign\n\nRequirements: Personal bike Hardworking Mindset for work Why should you work with us? Opportunity for salary reevaluation for experienced individuals Assurance of regular and dependable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20771",
    "job_id": "20771",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Goran, Jurain, Demra, Jatrabari, Rayerbag",
    "salary": "TK. 18,500-35,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-29",
    "date_posted": "2026-02-28",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Collect medicine from the hub at a designated time every day Deliver collected medicine to the pharmacy in a timely manner Collect cash from customers Deposit collected cash into the company's designated bank account through CRM Participate in the campaign\n\nRequirements: Personal bike Hardworking Mindset for work Why should you work with us? Opportunity for salary reassessment for experienced individuals Assurance of regular and reliable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20773",
    "job_id": "20773",
    "company_name": "Rokomari.com",
    "job_title": "Supply Chain Oparetion",
    "location": "Motijheel",
    "salary": "TK. 10,000-13,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-29",
    "date_posted": "2026-02-28",
    "industry": "Supply Chain/Procurement",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibilities: 1. Inventory books. 2. Select products for the superstore. 3. Pack products for the superstore.\n\nRequirements: Skills: 1. Will be able to read English and Bangla correctly. 2. Must have the mentality to work with patience. Type of work: Contractual. Shift: From 1 pm to 10 pm. Note: Priority if residing in and around Motijheel area.\n\nদায়িত্ব সমূহঃ ১। বই ইনভেন্টরি করা। ২।সুপারস্টোরের প্রোডাক্ট বাছাই করা। ৩। সুপারস্টোরের প্রোডাক্ট প্যাকিং করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20770",
    "job_id": "20770",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Eskaton, Kamalapur, Paltan, Motijheel, Shegunbagicha",
    "salary": "TK. 18,500-35,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-29",
    "date_posted": "2026-02-28",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Collect medicine from the hub at a designated time every day Deliver collected medicine to the pharmacy in a timely manner Collect cash from customers Deposit collected cash into the company's designated bank account through CRM Participate in the campaign\n\nRequirements: Personal bike Hardworking Mindset for work Why should you work with us? Opportunity for salary reassessment for experienced individuals Assurance of regular and dependable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20772",
    "job_id": "20772",
    "company_name": "Rokomari.com",
    "job_title": "Digital Sales support agent",
    "location": "Motijheel",
    "salary": "TK. 10,000-12,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-29",
    "date_posted": "2026-02-28",
    "industry": "IT/Telecommunication",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "2/1/E, Eden Center, Dhaka 1000",
    "job_description": "Responsibilities: Responsibilities: Communicate with customers over the phone to sell products Convince customers through WhatsApp messages Receive and place customer orders correctly Create product lists and work understanding data criteria Acquire detailed knowledge about products and stay updated Distribute work among team members correctly Prepare regular reports Maintain and update data on Google Sheet / Microsoft Excel\n\nRequirements: Required Skills: · Bangla typing speed should be 22 per minute. · Basic knowledge of computer is required. · Good communication skills are required. Age: · 20 – 25 years old · Both male and female can apply. Job Type: Contractual\n\nদায়িত্ব সমুহঃ ফোনের মাধ্যমে কাস্টমারদের সাথে যোগাযোগ করে প্রোডাক্ট সেল করতে হবে WhatsApp-এ মেসেজ দিয়ে কাস্টমারকে কনভিন্স করতে হবে কাস্টমারের অর্ডার গ্রহণ ও সঠিকভাবে প্লেস করতে হবে প্রোডাক্ট লিস্ট তৈরি ও ডাটা ক্রাইটেরিয়া বুঝে কাজ করতে হবে প্রোডাক্ট সম্পর্কে বিস্তারিত জ্ঞান অর্জন ও আপডেট থাকতে হবে টিম মেম্বারদের মধ্যে কাজ সঠিকভাবে বণ্টন (ডিস্ট্রিবিউট) করতে হবে নিয়মিত রিপোর্ট প্রস্তুত করতে হবে Google Sheet / Microsoft Excel-এ ডাটা মেইনটেইন ও আপডেট করতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20767",
    "job_id": "20767",
    "company_name": "Auko-Tex Group",
    "job_title": "গানম্যান / সশস্ত্র নিরাপত্তাকর্মী (Gunman)",
    "location": "Baridhara",
    "salary": "TK. 40,000-45,000",
    "experience": "3-5 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-01",
    "date_posted": "2026-02-28",
    "industry": "Security/Support Service",
    "vacancy": 2,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibilities of the security personnel:\n- Providing top-level security to the senior executive during office hours, travel time, meetings, and public appearances to ensure personal safety and maintain utmost confidentiality and professionalism.\nResponsibilities include:\n- Providing close protection to the VIP at the office, residence, and during travel.\n- Carrying and using approved firearms as per the law.\n- Assessing potential threats, ensuring safe movement and secure routes.\n- Ensuring the security of the senior executive during meetings, events, and public appearances.\n- Constant surveillance of the surroundings and identifying potential security risks.\n- Taking prompt and effective action in case of any security threat or emergency situation.\n- Coordinating with drivers, security personnel, and law enforcement agencies when necessary.\n- Maintaining strict confidentiality of all information related to the VIP's movements and activities.\n- Ensuring proper care, security, and safekeeping of firearms and security equipment.\n- Submitting daily duty logs and incident reports as required.\n\nRequirements: Age: 39 to 55 years. Salary: Negotiable. Experience: Must have at least 05 years of practical experience as a singer or armed security personnel. Educational Qualification: SSC/HSC. Bangladesh Armed Forces/SSF/RAB retired members (Corporal/Sergeant/Warrant Officer or equivalent rank) •    Must have minimum 5-7 years of experience in Armed Security or Close Protection Duty. •    Height: 5 feet 6 inches to 5 feet 11 inches. •    Must have a valid and updated firearms license. •    Must be physically fit, mentally alert, and disciplined. •    Must have a strong knowledge of close protection and emergency response methods. •    Must be capable of making quick and correct decisions under pressure. •    Must have a mentality to maintain integrity, trustworthiness, and professional conduct.\n\nগানম্যানের প্রধান দায়িত্ব হলো ঊর্ধ্বতন কর্মকর্তাকে সর্বোচ্চ নিরাপত্তা প্রদান করা। অফিস সময়, ভ্রমণকাল, মিটিং এবং বিভিন্ন জনসম্মুখে উপস্থিতির সময় তার ব্যক্তিগত নিরাপত্তা নিশ্চিত করতে হবে এবং সর্বদা সর্বোচ্চ গোপনীয়তা ও পেশাদারিত্ব বজায় রাখতে হবে। দায়িত্বসমুহ: •    অফিস, বাসভবন এবং ভ্রমণকালে ভিআইপিকে ক্লোজ প্রোটেকশন প্রদান করা •    আইন অনুযায়ী অনুমোদিত আগ্নেয়াস্ত্র বহন ও ব্যবহার করা •    সম্ভাব্য হুমকি মূল্যায়ন করা এবং নিরাপদ চলাচল ও নিরাপদ রুট নিশ্চিত করা •    মিটিং, অনুষ্ঠান ও জনসম্মুখে উপস্থিতির সময় ঊর্ধ্বতন কর্মকর্তার নিরাপত্তা নিশ্চিত করা •    সার্বক্ষণিক আশপাশ পর্যবেক্ষণ করা এবং সম্ভাব্য নিরাপত্তা ঝুঁকি শনাক্ত করা •    যেকোনো নিরাপত্তা হুমকি বা জরুরি পরিস্থিতিতে দ্রুত ও কার্যকরভাবে ব্যবস্থা গ্রহণ করা •    প্রয়োজনে চালক, নিরাপত্তাকর্মী ও আইনশৃঙ্খলা রক্ষাকারী বাহিনীর সাথে সমন্বয় করা •    ভিআইপির চলাচল ও কার্যক্রম সম্পর্কিত সকল তথ্যের কঠোর গোপনীয়তা বজায় রাখা •    আগ্নেয়াস্ত্র ও নিরাপত্তা সরঞ্জামের যথাযথ যত্ন, নিরাপত্তা ও নিরাপদ সংরক্ষণ নিশ্চিত করা •    প্রয়োজন অনুযায়ী দৈনিক ডিউটি লগ ও ঘটনা প্রতিবেদন (Incident Report) দাখিল করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20768",
    "job_id": "20768",
    "company_name": "Shopping Zone BD Limited",
    "job_title": "Personal Secretary (PS) to Managing Director",
    "location": "Mohammadpur",
    "salary": "TK. 40,000-60,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-28",
    "date_posted": "2026-02-28",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: - Provide comprehensive secretarial and administrative support to the Managing Director, anticipating needs and prioritizing tasks to enable efficient decision-making.\n- Manage the MD’s diary, schedule meetings and appointments, and optimize time allocation across competing priorities.\n- Coordinate meeting logistics, prepare agendas and briefing materials, and ensure participants receive timely information.\n- Record clear, accurate meeting minutes and track action items to completion through timely follow-up.\n- Draft, edit, and format reports, presentations, and official correspondence with attention to clarity and professionalism.\n- Handle incoming communications—screen emails and calls, respond or redirect appropriately, and maintain prompt follow-up.\n- Arrange travel and accommodation, prepare itineraries and visa documentation, and manage related expense records.\n- Maintain confidential files and records securely, ensuring organized filing and controlled access.\n- Liaise proactively with internal teams and external stakeholders to coordinate activities, share information, and resolve issues.\n- Support ad hoc projects and special requests with a cooperative, solutions-focused approach to deliver timely results.\n\nRequirements: - Proven experience as a Personal Secretary/Executive Assistant preferred\n- Excellent communication skills in Bangla & English\n- Strong computer skills (MS Word, Excel, PowerPoint, Email)\n- Smart, well-organized, and able to maintain confidentiality\n- Ability to work under pressure and manage multiple tasks\n\nProvide comprehensive secretarial and administrative support to the Managing Director, anticipating needs and prioritizing tasks to enable efficient decision-making. Manage the MD’s diary, schedule meetings and appointments, and optimize time allocation across competing priorities. Coordinate meeting logistics, prepare agendas and briefing materials, and ensure participants receive timely information. Record clear, accurate meeting minutes and track action items to completion through timely follow-up. Draft, edit, and format reports, presentations, and official correspondence with attention to clarity and professionalism. Handle incoming communications—screen emails and calls, respond or redirect appropriately, and maintain prompt follow-up. Arrange travel and accommodation, prepare itineraries and visa documentation, and manage related expense records. Maintain confidential files and records securely, ensuring organized filing and controlled access. Liaise proactively with internal teams and external stakeholders to coordinate activities, share information, and resolve issues. Support ad hoc projects and special requests with a cooperative, solutions-focused approach to deliver timely results."
  }
]