[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20525",
    "job_id": "20525",
    "company_name": "RSM Door & Furniture",
    "job_title": "সহকারী লেকার-পলিশ মিস্ত্রী",
    "location": "Savar",
    "salary": "TK. 12,000-15,000",
    "experience": "3-5 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Technician",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kaliakoir, Birulia Road, Savar, Dhaka",
    "job_description": "Responsibilities: The renowned manufacturer RSM Door and Furniture company in Savar is looking to hire experienced assistant lacquer-polish masters. Interested candidates please apply quickly; Working on lacquering, polishing, and finishing of wooden furniture Using various types of chemicals, dyes, and spray machines Maintaining the quality of finishing Following safety regulations during work Salary and Benefits: Salary: 12,000 to 15,000 (based on experience) Performance bonus Annual bonus Salary increment based on performance Workplace: Birulia, Savar\n\nRequirements: At least 2 years of experience in accounting/polishing work is necessary Proficiency in using spray machines is required. Must be responsible and hardworking. To know more, contact mobile: 01404-071377 Email CV to: mahmudul@shomvob.com\n\nসাভারের স্বনামধন্য উৎপাদনকারী প্রতিষ্ঠান আরএসএম ডোর এন্ড ফার্নিচার কোম্পানিতে  কয়েকজন অভিজ্ঞ সহকারী লেকার-পলিশ মিস্ত্রী নিয়োগ দেয়া হবে। আগ্রহী পার্থীগন দ্রুত আবেদন করুন; কাঠের ফার্নিচারে লেকার, পলিশ ও ফিনিশিং কাজ করা বিভিন্ন ধরনের কেমিক্যাল, রঙ ও স্প্রে মেশিন ব্যবহার করা ফিনিশিংয়ের মান বজায় রাখা কাজের সময় নিরাপত্তা বিধি মেনে চলা বেতন ও সুবিধাঃ বেতনঃ ১২,০০০ থেকে ১৫,০০০ (অভিজ্ঞতার আলোকে নির্ধারিত হবে) পারফরমেন্স বোনাস বাৎসরিক বোনাস কর্মদক্ষতার ভিত্তিতে বেতন বৃদ্ধি কর্মস্থলঃ বিরুলিয়া, সাভার"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20522",
    "job_id": "20522",
    "company_name": "DEVRAM Nursing Home Care Service Ltd.",
    "job_title": "পেশেন্ট কেয়ার (Patient Care)",
    "location": "Anywhere in Dhaka Division",
    "salary": "TK. 17,000-22,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Healthcare/Medical/Hospital",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": "YB Tower (8th Floor), Shahjadpur, Gulshan-2, Dhaka-1212",
    "job_description": "Responsibilities: Providing daily care and support to the patient Ensuring the patient's medication, food, and personal care Following instructions of doctors/nurses Informing the responsible person about the patient's condition updates\n\nRequirements: Must be physically healthy and responsible Must have patience and a service-oriented mindset Age: 18-40 years (eligible for priority) Educational Qualification: Minimum SSC (priority, but not mandatory) Additional benefits if prior experience Training-related information:- Direct recruitment for skilled candidates Training facilities available for unskilled individuals Designated fee/charge applicable for training (Fee - 3900 Taka)\n\nরোগীর দৈনন্দিন যত্ন ও সাপোর্ট প্রদান রোগীর ওষুধ, খাবার ও ব্যক্তিগত পরিচর্যা নিশ্চিত করা ডাক্তার/নার্সের নির্দেশনা অনুযায়ী কাজ করা রোগীর অবস্থার আপডেট দায়িত্বপ্রাপ্ত ব্যক্তিকে জানানো"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20528",
    "job_id": "20528",
    "company_name": "ASA INTERNATIONAL",
    "job_title": "SOC Analyst – Level 1 (L1) – Monitoring & Triage",
    "location": "Shyamoli",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "IT/Telecommunication",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "ASA Tower Shyamoli",
    "job_description": "Responsibilities: Job profile\n\nThe SOC Analyst (L1) is responsible for continuous monitoring, first-level triage, and initial response actions based on approved SOC playbooks. The role focuses on accurate classification of alerts, rapid escalation of true security events, and maintaining high-quality case records to support investigations.\n\nResponsibilities\n\n- Monitor SIEM and security tooling queues; review alerts, events, and anomalies across endpoints, identity, email, and network sources.\n- Perform initial triage: validate alert context, enrich with basic data (user, host, IP, geolocation, asset criticality), and determine severity.\n- Create and maintain incident tickets with complete evidence, timeline, and actions taken; ensure accurate categorization and tagging.\n- Execute approved first-response playbooks (e.g., phishing triage, user verification steps, initial containment requests, password reset escalation).\n- Escalate suspected incidents to L2 within defined SLAs; ensure smooth handover with clear notes and supporting artifacts.\n- Support SOC reporting by maintaining disciplined ticket hygiene and shift handover notes.\n- Continuously improve alert quality by flagging false positives, missing telemetry, or recurring issues to the SOC Lead/SIEM Engineer.\n\nCore competencies\n\n- Meticulous attention to detail and strong documentation discipline.\n- Ability to work shifts and remain effective under pressure.\n- Curiosity and structured thinking—able to follow playbooks while spotting anomalies.\n- Strong communication and teamwork skills.\n\nJob Nature / Shift:\n\nThis role may be shift-based to support SOC coverage requirements (including weekends and public holidays as per shift rota). Shift patterns will be structured (e.g., 8-hour shifts) with rest days managed through the rota.\n\nReporting line\n\nThe SOC Analyst shall report to SOC Lead / Incident Response Lead (as applicable)\n\nCompensation & Benefits:\n\n- Competitive and attractive salary package will be offered to deserving candidates based on experience and skill set.\n- Festival Bonus\n- Provident Fund & Gratuity\n- Life & Health Insurance (IPD & OPD)\n- Annual Health Check-up\n- Baisakhi Allowance\n- Vehicle Loan Scheme / Vehicle Maintenance Allowance\n\nRequirements: Education and Experience:\n- Bachelor’s degree in Cyber Security/IT/Information Security or similar.\n- 1–3 years’ experience in SOC operations, IT security, NOC with security monitoring exposure, or related discipline.\n- Good written and spoken English; able to produce clear tickets and shift handovers.\n- Comfortable operating in a multi-country environment and supporting distributed teams.\n\nRequired knowledge and Technical Skills:\n- Basic understanding of cybersecurity concepts: malware, phishing, brute force, lateral movement, data exfiltration, and common attack patterns.\n- Foundational SIEM experience (alert review, dashboards, simple queries). Experience with Wazuh is preferred.\n- Basic understanding of Windows/Linux events, authen"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20526",
    "job_id": "20526",
    "company_name": "ARP SECURITY & LOGISTIC SERVICES LIMITED",
    "job_title": "Security Guard",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-19",
    "industry": "Security/Support Service",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": "GULBAR MUNSHI SHARANI ROAD,UTTARA AZAMPUR,DAKSHIN KHAN,WORD 6",
    "job_description": "Responsibilities: ★ Job Advertisement ★ Company Name: ★ ARP SECURITY & LOGISTIC SERVICES LIMITED Position : ★ Security Guard Number of Positions: ★ Multiple Job Type: ★ Full-Time Workplace: ★ Office, Factory, Showroom, Residential & Commercial Areas (as required) Job Responsibilities: ★ Ensure security at designated locations ★ Monitor entry and exit points ★ Supervise and report suspicious activities ★ Maintain discipline and punctuality during duty ★ Take prompt action in emergency situations ★ Follow instructions from authorities Qualifications and Experience: ★ Minimum 8th grade pass ★ Priority given to experience as a security guard ★ Physically fit and responsible ★ Discipline, punctuality, and adaptability ★ Age limit: Negotiable Salary and Benefits: ★ Competitive salary ★ Overtime benefits (where applicable) ★ Uniform provided ★ Timely salary payments ★ Safe and stable work environment\n\n★ নিয়োগ বিজ্ঞপ্তি ★ প্রতিষ্ঠানের নাম: ★ ARP SECURITY & LOGISTIC SERVICES LIMITED পদের নাম : ★ Security Guard পদসংখ্যা: ★ একাধিক চাকরির ধরন: ★ ফুল-টাইম কর্মস্থল: ★ অফিস, ফ্যাক্টরি, শোরুম, আবাসিক ও বাণিজ্যিক এলাকা (প্রয়োজন অনুযায়ী) কাজের দায়িত্বসমূহ: ★ নির্ধারিত স্থানে নিরাপত্তা নিশ্চিত করা ★ প্রবেশ ও প্রস্থানের উপর নজরদারি রাখা ★ সন্দেহজনক কার্যকলাপ পর্যবেক্ষণ ও রিপোর্ট করা ★ ডিউটির সময় শৃঙ্খলা ও সততা বজায় রাখা ★ জরুরি পরিস্থিতিতে দ্রুত ব্যবস্থা গ্রহণ করা ★ কর্তৃপক্ষের নির্দেশনা অনুযায়ী দায়িত্ব পালন করা যোগ্যতা ও অভিজ্ঞতা: ★ ন্যূনতম অষ্টম শ্রেণি পাস ★ সিকিউরিটি গার্ড হিসেবে অভিজ্ঞতা থাকলে অগ্রাধিকার ★ শারীরিকভাবে সক্ষম ও দায়িত্বশীল ★ সততা, শৃঙ্খলা ও সময়ানুবর্তিতা ★ বয়স সীমা: আলোচনা সাপেক্ষে বেতন ও সুযোগ-সুবিধা: ★ আকর্ষণীয় বেতন ★ ওভারটাইম সুবিধা (প্রযোজ্য ক্ষেত্রে) ★ ইউনিফর্ম প্রদান ★ সময়মতো বেতন পরিশোধ ★ নিরাপদ ও স্থিতিশীল কর্মপরিবেশ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20531",
    "job_id": "20531",
    "company_name": " IFixFast",
    "job_title": "Call Centre Executive",
    "location": "Hatirpool",
    "salary": "TK. 10,000-12,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Call Center",
    "vacancy": 150,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Rupayan Trade Center 17 Floor, 114 Kazi Nazrul Islam Avenue Banglamotor, Dhaka 1000, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Call a specific number of customers every day Regularly update information tracking sheet during conversations with customers Provide correct and appropriate answers to customer queries Build and maintain a positive relationship with customers Achieve monthly sales targets Actively participate in teamwork Maintain punctuality and discipline\n\nRequirements: Educational Qualification: HSC / Bachelor's degree completed Or ongoing Bachelor's degree Additional Requirements: Minimum 15 words per minute Bangla typing speed (mandatory) Prior experience in call center or customer service preferred Proficiency in CRM system usage Skill in customer handling Skill in tasks related to social media Skill in Google Sheets and data management Language Skills: Clear and accurate communication skills in Bengali Ability to speak professionally, politely, and clearly Compensation & Benefits: Basic Salary: 10,000 - 12,000 BDT Sales Incentive: Unlimited (Our call center agents currently receive sales incentives ranging from 20,000 to 30,000 BDT) Festival Bonus: Twice a year (minimum 1 year of service required) Performance Bonus Salary Review: Yearly Working Hours: Morning 10:00 AM - Evening 7:00 PM 6 days a week\n\nপ্রতিদিন নির্দিষ্ট সংখ্যক কাস্টমারকে কল করা কাস্টমারের সাথে কথোপকথনের তথ্য ট্র্যাকিং শিটে নিয়মিত আপডেট করা কাস্টমারের প্রশ্নের সঠিক ও যথাযথ উত্তর প্রদান করা কাস্টমারের সাথে ইতিবাচক সম্পর্ক তৈরি ও বজায় রাখা মাসিক সেলস টার্গেট অর্জন করা টিমওয়ার্কে সক্রিয়ভাবে অংশগ্রহণ করা সময়ানুবর্তিতা ও শৃঙ্খলা বজায় রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20533",
    "job_id": "20533",
    "company_name": "Patwary Stationery",
    "job_title": "শপ-কিপার",
    "location": "Uttara",
    "salary": "TK. 8,000-10,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Supply Chain/Procurement",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: The shop must be opened and cleaned Help in selling at the shop Keep the shop's books, pens, and other items organized Start from 12 pm to 10 pm every day Lunch bill must be paid\n\nদোকান খুলে পরিষ্কার করতে হবে দোকানের বিক্রয়ে সাহায্য করতে হবে দোকানের বই-খাতা, কলম ও অন্যান্য সামগ্রী সাজিয়ে রাখতে হবে প্রতিদিন ১২ টা থেকে ডিউটি শুরু হয়ে রাত ১০টা পর্যন্ত লাঞ্চ বিল প্রদান করা হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20523",
    "job_id": "20523",
    "company_name": "Shomvob Global",
    "job_title": "Driver ( হেভী ভেহিকেল- ট্রাক/ট্রেইলার) -SANS International Co. -Saudi Arabia",
    "location": "Saudi Arabia",
    "salary": "TK. 54,000-70,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-19",
    "industry": "Transportation",
    "vacancy": 25,
    "shift": "Day Shift",
    "country": "Saudi Arabia",
    "company_address": null,
    "job_description": "Responsibilities: Saudi Arabia's SANS International Company is currently hiring for the position of Driver (Heavy Vehicle - Truck/Trailer) ! Benefits: - Salary: 1500-2000 Riyal + Overtime\n- Accommodation: Provided by the company; Food: Own\n- Working hours: 8 hours per day, 6 days a week; (1 day off)\n- Other benefits: Iqama and transportation will be provided by the company\n- Overtime: As per Saudi labor law Job Responsibilities: - Safely drive the truck/trailer\n- Supervise loading/unloading\n- Follow designated routes\n- Vehicle check-up and reporting\n- Adhere to traffic rules Qualifications: (Please read carefully before applying)\n========================================\n- Age: 21-40 years. Candidates outside this age range will not be called for an interview.\n- Educational qualification: SSC or equivalent.\n- Must have a valid driving license.\n- Proficiency in speaking and writing in English is necessary.\n- Relevant work experience of 2-3 years is required.\n\n📆 Pre-selection Interview: March 2026 (Dhaka)\n📆 Delegate Interview: March 2026 (Dhaka) Additional Information: Visa validity: 2 (two) years - renewable. Passport: All candidates must bring both new and old passports to the interview. The passport must have a minimum validity of 1.5 years. Those without a passport should not apply. Payment terms: Payment will be made after obtaining the visa.\n\nসৌদি আরবে স্যান্স ইন্টারন্যাশনাল কোম্পানি (SANS International Company) কোম্পানিতে Driver ( হেভী ভেহিকেল- ট্রাক/ট্রেইলার) পদে নিয়োগ চলছে! সুবিধাসমূহ: বেতন: ১৫০০- ২০০০ রিয়াল+ ওভারটাইম থাকার ব্যবস্থা: কোম্পানি দেবে; খাবার: নিজ কর্মঘণ্টা: দিনে ৮ ঘণ্টা , সপ্তাহে ৬ দিন; (১ দিন ছুটি) অন্যান্য সুবিধা: ইকামা ও পরিবহন কোম্পানি বহন করবে ওভারটাইম:  সৌদি শ্রম আইন অনুযায়ী কাজের দায়িত্ব: ট্রাক/ট্রেইলার নিরাপদে চালানো লোডিং/আনলোডিং পর্যবেক্ষণ রুট ফলো করা ভেহিকল চেকআপ ও রিপোর্টিং ট্রাফিক রুলস মেনে চলা 📌 যোগ্যতা: (দয়া করে ভালো করে পড়ে এরপর জবে এপ্লাই করুন) ======================================== বয়সঃ ২১ - ৪০বছর। এর বাহিরের বয়সের প্রার্থীদেরকে ইন্টারভিউতে ডাকা হবে না। শিক্ষাগত যোগ্যতাঃ SSC/সমমান। অবশ্যই বৈধ ড্রাইভিং লাইসেন্স থাকতে হবে। ইংরেজিতে পরিষ্কার ও সাবলীলভাবে কথা বলা ও লেখার দক্ষতা আবশ্যক। সংশ্লিষ্ট কাজে ২-৩ বছর বাস্তব অভিজ্ঞতা আবশ্যক। 📆 প্রি-সিলেকশন ইন্টারভিউ : মার্চ, ২০২৬ (ঢাকা) 📆 ডেলিগেট ইন্টারভিউ: মার্চ, ২০২৬ (ঢাকা) আরও প্রয়োজনীয় তথ্য সমূহঃ ভিসা চুক্তির মেয়াদঃ ২ (দুই) বছর – নবায়নযোগ্য। পাসপোর্ট : নতুন-পুরাতন সকল পাসপোর্ট ইন্টারভিউতে সাথে নিয়ে আসতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১.৫ বছর থাকতে হবে। যাদের পাসপোর্ট নেই, তারা দয়া করে এপ্লাই করবেন না। পেমেন্ট শর্তঃ ভিসা হওয়ার পর পেমেন্ট।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20532",
    "job_id": "20532",
    "company_name": "Masud And Brothers",
    "job_title": "Relationship Officer",
    "location": "Dhaka",
    "salary": "TK. 25,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Call Center",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Job Responsibilities:\n\n1. Installation of devices\n2. Servicing at consumer households\n3. Responding promptly to customer inquiries\n4. Acknowledging and resolving customer complaints\n5. Knowing our products inside and out so that you can answer questions\n6. Keeping records of customer interactions, transactions, comments, and complaints\n7. Communicating and coordinating with colleagues as necessary\n8. Providing feedback on the efficiency of the customer service process\n9. Ensure customer satisfaction and provide professional customer support.\n\nRequirements: Additional Requirements: 1. Age 18 to 32 years\n2. Bangla speaking must be neat and tidy Earnings: Approximately 25,000 BDT\n(T&Cs Apply) Compensation & Other Benefits: 1. Festival Bonus: 2\n2. Lucrative rewards on achieving periodic\ntargets\n3. Salary Review: Yearly Qualifications Required: 1. Diploma in engineering preferably in Mechanical, Electrical/any other discipline. We welcome undergraduates (HSC completed) who are ambitious to learn business and improve their communication skills, leadership attributes and interpersonal networking.\n2. Willing to work under pressure, chase ambition and work in team.\n3. Must have good communication skill in Bangla (Reading, Writing & Speaking) and understanding of English (Reading & Writing).\n4. Ability to ride on motorbike and bicycles.\n5. Ability to operate and use smartphone & apps.\n\nJob Responsibilities: 1. Installation of devices 2. Servicing at consumer households 3. Responding promptly to customer inquiries 4. Acknowledging and resolving customer complaints 5. Knowing our products inside and out so that you can answer questions 6. Keeping records of customer interactions, transactions, comments, and complaints 7. Communicating and coordinating with colleagues as necessary 8. Providing feedback on the efficiency of the customer service process 9. Ensure customer satisfaction and provide professional customer support."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20517",
    "job_id": "20517",
    "company_name": "ZamZam Travels BD",
    "job_title": "Digital Marketing Officer ",
    "location": "Paltan",
    "salary": "TK. 15,000-16,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Sales/Marketing",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ZamZam Travels BD – a trusted and experienced provider of Hajj and Umrah services. We are in need of a skilled, creative, and responsible **Digital Marketing Officer** to join our team.\n\n🎯 **Responsibilities:**\n\n📸 **Content and Media:**\n- Must be interested in videography and photography\n- Minimum experience required in video editing\n- Proficiency in software like Adobe Premiere Pro / CapCut / Filmora / DaVinci Resolve\n- Designing images, reels, short videos, and banners using Canva\n- Creating and editing Hajj/Umrah training, seminar, and client testimonial videos\n\n✍️ **Content and SEO:**\n- Ability to write SEO-friendly content using ChatGPT\n- Regularly writing blogs, package descriptions, and articles for the website\n- Understanding of keyword research tools like Google Keyword Planner / Ubersuggest / Ahrefs\n- Generating content ideas and calendar planning\n- Creating campaign content related to Arabic months, Hajj season, Ramadan, Shawwal, etc.\n\n📱 **Social Media Management:**\n- Regularly posting content on Facebook, Instagram, YouTube, TikTok, LinkedIn\n- Developing reel, shorts, and story strategies\n- Managing paid ads (Facebook Boost / Meta Ads Manager)\n- Handling comments and inbox messages\n- Lead generation and conversion follow-up\n\n📧 **Email and Database Marketing:**\n- Understanding of Email Marketing tools (Mailchimp/Sendinblue)\n- Creating and segmenting client databases\n- Managing pre-registration campaigns for Hajj/Umrah\n- Coordinating WhatsApp Marketing / SMS Marketing\n\n🌐 **Website and Technical Skills:**\n- Ability to update website content\n- Advantageous to have basic HTML knowledge\n- Understanding of Google Analytics and Search Console\n- Landing page optimization\n\n📊 **Reporting and Analysis:**\n- Creating monthly reports (Reach, Engagement, Leads, Conversion)\n- Setting KPIs and analyzing results\n- Competitor research\n\n🔥 **Additional Qualifications (Advantageous):**\n- Interest in Hajj/Umrah-related content\n- Respectful attitude towards Islamic content\n- Experience in conducting live sessions or webinars\n- Google Ads certification would be advantageous\n- Graphic design skills (Photoshop / Illustrator)\n\n🖥 **Essential Requirements:**\n- Must have a personal laptop or desktop\n- Age: 22 – 30 years\n- Commitment to work for at least 1 year\n- Ability to work in a team-oriented environment\n\n💰 **Salary and Benefits:**\n- Probation period: 3 months\n- Probation salary: 15,000 BDT\n- Salary increment based on performance after 3 months (negotiable)\n- Performance incentive opportunities (based on lead conversion)\n\n📍 **Workplace:**\nZamZam Travels BD Office, Dhaka\n\nZamZam Travels BD – একটি বিশ্বস্ত ও অভিজ্ঞ হজ্জ ও উমরাহ সেবা প্রদানকারী প্রতিষ্ঠান। আমাদের টিমে যুক্ত করার জন্য একজন দক্ষ, সৃজনশীল ও দায়িত্বশীল ডিজিটাল মার্কেটিং অফিসার প্রয়োজন। 🎯 দায়িত্বসমূহ: 📸 কন্টেন্ট ও মিডিয়া: ভিডিওগ্রাফি ও ফটোগ্রাফিতে আগ্রহী হতে হবে ভিডিও এডিটিং-এ ন্যূনতম অভিজ্ঞতা থাকতে হবে Adobe Premiere Pro / CapCut / Filmora / DaVinci Resolve ইত্যাদি সফটওয়্যার পরিচালনায়"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20521",
    "job_id": "20521",
    "company_name": "RSM Door & Furniture",
    "job_title": "লেকার-পলিশ মিস্ত্রী",
    "location": "Savar",
    "salary": "TK. 20,000-25,000",
    "experience": "5-10 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Technician",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: The renowned manufacturer RSM Door and Furniture company in Savar is looking to hire experienced lacquer and polish masters. Interested candidates please apply quickly; Working on lacquering, polishing, and finishing of wooden furniture Using various chemicals, dyes, and spray machines Maintaining the quality of finishing Following safety regulations during work Salary and Benefits: Salary: 20,000 to 25,000 (based on experience) Performance bonus Yearly bonus Salary increment based on performance Workplace: Birulia, Savar\n\nRequirements: At least 5 years of experience in the field of accounting/polishing work is necessary Proficiency in using spray machines is required. Must be responsible and hardworking. To know more, contact mobile: 01404-071377\n\nসাভারের স্বনামধন্য উৎপাদনকারী প্রতিষ্ঠান আরএসএম ডোর এন্ড ফার্নিচার কোম্পানিতে  কয়েকজন অভিজ্ঞ লেকার-পলিশ মিস্ত্রী নিয়োগ দেয়া হবে। আগ্রহী পার্থীগন দ্রুত আবেদন করুন; কাঠের ফার্নিচারে লেকার, পলিশ ও ফিনিশিং কাজ করা বিভিন্ন ধরনের কেমিক্যাল, রঙ ও স্প্রে মেশিন ব্যবহার করা ফিনিশিংয়ের মান বজায় রাখা কাজের সময় নিরাপত্তা বিধি মেনে চলা বেতন ও সুবিধাঃ বেতনঃ ২০,০০০ থেকে ২৫,০০০ (অভিজ্ঞতার আলোকে নির্ধারিত হবে) পারফরমেন্স বোনাস বাৎসরিক বোনাস কর্মদক্ষতার ভিত্তিতে বেতন বৃদ্ধি কর্মস্থলঃ বিরুলিয়া, সাভার"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20524",
    "job_id": "20524",
    "company_name": "RSM Door & Furniture",
    "job_title": "দরজা প্রোডাকশন মিস্ত্রী",
    "location": "Savar",
    "salary": "TK. 20,000-25,000",
    "experience": "10+ years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Technician",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kaliakoir, Birulia Road, Savar, Dhaka",
    "job_description": "Responsibilities: The renowned manufacturer in Savar, RSM Door and Furniture , is looking to hire experienced door production masters. Interested candidates please contact quickly; Making and fitting of deep panel/solid panel Preparing doors with wood/board/MDF Completing cutting, fitting, assembling, and finishing work Operating machines (cutter, planer, drill, etc.) skillfully Ensuring flawless work according to design and measurements Coordinating with the production team to complete tasks Maintaining quality and safety of work Salary and Benefits: Salary: ২০,০০০ to ২৫,০০০ Taka (based on experience) Performance bonus Yearly bonus Opportunity for promotion based on skills\n\nRequirements: A minimum of 10 years of experience in door production/fitting work is required Contact for more information: 01404071377 Or send your CV via email: mahmudul@shomvob.com\n\nসাভারের স্বনামধন্য উৎপাদনকারী প্রতিষ্ঠান আরএসএম ডোর এন্ড ফার্নিচার এ কয়েকজন  অভিজ্ঞ দরজা প্রোডাকশন মিস্ত্রী নিয়োগ দেয়া হবে। আগ্রহী পার্থীগন দ্রুত যোগাযোগ করুন; ডিপ পাল্লা / সলিড পাল্লা তৈরি ও ফিটিং করা কাঠ/বোর্ড/এমডিএফ দিয়ে দরজা প্রস্তুত করা কাটিং, ফিটিং, অ্যাসেম্বলিং ও ফিনিশিং কাজ সম্পন্ন করা মেশিন (কাটার, প্ল্যানার, ড্রিল ইত্যাদি) দক্ষতার সাথে পরিচালনা করা ডিজাইন ও মাপ অনুযায়ী নির্ভুল কাজ নিশ্চিত করা প্রোডাকশন টিমের সাথে সমন্বয় করে কাজ সম্পন্ন করা কাজের মান ও নিরাপত্তা বজায় রাখা বেতন ও অন্যান্য সুযোগঃ বেতনঃ ২০,০০০ থেকে ২৫,০০০ টাকা (অভিজ্ঞতার উপর নির্ধারিত হবে) পারফরমেন্স বোনাস বাৎসরিক বোনাস দক্ষতার ভিত্তিতে পদোন্নতির সুযোগ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20516",
    "job_id": "20516",
    "company_name": "Vertex Telecom Solutions (Authorized Distributior of  RYZE)",
    "job_title": "Campaign Connector ",
    "location": "Keraniganj, Khilgaon, Old Dhaka, Mirpur",
    "salary": "TK. 10,000-30,000",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Sales/Marketing",
    "vacancy": 39,
    "shift": "Day Shift",
    "country": null,
    "company_address": "৪১ নীলাম্বার শাহা রোড, হাজারীবাগ ঢাকা ১২০৫।  ( নগর মাতৃসদন এর অপর পাশে)",
    "job_description": "Responsibilities: We are hiring some Campaign Connectors (CC) for our team. 🔹 Job Description: Selling SIM cards in densely populated areas with a chair-table setup Engaging with customers and introducing products 🕙 Office Hours: From 10:00 AM to 6:00 PM\n\nRequirements: 🎯 Qualifications: Age: Minimum 18 years, Maximum 35 years Educational Qualification: Minimum SSC Pass Prior experience in Campaign/Field Marketing will be given priority 💼 Job Type: Full Time 📍 Location: Mirpur, Khilgaon, Hazaribagh, Keraniganj. (Field-based work) Salary Structure: Basic: 10,000 BDT Variable: Up to 20,000 BDT Sales Quality: 8,000 BDT Phone Bill: 1,000 BDT\n\nআমরা আমাদের টিমে কিছু সংখ্যক CC (Campaign Connector ) নিয়োগ দিচ্ছি। 🔹 কাজের বিবরণ: চেয়ার–টেবিল নিয়ে জনবহুল এলাকায় বসে SIM sales করা কাস্টমারের সাথে কথা বলে প্রোডাক্ট পরিচিতি দেওয়া 🕙 অফিস টাইম: সকাল ১০:০০টা থেকে সন্ধ্যা ৬:০০টা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20530",
    "job_id": "20530",
    "company_name": "Dominos Pizza Bangladesh",
    "job_title": "Delivery Rider with Driving License",
    "location": "Uttara, Comilla, Gulshan-Banani, Chittagong, Mirpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Part Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Deliveryman",
    "vacancy": 100,
    "shift": "Other",
    "country": null,
    "company_address": "Dhaka, Bangladesh",
    "job_description": "Responsibilities: Deliver food within a time frame to the guest without rash driving Responsible for Pre-Rush preparation (PRP) Getting cross-trained for self-advancement Maintain all quality & Safety standards while operating Expected to follow the company's code of conduct and live Domino's culture of Hustle.\n\nRequirements: Age 18 to 30 years\nMust have a valid driving license\nMust have smartphone\nWilling to work in flexible hours\n\nDeliver food within a time frame to the guest without rash driving Responsible for Pre-Rush preparation (PRP) Getting cross-trained for self-advancement Maintain all quality & Safety standards while operating Expected to follow the company's code of conduct and live Domino's culture of Hustle."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20519",
    "job_id": "20519",
    "company_name": "Rokomari.com",
    "job_title": "Team Member",
    "location": "Motijheel",
    "salary": "TK. 10,000-12,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "Supply Chain/Procurement",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "2/1/E, Eden Center, Dhaka 1000",
    "job_description": "Responsibilities: Responsibilities: 1. Check the QC of new products. 2. Inform if any problems are found in the product. 3. Update data on the specified panel.\n\nRequirements: Job Description Number of Positions: 2 Job Type: Full-time (Contractual) Location: Dhaka, Motijheel Working Hours: 2:00 PM - 11:00 PM Job Responsibilities Conduct quality checks on supermarket products Verify and ensure product quality Provide necessary reports to the operations team Salary and Benefits Salary: 10,000 - 12,000 BDT Educational Qualifications Minimum SSC/HSC pass Experience No experience required (Freshers can apply) Candidate Qualifications Only male candidates Age: 18 - 25 years Must have basic computer knowledge\n\nদায়িত্ব সমুহঃ ১। নতুন প্রোডাক্ট এর QC চেক করতে হবে । ২। প্রোডাক্টের মধ্যে কোন প্রব্লেম পেলে জানাতে হবে। ৩। নির্দিষ্ট প্যানেলে ডাটা আপডেট করতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20529",
    "job_id": "20529",
    "company_name": "ASA INTERNATIONAL",
    "job_title": "Sr. SOC Analyst – Investigation & Incident Handling",
    "location": "Shyamoli",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-19",
    "date_posted": "2026-02-19",
    "industry": "IT/Telecommunication",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "ASA Tower Shyamoli",
    "job_description": "Responsibilities: Job profile\nThe Sr. SOC Analyst conducts in-depth investigations of escalated alerts and suspected incidents, confirms scope and impact, coordinates containment actions with IT and business stakeholders, and drives incidents to closure with appropriate evidence and reporting.\n\nResponsibilities\n- Investigate escalated alerts using SIEM/EDR/email/identity/network telemetry to confirm incident validity, scope, and root cause hypotheses.\n- Perform correlation across multiple data sources and build incident timelines; identify affected users, systems, and data at risk.\n- Coordinate containment and remediation with local IT teams (endpoint isolation, account disable/reset, blocking IOCs, firewall/VPN actions) per approved procedures.\n- Lead incident communications for assigned cases: maintain stakeholder updates, ensure actions are tracked, and escalate to Lead Information Security when thresholds are met.\n- Collect and preserve evidence in line with internal standards (logs, screenshots, hashes, email headers, EDR artifacts) to support audit/regulatory reporting.\n- Support development and refinement of playbooks/runbooks and detection logic by providing feedback to SIEM Engineer and Lead Information Security.\n- Conduct post-incident reviews for assigned incidents and propose preventive controls and monitoring improvements.\n\nCore competencies\n- Strong analytical and investigative mindset; able to distinguish signal from noise.\n- Structured incident handling and stakeholder coordination.\n- High-quality documentation and reporting, including executive-ready summaries when required.\n- Mentorship: supports L1 analysts through guidance and coaching.\n\nReporting line\nThe Sr. SOC Analyst shall report to Lead Information Security (as applicable)\n\nCompensation & Benefits:\n- Competitive and attractive salary package will be offered to deserving candidates based on experience and skill set.\n- Festival Bonus\n- Provident Fund & Gratuity\n- Life & Health Insurance (IPD & OPD)\n- Annual Health Check-up\n- Baisakhi Allowance\n- Vehicle Loan Scheme / Vehicle Maintenance Allowance\n\nRequirements: Education and Experience:\n- Bachelor’s degree in CSE/IT/Information Security or similar.\n- 3–6 years’ experience in SOC/incident response/security operations; financial services experience preferred.\n- Experience with SIEM and Microsoft/Azure security solutions is preferred.\n\nCertifications (preferred):\n- Incident handling/SOC: GCIH, GCIA, CEH, Security+, or equivalent.\n- Vendor certifications (Microsoft security, Wazuh) are an advantage.\n\nRequired knowledge and Technical Skills:\n- Hands-on investigation skills across SIEM, EDR, email security, and identity logs.\n- Good understanding of Windows security events, common attacker techniques, and incident scoping methods.\n- Ability to run basic threat hunting queries and pivot between telemetry sources.\n- Understanding of financial services threat scenarios (phishing/BEC, credential theft, privileged access abuse, ranso"
  }
]