[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20154",
    "job_id": "20154",
    "company_name": "Z&R Perfect IT Solution Authorised Agent Pubali Bank PLC.",
    "job_title": "কিউ আর এক্সিকিউটিভ ( QR Executive)",
    "location": "Anywhere in Rangpur Division, Anywhere in Rajshahi Division",
    "salary": "TK. 16,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-01",
    "date_posted": "2026-01-29",
    "industry": "General Management/Admin",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House-02 Road-06 Senpara Parbata.Mirpur-10,Kafrul, Dhaka- 1216",
    "job_description": "Responsibilities: Summary: Pubali Bank PLC is hiring skilled and proactive Queue and Executive for the expansion of Pi Banking services. Selected candidates will be involved in the bank's Merchant Registration and QR Service activation program. Location: Candidates will work in their respective areas (opportunity to work locally). Responsibilities: 1. Assist customers in opening Savings and Current accounts. 2. Verify KYC (Know Your Customer) documents such as Trade License, National ID, photos, and application form as per Bangladesh Bank's guidelines. 3. Provide other account-related services (ATM card, checkbook, mobile banking). 4. Enter complete information into the system including address, bank account, and transaction profiles by filling out forms and uploading data. 5. Capture and upload photos of merchants. 6. Ensure necessary contract signatures with merchants. 7. Deposit documents at the relevant branch and complete the process of issuing QR codes after verification.\n\nRequirements: Please note that no financial transaction is required for the position of QR Executive Officer. Qualifications and Skills: ★ Must have knowledge of using smartphones and the internet. ★ Must have a mindset for marketing work. ★ Must be skilled and confident in speaking. ★ Must have an understanding of local shops and business establishments. Target and Salary: Minimum of 60 merchant accounts If the target is achieved, the monthly salary is ৳16,000 Special Benefits: Commission based on target achievement Possibility of permanent employment based on good performance.\n\nসংক্ষিপ্ত বিবরণ: পূবালী ব্যাংক পিএলসি আধুনিক পাই ব্যাংকিং ( Pi Banking) সেবা সম্প্রসারণের লক্ষ্যে দক্ষ ও উদ্যমী কিউ আর এক্সিকিউটিভ নিয়োগ দিচ্ছে। নির্বাচিত প্রার্থীরা ব্যাংকের মার্চেন্ট রেজিস্ট্রেশন ও QR সার্ভিস সক্রিয়করণ কার্যক্রমে নিয়োজিত থাকবেন। কর্মস্থল: প্রার্থীর নিজ নিজ এলাকা (স্থানীয়ভাবে কাজ করার সুযোগ থাকবে)। দায়িত্ব সমূহ: ১। গ্রাহকদের সেভিংস ও কারেন্ট অ্যাকাউন্ট খোলার ক্ষেত্রে সহায়তা করা। ২। বাংলাদেশ ব্যাংকের নির্দেশনা অনুযায়ী KYC (Know Your Customer) নথি যাচাই ও প্রয়োজনীয় ডকুমেন্ট যেমন ট্রেড লাইসেন্স, জাতীয় পরিচয়পত্র, ছবি ও আবেদন ফর্ম সংগ্রহ করা। ৩। অ্যাকাউন্ট সম্পর্কিত অন্যান্য সেবা (এটিএম কার্ড, চেকবুক, মোবাইল ব্যাংকিং) প্রদান করা। ৪। ফর্ম পূরণ ও তথ্য আপলোড যেমন ঠিকানা, ব্যাংক অ্যাকাউন্ট ও লেনদেন প্রোফাইলসহ সম্পূর্ণ তথ্য সিস্টেমে এন্ট্রি করা। ৫। মার্চেন্টের ছবি তোলা ও সিস্টেমে আপলোড করা। ৬। মার্চেন্টের সঙ্গে প্রয়োজনীয় চুক্তিপত্রে স্বাক্ষর নিশ্চিত করা। ৭। সংশ্লিষ্ট শাখায় নথি জমা দেওয়া এবং যাচাই শেষে QR কোড ইস্যুর প্রক্রিয়া সম্পন্ন করা।"
  }
]