[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19698",
    "job_id": "19698",
    "company_name": "YOYOSO Bangladesh",
    "job_title": "সেলস অ্যাসোসিয়েট (গ্লোবাল রিটেইল শপ)",
    "location": "Gazipur",
    "salary": "TK. 10,000-12,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Our global retail team is looking for a friendly, proactive, and responsible **Sales Associate** to work with customers, be knowledgeable about visual merchandising, and capable of taking full responsibility for their designated area. \n\nResponsibilities\n\n- Greet and assist customers in a friendly and professional manner\n- Provide excellent customer service and accurate product information\n- Promote linked items and related series to increase sales\n- Rearrange and refill displays promptly after sales\n- Maintain clean, organized, and attractive product displays\n- Assist with product requisition and stock management\n- Conduct inventory checks every two weeks and submit reports to the shop manager\n- Stay informed about product information and stock updates\n- Be vigilant against theft and ensure store security\n- Adhere to company dress code and professional code of conduct\n- Work 9 hours per day (based on shifts/roster)\n\nShift Timings:\n- 1st Shift: 10:00 AM - 7:00 PM\n- 2nd Shift: 1:00 PM - 10:00 PM\n\nLocation: Ansar Road, Sreepur, Gazipur\n\nRequirements: Good communication skills Customer-focused mentality and proactive behavior Attentive and basic merchandising concepts Ability to work independently and with a team Preference for retail or sales experience (but not necessary) Complimentary lunch provided Sales incentive Two festival bonuses per year Supportive and friendly work environment Opportunity for learning and career growth in retail sales\n\nআমাদের গ্লোবাল রিটেইল টিমে কাজ করার জন্য আমরা একজন বন্ধুসুলভ, উদ্যমী ও দায়িত্বশীল সেলস অ্যাসোসিয়েট খুঁজছি। যিনি কাস্টমারের সাথে কাজ করতে আগ্রহী, ভিজুয়াল মার্চেন্ডাইজিং সম্পর্কে সচেতন এবং নিজের দায়িত্বপ্রাপ্ত এরিয়ার সম্পূর্ণ দায়িত্ব নিতে সক্ষম। দায়িত্বসমূহ কাস্টমারদের আন্তরিক ও পেশাদারভাবে স্বাগত জানানো এবং সহায়তা করা উন্নত কাস্টমার সার্ভিস প্রদান ও সঠিক পণ্যের তথ্য জানানো লিংকড আইটেম ও সংশ্লিষ্ট সিরিজ প্রোমোট করে বিক্রয় বৃদ্ধি করা বিক্রয়ের পরপরই ডিসপ্লে পুনরায় সাজানো ও রিফিল করা পণ্যের ডিসপ্লে পরিষ্কার, গোছানো ও আকর্ষণীয় রাখা প্রোডাক্ট রিকুইজিশন ও স্টক ম্যানেজমেন্টে সহায়তা করা প্রতি দুই সপ্তাহে একবার ইনভেন্টরি চেক করে শপ ম্যানেজারের কাছে রিপোর্ট জমা দেওয়া পণ্যের তথ্য ও স্টক আপডেট সম্পর্কে সচেতন থাকা চুরি প্রতিরোধে সতর্ক থাকা এবং স্টোরের নিরাপত্তা নিশ্চিত করা কোম্পানির ড্রেস কোড ও পেশাদার আচরণবিধি অনুসরণ করা প্রতিদিন ৯ ঘণ্টা (শিফট ভিত্তিক / রোস্টার অনুযায়ী) ১ম শিফট: সকাল ১০:০০ – সন্ধ্যা ৭:০০ ২য় শিফট: দুপুর ১:০০ – রাত ১০:০০ আনসার রোড, শ্রীপুর, গাজীপুর"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19768",
    "job_id": "19768",
    "company_name": "Glory Point",
    "job_title": "Assistant General Manager ",
    "location": "Mirpur",
    "salary": "TK. 50,000-70,000",
    "experience": "1-3 years",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Law/ Legal",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Shahbag, Dhaka",
    "job_description": "Responsibilities: Job Nature:\nFull-time / Contractual\nJob Location:\nDhaka (As per company requirement)\nSalary Range:\nBDT 50,000 – 70,000 (Negotiable)\nJob Responsibilities:\nOverall supervision of business operations\nStrategic planning and management support\nGuiding senior and mid-level executives\nMonitoring performance and ensuring discipline\nAssisting management in decision-making and policy matters\nEducational Requirements:\nMinimum Bachelor’s degree (Master’s preferred)\nExperience Requirements:\n8-12 years of relevant experience\nRetired or near-retirement senior-level professionals preferred\nAdditional Requirements:\nStrong leadership and communication skills\nProfessional, honest, and responsible attitude\nAbility to work independently\nAge preferably 45 years and above\nCompensation & Benefits:\nCompetitive salary\nRespectful and professional work environment\nOther benefits as per company policy\n\nRequirements: Minimum Bachelor's degree (Master's preferred)\n\nJob Nature: Full-time / Contractual Job Location: Dhaka (As per company requirement) Salary Range: BDT 50,000 – 70,000 (Negotiable) Job Responsibilities: Overall supervision of business operations Strategic planning and management support Guiding senior and mid-level executives Monitoring performance and ensuring discipline Assisting management in decision-making and policy matters Compensation & Benefits: Competitive salary Respectful and professional work environment Other benefits as per company policy"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19681",
    "job_id": "19681",
    "company_name": "Data Serve Technologies",
    "job_title": "Data Entry Executive (Night Shift)",
    "location": "Mohakhali DOHS",
    "salary": "TK. 15,000-16,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Computer Operator/Data Entry Operator",
    "vacancy": 5,
    "shift": "Night Shift",
    "country": null,
    "company_address": "Mohakhali,Dhaka",
    "job_description": "Responsibilities: At our organization, we are hiring a responsible and hardworking data entry operator for night shifts . Even fresh candidates without experience can apply. Age: 18 - 25 years Must be mentally prepared to work night shifts 🎓 Educational Qualifications SSC passed HSC passed\n\nRequirements: 💼 Job Type Job Status: Full-time Workplace: Office-based work Job Location: Dhaka (Dhaka, Mohakhali) 💰 Salary and Benefits Monthly Salary: 15,000 - 16,000 Taka Attendance Bonus after 1 month Salary review once a year Two festival bonuses per year Performance bonus based on skills\n\nআমাদের প্রতিষ্ঠানে নাইট শিফটে কাজ করার জন্য একজন দায়িত্বশীল ও পরিশ্রমী ডাটা এন্ট্রি অপারেটর নিয়োগ দেওয়া হবে। অভিজ্ঞতা না থাকলেও যোগ্য ফ্রেশার প্রার্থীরা আবেদন করতে পারবেন বয়স: ১৮ – ২৫ বছর নাইট শিফটে কাজ করার মানসিকতা থাকতে হবে 🎓 শিক্ষাগত যোগ্যতা এসএসসি পাস এইচএসসি পাস"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19705",
    "job_id": "19705",
    "company_name": "Parcel Trade International",
    "job_title": "Videographer",
    "location": "Notun Bajar",
    "salary": "TK. 25,000-30,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Graphics",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Sayednagar,Vatara,Gulshan-2,Dhaka-1212",
    "job_description": "Responsibilities: ```html Video shooting for social media, marketing campaigns, events, and promotions Video editing, color correction, adding sound and effects Creating and implementing creative video concepts Managing camera, lighting, and audio setups Collaborating with marketing team to generate content ideas ```\n\nRequirements: ```html Must have prior experience as a Videographer or Video Editor Proficiency in video editing software (Premiere Pro, Final Cut Pro, DaVinci Resolve, etc.) Creative mindset and attention to detail Ability to meet deadlines promptly If you have an understanding of social media video formats, it's a plus ```\n\nসোশ্যাল মিডিয়া, মার্কেটিং ক্যাম্পেইন, ইভেন্ট ও প্রোমোশনের জন্য ভিডিও শুট করা ভিডিও এডিটিং, কালার কারেকশন, সাউন্ড ও ইফেক্ট যোগ করা ক্রিয়েটিভ ভিডিও কনসেপ্ট তৈরি ও বাস্তবায়ন করা ক্যামেরা, লাইটিং ও অডিও সেটআপ পরিচালনা করা মার্কেটিং টিমের সাথে সমন্বয় করে কনটেন্ট আইডিয়া তৈরি করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19692",
    "job_id": "19692",
    "company_name": "Krishna Chura Caffe House & Restaurant",
    "job_title": "রিসেপশনিস্ট (পার্ট টাইম)",
    "location": "Uttara",
    "salary": "TK. 10,000-12,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "5 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "General Management/Admin",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Sector17#Road 01#Plot 01#Block i# New Bowbazar 1230 Dhaka, Bangladesh",
    "job_description": "Responsibilities: Job Advertisement *Company Name: SK Builder (a subsidiary of Krishna Chura Caffe House) *Position: Receptionist (Part-time) (Only female candidates) *Job Type: Part-time *Workplace: Office-based *Job Responsibilities: Warmly welcome visitors at the office reception Answer phone calls and transfer calls to the relevant person as needed Maintain initial communication with clients Manage daily reception-related tasks at the office *Qualifications and Requirements: Female candidates only Must have smart, presentable, and good communication skills Minimum HSC pass Must be able to speak in Bengali and English (Basic English) Preference will be given to candidates with prior experience\n\nনিয়োগ বিজ্ঞপ্তি *প্রতিষ্ঠানের নাম: SK Builder(Krishna Chura Caffe House-এর একটি অঙ্গ প্রতিষ্ঠান।) *পদের নাম: রিসেপশনিস্ট (পার্ট টাইম) (শুধুমাত্র নারী প্রার্থী) *চাকরির ধরন: পার্ট টাইম *কর্মস্থল: অফিস ভিত্তিক *কাজের দায়িত্বসমূহ: অফিস রিসেপশনে আগত ভিজিটরদের আন্তরিকভাবে স্বাগত জানানো ফোন কল গ্রহণ করা এবং প্রয়োজন অনুযায়ী সংশ্লিষ্ট ব্যক্তির কাছে কল ট্রান্সফার করা ক্লায়েন্টদের সাথে প্রাথমিক যোগাযোগ রক্ষা করা অফিসের দৈনন্দিন রিসেপশন সংক্রান্ত কাজ পরিচালনা করা *যোগ্যতা ও শর্তাবলি: শুধুমাত্র নারী প্রার্থী স্মার্ট, প্রেজেন্টেবল ও ভালো যোগাযোগ দক্ষতা থাকতে হবে ন্যূনতম HSC পাশ বাংলা ও ইংরেজিতে কথা বলতে সক্ষম হতে হবে (Basic English) পূর্ব অভিজ্ঞতা থাকলে অগ্রাধিকার দেওয়া হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19776",
    "job_id": "19776",
    "company_name": "ColorWise Computer House",
    "job_title": "Graphics Designer",
    "location": "Uttara",
    "salary": "TK. 12,000-15,000",
    "experience": "6 months - 1 year",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Graphics/Video Editor",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House No: 7, Road No: 19, Uttara, Dhaka",
    "job_description": "Responsibilities: - Assist in developing visual concepts and ideas for print, digital, and social media platforms.\n- Create and design visual content that meets project objectives and client expectations.\n- Collaborate with senior designers, copywriters, and other stakeholders to ensure visual elements are seamlessly integrated into overall projects.\n- Manage multiple design tasks simultaneously while maintaining high-quality standards and meeting deadlines.\n- Learn and apply creative feedback from senior team members to enhance your design skills.\n- Stay updated with industry trends, new technologies, and design techniques to incorporate innovative ideas into projects.\n- Help develop storyboards, mood boards, and visual presentations to communicate design concepts effectively.\n- Assist in maintaining visual design guidelines and ensuring consistency across all projects.\n- Basic understanding of graphic design principles, including layout, typography, and composition for both print and digital media.\n- Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, etc.). Experience with other design tools (Premiere Pro, After Effects, etc.) is a plus.\n- Strong attention to detail and a good eye for design.\n- Ability to work creatively and collaboratively with cross-functional teams.\n- Passion for design, innovation, and continuous improvement, with a drive to develop your skills.\n- Strong organizational skills and the ability to manage time effectively to meet project deadlines.\n- Willingness to learn and adapt to new challenges in a fast-paced environment.\n\nAssist in developing visual concepts and ideas for print, digital, and social media platforms. Create and design visual content that meets project objectives and client expectations. Collaborate with senior designers, copywriters, and other stakeholders to ensure visual elements are seamlessly integrated into overall projects. Manage multiple design tasks simultaneously while maintaining high-quality standards and meeting deadlines. Learn and apply creative feedback from senior team members to enhance your design skills. Stay updated with industry trends, new technologies, and design techniques to incorporate innovative ideas into projects. Help develop storyboards, mood boards, and visual presentations to communicate design concepts effectively. Assist in maintaining visual design guidelines and ensuring consistency across all projects. Basic understanding of graphic design principles, including layout, typography, and composition for both print and digital media Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, etc.). Experience with other design tools (Premiere Pro, After Effects etc.) is a plus. Strong attention to detail and a good eye for design. Ability to work creatively and collaboratively with cross-functional teams. Passion for design, innovation, and continuous improvement, with a drive to develop your skills. Strong organizational skills and the abili"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19778",
    "job_id": "19778",
    "company_name": "Dhakaiya Tant Fashion",
    "job_title": "Accounts Executive",
    "location": "Uttara",
    "salary": "TK. 15,000-16,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Accounts/Finance/Audit",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 23, Road No: 12A, Uttara, Dhaka",
    "job_description": "Responsibilities: - Basic understanding of accounting principles and financial statements (e.g., balance sheets, income statements).\n- Strong attention to detail to ensure accuracy in financial reporting and data entry.\n- Excellent verbal and written communication skills to interact with clients, colleagues, and stakeholders effectively.\n- Strong organizational capabilities to manage multiple tasks and meet deadlines.\n- Familiarity with accounting software and proficiency in Microsoft Excel for data manipulation.\n- Aptitude for resolving discrepancies and addressing client concerns proactively.\n- Willingness to work collaboratively in a team environment and support various departments.\n- Vigorous communication ability in both English and Bangla.\n- Highly effective supervisory skills and techniques.\n- Knowledge of MS Office proficiency (Word, Excel, PowerPoint, etc.).\n- Ability to input, retrieve, and analyze data for necessary reporting.\n- Hands-on commitment to getting the job done.\n- Excellent communication and interpersonal skills.\n- Strong organizational and time management skills.\n\nBasic understanding of accounting principles and financial statements (e.g., balance sheets, income statements). Strong attention to detail to ensure accuracy in financial reporting and data entry. Excellent verbal and written communication skills to interact with clients, colleagues, and stakeholders effectively. Strong organizational capabilities to manage multiple tasks and meet deadlines. Familiarity with accounting software and proficiency in Microsoft Excel for data manipulation. Aptitude for resolving discrepancies and addressing client concerns proactively. Willingness to work collaboratively in a team environment and support various departments. Vigorous communication ability in both English and Bangla. Highly effective supervisory skills and techniques Knowledge of MS Office proficiency (word, excel, power point etc.) Ability to input, retrieve, and analyze data for necessary reporting Hands-on commitment to getting the job done Excellent communication and interpersonal skills Strong organizational and time management skills"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19700",
    "job_id": "19700",
    "company_name": "YOYOSO Bangladesh",
    "job_title": "স্টোর ম্যানেজার (গ্লোবাল রিটেইল শপ)",
    "location": "Gazipur",
    "salary": "TK. 20,000-23,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Banani Road No: 11, House: 78, Dhaka",
    "job_description": "Responsibilities: A skilled and responsible store manager will be hired at our prestigious retail establishment. Properly manage the daily operations of the store Supervise and coordinate the sales team Work towards achieving sales targets Manage stock and inventory control Ensure customer service Coordinate with reporting and management\n\nRequirements: Experience in retail shop: 1-2 years as a store manager\nAge: Below 30 years\nLeadership skills and responsibility\nCommunication skills and problem-solving ability\nIncentive: 5,000 - 10,000 taka (based on performance)\n\nআমাদের স্বনামধন্য রিটেইল প্রতিষ্ঠানে একজন দক্ষ ও দায়িত্বশীল স্টোর ম্যানেজার নিয়োগ দেওয়া হবে। স্টোরের দৈনন্দিন কার্যক্রম সুষ্ঠুভাবে পরিচালনা করা বিক্রয় টিম পরিচালনা ও তদারকি করা বিক্রয় লক্ষ্য (Sales Target) অর্জনে কাজ করা স্টক ম্যানেজমেন্ট ও ইনভেন্টরি নিয়ন্ত্রণ কাস্টমার সার্ভিস নিশ্চিত করা রিপোর্টিং ও ব্যবস্থাপনার সাথে সমন্বয় করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19766",
    "job_id": "19766",
    "company_name": "Lamia Overseas Ltd.",
    "job_title": "video editor",
    "location": "Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Graphics/Video Editor",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Suggest creative ideas for video content\nFilm videos during trips (holding and operating the camera)\nAssist during travel specifically for content creation\nEdit recorded videos into engaging final content\nWork closely with me to match my content style and vision\n\nRequirements: Basic knowledge of video shooting and editing\nExperience with editing apps/software (mobile or PC)\nCreative mindset and understanding of social media content\nResponsible, punctual, and easy to work with\nComfortable traveling for content shoots\n\nSkills\nExperience with vlog-style or short-form videos (Reels, Shorts, TikTok, YouTube)\nKnowledge of trending video styles\nPhotography skills\n\nSuggest creative ideas for video content Film videos during trips (holding and operating the camera) Assist during travel specifically for content creation Edit recorded videos into engaging final content Work closely with me to match my content style and vision"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19693",
    "job_id": "19693",
    "company_name": "New Era Consultancy",
    "job_title": "Counselor – Visa Consultancy",
    "location": "Gulshan",
    "salary": "TK. 15,000-30,000",
    "experience": "<1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Education/Training/Consultant",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "B-1 (FIRST FLOOR ) PLOT-10 ROAD -113/A, GULSHAN -2, Dhaka, Bangladesh",
    "job_description": "Responsibilities: New Era Consultancy, a leading visa and immigration consultancy firm, is looking for dynamic, self-motivated, and customer-oriented individuals for the position of Counselor. The ideal candidate will have prior experience in visa consultancy services, excellent communication skills, and a passion for helping clients achieve their international goals.\n\nKey Responsibilities:\n- Provide professional counseling and guidance to clients regarding visa applications, study abroad, and immigration processes.\n- Maintain positive communication with clients and promptly respond to inquiries and follow-ups.\n- Prepare and manage documentation accurately, ensuring all records are up to date.\n- Coordinate with the operations and processing team to ensure a smooth client experience.\n- Stay updated on visa rules, embassy guidelines, and country-specific requirements.\n- Contribute to achieving team and company targets through proactive engagement.\n\nRequirements: Freshers with a strong willingness to learn and adapt are also encouraged to apply. Excellent verbal and written communication skills (English proficiency preferred). Strong organizational and problem-solving abilities. Office Hours: 10:00 a.m. – 6:00 p.m.\n\nNew Era Consultancy, a leading visa and immigration consultancy firm, is looking for dynamic, self-motivated, and customer-oriented individuals for the position of Counselor. The ideal candidate will have prior experience in visa consultancy services, excellent communication skills, and a passion for helping clients achieve their international goals. Key Responsibilities: Provide professional counseling and guidance to clients regarding visa applications, study abroad, and immigration processes. Maintain positive communication with clients and promptly respond to inquiries and follow-ups. Prepare and manage documentation accurately, ensuring all records are up to date. Coordinate with the operations and processing team to ensure a smooth client experience. Stay updated on visa rules, embassy guidelines, and country-specific requirements. Contribute to achieving team and company targets through proactive engagement."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19699",
    "job_id": "19699",
    "company_name": "AR ARTISTRY",
    "job_title": "𝐏𝐞𝐫𝐬𝐨𝐧𝐚𝐥 & 𝐎𝐩𝐞𝐫𝐚𝐭𝐢𝐨𝐧𝐬 𝐀𝐬𝐬𝐢𝐬𝐭𝐚𝐧𝐭",
    "location": "Gulshan-Banani, Badda, Baridhara, Mohakhali",
    "salary": "TK. 12,000-15,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Shop: 18/a, Ground Floor, Pinkcity Shopping Complex, Gulshan 02",
    "job_description": "Responsibilities: ⭐️ Job Context:\nWe are looking for a proactive Personal Assistant to support our Founder in managing fashion operations and content production in Dhaka.\n----\n⭐️ The Role:\n* Manage executive scheduling, correspondence, and client coordination.\n* Organize logistics for fashion shoots and events.\n* Create and edit 2-3 social media Reels weekly (CapCut/Adobe).\n* Provide studio support, including basic styling and client relations.\n* Daily Report of the Operations to the Founder (As per the direction of the Senior/ Founder).\n* Regular Communication with the Models, Influencers and Cinematographers.\n\nRequirements: ⭐️ **Key Requirements:**\n* Gender: Both Male and Female can apply.\n* At least 6 months to 1 year of experience in Administration/Social Media Manager/Video Editor/Content Creator/the creative industry.\n* Minimum HSC; Bachelor’s degree preferred.\n* Proficiency in Google Sheets, WhatsApp, and Video Editing (Basic) are a must.\n* Fluent in Bangla with professional English communication skills.\n----\n⭐️ **We Offer:**\n* **Salary:** BDT 12,000-15,000/month (Negotiable. During Probation Period).\n* **Benefits:** Direct mentorship, performance bonuses, and career growth.\n\n⭐️ 𝐉𝐨𝐛 𝐂𝐨𝐧𝐭𝐞𝐱𝐭: We are looking for a proactive Personal Assistant to support our Founder in managing fashion operations and content production in Dhaka. ---- ⭐️ 𝐓𝐡𝐞 𝐑𝐨𝐥𝐞: * Manage executive scheduling, correspondence, and client coordination. * Organize logistics for fashion shoots and events. * Create and edit 2–3 social media Reels weekly (CapCut/Adobe). * Provide studio support, including basic styling and client relations. * Daily Report of the Operations to the Founder (As per the direction of the Senior/ Founder). * Regular Communication with the Models, Influencers and Cinematographers."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19782",
    "job_id": "19782",
    "company_name": "Maliha Products",
    "job_title": "Sales Representative",
    "location": "Uttara",
    "salary": "TK. 10,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Sales/Marketing",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No: 13, Sector: 5, Uttara, Dhaka",
    "job_description": "Responsibilities: - Sales Executive should be able to meet daily, weekly, and monthly sales targets.\n- The sales executive’s responsibilities include generating leads, making sales calls.\n- Setting sales goals, researching prospects of sales and developing sales strategies.\n- Should be able to build rapport with customers.\n- Contacting potential and existing customers over the phone, through the internet, and in person.\n- Handling customer questions, inquiries, and complaints.\n- Preparing and sending quotes and proposals.\n- Building and maintaining a CRM database.\n- Participating in sales team meetings.\n- Perform any other task given by the management if deemed necessary.\n\nSales Executive should be able to meet daily, weekly, and monthly sales targets. The sales executive’s responsibilities include generating leads, making sales calls Setting sales goals, researching prospects of sales and developing sales strategies. Should be able to build rapport with customers. Contacting potential and existing customers over phone, through internet and in person. Handling customer questions, inquiries, and complaints. Preparing and sending quotes and proposals. Building and maintaining a CRM database. Participating in sales team meetings. Perform any other task given by the management if deemed necessary."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19695",
    "job_id": "19695",
    "company_name": "Ribana",
    "job_title": "Call Center Executive",
    "location": "Dhaka, Mohammadpur",
    "salary": "TK. 10,000-12,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Call Center",
    "vacancy": 4,
    "shift": "Other",
    "country": null,
    "company_address": "Shop no. 14, 27 SHAPTAK SQUARE, Road No 16, Dhanmondi, Dhaka 1205.",
    "job_description": "Responsibilities: Job Responsibilities: - Selling products by making outbound calls\n- Providing accurate information to customers and helping them solve problems\n- Convincing customers about the company's products and services\n- Receiving customer feedback and preparing reports\n\nRequirements: Qualifications and Skills: - Minimum HSC or Graduation\n- Experience in customer service is preferred\n- Fluent in Bengali (English is an added advantage)\n- Proficiency in using computers and Microsoft Office\n- Patient, positive attitude and problem-solving skills Benefits: - Performance bonus (opportunity to earn 15,000-20,000 per month with basic salary)\n- Friendly and professional work environment\n- Candidates from Dhanmondi, Mirpur, Mohammadpur, Shyamoli or nearby areas will be preferred.\n\nInterested candidates apply now!\n\nEmail your CV 📧 - hr.ribana@gmail.com\n\nJob Responsibilities: - Selling products by making outbound calls - Providing accurate information to customers and helping them solve problems - Convincing customers about the company's products and services - Receiving customer feedback and preparing reports"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19701",
    "job_id": "19701",
    "company_name": "Shomvob Global",
    "job_title": "Executive – Call Center & Overseas Recruitment (Manpower)",
    "location": "Dhaka",
    "salary": "TK. 18,000-20,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: Shomvob is looking for a dynamic and responsible Executive – Call Center & Overseas Recruitment to support our international manpower operations. This role is ideal for candidates who can communicate confidently with blue-collar job seekers, manage high call volumes, and support overseas recruitment processes from sourcing to deployment.\n\nKey Responsibilities\n• Make and receive outbound & inbound calls to potential overseas job candidates\n• Explain overseas job opportunities, country details, salary, benefits, and recruitment process clearly\n• Screen candidates based on job requirements (age, experience, skills, medical, documentation)\n• Guide candidates on interview preparation, video interviews, and trade test requirements\n• Collect and verify candidate documents (CV, passport, photos, videos, certificates)\n• Update candidate status regularly in the recruitment system / tracker\n• Coordinate with overseas recruiters, local agents, and internal recruitment teams\n• Follow up with shortlisted candidates to ensure process completion\n• Handle candidate queries professionally and build trust\n• Maintain accurate records and daily call/recruitment reports\n• Support deployment-related communication until visa issuance\n\nRequired Qualifications & Skills\n• Minimum Bachelor’s degree (any discipline preferred)\n• 1-3 years experience in call center, recruitment, or overseas manpower (preferred)\n• Strong verbal communication skills in Bangla; basic English communication preferred\n• Ability to handle pressure and high call volumes\n• Familiarity with overseas recruitment or blue-collar hiring will be a strong advantage\n• Basic computer skills (Google Sheets, Excel, CRM or ATS is a plus)\n• Honest, patient, and candidate-friendly attitude\n\nJob Type & Location\n• Employment Type: Full-time\n• Location: Dhaka (Office-based)\n• Department: Shomvob Manpower / Shomvob Global\n\nWhy Join Shomvob\n• Work with a fast-growing international manpower platform\n• Exposure to overseas recruitment projects (Middle East, Europe, Asia-Pacific)\n• Structured recruitment process with long-term growth opportunities\n• Mission-driven work enabling safe and transparent overseas employment\n\nShomvob is looking for a dynamic and responsible Executive – Call Center & Overseas Recruitment to support our international manpower operations. This role is ideal for candidates who can communicate confidently with blue-collar job seekers, manage high call volumes, and support overseas recruitment processes from sourcing to deployment. Key Responsibilities • Make and receive outbound & inbound calls to potential overseas job candidates • Explain overseas job opportunities, country details, salary, benefits, and recruitment process clearly • Screen candidates based on job requirements (age, experience, skills, medical, documentation) • Guide candidates on interview preparation, video interviews, and trade test requirements • Collect and verify candidate documents (CV, passport, photos, vide"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19688",
    "job_id": "19688",
    "company_name": "N.N Corporation (Robi-Airtel Distribution House)",
    "job_title": "Distribution Sales Representative (D.S.R)",
    "location": "Dhaka",
    "salary": "TK. 20,000-21,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Sales/Marketing",
    "vacancy": 6,
    "shift": "Other",
    "country": null,
    "company_address": "Chankharpool",
    "job_description": "Responsibilities: Job Description: Providing market services (recharge sales, scratch card sales, POSM execution) Selling Robi and Airtel SIM cards Providing daily work reports 🎓 Qualifications: Minimum S.S.C / H.S.C pass Must have good communication skills Must be interested in fieldwork Must have knowledge of using smartphones Both male and female can apply 📍 Job Location: Dhaka\n\nকাজের বিবরণ: মার্কেট সার্ভিস দেয়া (রিচার্জে সেল, স্ক্র্যাচকার্ড সেল, POSM এক্সিকিউশন) রবি এবং এয়ারটেল সিম সেল দৈনিক কাজের রিপোর্ট প্রদান 🎓 যোগ্যতা: ন্যূনতম S.S.C / H.S.C পাশ ভালো যোগাযোগ দক্ষতা থাকতে হবে ফিল্ড ওয়ার্কে আগ্রহী হতে হবে স্মার্টফোন ব্যবহারে ধারণা থাকতে হবে নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন 📍 কাজের এলাকা: ঢাকা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19760",
    "job_id": "19760",
    "company_name": "ST Group",
    "job_title": "টেরিটরি সেলস অফিসার (TSO)",
    "location": "Ashulia, Gazipur, Manikganj, Mirpur",
    "salary": "TK. 14,000-15,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Sales/Marketing",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "lift-7A, House-217, Road-11 Savar DOHS, Nobinogor, Ashulia, Dhaka.",
    "job_description": "Responsibilities: Selling and promoting Chinese imported products in designated areas Building relationships with dealers, distributors, and retail sellers Achieving monthly and quarterly sales targets Regularly visiting markets to collect orders Exploring new markets and acquiring new customers Monitoring activities and market conditions of competitors Preparing daily/weekly sales reports and submitting to the management 💰 Salary and Benefits Salary: 14,000-15,000 Sales Incentive/Commission Travel and Daily Allowance (TA/DA) Mobile bill Career growth opportunities If you can ride a motorcycle and have a valid driving license, preference will be given. Work Area: Ashulia, Gazipur, Manikganj, Mirpur\n\nRequirements: 🎓 Educational Qualifications: Minimum Bachelor's degree (preferably in Marketing/Business) However, educational qualifications may be relaxed for more experienced candidates 🧠 Experience: Minimum 1-3 years of experience in sales and marketing of Chinese imported products. Real-world experience in field sales is necessary 🧰 Skills and Abilities: Must have good communication and negotiation skills Ability to work independently in the field Must have skills in customer handling and relationship building Must have a mindset for target-oriented work Preference will be given to candidates with a motorcycle and valid driving license\n\nনির্ধারিত এলাকায় চীনা আমদানিকৃত পণ্য বিক্রয় ও প্রচারণা করা ডিলার, ডিস্ট্রিবিউটর ও খুচরা বিক্রেতাদের সাথে সুসম্পর্ক গড়ে তোলা মাসিক ও ত্রৈমাসিক সেলস টার্গেট অর্জন নিশ্চিত করা নিয়মিত মার্কেট ভিজিট করে অর্ডার সংগ্রহ করা নতুন মার্কেট ও নতুন কাস্টমার খুঁজে বের করা প্রতিযোগী প্রতিষ্ঠানের কার্যক্রম ও বাজার পরিস্থিতি পর্যবেক্ষণ করা দৈনিক/সাপ্তাহিক সেলস রিপোর্ট প্রস্তুত ও ঊর্ধ্বতন কর্তৃপক্ষকে প্রদান করা 💰 বেতন ও সুযোগ-সুবিধা বেতনঃ ১৪,০০০-১৫,০০০ এবং সেলস ইনসেনটিভ / কমিশন যাতায়াত ও ভাতা (TA/DA) মোবাইল বিল ক্যারিয়ার গ্রোথের সুযোগ মোটর সাইকেল চালানো জানলে ও ভ্যালিড ড্রাইভিং লাইসেন্স থাকলে অগ্রাধিকার দেয়া হবে। কাজের এরিয়াঃ আশুলিয়া, গাজীপুর, মানিকগঞ্জ, মিরপুর"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19689",
    "job_id": "19689",
    "company_name": "N.N Corporation (Robi-Airtel Distribution House)",
    "job_title": "Brand Promoter ",
    "location": "Dhaka",
    "salary": "TK. 13,000-25,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-11",
    "industry": "Sales/Marketing",
    "vacancy": 6,
    "shift": "Other",
    "country": null,
    "company_address": "Chankharpool",
    "job_description": "Responsibilities: ```html Job Description: Promote Robi and Airtel brands at designated stalls/points Inform customers about SIM cards, data offers, and call rates Motivate interested customers to purchase SIM cards Handle customers while maintaining brand image Provide daily work reports 🎓 Qualifications: Minimum S.S.C / H.S.C pass Ability to communicate effectively Must be confident and presentable Interest in customer service Both male and female candidates can apply 📍 Job Location: Dhaka ```\n\nকাজের বিবরণ: নির্ধারিত স্টল/পয়েন্টে Robi ও Airtel ব্র্যান্ড প্রমোশন করা কাস্টমারদের সিম, ডাটা অফার ও কল রেট সম্পর্কে জানানো আগ্রহী গ্রাহকদের সিম ক্রয়ে উৎসাহ দেওয়া ব্র্যান্ড ইমেজ বজায় রেখে কাস্টমার হ্যান্ডলিং করা দৈনিক কাজের রিপোর্ট প্রদান 🎓 যোগ্যতা: ন্যূনতম S.S.C / H.S.C পাশ সুন্দর কথা বলার দক্ষতা আত্মবিশ্বাসী ও প্রেজেন্টেবল হতে হবে কাস্টমার সার্ভিসে আগ্রহ নারী ও পুরুষ উভয়েই আবেদন করতে পারবেন 📍 কাজের এলাকা: ঢাকা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19779",
    "job_id": "19779",
    "company_name": "Onibar Door & Interior ",
    "job_title": "Sales & Marketing Officer (Door & Interior) ",
    "location": "Ashulia, Uttara, Mirpur, Savar",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-11",
    "date_posted": "2026-01-14",
    "industry": "Sales/Marketing",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Opposite Pakija Garments, Bank-Colony, Savar",
    "job_description": "Responsibilities: ```html 🧩 Job Overview As a Sales & Marketing Officer, you’ll be the frontline person driving revenue, building client relationships, and promoting Onibar’s premium door and interior design services. You’ll blend sales skills with creative marketing to grow brand visibility and generate consistent leads. 🛠 Key Responsibilities Sales Identify and approach potential clients (B2B & B2C). Present, demo, and sell door and interior design solutions. Prepare proposals, quotations, and follow-up with customers. Close sales and achieve monthly/quarterly targets. Maintain and update the customer database (CRM). Marketing Plan and execute online/offline marketing campaigns. Manage social media profiles (FB, IG, TikTok, LinkedIn). Create engaging content (ads, visuals, reels, carousels). Track campaign performance & optimize for better ROI. Collaborate with designers/content creator for promotions. Customer Experience Respond to inquiries via phone, email & social channels. Provide excellent after-sales support. Gather feedback & build long-term relationship with clients. Market Research Study competitors & market trends. Identify new product/service opportunities. Suggest pricing & promotional strategies. 🎯 Performance Metrics 🔹 Monthly Sales Volume🔹 New Customers Acquired🔹 Lead Conversion Rate🔹 Marketing Engagement (Clicks, Leads, Reach)🔹 Customer Satisfaction 💡 What you will gain.... ✨ Hands-on experience in interior/design industry✨ Growth opportunities in sales & marketing roles✨ Networking with architects, builders & customers✨ Competitive salary + incentives ```\n\nRequirements: 📈 Skill & Qualification ✔️ Minimum Bachelor's degree (Business, Marketing, or related) ✔️ Strong communication & presentation skills ✔️ Sales-oriented with negotiation ability ✔️ Basic knowledge of digital marketing tools ✔️ CRM / MS Office experience ✔️ Creative mindset + result focus\n\n🧩 Job Overview As a Sales & Marketing Officer , you’ll be the frontline person driving revenue, building client relationships, and promoting Onibar’s premium door and interior design services. You’ll blend sales skills with creative marketing to grow brand visibility and generate consistent leads. 🛠 Key Responsibilities Sales Identify and approach potential clients (B2B & B2C). Present, demo, and sell door and interior design solutions. Prepare proposals, quotations, and follow-up with customers. Close sales and achieve monthly/quarterly targets. Maintain and update the customer database (CRM). Marketing Plan and execute online/offline marketing campaigns. Manage social media profiles (FB, IG, TikTok, LinkedIn). Create engaging content (ads, visuals, reels, carousels). Track campaign performance & optimize for better ROI. Collaborate with designers/content creator for promotions. Customer Experience Respond to inquiries via phone, email & social channels. Provide excellent after-sales support. Gather feedback & build long-term relationship with clients. Market Research Study com"
  }
]