[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19880",
    "job_id": "19880",
    "company_name": "M/S. Momin Enterprise",
    "job_title": "Warehouse Management Executive",
    "location": "Uttara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Warehouse",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 79, Road No: 10B, Uttara, Dhaka",
    "job_description": "Responsibilities: Managing inventory, overseeing store operations, and ensuring all store activities such as receiving, storing, and dispatching materials. Maintaining accurate inventory records through stock checks and reconciliations and preparing reports on stock levels and transactions. Receiving incoming materials and verifying quantity and quality against purchase orders and delivery challans. Maintaining accurate records of stock (raw materials, finished goods, accessories, and trims). Updating stock levels in ERP/software or manual stock registers. Storing materials in a clean, organized, and safe environment. Segregating shipment products that are processed for delivery or tracking inward and outward movement of goods. Keeping track of returnable products (e.g. unused trims, accessories, and raw materials). Preparing daily/weekly/monthly stock reports as well as monitoring shortages of products. Ensuring the security and safety of inventories to prevent damages effectively.\n\nManaging inventory, overseeing store operations, and ensuring all store activities such as-receiving, storing, and dispatching materials. Maintaining accurate inventory records through stock checks and reconciliations and prepare reports on stock levels and transactions. Receiving incoming materials & verify quantity and quality against purchase orders and delivery challans. Maintaining accurate records of stock (raw materials, finished goods, accessories & trims). Updating stock levels in ERP/software or manual stock registers. Storing materials in a clean, organized, and safe environment. Segregating shipment products that are processed for delivery or track inward and outward movement of goods. Keeping track of returnable products (e.g. unused trims, accessories & raw-materials) Preparing daily/weekly/monthly stock reports as well as monitor shortage of products. Assuring security and safety of inventories with prevent damages strongly."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19863",
    "job_id": "19863",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Aftabnagar, Banasree, Bashabo, Maghbazar, Malibagh",
    "salary": "TK. 18,350-36,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Collect medicine from the hub at a designated time every day Deliver collected medicine to the pharmacy in a timely manner Collect cash from customers Deposit collected cash into the company's designated bank account through CRM Participate in the campaign\n\nRequirements: Personal bike Hardworking Mindset for working Why should you work with us? Opportunity for salary reassessment for experienced individuals Assurance of regular and dependable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19858",
    "job_id": "19858",
    "company_name": "RS 3D wallpaper & Floor",
    "job_title": "Video Editor",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Graphics/Video Editor",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Ka-57/4 kuril chowrastha vatara, dhaka 1229",
    "job_description": "Responsibilities: 🛠️ Job Type: Video Editing (Promotional/Content Videos) Improving Audio and Visual Quality Adding Graphics and Effects as needed ✅ Qualifications: Minimum HSC Pass At least 1 year of practical experience in video editing Proficiency in Adobe Premiere Pro, Adobe Audition, and Adobe Photoshop required ⏰ Working Hours: 🕙 10 AM - 7 PM 📅 6 days a week 📩 Application Procedure: Send your name, experience, and previous work sample/link through any of the following methods— 📱 WhatsApp: 01772-132818 📧 Email: raselshomaji@gmail.com ⚠️ Only serious and responsible candidates are requested to apply.\n\n🛠️ কাজের ধরন: ভিডিও এডিটিং (প্রমোশনাল/কনটেন্ট ভিডিও) অডিও ও ভিজ্যুয়াল কোয়ালিটি উন্নয়ন প্রয়োজন অনুযায়ী গ্রাফিক্স ও ইফেক্ট যুক্ত করা ✅ যোগ্যতা: ন্যূনতম HSC পাস কমপক্ষে ১ বছরের বাস্তব ভিডিও এডিটিং অভিজ্ঞতা Adobe Premiere Pro, Adobe Audition ও Adobe Photoshop–এ দক্ষতা থাকতে হবে ⏰ কাজের সময়: 🕙 সকাল ১০টা – সন্ধ্যা ৭টা 📅 সপ্তাহে ৬ দিন 📩 আবেদন করার নিয়ম: নিচের যেকোনো একটি মাধ্যমে আপনার নাম, অভিজ্ঞতা ও আগের কাজের Sample/Link পাঠান— 📱 WhatsApp: 01772-132818 📧 Email: raselshomaji@gmail.com ⚠️ শুধুমাত্র সিরিয়াস ও দায়িত্বশীল প্রার্থীদের আবেদন করার অনুরোধ করা হলো।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19864",
    "job_id": "19864",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Uttara, Tongi, Banani, Badda",
    "salary": "TK. 18,500-35,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Collect medicine from the hub at a designated time every day Deliver collected medicine to the pharmacy in a timely manner Collect cash from customers Deposit collected cash into the company's designated bank account through CRM Participate in the campaign\n\nRequirements: Own bike Hardworking Mindset for work Why should you work with us? Opportunity for salary reassessment for experienced individuals Assurance of regular and dependable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19860",
    "job_id": "19860",
    "company_name": "Lamia Overseas Ltd.",
    "job_title": "Civil Foreman Urgent/ Free Accommodation",
    "location": "Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "5-10 years",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Engineer",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Location: Aftabnagar, Rampura Job Description: We are seeking a dedicated and experienced Site civil foreman - Civil to oversee construction projects, ensure quality standards, and coordinate with various teams on-site. The ideal candidate will have a strong background in civil engineering, excellent problem-solving skills, and the ability to manage multiple tasks efficiently"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19876",
    "job_id": "19876",
    "company_name": "Emir Electronics Imports",
    "job_title": "Executive, Sales & Marketing",
    "location": "Uttara",
    "salary": "TK. 16,000-20,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 23, Road: 6, Uttara, Dhaka",
    "job_description": "Responsibilities: Hunt and identify new potential clients.\nAcquire new orders from newly onboarded clients.\nOnboard new clients on a daily basis to expand the customer base.\nMaintain strong and positive relationships with existing clients.\nExecute marketing campaigns via Email and WhatsApp.\nTarget and approach retail stores and grocery shops for business development.\n\nHunt and identify new potential clients. Acquire new orders from newly onboarded clients. Onboard new clients on a daily basis to expand the customer base. Maintain strong and positive relationships with existing clients. Execute marketing campaigns via Email and WhatsApp. Target and approach retail stores and grocery shops for business development."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19999",
    "job_id": "19999",
    "company_name": "SKRP Group",
    "job_title": "Brand Promoting Officer (BPO)",
    "location": "Dhaka",
    "salary": "TK. 10,000-12,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-22",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "80/1,Vip Road,Kakrail,Dhaka",
    "job_description": "Responsibilities: 1. Brand Promotion & Awareness\n- Promote SKRP products to retailers, electricians, and end customers.\n- Communicate product features, benefits, and usage effectively.\n- Support marketing campaigns, roadshows, and in-market activation programs.\n\n2. Merchandising & Display\n- Ensure all products are properly displayed and branded at retail points.\n- Place promotional materials (banners, posters, danglers, etc.) in assigned outlets.\n- Regularly check visibility and replace damaged or outdated materials.\n\n3. Market Visit & Support\n- Visit outlets daily as per route plan and maintain strong relationships with shop owners.\n- Assist the Sales Executive in collecting orders (memos) from retailers.\n- Identify new outlets for product placement and promotion.\n\n4. Feedback & Reporting\n- Collect feedback from retailers, electricians, and customers about products and competitors.\n- Report daily market activities, feedback, and promotional performance to the TSM/RSM.\n- Share photos or records of display, branding, and campaign participation.\n\n5. Event & Campaign Support\n- Participate in trade shows, fairs, dealer meetings, and promotional events.\n- Coordinate with marketing team for special campaigns and seasonal offers.\n- Represent the brand positively and maintain professional appearance and behavior.\n\nRequirements: Skills & Abilities:\n- Good communication and presentation skills.\n- Confident, energetic, and brand-oriented mindset.\n- Ability to engage with retailers and customers effectively.\n- Willing to work in the field and travel frequently.\n\n1. Brand Promotion & Awareness Promote SKRP products to retailers, electricians, and end customers. Communicate product features, benefits, and usage effectively. Support marketing campaigns, roadshows, and in-market activation programs. 2. Merchandising & Display Ensure all products are properly displayed and branded at retail points. Place promotional materials (banners, posters, danglers, etc.) in assigned outlets. Regularly check visibility and replace damaged or outdated materials. 3. Market Visit & Support Visit outlets daily as per route plan and maintain strong relationships with shop owners. Assist the Sales Executive in collecting orders (memos) from retailers. Identify new outlets for product placement and promotion. 4. Feedback & Reporting Collect feedback from retailers, electricians, and customers about products and competitors. Report daily market activities, feedback, and promotional performance to the TSM/RSM. Share photos or records of display, branding, and campaign participation. 5. Event & Campaign Support Participate in trade shows, fairs, dealer meetings, and promotional events. Coordinate with marketing team for special campaigns and seasonal offers. Represent the brand positively and maintain professional appearance and behavior."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19865",
    "job_id": "19865",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Khilgaon, Goran, Jurain, Demra, Jatrabari",
    "salary": "TK. 18,500-35,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Collecting medicine from the hub at a designated time every day Supplying collected medicine to the pharmacy in a timely manner Collecting cash from customers Depositing collected cash into the company's designated bank account through CRM Participating in the campaign\n\nRequirements: Personal bike Hardworking Mindset for working Why should you work with us? Opportunity for salary revision for experienced individuals Assurance of regular and dependable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19862",
    "job_id": "19862",
    "company_name": "HealthOS Limited",
    "job_title": "ডেলিভারি ম্যান",
    "location": "Uttara, Tongi",
    "salary": "TK. 19,350-38,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Collect medicine from the hub at a designated time every day Deliver collected medicine to the pharmacy in a timely manner Collect cash from customers Deposit collected cash into the company's designated bank account through CRM Participate in the campaign\n\nRequirements: Personal bike Hardworking Mindset for working Why should you work with us? Opportunity for salary revision for experienced individuals Assurance of regular and reliable income Easy and clean work process Percentage-based bonus facility alongside the base salary\n\nপ্রতিদিন নির্ধারিত সময়ে হাব থেকে ওষুধ সংগ্রহ করা সংগ্রহকৃত ওষুধ যথাসময়ে ফার্মেসিতে সরবরাহ করা গ্রাহকদের কাছ থেকে নগদ অর্থ সংগ্রহ করা সংগ্রহকৃত নগদ অর্থ CRM-এর মাধ্যমে কোম্পানির নির্ধারিত ব্যাংক অ্যাকাউন্টে জমা প্রদান করা ক্যাম্পেইনে অংশগ্রহণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19866",
    "job_id": "19866",
    "company_name": "HealthOS Limited",
    "job_title": "সহকারী লজিস্টিক অফিসার (Evening-shift)",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-10,500",
    "experience": "6 months - 1 year",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-16",
    "date_posted": "2026-01-19",
    "industry": "Supply Chain/Procurement",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Before applying, make sure to carefully read the following:\nOur main goal at HealthOS company is to deliver our products to our esteemed customers with utmost care.\nJob Description:\n1. Understand the products according to the correct invoice from the supervisor.\n2. After understanding the products correctly, arrange the products in the designated place.\n3. After the product is ordered, package the correct product by checking the invoice.\nWork Hours:\nMorning Shift: From 2 pm to 11 pm.\nEducational Qualification: Minimum from JSC to SSC, primarily focusing on understanding the product names for packaging.\n\nRequirements: The location of the workplace is the fourth floor of the Prime Bank building, a little ahead of the Adabar Police Station, Baiytul Aman Tower.\n\nআবেদন করার পূর্বে অবশ্যই সম্পূর্ণ পরে দেখবেন, আমাদের HealthOS কোম্পানি এর মূল লক্ষই হচ্ছে আমাদের প্রোডাক্ট সমূহ খুবই যত্নের সাথে আমাদের সম্মানিত গ্রাহকের নিকট পৌঁছে দেওয়া। কাজের বিবরণ, সুপারভাইজার থেকে সঠিক ইনভয়েস অনুযায়ী প্রোডাক্ট বুঝে নেওয়া পণ্য সঠিকভাবে বুঝে পাওয়ার পর নির্ধারিত স্থানে প্রোডাক্ট কে সাজিয়ে রাখতে হবে পণ্য অর্ডার হওয়ার পরে ইন ভয়েস দেখে সঠিক পণ্য প্যাকেজিং করতে হবে কাজের সময় : Morning Shift: দুপুর ২টা থেকে রাত ১১টা পর্যন্ত । শিক্ষাগত যোগ্যতা সর্বনিম্ন জেএসসি থেকে এসএসসি পর্যন্ত,মূলত প্রোডাক্টের নাম বুঝে প্যাকেজিং করতে পারাটাই মূল লক্ষ্য।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20220",
    "job_id": "20220",
    "company_name": "Soft Vio IT",
    "job_title": "মার্কেটিং ও সেলস অফিসার",
    "location": "Uttara, Gazipur, Tongi, Mirpur",
    "salary": "TK. 20,000-25,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-20",
    "date_posted": "2026-01-31",
    "industry": "Sales/Marketing",
    "vacancy": 15,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Opposite of Gazipur Biggan College, BIDC Road, Joydebpur, Gazipur City Corporation",
    "job_description": "Responsibilities: Soft Vio IT, a reputable IT company, is hiring experienced Sales and Marketing Officers. Interested candidates are requested to apply promptly. 🔰 Responsibilities: Introducing software to schools, colleges, and educational institutions, conducting demos and presentations Identifying new clients, visiting them, and building relationships Ensuring software sales according to sales targets Conducting market research, lead generation, and regular follow-ups Understanding clients' needs and providing appropriate solutions and price proposals Updating CRM/reports, preparing daily/weekly sales reports Explaining software features and providing basic training assistance as needed Salary and Benefits: Salary: 20,000 - 25,000 BDT Incentives: Attractive incentive policy 2 Eid bonuses Opportunities for promotion and various other benefits 📍 Location: 📌 Mirpur 📌 📌 Uttara 📌 📌 Tongi 📌 📌 Gazipur 📌\n\nRequirements: Qualifications: Minimum 1-2 years of experience in sales/marketing (preferably in software/IT sales) Bachelor's degree in any subject (additional advantage if in marketing/computer science) Educational qualifications flexible for more experienced candidates Interest and basic understanding of technology and software Strong communication and presentation skills Goal-oriented mindset Contact: Mr. Mehedi Hasan 01942845813 Office Location: Opposite Gazipur Commerce College, BIDC Road, Joydevpur, Gazipur City Corporation. [Interview Date: 15th February, 9 am to 4 pm] [Note: Inexperienced candidates need not apply for sales/marketing positions]\n\nস্বনামধন্য আইটি প্রতিষ্ঠান Soft Vio IT প্রতিষ্ঠানে অভিজ্ঞ সেলস-মার্কেটিং অফিসার নিয়োগ করতেছি। আগ্রহী অভিজ্ঞ পার্থীগন দ্রুত আবেদন করুন। 🔰 দায়িত্বসমূহঃ স্কুল, কলেজ ও শিক্ষাপ্রতিষ্ঠানে সফটওয়্যার পরিচিতি, ডেমো প্রদর্শন ও উপস্থাপন করা নতুন ক্লায়েন্ট চিহ্নিত করে ভিজিট ও সম্পর্ক তৈরি করা সেলস টার্গেট অনুযায়ী সফটওয়্যার বিক্রয় নিশ্চিত করা মার্কেট রিসার্চ, লিড জেনারেশন ও নিয়মিত ফলো-আপ করা ক্লায়েন্টদের প্রয়োজন বুঝে যথাযথ সমাধান ও মূল্য প্রস্তাবনা প্রদান সিআরএম/রিপোর্ট আপডেট, দৈনিক/সাপ্তাহিক সেলস রিপোর্ট তৈরি প্রয়োজন অনুযায়ী সফটওয়্যার ফিচার ব্যাখ্যা ও বেসিক ট্রেনিং সহায়তা বেতন ও সুবিধাসমূহঃ সেলারি    : ২০,০০০ – ২৫,০০০ টাকা ইনসেন্টিভ:  আকর্ষণীয় ইনসেন্টিভ পলিসি ২টি ঈদ বোনাস পদোন্নতির সুযোগসহ নানাবিধ সুবিধা 📍 কর্মস্থলঃ 📌 মিরপুর📌 📌 উত্তরা📌 📌 টঙ্গি📌 📌 গাজীপুর📌"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20360",
    "job_id": "20360",
    "company_name": "Fighter Solution Faridpur",
    "job_title": "Sales Executive",
    "location": "Faridpur",
    "salary": "TK. 22,000-29,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-16",
    "date_posted": "2026-02-09",
    "industry": "Sales/Marketing",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ⭐⭐⭐ Job Announcement ⭐⭐⭐ A well-established mobile operator Banglalink is looking to hire several skilled, handsome, enterprising, and hardworking Campus Connectors on a permanent basis. ➡ Daily visits and rise app discussion with area-based universities, companies/organizations. ➡ Must have a strong mentality to fulfill monthly targets. ➡ Must have a mentality like taking rise sim sales challenges. ➡ Ability to communicate with strangers is a must for candidates. ➡ Must be honest, hardworking, and smart. ➡ Must have a smartphone. ➡ Candidates with experience in sim sales/fieldwork will be given preference.\n\n⭐⭐⭐ নিয়োগ বিজ্ঞপ্তি ⭐⭐⭐ একটি সুপ্রতিষ্ঠিত মোবাইল অপা‌রেটর বাংলালিংক এর জন্য স্থায়ী ভিত্তিতে কিছু সংখ্যক দক্ষ, সুদর্শন, উদ্যমী ও পরিশ্রমী ক্যাম্পাস কানেক্টর  পদে নিয়োগ দেয়া হবে। ➡ এরিয়া ভিত্তিক দৈনিক ইউনিভার্সিটি এরিয়া, কোম্পানি/প্রতিষ্ঠান ভিজিট ও রাইজ এপ নিয়ে কথা বলা। ➡ মাসিক টার্গেট পুরন করার কঠোর মানসিকতা থাকতে হবে। ➡ রাইজ সিম সেলস চ্যালেঞ্জ নেওয়ার মত মানসিকতা থাকতে হবে। ➡ প্রার্থীর অবশ্যই অপরিচিত মানুষের সাথে কথা বলার দক্ষতা থাকতে হবে। ➡ সৎ, পরিশ্রমী এবং স্মার্ট হতে হবে । ➡ স্মার্ট ফোন থাকতে হবে । ➡ সিম সেলস / ফিল্ড ওয়ার্কের অভিজ্ঞতা রয়েছে এমন প্রার্থীরা অগ্রাধিকার দেওয়া হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20362",
    "job_id": "20362",
    "company_name": "ARP SECURITY & LOGISTIC SERVICES LIMITED",
    "job_title": "Security Guard",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-16",
    "date_posted": "2026-02-09",
    "industry": "Security/Support Service",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ```html ★ Job Advertisement ★ Company Name: ★ ARP SECURITY & LOGISTIC SERVICES LIMITED Position: ★ Security Guard Number of Positions: ★ Multiple Job Type: ★ Full-Time Workplace: ★ Office, Factory, Showroom, Residential & Commercial Areas (as per requirement) Job Responsibilities: ★ Ensure security at designated locations ★ Monitor entry and exit points ★ Supervise and report suspicious activities ★ Maintain discipline and punctuality during duty ★ Take prompt action in emergency situations ★ Follow instructions from authorities Qualifications and Experience: ★ Minimum 8th grade pass ★ Priority given to experience as a security guard ★ Physically fit and responsible ★ Discipline, punctuality, and adaptability ★ Age limit: Negotiable Salary and Benefits: ★ Competitive salary ★ Overtime benefits (where applicable) ★ Uniform provided ★ Timely salary payment ★ Safe and stable work environment ```\n\n★ নিয়োগ বিজ্ঞপ্তি ★ প্রতিষ্ঠানের নাম: ★ ARP SECURITY & LOGISTIC SERVICES LIMITED পদের নাম : ★ Security Guard পদসংখ্যা: ★ একাধিক চাকরির ধরন: ★ ফুল-টাইম কর্মস্থল: ★ অফিস, ফ্যাক্টরি, শোরুম, আবাসিক ও বাণিজ্যিক এলাকা (প্রয়োজন অনুযায়ী) কাজের দায়িত্বসমূহ: ★ নির্ধারিত স্থানে নিরাপত্তা নিশ্চিত করা ★ প্রবেশ ও প্রস্থানের উপর নজরদারি রাখা ★ সন্দেহজনক কার্যকলাপ পর্যবেক্ষণ ও রিপোর্ট করা ★ ডিউটির সময় শৃঙ্খলা ও সততা বজায় রাখা ★ জরুরি পরিস্থিতিতে দ্রুত ব্যবস্থা গ্রহণ করা ★ কর্তৃপক্ষের নির্দেশনা অনুযায়ী দায়িত্ব পালন করা যোগ্যতা ও অভিজ্ঞতা: ★ ন্যূনতম অষ্টম শ্রেণি পাস ★ সিকিউরিটি গার্ড হিসেবে অভিজ্ঞতা থাকলে অগ্রাধিকার ★ শারীরিকভাবে সক্ষম ও দায়িত্বশীল ★ সততা, শৃঙ্খলা ও সময়ানুবর্তিতা ★ বয়স সীমা: আলোচনা সাপেক্ষে বেতন ও সুযোগ-সুবিধা: ★ আকর্ষণীয় বেতন ★ ওভারটাইম সুবিধা (প্রযোজ্য ক্ষেত্রে) ★ ইউনিফর্ম প্রদান ★ সময়মতো বেতন পরিশোধ ★ নিরাপদ ও স্থিতিশীল কর্মপরিবেশ"
  }
]