[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20662",
    "job_id": "20662",
    "company_name": "Navana Group",
    "job_title": "Driver ",
    "location": "Mirpur",
    "salary": "TK. 15,000-17,000",
    "experience": "3-5 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-25",
    "industry": "Transportation",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Provide safe Pick & Drop service to employees according to the designated route and schedule. Operate Manual Hiace vehicles with skill and caution. Complete daily checklist of the vehicle (brakes, lights, tires, fuel, engine oil, etc.). Maintain cleanliness and regular servicing of the vehicle. Maintain records related to fuel usage and mileage. Immediately inform the authorities about any accidents or mechanical issues. Be prepared to take on additional responsibilities or work on different routes in case of emergencies. Maintain respectful, professional, and responsible behavior with passengers.\n\nRequirements: Valid driving license (professional license preferred). Must have at least 3 (three) years of practical experience in driving manual vehicles. Special experience in driving Hiace or similar microbuses preferred. Should have a good understanding of road safety and traffic laws. Must have integrity, punctuality, and a responsible mindset. Should have a mindset to work overtime or extra hours as needed.\n\nনির্ধারিত রুট ও সময়সূচি অনুযায়ী কর্মকর্তাদের নিরাপদভাবে Pick & Drop সেবা প্রদান করা। Manual Hiace গাড়ি দক্ষতা ও সতর্কতার সাথে পরিচালনা করা। গাড়ির দৈনিক চেকলিস্ট সম্পন্ন করা (ব্রেক, লাইট, টায়ার, ফুয়েল, ইঞ্জিন অয়েল ইত্যাদি)। গাড়ি পরিষ্কার-পরিচ্ছন্ন রাখা ও নিয়মিত সার্ভিসিং নিশ্চিত করা। জ্বালানি ব্যবহার ও মাইলেজ সংক্রান্ত রেকর্ড সংরক্ষণ করা। যে কোনো দুর্ঘটনা বা মেকানিক্যাল সমস্যার বিষয়ে তাৎক্ষণিকভাবে কর্তৃপক্ষকে অবহিত করা। জরুরি প্রয়োজনে অতিরিক্ত দায়িত্ব বা ভিন্ন রুটে কাজ করতে প্রস্তুত থাকা। যাত্রীদের সাথে ভদ্র, পেশাদার ও দায়িত্বশীল আচরণ বজায় রাখা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20660",
    "job_id": "20660",
    "company_name": "MetLife - B.Zaman Agency",
    "job_title": "Financial Associate",
    "location": "Moulvibazar, Sylhet, Sunamganj, Habiganj",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-24",
    "date_posted": "2026-02-25",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Sadique Tower 3rd floor, Holding 871, Noyasorok, Sylhet-3100",
    "job_description": "Responsibilities: Why become a Financial Associate at MetLife? Opportunity for rapid career advancement through hard work and skill Financial Associate ----> Unit Manager ----> Branch Manager Only candidates from Sylhet should apply. Financial stability achieved 1. Immediate income after joining 2. Annual average income of 40 lakh taka for top 50 performers 3. Annual average income of 20 lakh taka with bonuses for top 100 performers 4. Special recognition and rewards for exceptional performance Opportunities for fulfilling dreams 1. International and domestic travel 2. Recognition at international conferences 3. Medical coverage for family 4. Provident fund 5. Education scholarships for children Likelihood of rapid success 1. World-class training facilities 2. Skilled trainers 3. Digital workspace 4. 100% online programs 5. Digital tools for sales and activity management Opportunity for own business 1. Opportunity for own business without investment 2. Rapid career advancement based on performance, with opportunities to become Unit Manager and then Branch Manager 3. Opportunity to start an agency in own name 4. Work flexibility based on personal convenience Only candidates from Sylhet should apply. Address: Sadique Tower (3rd floor) Holding-871, Noyasorak, Sylhet-3100. Website : https://www.metlife.com.bd\n\nকেন হবেন মেটলাইফ-এর ফিনান্সিয়াল অ্যাসোসিয়েট? নিজের পরিশ্রম এবং দক্ষতা কাজে লাগিয়ে দ্রুত পদোন্নতির সুযোগ ফিনান্সিয়াল অ্যাসোসিয়েট   ---->    ইউনিট ম্যানেজার    ----->    ব্রাঞ্চ ম্যানেজার শুধুমাত্র সিলেটের প্রার্থীরা আবেদন করবেন। আর্থিক স্বচ্ছলতা অর্জন ১. যোগদানের পর দ্রুত আয় শুরু ২. সেরা ৫০ পারফর্মারদের জনপ্রতি বার্ষিক গড় আয় ৪০ লক্ষ টাকা ৩. সেরা ১০০ জনের বার্ষিক গড় আয় ২০ লক্ষ টাকা এবং সাথে অন্যান্য বোনাস ৪. বিশেষ অর্জনে স্বীকৃতিস্বরূপ বিশেষ সম্মাননা। স্বপ্নপূরণের সুযোগ ১. আন্তর্জাতিক ভ্রমন ও অভ্যন্তরীন ভ্রমন ২. আন্তর্জাতিক সম্মেলনে সম্মাননা ৩. পরিবারের জন্য মেডিকেল কাভারেজ ৪. প্রভিডেন্ট ফান্ড ৫. সন্তানের জন্য শিক্ষা বৃত্তি দ্রুত সাফল্যের সম্ভাবনা ১. বিশ্বমানের প্রশিক্ষণ ব্যবস্থা ২. দক্ষ প্রশিক্ষক ৩. ডিজিটাল ওয়ার্কস্পেস ৪. ১০০% অনলাইন ভিত্তিক কার্যক্রম ৫. সেলস এবং অ্যাক্টিভিটি ম্যানেজমেন্টের ডিজিটাল টুলস নিজস্ব ব্যবসার সুযোগ ১. কোনো বিনিয়োগ ছাড়াই নিজের ব্যাবসার সুযোগ ২. পারফরম্যান্সের ভিত্তিতে দ্রুত পদোন্নতি এবং ইউনিট ম্যানেজার ও পরে ব্রাঞ্চ ম্যানেজার হওয়ার সুযোগ ৩. নিজের নামে এজেন্সি চালু করার সুযোগ ৪. নিজের সুবিধাজনক সময় অনুযায়ী কাজের স্বাধীনতা শুধুমাত্র সিলেটের প্রার্থীরা আবেদন করবেন। ঠিকানা: Sadique Tower (3rd floor) Holding-871, Noyasorak, Sylhet-3100. Website : https://www.metlife.com.bd"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20573",
    "job_id": "20573",
    "company_name": "Bismillah Mobile",
    "job_title": "Unit Manager/General Manager/Gm",
    "location": "Gulshan, Mirpur",
    "salary": "TK. 30,000-150,000",
    "experience": "Fresher",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-22",
    "date_posted": "2026-02-25",
    "industry": "Management Staff",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ✳️ Job Summary\nThe General Manager will be responsible for the overall management, operational control, compliance, financial oversight, and business growth of the company’s three mobile retail shops dealing with imported mobile phone sets. The role requires strong leadership, integrity, discipline, and experience in administration and governance.\n\n🛄 Key Roles & Responsibilities\n✅ Business Growth & Planning\n- Develop detailed strategies, action plans, and timelines to increase the company’s products and services and expand business operations.\n- Identify opportunities for business improvement, operational efficiency, and sustainable growth.\n\n✅ Operations & Team Management\n- Oversee daily operations of all three mobile shops and ensure smooth workflow.\n- Lead, manage, and supervise shop managers and staff, ensuring discipline, coordination, and performance improvement.\n- Conduct regular shop visits and performance evaluations.\n\n✅ Customer Care & Service Excellence\n- Ensure high-quality customer care services across all outlets.\n- Maintain strong relationships with customers and resolve major complaints or disputes professionally.\n\n✅ Inventory & Asset Control\n- Monitor inward and outward movement of mobile phones and accessories.\n- Ensure proper documentation, IMEI records, stock registers, and prevention of stock loss or misuse.\n- Verify inventory reports and ensure transparency in stock management.\n\n✅ Financial Oversight & Confidentiality\n- Oversee all financial transactions of the company, including sales, expenses, cash handling, and bank deposits.\n- Supervise loan disbursement and recovery (if applicable) in accordance with company policies.\n- Maintain strict confidentiality of all financial transactions, records, and sensitive company information.\n\n✅ Compliance & Governance\n- Ensure compliance with government regulations, customs documentation, VAT, tax, and company policies.\n- Maintain proper records to support audits, inspections, and regulatory requirements.\n\n✅ Staff & Customer Welfare\n- Ensure customers and office staff receive all benefits, facilities, and entitlements as per company rules and policies.\n- Promote ethical practices, fairness, and professionalism within the organization.\n\n✅ Reporting & Coordination\n- Prepare and submit regular operational and financial reports to ownership/management.\n- Coordinate closely with accounts, operations, suppliers, and other stakeholders.\n- Report risks, irregularities, or operational issues promptly with recommendations for corrective action.\n\nPreferred Candidate Profile\nAge: 25-65 years\nBackground: Retired Army / Defense / Banker / College or University Teacher / Government Service\nStrong leadership, integrity, administrative experience, and decision-making ability\n\nRequirements: ✅ Required Documents Updated CV / Resume Recent passport-size photograph Photocopies of educational certificates Photocopy of National ID (NID) ✅ Required Qualifications & Skills Masters or equivalen"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20674",
    "job_id": "20674",
    "company_name": "Alim Enterprise",
    "job_title": "সেলসম্যান",
    "location": "Anywhere in Dhaka Division",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-20",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibility:\n1. Collect orders from customers in the market.\n2. Communicate with customers to provide product information and prices.\n3. Record orders after confirmation and report to the office.\n4. Provide delivery and payment information related to products to the office appropriately.\n5. Search for new customers and try to increase sales according to market demand.\n\nRequirements: Qualifications: Passed Secondary School Certificate (SSC)/Higher Secondary Certificate (HSC) Experience: Previous experience is good, but freshers can also apply Skills: Good communication skills Respectful and professional behavior Punctual and active in the market\n\nদায়িত্ব: মার্কেট থেকে গ্রাহকদের অর্ডার সংগ্রহ করা। গ্রাহকের সাথে যোগাযোগ করে পণ্যের তথ্য ও মূল্য জানানো। অর্ডার নিশ্চিত করার পর তা রেকর্ড করা এবং অফিসে রিপোর্ট করা। পণ্যের ডেলিভারি ও পেমেন্ট সংক্রান্ত তথ্য যথাযথভাবে অফিসে প্রদান করা। নতুন গ্রাহক খোঁজা এবং বাজারের চাহিদা অনুযায়ী বিক্রয় বাড়ানোর চেষ্টা করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20676",
    "job_id": "20676",
    "company_name": "Alim Enterprise",
    "job_title": "Packaging Man",
    "location": "Anywhere in Dhaka Division",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-22",
    "date_posted": "2026-02-25",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibilities:\n- Properly packaging and labeling products\n- Proper use and storage of packaging materials (boxes, polybags, tape, etc.)\n- Ensuring product quality is maintained and packaging is done quickly\n- Completing work according to daily targets\n- Following supervisor's instructions\n- Keeping work area clean and tidy\n\nRequirements: Qualifications: Minimum eighth grade / SSC (preferred) Experience in packaging work is a plus Must be physically fit and hardworking Punctual and responsible\n\nদায়িত্ব: পণ্য সঠিকভাবে প্যাকেট করা ও লেবেল লাগানো প্যাকেজিং ম্যাটেরিয়াল (বক্স, পলিব্যাগ, টেপ ইত্যাদি) ব্যবহার ও সংরক্ষণ পণ্যের গুণগত মান বজায় রেখে দ্রুত প্যাকেজিং সম্পন্ন করা দৈনিক টার্গেট অনুযায়ী কাজ শেষ করা সুপারভাইজারের নির্দেশনা অনুযায়ী কাজ করা কাজের জায়গা পরিষ্কার ও গোছানো রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20657",
    "job_id": "20657",
    "company_name": "Sher Agency (Metlife)",
    "job_title": "Financial Associate ",
    "location": "Bashabo, Motijheel, Malibagh, Rajarbagh, Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Job Title: 'Financial Associate' Job Description: In the position of Financial Associate, brighten your future and contribute to great work at 'Sher Agency' MetLife Bangladesh to fulfill your dreams. Why join MetLife as a Financial Associate? Your hard work and skills will quickly lead to opportunities for advancement. Financial Associate ----> Unit Manager ----> Branch Manager Financial Stability Achievements: 1. Quick start to earnings after joining 2. Annual average earnings of 40 lakh taka per person among top 50 performers 3. Annual average earnings of 20 lakh taka per person among top 100 performers, along with other bonuses 4. Special recognition and rewards for exceptional achievements. Opportunities for Fulfilling Dreams: 1. International and domestic travel 2. Recognition at international conferences 3. Medical coverage for family 4. Provident fund 5. Education scholarships for children Potential for Rapid Success: 1. World-class training facilities 2. Skilled trainers 3. Digital workspace 4. 100% online-based programs 5. Digital tools for sales and activity management Opportunities for Own Business: 1. Opportunity for personal business without any investment 2. Opportunities for rapid advancement based on performance, leading to roles as Unit Manager and later Branch Manager 3. Opportunity to start an agency in your own name 4. Work flexibility based on personal convenience Responsibility: Assist in providing health and financial protection to millions of people in the country. Establish and monitor relationships with clients to achieve business goals. Work Flexibility: Opportunities for part-time and full-time work. Contact: 'Sher Agency' MetLife, Bangladesh Address: LR Building, 1/2 Outer Circular Road (Ground Floor above Sonali Bank), Malibagh, Dhaka-1217. Phone Number: 01914488014 'If you are ready to take on challenges and want to embark on a successful career path, then apply today to join this dynamic team at Dhanantari.'\n\nRequirements: Qualification: HSC/ Bachelor's degree. Age: More than 25.\n\nপদের নাম: 'ফিনান্সিয়াল অ্যাসোসিয়েট' পদের  বিবরণ:  ফিনান্সিয়াল অ্যাসোসিয়েট পদে আপনার ভবিষ্যৎ উজ্জ্বল করুন এবং মহান কাজে যোগ দিন, 'শের এজেন্সি' মেটলাইফ বাংলাদেশ এ কাজ করে আপনার স্বপ্ন পূরণ করুন। কেন হবেন মেটলাইফ-এর ফিনান্সিয়াল অ্যাসোসিয়েট? নিজের পরিশ্রম এবং দক্ষতা কাজে লাগিয়ে দ্রুত পদোন্নতির সুযোগ ফিনান্সিয়াল অ্যাসোসিয়েট   ---->    ইউনিট ম্যানেজার    ----->    ব্রাঞ্চ ম্যানেজার আর্থিক স্বচ্ছলতা অর্জন: ১. যোগদানের পর দ্রুত আয় শুরু ২. সেরা ৫০ পারফর্মারদের জনপ্রতি বার্ষিক গড় আয় ৪০ লক্ষ টাকা ৩. সেরা ১০০ জনের বার্ষিক গড় আয় ২০ লক্ষ টাকা এবং সাথে অন্যান্য বোনাস ৪. বিশেষ অর্জনে স্বীকৃতিস্বরূপ বিশেষ সম্মাননা। স্বপ্নপূরণের সুযোগ: ১. আন্তর্জাতিক ভ্রমন ও অভ্যন্তরীন ভ্রমন ২. আন্তর্জাতিক সম্মেলনে সম্মাননা ৩. পরিবারের জন্য মেডিকেল কাভারেজ ৪. প্রভিডেন্ট ফান্ড ৫. সন্তানের জন্য শিক্ষা বৃত্তি দ্রুত সাফল্যের সম্ভাবনা: ১. বিশ্বমানের প্রশিক্ষণ ব্যবস্থা ২. দক্ষ প্রশিক্ষক ৩. ডিজিটাল ওয়ার্কস্পেস ৪. ১০০% অনলাইন ভিত্তিক কার্"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20667",
    "job_id": "20667",
    "company_name": " IFixFast",
    "job_title": "Customer Engagement Executive",
    "location": "Hatirpool",
    "salary": "TK. 12,000-35,000",
    "experience": "<1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Call Center",
    "vacancy": 150,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Call a specific number of customers every day Regularly update information tracking sheet during conversations with customers Provide correct and appropriate answers to customer questions Build and maintain a positive relationship with customers Achieve monthly sales targets Actively participate in teamwork Maintain punctuality and discipline\n\nRequirements: Educational Qualification: Completed HSC/Honors Or ongoing Honors Additional Requirements: Minimum 15 words per minute Bangla typing speed (mandatory) Prior experience in call center or customer service preferred Proficiency in CRM system usage Skill in customer handling Proficiency in tasks related to social media Skill in Google Sheets and data management Language Skills: Clear and accurate communication skills in Bengali Ability to speak professionally, politely, and clearly Compensation & Benefits: Basic Salary: 12,000 - 35,000 BDT Sales Incentive: Unlimited (Our call center agents currently receive sales incentives ranging from 20,000 to 30,000 taka) Festival Bonus: Twice a year (minimum 1 year of service required) Performance Bonus Salary Review: Yearly Working Hours: Morning 10:00 AM - Evening 7:00 PM 6 days a week\n\nপ্রতিদিন নির্দিষ্ট সংখ্যক কাস্টমারকে কল করা কাস্টমারের সাথে কথোপকথনের তথ্য ট্র্যাকিং শিটে নিয়মিত আপডেট করা কাস্টমারের প্রশ্নের সঠিক ও যথাযথ উত্তর প্রদান করা কাস্টমারের সাথে ইতিবাচক সম্পর্ক তৈরি ও বজায় রাখা মাসিক সেলস টার্গেট অর্জন করা টিমওয়ার্কে সক্রিয়ভাবে অংশগ্রহণ করা সময়ানুবর্তিতা ও শৃঙ্খলা বজায় রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20675",
    "job_id": "20675",
    "company_name": "Alim Enterprise",
    "job_title": "ড্রাইভার",
    "location": "All over Bangladesh",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-20",
    "date_posted": "2026-02-25",
    "industry": "Deliveryman",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Responsibility:\n- Delivering goods from the office or depot using a van.\n- Ensuring safe and timely delivery of goods.\n- Ensuring regular care and supervision of the van.\n- Proper completion of delivery-related documents.\n- Collaborating with colleagues or salespersons when necessary.\n\nRequirements: Qualifications: Valid driving license (van/lorry) required Experience preferred Punctual and responsible Skills: Safe and cautious driving Knowledge of market or road routes Respectful and professional behavior\n\nদায়িত্ব: অফিস বা ডিপো থেকে ভ্যান নিয়ে পণ্য ডেলিভারি করা। ডেলিভারির সময় নিরাপদে এবং সময়মতো পণ্য পৌঁছে দেওয়া। ভ্যানের নিয়মিত যত্ন এবং রক্ষণাবেক্ষণ নিশ্চিত করা। ডেলিভারি সংক্রান্ত কাগজপত্র যথাযথভাবে সম্পন্ন করা। প্রয়োজনে সহকর্মী বা সেলসম্যানদের সহযোগিতা করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20658",
    "job_id": "20658",
    "company_name": "Metlife (Sher Agency Shamima Unit)",
    "job_title": "Financial Associate",
    "location": "Paltan, Bashabo, Motijheel, Malibagh, Rajarbagh",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Call Center",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Job Title: 'Financial Associate' Job Description: Elevate your future with a position as a Financial Associate and contribute to great work at 'Sher Agency' Metlife Bangladesh to fulfill your dreams. Why join Metlife as a Financial Associate? Opportunity for rapid career advancement by utilizing your hard work and skills Financial Associate   ---->    Unit Manager    ----->    Branch Manager Financial Benefits: 1. Quick start to earnings post joining 2. Annual average earnings of 40 lakh taka for top 50 performers 3. Annual average earnings of 20 lakh taka for top 100 performers along with other bonuses 4. Special recognition and rewards for exceptional performance Opportunities for Fulfilling Dreams: 1. International and domestic travel opportunities 2. Recognition at international conferences 3. Medical coverage for family 4. Provident fund 5. Scholarships for children's education Potential for Rapid Success: 1. World-class training facilities 2. Skilled trainers 3. Digital workspace 4. 100% online-based programs 5. Digital tools for sales and activity management Opportunity for Own Business: 1. Opportunity to run your own agency without any investment 2. Rapid career advancement based on performance to become Unit Manager and then Branch Manager 3. Opportunity to start an agency in your own name 4. Work flexibility based on your convenience Responsibility: Assist in providing health and financial protection to millions of people in the country. Establish and monitor relationships with clients to achieve business goals. Work Flexibility: Opportunity for part-time and full-time work. Contact: 'Sher Agency' Shamima Nasrin (M.S.C , B.E.D) Unit Manager Metlife, Bangladesh Address: L.R Building, 1/2 Outer Circular Road (Ground floor above Sonali Bank), Malibagh, Dhaka-1217. Phone Number: 01915814199 'If you are ready to take on challenges and want to embark on a successful career path, then apply today to join this dynamic team at Durdanto.'\n\nRequirements: Qualification: HSC - Masters. Age: Over 18 years.\n\nপদের নাম: 'ফিনান্সিয়াল অ্যাসোসিয়েট' পদের  বিবরণ: ফিনান্সিয়াল অ্যাসোসিয়েট পদে আপনার ভবিষ্যৎ উজ্জ্বল করুন এবং মহান কাজে যোগ দিন, 'শের এজেন্সি' মেটলাইফ বাংলাদেশ এ কাজ করে আপনার স্বপ্ন পূরণ করুন। কেন হবেন মেটলাইফ-এর ফিনান্সিয়াল অ্যাসোসিয়েট? নিজের পরিশ্রম এবং দক্ষতা কাজে লাগিয়ে দ্রুত পদোন্নতির সুযোগ ফিনান্সিয়াল অ্যাসোসিয়েট   ---->    ইউনিট ম্যানেজার    ----->    ব্রাঞ্চ ম্যানেজার আর্থিক স্বচ্ছলতা অর্জন: ১. যোগদানের পর দ্রুত আয় শুরু ২. সেরা ৫০ পারফর্মারদের জনপ্রতি বার্ষিক গড় আয় ৪০ লক্ষ টাকা ৩. সেরা ১০০ জনের বার্ষিক গড় আয় ২০ লক্ষ টাকা এবং সাথে অন্যান্য বোনাস ৪. বিশেষ অর্জনে স্বীকৃতিস্বরূপ বিশেষ সম্মাননা। স্বপ্নপূরণের সুযোগ: ১. আন্তর্জাতিক ভ্রমন ও অভ্যন্তরীন ভ্রমন ২. আন্তর্জাতিক সম্মেলনে সম্মাননা ৩. পরিবারের জন্য মেডিকেল কাভারেজ ৪. প্রভিডেন্ট ফান্ড ৫. সন্তানের জন্য শিক্ষা বৃত্তি দ্রুত সাফল্যের সম্ভাবনা: ১. বিশ্বমানের প্রশিক্ষণ ব্যবস্থা ২. দক্ষ প্রশিক্ষক ৩. ডিজিটাল ওয়ার্কস্পেস ৪. ১০০% অনলাইন ভিত্তিক কার্যক্রম ৫. স"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20655",
    "job_id": "20655",
    "company_name": "Taobao project",
    "job_title": " E-commerce Data Annotator (Remote)",
    "location": "All over Bangladesh",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": null,
    "working_hours": "",
    "deadline": "2026-03-24",
    "date_posted": "2026-02-25",
    "industry": "Computer Operator/Data Entry Operator",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: As a Data Annotator, your main task will be to review and verify product information on Taobao's work platform. You will: - Assess whether product attributes are correct or incorrect.\n- Use common sense and available product details to correct any inaccuracies.\n- Ensure high-quality and accurate data for an enhanced e-commerce experience.\n\n⏰ Work Schedule: - Preferred Days: Monday to Saturday (7am to 3 pm)\n\n💰 Salary Details: - Payment Model: Task-based (per item).\n- Estimated Monthly Earnings:\n  Up to 15,000 BDT – 25,000 BDT , depending on your English proficiency, related work experience, and educational background.\n- You will receive your salary by the 22nd to 25th of every month.\n\n🎯 How to Apply: If you’re interested and meet the requirements, please send your resume/CV and a brief introduction (in English) to khayum6889@gmail.com Or add WhatsApp for further queries: 01400476889 Shortlisted candidates will be contacted for the next steps.\n\nRequirements: Requirements:\n- Must have a computer or laptop with good reading and typing skills\n- Proficient to advanced English language skills (written and comprehension).\n- Strong attention to detail and good judgment.\n- Ability to work independently with minimal supervision.\n- Previous experience in data annotation is a plus, but not mandatory.\n\nAs a Data Annotator, your main task will be to review and verify product information on Taobao's work platform. You will: Assess whether product attributes are correct or incorrect. Use common sense and available product details to correct any inaccuracies. Ensure high-quality and accurate data for an enhanced e-commerce experience. ⏰ Work Schedule: Preferred Days: Monday to Saturday (7am to 3 pm) 💰 Salary Details: Payment Model: Task-based (per item). Estimated Monthly Earnings: Up to 15,000 BDT – 25,000 BDT , depending on your English proficiency, related work experience, and educational background. You will receive your salary by the 22 to 25 of every month. 🎯 How to Apply: If you’re interested and meet the requirements, please send your resume/CV and a brief introduction (in English) to khayum6889@gmail.com Or add WhatsApp for further queries: 01400476889 Shortlisted candidates will be contacted for the next steps."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20672",
    "job_id": "20672",
    "company_name": "Amdox",
    "job_title": "Call Center Cum Social Media Executive",
    "location": "Hatirpool",
    "salary": "TK. 15,000-25,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Call Center",
    "vacancy": 25,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Rupayan Trade Centre (Level-17), Bangla Motor, Dhaka",
    "job_description": "Responsibilities: Manage and handle company social media platforms (Facebook, Instagram, etc.)\n- Respond to customer inquiries through messages and calls\n- Assist in executing online campaigns and promotions\n- Attend customer calls and provide solutions or forward to the concerned team\n- Maintain daily call and response records\n\nSalary:\n- Basic: 10,000 – 15,000 BDT\n- Incentive: Up to 20,000 BDT (based on performance)\n\nInterview Schedule:\n⏰ Time: 11:00 AM – 5:00 PM\n📍 Location: Amdox, Rupayan Trade Center, 17th Floor, Bangla Motor, Dhaka\n\nJob Type\nFull-time\n\nWorking Hours\n8 hours\n\nShift\nDay shift\n\nCompany Benefits\n- T/A\n- Mobile Bill\n- Performance Bonus\n- Salary Review: Yearly\n\nRequirements: Requirements:\n- Good communication skills in Bangla (English is a plus)\n- Basic knowledge of social media handling\n- Call center or customer support experience is a plus\n- Must be punctual, responsible, and well-presented\n\nEnglish & Bangla Typing Skill: 15-20 words per minute (Avro or Bijoy)\n\nManage and handle company social media platforms (Facebook, Instagram, etc.) - Respond to customer inquiries through messages and calls - Assist in executing online campaigns and promotions - Attend customer calls and provide solutions or forward to the concerned team - Maintain daily call and response records Salary: - Basic: 10,000 – 15,000 BDT - Incentive: Up to 20,000 BDT (based on performance) Interview Schedule: ⏰ Time: 11:00 AM – 5:00 PM 📍 Location: Amdox, Rupayan Trade Center, 17th Floor, Bangla Motor, Dhaka চাকরির ধরন ফুল-টাইম কাজের সময় ৮ ঘন্টা কাজের শিফট ডে শিফট কোম্পানীর সুযোগ সুবিধাদি T/A Mobile Bill Performance Bonus Salary Review: Yearly"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20659",
    "job_id": "20659",
    "company_name": "Uthshob Clothing",
    "job_title": "Sales Representative",
    "location": "Dhaka",
    "salary": "TK. 10,000-12,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road: 12, Sector: 11, Uttara, Dhaka",
    "job_description": "Responsibilities: - Promote and demonstrate company products to customers inside.\n- Explain product features, benefits, pricing, and offers clearly.\n- Engage with walk-in customers and encourage product purchase.\n- Maintain attractive product display and ensure proper visibility.\n- Distribute promotional materials (leaflets, brochures, samples, etc.).\n- Collect customer feedback and report insights to management.\n- Actively promote products in the shop to the customer.\n- Attract potential customers and generate leads.\n- Support salesmen to achieve daily and monthly sales targets.\n\nPromote and demonstrate company products to customers inside. Explain product features, benefits, pricing, and offers clearly. Engage with walk-in customers and encourage product purchase. Maintain attractive product display and ensure proper visibility. Distribute promotional materials (leaflets, brochures, samples, etc.). Collect customer feedback and report insights to management. Actively promote products in the shop to the customer. Attract potential customers and generate leads. Support salesmen to achieve daily and monthly sales targets."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20671",
    "job_id": "20671",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Anywhere in Dhaka Division, Dhanmondi, Old Dhaka, Mohammadpur, Jatrabari",
    "salary": "TK. 11,500-18,100",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Job Type: 1. Team sales in designated area booth. 2. Present service information clearly to pedestrians and potential customers. 3. Assist in selecting appropriate packages according to customer demands. 4. Inform customers about pre-sales and after-sales services. 5. Explain terms and conditions at each sale and transfer membership cards.\n\nRequirements: Position Location (a specific area): Dhaka North: Mohakhali, Mirpur, Dhanmondi, Gulshan, Tejgaon, Badda, Hatirjheel, Bashundhara, Farmgate, Shyamoli, Kalyanpur Dhaka South: Jatrabari, Mugda, Sutrapur, Puran Dhaka, Azimpur, Gulistan, Paltan, Motijheel, Sadarghat, Khilgaon, Narayanganj Dhaka Outer: Savar, Manikganj, Narayanganj, Gazipur, Mymensingh Qualifications: HSC or Bachelor's degree, 6 months of sales experience (freshers can apply) Age: 19+ After confirmation Salary and Benefits: - Basic: 11,500 - 12,000 BDT - Allowance and Commission: 2,600 + 3,000-25,000 BDT - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nকাজের ধরন: 1. নির্দিষ্ট এরিয়ায় বুথে দলগতভাবে সেলস। 2. পথচারী ও সম্ভাব্য কাস্টমারদের কাছে গিয়ে সার্ভিস সম্পর্কে স্পষ্টভাবে তথ্য উপস্থাপন করা। 3. কাস্টমারদের চাহিদা অনুযায়ী উপযুক্ত প্যাকেজ বেছে নিতে সহায়তা করা। 4. কাস্টমারকে বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী সেবা সম্পর্কে অবহিত করা। 5. প্রতিটি বিক্রয়ের সময় শর্তাবলী বুঝিয়ে মেম্বারশিপ কার্ড হস্তান্তর করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20673",
    "job_id": "20673",
    "company_name": "Barikoi Technologies Limited",
    "job_title": "Trainee Field Operation Executive",
    "location": "Dhaka",
    "salary": "TK. 14,000-15,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Contractual",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 25,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Dr Mohsin Plaza, House 2/7, Begum Rokeya Sarani, Pallabi, Mirpur, Dhaka",
    "job_description": "Responsibilities: Visiting homes and offices for verifying information for the bank Training will be provided at each step 👉 Watch the video to learn more about the job: https://youtu.be/w9ZIMMuwmEc Salary and Allowance: For motorcycle users: 👉 Monthly 14,000 Taka + 3,000 Taka (fuel cost) For bicycle / electric bicycle users: 👉 Monthly 15,000 Taka Mobile bill: 500 Taka Note: Probation period: 6 months. (Permanent after 6 months)\n\nRequirements: Priority for having own motorcycle (with documents) / bicycle Proficiency in reading and writing in Bengali and English Must have an Android smartphone Knowledge of using Google Map and Barikoi Map Must have the mentality to work in the field Ability to work outside for 8-10 hours daily 🎁 Other Benefits Applicable upon conditions: Training allowance Annual refreshment trip Festival allowance Opportunity for promotion Salary review Personal loan facility 👉 Details will be provided during the interview.\n\nব্যাংকের কাজে বাসা ও অফিস ভিজিট করে তথ্য যাচাই করা প্রতিটি ধাপে প্রশিক্ষণ প্রদান করা হবে 👉 কাজ সম্পর্কে বিস্তারিত জানতে ভিডিওটি দেখুন: https://youtu.be/w9ZIMMuwmEc বেতন ও ভাতা: মোটরসাইকেল ব্যবহারকারীদের জন্য: 👉 মাসিক ১৪,০০০ টাকা + ৩,০০০ টাকা (ফুয়েল খরচ) সাইকেল / ইলেকট্রিক সাইকেল ব্যবহারকারীদের জন্য: 👉 মাসিক ১৫,০০০ টাকা মোবাইল বিল: ৫০০ টাকা N>B= প্রবেশন সময়কালঃ ৬ মাস। (৬ মাস পর পার্মার্মনেন্ট করা হবে )"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20664",
    "job_id": "20664",
    "company_name": "F. S BUSINESS CORPORATION LTD (FSBC)",
    "job_title": "CCTV Technician",
    "location": "Uttara",
    "salary": "TK. 15,000-20,000",
    "experience": "1-3 years",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Technician",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "5th Floor, 5/B ,House#12, Road# 04, SECTOR #01, UTTARA-1230,BANGLADESH.",
    "job_description": "Responsibilities: Responsibilities of a CCTV Technician:\n\nSetting up CCTV systems, including cameras, wiring, and recording devices, as well as configuring software and network connections.\n\nRegularly inspecting and testing CCTV equipment to ensure optimal performance and identifying potential issues before they escalate.\n\nDiagnosing and repairing faults in CCTV systems, including camera malfunctions, wiring problems, and software errors.\n\nProject Maintenance Works.\n\n- Troubleshooting & Repair: Diagnose, repair, or replace broken components (cameras, cabling, power supplies, NVRs/DVRs).\n- Documentation: Maintain accurate service logs, system configurations, and maintenance reports.\n\nInteracting with clients to address their concerns, provide support, and explain the operation of the system.\n\nProvide technical support to users, troubleshoot issues, and ensure the smooth and secure operation of IT infrastructure. IT Technicians are essential for maintaining an organization's technological capabilities and productivity. Configuring, monitoring, and maintaining LAN/WAN networks, ensuring network security and connectivity.\n\n- Experience: Proven experience as a CCTV Technician, with 2-3 years preferred.\n\nAbility to work at heights and in various weather conditions. Ability to UTP /Fiber Cable laying.\n\nRequirements: ```html EDUCATIONAL QUALIFICATION: — Diploma degree in computer engineering. — Must be need IT/Telecom/ISP/Online business-related field experience. Technical Skills: Proficiency with IP networking, Windows OS , and VMS software. Hardware Knowledge: Familiarity with PTZ, analog, and IP camera systems, as well as fiber optics or coax cabling. ```\n\nResponsibilities of a CCTV Technician: Setting up CCTV systems, including cameras, wiring, and recording devices, as well as configuring software and network connections. Regularly inspecting and testing CCTV equipment to ensure optimal performance and identifying potential issues before they escalate. Diagnosing and repairing faults in CCTV systems, including camera malfunctions, wiring problems, and software errors. Project Maintenance Works. Troubleshooting & Repair: Diagnose, repair, or replace broken components (cameras, cabling, power supplies, NVRs/DVRs). Documentation: Maintain accurate service logs, system configurations, and maintenance reports. Interacting with clients to address their concerns, provide support, and explain the operation of the system. Provide technical support to users, troubleshoot issues, and ensure the smooth and secure operation of IT infrastructure. IT Technicians are essential for maintaining an organization's technological capabilities and productivity . Configuring, monitoring, and maintaining LAN/WAN networks, ensuring network security and connectivity. Experience: Proven experience as a CCTV Technician, with 2-3 years preferred. Ability to work at heights and in various weather conditions. Ability to UTP /Fiber Cable laying."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20669",
    "job_id": "20669",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Gazipur, Tongi, Tangail, Narsingdi, Savar",
    "salary": "TK. 11,200-18,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Job Type: 1. Sales team in a specific area at the booth. 2. Clearly present information about services to pedestrians and potential customers. 3. Assist in selecting appropriate packages according to customer demands. 4. Inform customers about pre-sales and after-sales services. 5. Transfer membership cards by explaining terms and conditions at each sale.\n\nRequirements: Position Location (a specific area): Dhaka Outer: Savar, Manikganj, Narshingdi, Gazipur, Mymensingh Qualifications: HSC or Graduate, 6 months sales experience (freshers applicable) Age: 19+ After confirmation Salary and Benefits: - Basic: 11,200 - 12,000 Taka - Allowance and Commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nকাজের ধরন: 1. নির্দিষ্ট এরিয়ায় বুথে দলগতভাবে সেলস। 2. পথচারী ও সম্ভাব্য কাস্টমারদের কাছে গিয়ে সার্ভিস সম্পর্কে স্পষ্টভাবে তথ্য উপস্থাপন করা। 3. কাস্টমারদের চাহিদা অনুযায়ী উপযুক্ত প্যাকেজ বেছে নিতে সহায়তা করা। 4. কাস্টমারকে বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী সেবা সম্পর্কে অবহিত করা। 5. প্রতিটি বিক্রয়ের সময় শর্তাবলী বুঝিয়ে মেম্বারশিপ কার্ড হস্তান্তর করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20678",
    "job_id": "20678",
    "company_name": "Paikarighor-পাইকারিঘর ",
    "job_title": "Customer Service & Telesales ExeExecutive ",
    "location": "Nikunjo",
    "salary": "TK. 13,000-27,000",
    "experience": "<1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 100,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road 14, House 26, Nikunjo 2",
    "job_description": "Responsibilities: Make inbound & outbound calls / chats with potential customers Clearly explain products/services to customers Handle customer queries & objections professionally Convert queries into sales opportunities Work closely with team leaders & managers to achieve targets 💰 Salary: Fixed: ৳46/hour KPI Bonus: ৳12/hour Average Duty: 6 to 9 hours/day Monthly Earning Range (with KPI): ৳10,000 – ৳14,000 🕑 Duty Schedule: 24/7 service, roster-based duty 🚍 Transport Facility: Available at 12:00 AM & 01:30 AM Route: Nikunjo → Abdullahpur → Badda Link Road → Mohakhali → Banani (last stoppage)\n\nRequirements: 👤 Candidate Requirement:\n- Age: 18 – 30 years\n- Education: HSC pass / Current University Students / Freshers encouraged to apply\n- Skills:\n  - Good typing skills in Bangla (Avro/Bijoy) & English\n  - Customer service / Sales communication skills\n- Experience: Not required – just willingness to learn & positive attitude!\n\nMake inbound & outbound calls / chats with potential customers Clearly explain products/services to customers Handle customer queries & objections professionally Convert queries into sales opportunities Work closely with team leaders & managers to achieve targets 💰 Salary: Fixed: ৳46/hour KPI Bonus: ৳12/hour Average Duty: 6 to 9 hours/day Monthly Earning Range (with KPI): ৳13,000 – ৳27,000 🕑 Duty Schedule: 24/7 service, roster-based duty 🚍 Transport Facility: Available at 12:00 AM & 01:30 AM Route: Nikunjo → Abdullahpur → Badda Link Road → Mohakhali → Banani (last stoppage)"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20666",
    "job_id": "20666",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান(সাইকেলিস্ট)",
    "location": "Notun Bajar, Badda, Mirpur, Rajarbagh, Lalmatia",
    "salary": "TK. 9,834-13,434",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: In areas like Badda, Rajarbag, Mirpur, Lalmatia, and Dhalibari (Vatara), there are vacancies. Salary: Cyclist: 9,834 - 13,434 taka. (Having a bicycle is necessary) · Shifts from 7 am, 9 am, and 10:45 am. 12-hour duty. · One day off after every 3 days, 8 days off per month. . Monthly mobile bill provided. -> Delivery bonus: · 10 taka bonus for each delivery from 18 to 24, · 15 taka bonus for all deliveries after 24. Incentive arrangement is available. -> Other facilities: · Salary increase after six months. · Festival allowance given twice a year. · 14 days sick leave per year after six months. · 11 days festival leave per year after six months. · 12 days earned leave per year after six months. · 10 days casual leave per year after six months Contact today to join: 01401153402\n\nRequirements: Terms and Conditions:\nCyclist must have a bicycle in the post.\nMust be 18 years old.\n\nবাড্ডা, রাজারবাগ, মিরপুর, লালমাটিয়া, ঢালীবাড়ি (ভাটারা) এই এরিয়াগুলোতে ভ্যাকেন্সি আছে. বেতন: সাইক্লিস্টঃ ৯,৮৩৪ - ১৩,৪৩৪ টাকা। (সাইকেল থাকা আবশ্যক) · সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । · ৩ দিন পর পর ১ দিন ছুটি, মাসে ৮ দিন ছুটি . মাসিক মোবাইল বিল প্রদান করা হয়। -> ডেলিভারি বোনাসঃ · ১৮ থেকে ২৪ প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস, · ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস। ইনসেন্টিভ এর ব্যবস্থা রয়েছে ->অন্যান্য সুবিধা সমুহঃ · ছয় মাস পর বেতন বৃদ্ধি পাবে। · বছরে দুইবার উৎসব ভাতা দেয়া হয়। · ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় যোগদান করতে আজই আজ ই যোগাযোগ করুন: 01401153402"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20681",
    "job_id": "20681",
    "company_name": "HANSA Management Ltd",
    "job_title": "সিকিউরিটি গার্ড  ( প্রিমিয়াম )",
    "location": "Anwara, Uttara, Cox's Bazar, Kishoreganj, Kurigram, Comilla, Kushtia, Khagrachhari, Khulna, Gaibandha, Gazipur, Gulshan-Banani, Gopalganj, Chittagong, Chandpur, Chapai Nawabganj, Chuadanga, Joypurhat, Jamalpur, Jhalokati, Jhenaidah, Tangail, Thakurgaon, Dhaka, Dinajpur, Dhanmondi, Naogaon, Narail, Narsingdi, Natore, Narayanganj, Nilphamari, Netrokona, Noakhali, Panchagarh, Patiya, Patuakhali, Pabna, Pirojpur, Old Dhaka, Faridpur, Feni, Bogra, Barguna, Barisal, Bagerhat, Bandarban, Brahmanbaria, Bhola, Mymensingh, Magura, Madaripur, Manikganj, Mirpur, Munshiganj, Meherpur, Moulvibazar, Jessore, Jatrabari, Rangpur, Rangamati, Rajbari, Rajshahi, Lakshmipur, Lalmonirhat, Lohagara, Shariatpur, Sherpur, Satkhira, Savar, Sirajganj, Sylhet, Sitakundo, Sunamganj, Habiganj",
    "salary": "TK. 16,500",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Security/Support Service",
    "vacancy": 100,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Borak Mehnur, 51/B Kemal Ataturk Avenue, Banani, Dhaka-1213",
    "job_description": "Responsibilities: ```html Qualifications: Minimum height: 5'6\" Weight: Proportionate to height Must be physically fit Minimum educational qualification: HSC pass Experience: 0-6 months (Preference for experienced candidates) Maximum age: 45 years💼 Attractive salary and other benefits will be provided. Type of Job Full-time Working Hours 12 hours ```\n\nযোগ্যতা: ন্যূনতম উচ্চতা: ৫’৬” ওজন: উচ্চতা অনুযায়ী মানসম্মত শারীরিকভাবে ফিট হতে হবে ন্যূনতম শিক্ষাগত যোগ্যতা: এসএসসি পাশ অভিজ্ঞতা: ০–৬ মাস (অভিজ্ঞ প্রার্থীদের অগ্রাধিকার) সর্বোচ্চ বয়স: ৪৫ বছর💼 আকর্ষণীয় বেতন ও অন্যান্য সুযোগ-সুবিধা প্রদান করা হবে। চাকরির ধরন ফুল-টাইম কাজের সময় ১২ ঘন্টা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20668",
    "job_id": "20668",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Anywhere in Dhaka Division, Dhanmondi, Old Dhaka, Mohammadpur, Jatrabari",
    "salary": "TK. 11,500-18,100",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Job Type: 1. Team-based sales in a specific area at the booth. 2. Present service information clearly to pedestrians and potential customers. 3. Assist in selecting appropriate packages according to customer demands. 4. Inform customers about pre-sales and after-sales services. 5. Explain terms and conditions at each sale and transfer membership cards.\n\nRequirements: Workplace location (a specific area): Dhaka North: Mohakhali, Mirpur, Dhanmondi, Gulshan, Tejgaon, Badda, Hatirjheel, Basundhara, Farmgate, Shyamoli, Kalyanpur Dhaka South: Jatrabari, Mugda, Sutrapur, Puran Dhaka, Azimpur, Gulistan, Paltan, Motijheel, Sadarghat, Khilgaon, Narayanganj Dhaka Outer: Savar, Manikganj, Narayanganj, Gazipur, Mymensingh Qualifications: HSC or Graduate, 6 months sales experience (freshers applicable) Age: 19+ After confirmation Salary and benefits: - Basic: 11,500 – 12,000 Taka - Allowance and commission: 2,600 + 3,000–25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nকাজের ধরন: 1. নির্দিষ্ট এরিয়ায় বুথে দলগতভাবে সেলস। 2. পথচারী ও সম্ভাব্য কাস্টমারদের কাছে গিয়ে সার্ভিস সম্পর্কে স্পষ্টভাবে তথ্য উপস্থাপন করা। 3. কাস্টমারদের চাহিদা অনুযায়ী উপযুক্ত প্যাকেজ বেছে নিতে সহায়তা করা। 4. কাস্টমারকে বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী সেবা সম্পর্কে অবহিত করা। 5. প্রতিটি বিক্রয়ের সময় শর্তাবলী বুঝিয়ে মেম্বারশিপ কার্ড হস্তান্তর করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20680",
    "job_id": "20680",
    "company_name": "Ahmadia Trading",
    "job_title": "Video Editor & Motion Designer",
    "location": "Mohakhali",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Graphics",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "32/A,Salaha Monjil, Beside Mohakhali bazar",
    "job_description": "Responsibilities: We are looking for a creative and detail-oriented Video Editor & Motion Designer to join our team. The selected candidate will be responsible for editing videos, creating motion graphics, and producing engaging visual content for digital platforms, marketing campaigns, and promotional materials.\n\nJob Responsibilities:\n\n- Edit raw footage into compelling, polished videos for social media, websites, and promotional materials\n- Follow scripts, outlines, or storyboards to arrange footage in a logical sequence\n- Apply transitions, effects, motion graphics, titles, and captions\n- Add music, voice-overs, and sound effects for balanced audio\n- Perform trimming, cropping, resizing, color grading, stabilization, and rendering\n- Ensure all video content follows brand guidelines and quality standards\n- Collaborate with marketing and creative teams\n- Check videos for errors and technical issues before final delivery\n- Stay updated with the latest video editing trends and technologies\n\nRequirements: Additional Requirements\n\n- Age 20 to 35 years\n- Proven experience in video editing\n- Proficiency in: Adobe Premiere Pro, Adobe After Effects, Final Cut Pro, DaVinci\n- Resolve excellent storytelling and visual sense\n- Strong organizational and time management skills\n- Ability to work independently and in a team\n- Creative mindset with a passion for video production\n- Marketing-related experience will be an advantage\n\nWe are looking for a creative and detail-oriented Video Editor & Motion Designer to join our team. The selected candidate will be responsible for editing videos, creating motion graphics, and producing engaging visual content for digital platforms, marketing campaigns, and promotional materials. Job Responsibilities Edit raw footage into compelling, polished videos for social media, websites, and promotional materials Follow scripts, outlines, or storyboards to arrange footage in a logical sequence Apply transitions, effects, motion graphics, titles, and captions Add music, voice-overs, and sound effects for balanced audio Perform trimming, cropping, resizing, color grading, stabilization, and rendering Ensure all video content follows brand guidelines and quality standards Collaborate with marketing and creative teams Check videos for errors and technical issues before final delivery Stay updated with the latest video editing trends and technologies"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20684",
    "job_id": "20684",
    "company_name": "HANSA Management Ltd",
    "job_title": "জেনারেল প্লাস সিকিউরিটি গার্ড",
    "location": "Anwara, Uttara, Cox's Bazar, Kishoreganj, Kurigram, Comilla, Kushtia, Khagrachhari, Khulna, Gaibandha, Gazipur, Gulshan-Banani, Gopalganj, Chittagong, Chandpur, Chapai Nawabganj, Chuadanga, Joypurhat, Jamalpur, Jhalokati, Jhenaidah, Tangail, Thakurgaon, Dhaka, Dinajpur, Dhanmondi, Naogaon, Narail, Narsingdi, Natore, Narayanganj, Nilphamari, Netrokona, Noakhali, Panchagarh, Patiya, Patuakhali, Pabna, Pirojpur, Old Dhaka, Faridpur, Feni, Bogra, Barguna, Barisal, Bagerhat, Bandarban, Brahmanbaria, Bhola, Mymensingh, Magura, Madaripur, Manikganj, Mirpur, Munshiganj, Meherpur, Moulvibazar, Jessore, Jatrabari, Rangpur, Rangamati, Rajbari, Rajshahi, Lakshmipur, Lalmonirhat, Lohagara, Shariatpur, Sherpur, Satkhira, Savar, Sirajganj, Sylhet, Sitakundo, Sunamganj, Habiganj",
    "salary": "TK. 14,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Security/Support Service",
    "vacancy": 100,
    "shift": "Other",
    "country": null,
    "company_address": "Borak Mehnur, 51/B Kemal Ataturk Avenue, Banani, Dhaka-1213",
    "job_description": "Responsibilities: We are looking for General Plus Security Guards who will have loyalty and dedication. Qualifications: Minimum height: 5'6\" Weight according to height Minimum educational qualification: SSC Pass Maximum age: 45 years 💼 Attractive salary and career advancement opportunities. Job Type Full-time\n\nআমরা খুঁজছি জেনারেল প্লাস সিকিউরিটি গার্ড , যাদের মধ্যে থাকবে নিষ্ঠা ও শৃঙ্খলা। যোগ্যতা: ন্যূনতম উচ্চতা: ৫’৬” উচ্চতা অনুযায়ী স্বাভাবিক ওজন ন্যূনতম শিক্ষাগত যোগ্যতা: এসএসসি পাশ সর্বোচ্চ বয়স: ৪৫ বছর 💼 আকর্ষণীয় বেতন এবং ক্যারিয়ার উন্নতির সুযোগ। চাকরির ধরন ফুল-টাইম"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20677",
    "job_id": "20677",
    "company_name": "Ahmadia Trading",
    "job_title": "Accounts Executive",
    "location": "Mohakhali",
    "salary": "TK. 28,000-30,000",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Accounts/Finance/Audit",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "32/A,Salaha Monjil, Beside Mohakhali bazar",
    "job_description": "Responsibilities: Core Responsibilities\n- Handle day-to-day accounting (cash, bank, petty cash, journals)\n- Prepare event-wise budgets and track actual vs planned cost\n- Manage vendor bills, advances, and final settlements\n- Issue client invoices and follow up for payments (this is critical)\n- Maintain receivables & payables reports\n\nEvent-Specific Duties\n- Control event-wise expense tracking (fabrication, manpower, logistics, F&B, artists, etc.)\n- Verify vendor quotations, PO, and bills before payment\n- Ensure on-site cash disbursement is documented properly\n- Close accounts event-by-event after execution\n\nFinancial Control & Compliance\n- Maintain VAT, Tax, TDS records\n- Assist in monthly closing & audit support\n- Ensure company policies are followed in spending\n- Maintain proper bill files & digital records\n\nCoordination & Reporting\n- Coordinate with Project Managers & Operations team\n- Prepare profit/loss reports per event\n- Submit management financial reports\n- Support decision-making with cost insights\n\nTools & Skills Expected\n- Strong in Excel / Google Sheets\n- Knowledge of Tally / accounting software\n- Good understanding of event costing\n- Detail-oriented, deadline-driven mindset\n\nRequirements: Requirements\n- Bachelor’s degree in Accounting / Finance / Business Administration\n- 2-4 years experience in accounts\n- Strong knowledge of basic accounting principles\n- Hands-on experience with Tally / accounting software\n- Excellent command over MS Excel / Google Sheets\n- Ability to manage event-wise costing & expense tracking\n- Knowledge of VAT, Tax & compliance (practical, not textbook)\n- Experience handling vendor bills, payments & client invoicing\n- Strong attention to detail and accuracy\n- Ability to work under tight deadlines & pressure (events don’t wait)\n- Good communication & coordination skills\n- Honest, organized, and responsible mindset\n\nOptional (Adds Extra Value)\n- Experience in event management / advertising agency\n- Knowledge of petty cash & on-site cash handling\n- Understanding of budget control & P/L reporting\n\nCore Responsibilities Handle day-to-day accounting (cash, bank, petty cash, journals) Prepare event-wise budgets and track actual vs planned cost Manage vendor bills, advances, and final settlements Issue client invoices and follow up for payments (this is critical) Maintain receivables & payables reports Event-Specific Duties Control event-wise expense tracking (fabrication, manpower, logistics, F&B, artists, etc.) Verify vendor quotations, PO, and bills before payment Ensure on-site cash disbursement is documented properly Close accounts event-by-event after execution Financial Control & Compliance Maintain VAT, Tax, TDS records Assist in monthly closing & audit support Ensure company policies are followed in spending Maintain proper bill files & digital records Coordination & Reporting Coordinate with Project Managers & Operations team Prepare profit/loss reports per event Submit management financial reports Support dec"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20685",
    "job_id": "20685",
    "company_name": "NAGORIK HOLDINGS LIMITED",
    "job_title": "অফিস সহায়ক ",
    "location": "Chittagong",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "General Management/Admin",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Bangobandhu Avenue, Oxygen Moor, Bayezid Bostami, Chattogram.",
    "job_description": "Responsibilities: Candidates with at least 3 years of relevant experience will be given priority in the related job.\n\nRequirements: Three years of practical experience in the relevant field\n\nসংশ্লিষ্ট কাজে ০৩ বছরের বাস্তব অভিজ্ঞতাসম্পন্ন প্রার্থীদের অগ্রাধিকার দেওয়া হবে ।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20679",
    "job_id": "20679",
    "company_name": "NAGORIK HOLDINGS LIMITED",
    "job_title": "মালী ",
    "location": "Chittagong",
    "salary": "TK. 6,000-8,000",
    "experience": "1-3 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Household",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Bangobandhu Avenue, Oxygen Moor, Bayezid Bostami, Chattogram.",
    "job_description": "Responsibilities: Candidates with at least 3 years of relevant experience will be given priority in the related job.\n\nRequirements: Three years of practical experience in the relevant field\n\nসংশ্লিষ্ট কাজে ০৩ বছরের বাস্তব অভিজ্ঞতাসম্পন্ন প্রার্থীদের অগ্রাধিকার দেওয়া হবে ।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20686",
    "job_id": "20686",
    "company_name": "M/S. Ambreen Fragrance",
    "job_title": "বিক্রয়কর্মী",
    "location": "Uttara",
    "salary": "TK. 10,000-12,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House No: 67, Road No: 5, Uttara, Dhaka",
    "job_description": "Responsibilities: Increase sales of products/services. Maintain relationships with new and existing customers. Conduct market surveys and prepare reports. Achieve monthly sales targets. Keen on sales and marketing activities. Must have communication skills and presentation abilities. Should be proficient in using smartphones and basic accounting.\n\nপন্য / সেবার বিক্রয় বৃদ্ধি। নতুন কাষ্টমার সংগ্রহ ও পুরনো কাষ্টমারের সাথে সম্পর্ক বজায় রাখা। মার্কেট সার্ভে ও রিপোর্ট প্রস্তুত করা। মাসিক বিক্রয় টার্গেট পূরণ করা। সেলস্ এন্ড মার্কেটিং কাজে আগ্রহী। যোগাযোগ দক্ষতা এবং উপস্থাপন ক্ষমতা থাকতে হবে। স্মার্ট ফোন ব্যবহার ও সাধারণ হিসাবের দক্ষ থাকতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20683",
    "job_id": "20683",
    "company_name": "NAGORIK HOLDINGS LIMITED",
    "job_title": "নিরাপত্তা প্রহরী ",
    "location": "Chittagong",
    "salary": "TK. 8,000-10,000",
    "experience": "1-3 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Security/Support Service",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Bangobandhu Avenue, Oxygen Moor, Bayezid Bostami, Chattogram.",
    "job_description": "Responsibilities: Candidates with at least 3 years of relevant experience will be given priority in the related job.\n\nRequirements: Candidates with at least 3 years of relevant experience will be given priority in the related job.\n\nসংশ্লিষ্ট কাজে ০৩ বছরের বাস্তব অভিজ্ঞতাসম্পন্ন প্রার্থীদের অগ্রাধিকার দেওয়া হবে ।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20665",
    "job_id": "20665",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান (বাইকার)",
    "location": "Chittagong",
    "salary": "TK. 10,318-13,918",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Salary:- Biker: 10,318 - 13,918 taka. (Driving license required) · Shifts from 7 am, 9 am, and 10:45 am. 12 hours duty. · 1 day off after every 3 days, 8 days off per month. . Monthly mobile bill provided. -> Delivery Bonus: · 10 taka bonus for each delivery from 18 to 24, · 15 taka bonus for all deliveries after 24. Incentive scheme available ->Other facilities: · Salary increment after six months. · Festival allowance given twice a year. · 14 days sick leave per year from six months onwards. · 11 days festival leave per year from six months onwards. · 12 days paid leave per year from six months onwards. · 10 days casual leave per year from six months onwards Contact today to join: 01401153402\n\nRequirements: Terms and Conditions:\nDriving license is mandatory.\nMust be at least 21 years old.\n\nবেতন:- বাইকার: ১০,৩১৮ - ১৩,৯১৮টাকা। (ড্রাইভিং লাইসেন্স থাকা আবশ্যক) · সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । · ৩ দিন পর পর ১ দিন ছুটি, মাসে ৮ দিন ছুটি . মাসিক মোবাইল বিল প্রদান করা হয়। -> ডেলিভারি বোনাসঃ · ১৮ থেকে ২৪ প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস, · ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস। ইনসেন্টিভ এর ব্যবস্থা রয়েছে ->অন্যান্য সুবিধা সমুহঃ · ছয় মাস পর বেতন বৃদ্ধি পাবে। · বছরে দুইবার উৎসব ভাতা দেয়া হয়। · ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় যোগদান করতে আজ ই যোগাযোগ করুন: 01401153402"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20687",
    "job_id": "20687",
    "company_name": "Patwary Stationery",
    "job_title": "শপ ম্যানেজার",
    "location": "Uttara",
    "salary": "TK. 15,000",
    "experience": "6 months - 1 year",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Management Staff",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road: 12, Shop No: 33, Uttara",
    "job_description": "Responsibilities: Provide appropriate reception and product suggestions to incoming customers at the store Know and sell a list of stationery, gift items, office supplies, etc. Product display, shelf management, and keeping the store clean and tidy Prepare bills, handle cash, and maintain sales accounts Generate daily sales reports, monitor stock, and inform about the demand for necessary products Listen to and assist in resolving customer complaints\n\nদোকানে আগত কাস্টমারদের যথাযথ রিসিভ ও প্রয়োজন অনুযায়ী প্রোডাক্ট সাজেশন দেওয়া স্টেশনারী, গিফট আইটেম, অফিস সাপ্লাই ইত্যাদি সামগ্রীর তালিকা জানা ও বিক্রয় করা প্রোডাক্ট ডিসপ্লে, শেলফ ম্যানেজমেন্ট এবং দোকান পরিষ্কার-পরিচ্ছন্ন রাখা বিল তৈরি, ক্যাশ হ্যান্ডলিং ও বিক্রির হিসাব সংরক্ষণ প্রতিদিনের সেলস রিপোর্ট তৈরি করাস্টক মনিটরিং ও প্রয়োজনীয় পণ্যের ডিমান্ড জানানো কাস্টমারের অভিযোগ শোনা ও সমাধানে সহায়তা করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20663",
    "job_id": "20663",
    "company_name": " IFixFast",
    "job_title": "Graphics Designer",
    "location": "Hatirpool",
    "salary": "TK. 20,000-30,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Graphics/Video Editor",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Rupayan Trade Center 17 Floor, 114 Kazi Nazrul Islam Avenue Banglamotor, Dhaka 1000, Dhaka, Bangladesh",
    "job_description": "Responsibilities: - Design social media creatives, digital banners, posters, and marketing materials.\n- Collaborate with marketing and content teams to develop visual concepts.\n- Maintain consistent brand identity across all platforms.\n- Edit images and graphics as per campaign needs.\n- Deliver designs within tight deadlines.\n\nRequirements: - Proficient in Adobe Photoshop, Illustrator, and other relevant tools.\n- At least 1-2 years of experience in graphic design (portfolio required).\n- Strong creative sense and attention to detail.\n- Ability to work independently and as part of a team.\n\n- Design social media creatives, digital banners, posters, and marketing materials. - Collaborate with marketing and content teams to develop visual concepts. - Maintain consistent brand identity across all platforms. - Edit images and graphics as per campaign needs. - Deliver designs within tight deadlines."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20661",
    "job_id": "20661",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান(সাইকেলিস্ট)",
    "location": "Chittagong",
    "salary": "TK. 9,350-12,950",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-25",
    "date_posted": "2026-02-25",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Salary: Cyclist: 9,350 - 12,950 taka. (Having a bicycle is necessary) · Shifts from 7 am, 9 am, and 10:45 am. 12 hours duty. · One day off after every 3 days, 8 days off per month. Monthly mobile bill provided. -> Delivery bonus: · 10 taka bonus for each delivery from 18 to 24. · 15 taka bonus for all deliveries after 24. Incentive system is in place. -> Other facilities: · Salary increment after six months. · Festival allowance given twice a year. · 14 days sick leave per year from six months onwards. · 11 days festival leave per year from six months onwards. · 12 days earned leave per year from six months onwards. · 10 days casual leave per year from six months onwards Contact today to join: 01401153402\n\nRequirements: Terms and Conditions:\nCyclist must have a bicycle in the post.\nMust be 18 years old.\n\nবেতন: সাইক্লিস্টঃ ৯,৩৫০ - ১২,৯৫০ টাকা। (সাইকেল থাকা আবশ্যক) · সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । · ৩ দিন পর পর ১ দিন ছুটি, মাসে ৮ দিন ছুটি . মাসিক মোবাইল বিল প্রদান করা হয়। -> ডেলিভারি বোনাসঃ · ১৮ থেকে ২৪ প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস, · ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস। ইনসেন্টিভ এর ব্যবস্থা রয়েছে ->অন্যান্য সুবিধা সমুহঃ · ছয় মাস পর বেতন বৃদ্ধি পাবে। · বছরে দুইবার উৎসব ভাতা দেয়া হয়। · ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। · ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় যোগদান করতে আজ ই যোগাযোগ করুন: 01401153402"
  }
]