[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20732",
    "job_id": "20732",
    "company_name": "Beta Software Solutions",
    "job_title": "Senior Sales Executive",
    "location": "All over Bangladesh",
    "salary": "TK. 20,000-30,000",
    "experience": "1-3 years",
    "education": "Degree/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-26",
    "date_posted": "2026-02-26",
    "industry": "General Management/Admin",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House: 20, Road: 12, Sector: 3, Uttara, Dhaka",
    "job_description": "Responsibilities: Achieve monthly and quarterly sales targets by planning and executing focused sales activities. Develop and implement effective sales strategies to grow revenue and expand market presence. Generate and qualify leads through online and direct marketing initiatives. Identify new business opportunities by conducting market visits and proactive client outreach. Maintain regular follow-up with existing and potential clients to nurture relationships and close deals. Deliver clear, persuasive presentations and demonstrations tailored to customer needs. Manage a portfolio of customers through face-to-face visits and personalized engagement. Use Microsoft Excel, Word, PowerPoint, email, and online research to prepare reports, presentations, and track sales activity. Collaborate with colleagues to share market insights, coordinate efforts, and support team objectives. Communicate professionally and courteously, demonstrating strong interpersonal and presentation skills. Stay composed under pressure, prioritize tasks effectively, and meet deadlines with a positive attitude. Adapt quickly to change, learn on the go, and embrace feedback to continuously improve performance. Freshers are encouraged to apply and will receive support to develop their sales skills and product knowledge.\n\nAchieve monthly and quarterly sales targets by planning and executing focused sales activities. Develop and implement effective sales strategies to grow revenue and expand market presence. Generate and qualify leads through online and direct marketing initiatives. Identify new business opportunities by conducting market visits and proactive client outreach. Maintain regular follow-up with existing and potential clients to nurture relationships and close deals. Deliver clear, persuasive presentations and demonstrations tailored to customer needs. Manage a portfolio of customers through face-to-face visits and personalized engagement. Use Microsoft Excel, Word, PowerPoint, email, and online research to prepare reports, presentations, and track sales activity. Collaborate with colleagues to share market insights, coordinate efforts, and support team objectives. Communicate professionally and courteously, demonstrating strong interpersonal and presentation skills. Stay composed under pressure, prioritize tasks effectively, and meet deadlines with a positive attitude. Adapt quickly to change, learn on the go, and embrace feedback to continuously improve performance. Freshers are encouraged to apply and will receive support to develop their sales skills and product knowledge."
  }
]