[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20733",
    "job_id": "20733",
    "company_name": "Sk Corporation",
    "job_title": "প্রধান হিসাবরক্ষক (মেইন অ্যাকাউন্টেন্ট)",
    "location": "Mirpur",
    "salary": "TK. 20,000-25,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-20",
    "date_posted": "2026-02-27",
    "industry": "Accounts & Finance",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "571/1,East Kazipara (2nd Floor), Begum Rokeya Sarani , Mirpur, Kafrul,Dhaka-1216",
    "job_description": "Responsibilities: Establishment: S K Corporation\nWorkplace: Mirpur Kazipara, Dhaka\nSalary: 20,000 - 25,000 Taka (Negotiable)\n\nS K Corporation is looking to hire a skilled, experienced, and responsible Chief Accountant to strengthen and organize their accounting department.\n\nResponsibilities:\n- Ensure timely and controlled accounting operations of the organization.\n- Prepare and verify Purchase, Sales, Inventory, Trial Balance, and Final Accounts.\n- Maintain and regularly update Journal, Ledger, Cash Book, and Purchase-Sales accounts.\n- Prepare Salary Sheet, Provident Fund (PF), Incentives, and other benefit accounts.\n- Manage VAT, Tax, and other legal matters appropriately.\n- Prepare and present monthly, quarterly, and annual financial reports to the management.\n- Coordinate and reconcile accounts of multiple branches and head office.\n- Visit various branches as needed for inventory and accounting purposes.\n\nEducational Qualifications:\n- Bachelor's/Master's degree in Accounting or Finance.\n- Candidates with CA/CCA/MBA (Accounting) will be given preference.\n\nExperience:\n- Minimum 1-3 years of experience in the accounting department.\n- Experience in managing accounts of multiple branches and head office.\n- Practical experience in complete accounting cycle management.\n\nRequired Skills:\n- Must have experience working with ERP Software Odoo.\n- Mandatory experience with Tally Prime/ERP 9.\n- Proficiency in Microsoft Excel (Vlookup, Pivot Table, Macro) is required.\n- Advantageous to have experience working with other accounting software.\n- Ability to identify and resolve accounting discrepancies.\n\nPersonal Qualities:\n- Integrity, responsibility, and professional attitude.\n- Leadership and team coordination skills.\n- Ability to work under pressure.\n- Effective communication skills.\n\nOther Requirements:\n- Generally aged between 30-45 years (flexible based on experience).\n- Both male and female candidates are encouraged to apply.\n\nApplication Process:\nInterested candidates are requested to mention their previous job responsibilities and achievements clearly in the CV.\nContact: 01823-064555\n\nপ্রতিষ্ঠান: এস কে কর্পোরেশন কর্মস্থল: মিরপুর কাজীপাড়া, ঢাকা বেতন: ২০,০০০ – ২৫,০০০ টাকা (আলোচনাসাপেক্ষ) এস কে কর্পোরেশন তাদের হিসাব বিভাগকে আরও শক্তিশালী ও সুসংগঠিত করার লক্ষ্যে একজন দক্ষ, অভিজ্ঞ ও দায়িত্বশীল প্রধান হিসাবরক্ষক নিয়োগ দিতে আগ্রহী। দায়িত্বসমূহ প্রতিষ্ঠানের সম্পূর্ণ হিসাব কার্যক্রম তদারকি ও নিয়ন্ত্রণ করা। Purchase, Sales, Inventory, Trial Balance ও Final Accounts প্রস্তুত ও যাচাই করা। জার্নাল, লেজার, ক্যাশ বুক ও ক্রয়-বিক্রয় খাতা সংরক্ষণ ও নিয়মিত আপডেট করা। বেতন শিট, প্রভিডেন্ট ফান্ড (PF), ইনসেনটিভ ও অন্যান্য সুবিধার হিসাব প্রস্তুত করা। ভ্যাট, ট্যাক্স ও অন্যান্য আইনগত বিষয় যথাযথভাবে পরিচালনা করা। মাসিক, ত্রৈমাসিক ও বার্ষিক আর্থিক প্রতিবেদন প্রস্তুত ও ব্যবস্থাপনা কর্তৃপক্ষের নিকট উপস্থাপন করা। একাধিক শাখা ও হেড অফিসের হিসাব সমন্বয় ও তদারকি করা। ইনভেন্টরি ও হিসাবের প্রয়োজনে বিভিন্ন শাখায় ভিজিট করা। শিক্ষাগত যোগ্যতা হিসাববিজ্ঞান বা ফিন্যান্স বিষয়ে স্"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20735",
    "job_id": "20735",
    "company_name": "Koryori",
    "job_title": "Kitchen Assistant ",
    "location": "Mohammadpur",
    "salary": "TK. 12,500",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-27",
    "date_posted": "2026-02-27",
    "industry": "Restaurant staff",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Koryori -Uttara, 1230",
    "job_description": "Responsibilities: Preparing ingredients for cooking (cutting, washing, etc.) before cooking Assisting chefs and kitchen staff in their work Keeping the kitchen and work area clean and tidy Washing and organizing utensils and kitchen equipment Maintaining hygiene and food safety during food preparation Assisting in proper storage of necessary kitchen items Completing assigned tasks as per instructions and on time Working as a team in the kitchen and maintaining cooperation\n\nRequirements: Interest in learning and sense of responsibility towards work Concept of kitchen hygiene and cleanliness Ability to work for long hours Mentality to follow teamwork and guidance At least 1 year of experience is preferable Opportunity for training if suitable candidate Mentality to work in both shifts Salary and Benefits Monthly Salary: 8,000-10,000 Taka Food Allowance: 2,500 Taka Working Hours: 10 hours per day Weekly Off: 1 day per week Additional Benefits: Opportunity for salary increase after 3 months of good performance Experience At least 1 year of experience is preferable Opportunity for training if suitable candidate\n\nরান্নার আগে খাবারের উপকরণ প্রস্তুত করা (কাটা, ধোয়া ইত্যাদি) শেফ ও কিচেন স্টাফদের কাজে সহায়তা করা কিচেন ও কাজের জায়গা পরিষ্কার-পরিচ্ছন্ন রাখা থালা-বাসন ও কিচেন সরঞ্জাম ধোয়া ও গুছিয়ে রাখা খাবার প্রস্তুতের সময় হাইজিন ও ফুড সেফটি মেনে চলা কিচেনের প্রয়োজনীয় জিনিসপত্র সঠিকভাবে সংরক্ষণে সহায়তা করা নির্দেশনা অনুযায়ী নির্ধারিত কাজ সময়মতো সম্পন্ন করা কিচেনে টিম হিসেবে কাজ করা এবং সহযোগিতা বজায় রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20734",
    "job_id": "20734",
    "company_name": "Koryori",
    "job_title": "Kitchen Assistant ",
    "location": "Uttara",
    "salary": "TK. 12,500",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-27",
    "date_posted": "2026-02-27",
    "industry": "Restaurant staff",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Koryori -Uttara, 1230",
    "job_description": "Responsibilities: Preparing ingredients for cooking (cutting, washing, etc.) before cooking Assisting chefs and kitchen staff in their work Keeping the kitchen and work area clean and tidy Washing and organizing utensils and kitchen equipment Maintaining hygiene and food safety during food preparation Assisting in proper storage of necessary kitchen items Completing assigned tasks according to instructions and on time Working as a team in the kitchen and maintaining cooperation\n\nRequirements: Interest in learning and sense of responsibility towards work Concept of kitchen hygiene and cleanliness Ability to work for long hours Mentality to follow teamwork and guidance At least 1 year of experience is preferable Opportunity for training if suitable candidate Mentality to work in both shifts Salary and Benefits Monthly Salary: 8,000-10,000 Taka Food Allowance: 2,500 Taka Working Hours: 10 hours per day Weekly Off: 1 day per week Additional Benefits: Opportunity for salary increase after 3 months of good performance Experience At least 1 year of experience is preferable Opportunity for training if suitable candidate\n\nরান্নার আগে খাবারের উপকরণ প্রস্তুত করা (কাটা, ধোয়া ইত্যাদি) শেফ ও কিচেন স্টাফদের কাজে সহায়তা করা কিচেন ও কাজের জায়গা পরিষ্কার-পরিচ্ছন্ন রাখা থালা-বাসন ও কিচেন সরঞ্জাম ধোয়া ও গুছিয়ে রাখা খাবার প্রস্তুতের সময় হাইজিন ও ফুড সেফটি মেনে চলা কিচেনের প্রয়োজনীয় জিনিসপত্র সঠিকভাবে সংরক্ষণে সহায়তা করা নির্দেশনা অনুযায়ী নির্ধারিত কাজ সময়মতো সম্পন্ন করা কিচেনে টিম হিসেবে কাজ করা এবং সহযোগিতা বজায় রাখা"
  }
]