[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20513",
    "job_id": "20513",
    "company_name": "Future Cloud Bangladesh Ltd",
    "job_title": "Junior Data Analyst (Night Shift - Work From Home)",
    "location": "All over Bangladesh",
    "salary": "TK. 10,000-13,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-18",
    "date_posted": "2026-02-18",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Night Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Future Cloud Bangladesh Limited (FCBL) is a renowned multinational ITES company with over 11 years of experience. We are excited to offer full-time job opportunities for potential candidates who are willing to work night shifts. Only female applicants are encouraged to apply for this position, and female staff members have the option to work from home.\n\nResponsibilities and key learning areas:\n- Conducting extensive online research on North American businesses and their corporate practices.\n- Hosting regular meetings with managers, taking notes, and preparing meeting minutes.\n- Organizing data in spreadsheets, PowerPoint presentations, etc.\n- Making telemarketing calls and hosting conference calls as required.\n- Updating CRM systems, adding notes, and setting up drip plans for texts and emails.\n- Maintaining internal communication and completing individual assignments.\n- Engaging in external communication with corporate stakeholders.\n- Participating in collaboration meetings, workshops with industry colleagues, BASIS, etc.\n- Updating daily activities and work status on a dedicated individual tracking platform.\n\nEducational Requirements:\n- Bachelor's/Master's students from any UGC approved University/College.\n- Diploma students currently enrolled are also encouraged to apply.\n- Candidates from any discipline/department are welcome, and all will be treated equally.\n\nCompensation & Other info:\n- Work From Home\n- 6 days per week.\n- Office Schedule (Night Shift)\n- Timely salary payments.\n- 10 paid holidays per year.\n- 15 casual paid leaves per year.\n- All employees have access to loan facilities, including probationary employees.\n- Employees, their parents, spouses, and children receive a 35% discount at Ibn Sina Hospital.\n\nRequirements: Additional Requirements\n\n- Age 18 to 32 years\n- Only females are allowed to apply.\n- Call center experience will get priority.\n- English medium background will get priority.\n- Must be fluent in English.\n- Experience in sales campaigns will get priority.\n\nFuture Cloud Bangladesh Limited (FCBL) is a reputed multinational ITES company operating for over 11 years. We are pleased to offer full-time job opportunities for potential candidates willing to work on night shifts. Females are only encouraged to apply for this position. Female staff get the flexibility to work from home. Responsibilities and key learning areas: Extensive online research on North American businesses and their corporate practices. Hosting regular meetings with managers, collecting notes and preparing meeting minutes. Organising data in a spreadsheet, PowerPoint presentation, etc. Making telemarketing calls and hosting conference calls as needed. Updating CRM systems, putting notes, assigning drip plans for texts and emails, etc. Maintaining internal communication and completing individual assignments. Maintaining external communication with corporate stakeholders. Participating in collaboration meetings, workshops with industry coll"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20512",
    "job_id": "20512",
    "company_name": "Future Cloud Bangladesh Ltd",
    "job_title": "Office Executive - Night Shift",
    "location": "Banani",
    "salary": "TK. 15,000-18,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-18",
    "date_posted": "2026-02-18",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Night Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Future Cloud Bangladesh Limited (FCBL) is a reputed multinational ITES company operating for over 11 years. We are pleased to offer full-time job opportunities for potential candidates willing to work at night shift. Males are encouraged to apply for the same position. FCBL has an amazing workplace at the heart of the town Banani for male staff.\n\nJob Responsibilities:\n- Serving North American clients/customers.\n- Working as a remote/virtual executive for various overseas companies.\n- Back office support (administrative, cold calling, customer service, CRM, etc.)\n- Maintaining communication over the phone, email, and chat.\n- Managing appointments, rescheduling, and hosting conference calls.\n- Coordinating with the team members to ensure the success of the project.\n- Statistical analysis and daily reporting to the supervisor.\n\nEmployment Status:\n- Full-time\n\nJob Location:\n- Dhaka\n\nCompensation & other benefits:\n- On-time salary\n- Monthly recreation based on performance.\n- Yearly recreation based on performance.\n- Unlimited NESCAFÉ.\n- Yearly 10 paid holidays.\n- Yearly 15 casual paid leaves.\n- All employees get loan facilities, including probationary employees.\n- Employees and their parents, spouses & children get a 35% discount in Ibn Sina Hospital.\n- Company sponsored 3 annual programs.\n\nRead Before Applying:\n- Go to https://online-voice-recorder.com and record your voice for at least 2-3 minutes with an introduction on yourself (you can speak about yourself, your education, experience, expertise, family, friends, hobbies, etc.). The recording of your introduction needs to be in English. Save the audio file. You can use any other audio recording software too.\n- Send an email to apply@futurecloudbd.com with an attachment of your resume and the audio recording. Keep in mind the voice recording is to verify you are fluent in speaking English, so give your best try in that audio.\n\nRequirements: Educational Requirements:\n- Students and graduates both can apply.\n\nAdditional Requirements:\n- Age 18 to 32 years\n- Only males are allowed to apply.\n- Call center experience will get priority.\n- English-medium background will get priority.\n- Must be fluent in English.\n- Experience in sales campaigns will get priority.\n\nFuture Cloud Bangladesh Limited (FCBL) is a reputed multinational ITES company operating for over 11 years. We are pleased to offer full-time job opportunities for potential candidates willing to work at night shift. Males are encouraged to apply for the same position. FCBL has an amazing workplace at the heart of the town Banani for male staff. Job Responsibilities: Serving North American clients/customers. Working as a remote/virtual executive for various overseas companies. Back office support (administrative, cold calling, customer service, CRM, etc.) Maintaining communication over the phone, email, and chat. Managing appointments, rescheduling, and hosting conference calls. Coordinating with the team members to ensure the su"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20514",
    "job_id": "20514",
    "company_name": "Future Cloud Bangladesh Ltd",
    "job_title": "Video Editor (Night Shift)",
    "location": "Banani",
    "salary": "TK. 15,000-25,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-18",
    "date_posted": "2026-02-18",
    "industry": "Graphics/Video Editor",
    "vacancy": 10,
    "shift": "Night Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Future Cloud Bangladesh Limited (FCBL) is a reputed multinational ITES company operating for over 11 years. We are pleased to offer full-time job opportunities for potential candidates willing to work at night shift. Males are encouraged to apply for the same position. FCBL has an amazing workplace at the heart of the town Banani for male staff.\n\nJob Responsibilities:\n- Produce high-quality visual content, including vertical short-form content like Instagram Reels and TikTok Shorts, as well as edited long-form YouTube videos.\n- Research and implement trendy Reel formats, audio, and transitions to maximize engagement for North American marketing purposes.\n- Communicate directly with overseas clients to understand creative briefs and provide project updates.\n- Manage video assets, organize project files within the CRM, and schedule video review sessions with clients.\n- Work closely with the remote virtual executive team to ensure visual branding aligns with overall project goals.\n- Perform statistical analysis on video performance and provide daily progress reports to the supervisor.\n\nEmployment Status:\n- Full-time\n\nJob Location:\n- Dhaka\n\nCompensation & other benefits:\n- On-time salary\n- Monthly recreation based on performance.\n- Yearly recreation based on performance.\n- Unlimited NESCAFÉ.\n- Yearly 10 paid holidays.\n- Yearly 15 casual paid leaves.\n- All employees get loan facilities, including probationary employees.\n- Employees and their parents, spouses & children get a 35% discount in Ibn Sina Hospital.\n- Company sponsored 3 annual programs.\n\nRead Before Applying:\n- Go to https://online-voice-recorder.com and record your voice for at least 2-3 minutes with an introduction on yourself (you can speak about yourself, your education, experience, expertise, family, friends, hobbies, etc.). The recording of your introduction needs to be in English. Save the audio file. You can use any other audio recording software too.\n- Send an email to apply@futurecloudbd.com with an attachment of your resume and the audio recording. Keep in mind the voice recording is to verify you are fluent in speaking English, so give your best try in that audio.\n\nRequirements: Educational Requirements: HSC Complete Other Requirements Intermediate to Advanced knowledge of industry-standard video editing software (e.g., Adobe Premiere Pro, DaVinci Resolve, Capcut, Canva). Proven experience in creating marketing materials specifically tailored for Reels, Shorts, and YouTube platforms. Strong understanding of current social media trends and how to use trendy Reels effectively for business marketing. Excellent verbal and written English communication skills to interact professionally with North American clients. Must be willing and able to work the night shift to align with North American time zones.\n\nFuture Cloud Bangladesh Limited (FCBL) is a reputed multinational ITES company operating for over 11 years. We are pleased to offer full-time job opportunities for p"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20511",
    "job_id": "20511",
    "company_name": "Buzzblu Limited",
    "job_title": "Logistics Executive",
    "location": "Shonir Akhra",
    "salary": "TK. 10,000-16,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-18",
    "industry": "Supply Chain/Procurement",
    "vacancy": 15,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Sonir Akhra, Bus Stop, UCB Bank Building 6th Floor, Kadamtoli Dhaka, Dhaka 1236",
    "job_description": "Responsibilities: BuzzBlu team is hiring! Position: Courier Management Officer/Logistics Executive 📍 Office: Shonir Akhda, (6th floor of UCB Bank, with Foot Over Bridge), Dhaka. 🎯 Your responsibilities will include: ✅ Order management using software ✅ Uploading and tracking orders on Steadfast Courier ✅ Handling calls for riders and customers ✅ Maintaining Delivery, Return, Packing reports 🧠 You must have: ✔ Experience in courier management ✔ Knowledge of Bizmation or other OMS tools ✔ Basic understanding of Google Sheet and Excel ✔ Ability to handle rider/customer issues ✔ Responsible, patient, and punctual 🕐 Timing: 9 AM - 9 PM (with early leave if work finishes early) 💳 Salary based on experience: ৳13,000 - ৳18,000 (Basic) 🎓 Salary for freshers: ৳10,000 (Basic)\n\nBuzzBlu টিমে নিয়োগ চলছে! পজিশন: Courier Management Officer/Logistics Executive 📍 অফিস:  শনিরআখড়া,(UCB ব্যাংকের ষষ্ঠ তলা,ফুটওভার ব্রিজের সাথে)ঢাকা। 🎯 আপনার কাজ হবে: ✅ সফটওয়্যার ব্যবহার করে অর্ডার ম্যানেজমেন্ট ✅ Steadfast কুরিয়ারে অর্ডার আপলোড ও ট্র্যাকিং ✅ রাইডার ও কাস্টমারকে কল হ্যান্ডেল ✅ Delivery, Return, Packing রিপোর্ট মেইনটেইন করা 🧠 আপনার হতে হবে: ✔ কুরিয়ার ম্যানেজমেন্টে অভিজ্ঞ ✔ Bizmation বা অন্য OMS টুল ব্যবহার জানা ✔ Google Sheet ও Excel Basic জানা ✔ রাইডার/কাস্টমার Issue হ্যান্ডেল করতে পারা ✔ দায়িত্বশীল, ধৈর্যশীল এবং সময়ানুবর্তী 🕐 সময়: সকাল ৯টা – রাত ৯টা (কাজ আগে শেষ হলে আগে ছুটি) 💳 অভিজ্ঞতা অনুযায়ী বেতন: ৳১৩,০০০ – ৳১৮,০০০ (বেসিক) 🎓 ফ্রেশারদের জন্য বেতন: ৳১০,০০০ (বেসিক)"
  }
]