[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19781",
    "job_id": "19781",
    "company_name": "YAMAAN",
    "job_title": "Online Customer Support Executive (English Communication)",
    "location": "Banani",
    "salary": "TK. 14,000-16,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-14",
    "date_posted": "2026-01-14",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Responsibilities & Context\nCompany Overview\nYAMAAN is a modern fashion and lifestyle brand focused on premium quality, contemporary design, and delivering an exceptional customer experience. The brand operates through its own retail outlets and online platforms and maintains a strong, professional brand voice in all customer communications.\nJob Responsibilities\n- Respond to customer messages on Facebook, Instagram, WhatsApp, and website live chat (English only)\n- Call customers\n- Provide accurate information regarding products, pricing, sizing, availability, and delivery\n- Confirm orders and complete the delivery process\n- Maintain a polite, professional, and brand-consistent tone in all communications\n- Handle customer inquiries, complaints, and follow-ups efficiently\n- Coordinate with sales and operations teams when necessary\n- Maintain records of customer interactions when required\nSkills & Expertise\n- Call Center Operations\n- Customer Communication\n- Fluent Communication in English\n\nRequirements: Educational Requirements\n• Bachelor’s Degree (Graduation must be completed)\n• Candidates with an academic background in English or related disciplines will be given preference\nExperience Requirements\n• Minimum 1 year of experience\n• Experience in the following business areas will be preferred:\no Call Center\no E-commerce\no F-commerce\nAdditional Requirements\n• Age between 20 to 30 years\n• Strong expertise in written English is mandatory\n• Minimum English typing speed of 30 WPM\n• Excellent knowledge of English grammar, sentence structure, and professional tone\n• Candidates with IELTS certification or professional English language training will be given priority\n• Fast and accurate typing skills\n• Basic computer knowledge and familiarity with social media platforms\n• Ability to handle multiple customer conversations simultaneously\n• Strong customer service mindset and communication skills\n• Interest in fashion and lifestyle brands will be an added advantage\n\nResponsibilities & Context Company Overview YAMAAN is a modern fashion and lifestyle brand focused on premium quality, contemporary design, and delivering an exceptional customer experience. The brand operates through its own retail outlets and online platforms and maintains a strong, professional brand voice in all customer communications. Job Responsibilities • Respond to customer messages on Facebook, Instagram, WhatsApp, and website live chat (English only) • Call to customer, • Provide accurate information regarding products, pricing, sizing, availability, and delivery • Confirm the order and complete the delivery process • Maintain a polite, professional, and brand-consistent tone in all communications • Handle customer inquiries, complaints, and follow-ups efficiently • Coordinate with sales and operations teams when necessary • Maintain records of customer interactions when required Skills & Expertise • Call Center Operations • Customer Communication • Fluent Communication i"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19780",
    "job_id": "19780",
    "company_name": "YAMAAN",
    "job_title": "Sales Associate (Showroom)",
    "location": "Banani",
    "salary": "TK. 12,000-15,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-14",
    "date_posted": "2026-01-14",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: YAMAAN is a modern fashion and lifestyle brand based in Dhaka, Bangladesh, known for its clean design language, premium quality, and distinctive concepts. Greet and assist customers in a polite, professional, and welcoming manner.\n• Understand customer requirements and recommend suitable products accordingly.\n• Clearly explain product features including fabric quality, sizing, pricing, and styling.\n• Maintain organized product displays, shelves, racks, and mannequins at all times.\n• Assist with billing, packaging, tagging, and inventory handling when required.\n• Ensure the showroom remains clean, tidy, and visually appealing.\n• Handle customer inquiries and complaints calmly and professionally.\n• Maintain effective communication and teamwork with colleagues.\n• Follow showroom policies including dress code, grooming standards, attendance, and operational guidelines.\n\nRequirements: Working Days: 6 Days in a week. (Thursday, Friday, Saturday Must)\n• Weekly Off: One day off will be provided on the remaining weekdays (Roster base) \n• Retail Sales & Customer Service \n• Sales Target Achievement \n• POS Software operation (Sales, Inventory & Billing) \n• Strong communication and interpersonal skills \n• Detail-oriented and efficient task handling \n• Presentable, confident, and professional appearance \n• No trace of local accent; clear and neutral communication required \nAdditional Requirements: \n• Experience in shop/showroom-based retail business \n• Smart, confident, and customer-focused mindset \n• Ability to work under pressure and in a team environment\n\nYAMAAN is a modern fashion and lifestyle brand based in Dhaka, Bangladesh, known for its clean design language, premium quality, and distinctive concepts. Greet and assist customers in a polite, professional, and welcoming manner. • Understand customer requirements and recommend suitable products accordingly. • Clearly explain product features including fabric quality, sizing, pricing, and styling. • Maintain organized product displays, shelves, racks, and mannequins at all times. • Assist with billing, packaging, tagging, and inventory handling when required. • Ensure the showroom remains clean, tidy, and visually appealing. • Handle customer inquiries and complaints calmly and professionally. • Maintain effective communication and teamwork with colleagues. • Follow showroom policies including dress code, grooming standards, attendance, and operational guidelines."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19813",
    "job_id": "19813",
    "company_name": "PizzaBurg ",
    "job_title": "Surveillance Officer (Part-Time)",
    "location": "Mirpur",
    "salary": "TK. 8,000-11,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Part Time",
    "working_hours": "6 hours per day",
    "deadline": "2026-02-14",
    "date_posted": "2026-01-17",
    "industry": "General Management/Admin",
    "vacancy": 20,
    "shift": "Other",
    "country": null,
    "company_address": "Avenue Road Section:2 , Block: A, Avenue:1 , House: 12/1, Dhaka 1216, Dhaka, Bangladesh",
    "job_description": "Responsibilities: - Regularly monitor all CCTV cameras and surveillance systems in the outlet.\n- Identify irregularities, theft, or suspicious activities in the cash counter, kitchen, store, and delivery area.\n- Monitor cash handling, inventory movement, and employee behavior.\n- Report any irregularities or security incidents to the relevant authorities immediately.\n- Prepare and maintain daily and weekly surveillance reports.\n- Review, maintain, and provide CCTV video footage as required.\n- Ensure proper adherence to the organization's security policies and SOPs.\n- Assist HR and management in investigation-related activities.\n- Maintain confidentiality and professional conduct at all times.\n\nRequirements: - University-enrolled students from any reputed private or public university\n- Ability to work under pressure\n- Good writing skills in both English and Bangla\n- Good computer operational knowledge, with good typing speed\n- Good observation capability\n- Critical thinking and decision making capability\n- Ability to work in shifts\n- Both males and females can apply\n- Applicants residing in Mirpur will get priority\n\nRegularly monitor all CCTV cameras and surveillance systems in the outlet. Identify irregularities, theft, or suspicious activities in the cash counter, kitchen, store, and delivery area. Monitor cash handling, inventory movement and employee behavior. Report any irregularities or security incidents to the relevant authorities immediately. Prepare and maintain daily and weekly surveillance reports. Review, maintain, and provide CCTV video footage as required. Ensure proper adherence to the organization's security policies and SOPs. Assist HR and management in investigation-related activities. Maintain confidentiality and professional conduct at all times."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19583",
    "job_id": "19583",
    "company_name": "NextWave Solutions",
    "job_title": "কাস্টমার কেয়ার এক্সিকিউটিভ (Female)",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-15,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-14",
    "date_posted": "2026-01-17",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Mohammadpur,Dhaka",
    "job_description": "Responsibilities: Job Responsibilities: Confirm website orders Manage courier operations Communicate with new and existing customers to increase sales Explain product features and benefits to customers Work towards achieving sales targets Collect customer feedback and report it for management Build good relationships with customers and resolve any issues\n\nRequirements: Requirements: At least HSC/ Bachelor's degree or equivalent. 1-2 years of work experience in customer care or e-commerce. Both freshers and experienced candidates can apply (experience will be preferred). Must have interest in customer handling and sales. Excellent communication skills and self-confidence are required. Experience in online sales will be given special consideration. Ability to work in a team and under pressure is necessary. Must be quick to learn. Benefits: Career growth and training opportunities. A friendly working environment. Additional benefits. NextWave Solutions Address: Mohammadpur, Dhaka Phone: 01911-055285 (WhatsApp)\n\nদায়িত্বসমূহ (Job Responsibilities): Website অর্ডার কনফার্ম করা Courier পরিচালনা করা নতুন ও পুরাতন গ্রাহকদের সাথে যোগাযোগ করা এবং বিক্রয় বৃদ্ধি করা। পণ্যের বৈশিষ্ট্য এবং উপকারিতা সম্পর্কে গ্রাহকদের বোঝানো। বিক্রয় লক্ষ্যমাত্রা (Sales Target) পূরণে কাজ করা। গ্রাহকদের ফিডব্যাক নেওয়া এবং তা ব্যবস্থাপনায় রিপোর্ট করা। কাস্টমারদের সাথে ভালো সম্পর্ক তৈরি করা এবং সমস্যার সমাধান করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19816",
    "job_id": "19816",
    "company_name": " South On Security Services limited ",
    "job_title": " বাস টিকেট কাউন্টার এক্সিকিউটিভ",
    "location": "Dhaka",
    "salary": "TK. 12,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-14",
    "date_posted": "2026-01-17",
    "industry": "General Management/Admin",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "উত্তরা ১০ নম্বর সেক্টর কামারপাড়া ২১ নম্বর রোড হাউস নাম্বার ২০৭",
    "job_description": "Responsibilities: Job Description: Selling bus tickets Providing information and assistance to passengers Keeping track of daily ticket sales Coordinating with supervisors and relevant staff\n\nRequirements: 📝 Service and Training Charge Deposit: ১,০০০ টাকা deposit required Eligibility: Minimum SSC / HSC pass Must have good communication skills Honest, responsible, and punctual Prior experience will be given preference (not mandatory) Salary and Benefits: 💰 Monthly Salary: ১২,০০০ টাকা 🚍 Transportation Allowance: ১,৫০০ টাকা\n\nকাজের বিবরণ: বাসের টিকেট বিক্রি করা যাত্রীদের প্রশ্ন ও তথ্য প্রদান দৈনিক টিকেট বিক্রির হিসাব রাখা সুপারভাইজার ও সংশ্লিষ্ট স্টাফদের সাথে সমন্বয় করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19777",
    "job_id": "19777",
    "company_name": "Metlife, Akkas Agency",
    "job_title": "Financial Associate",
    "location": "Elephant Road, Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-14",
    "date_posted": "2026-01-14",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Chawrangi Bhaban,124/A  Elephant Road(6th Floor), Dhaka-1205",
    "job_description": "Responsibilities: Responsibilities: Providing financial assistance to millions of people in the country. Establishing and maintaining relationships with clients to achieve business goals. Benefits: Unlimited earning potential: Commission based on your work. Rapid career progression: Recognition and appreciation based on performance. Opportunity for international travel. Medical coverage: For yourself and your family. Special recognition and provident fund. Scholarship for children. World-class training: To enhance your skills. Flexible work options: Part-time and full-time job opportunities.\n\nRequirements: Contact Us: MetLife Akkas Agency Address: Chourangi Bhavan, Elephant Road, Dhaka If you are ready to take on challenges and want to step into a successful career path, then apply today!\n\nদায়িত্ব: দেশের লক্ষ লক্ষ মানুষকে আর্থিক সুরক্ষা প্রদানে সহায়তা করা। ব্যবসায়িক লক্ষ্য অর্জনের জন্য ক্লায়েন্টদের সঙ্গে সম্পর্ক স্থাপন ও রক্ষণাবেক্ষণ করা। সুবিধা: অফুরন্ত আয়ের সুযোগ: আপনার কাজের উপর ভিত্তি করে কমিশন। ক্যারিয়ারের দ্রুত অগ্রগতি: পারফরমেন্সের ভিত্তিতে সম্মাননা ও স্বীকৃতি। আন্তর্জাতিক ভ্রমণের সুযোগ। মেডিকেল কভারেজ: নিজের এবং পরিবারের জন্য। বিশেষ সম্মাননা এবং প্রভিডেন্ট ফান্ড। সন্তানের জন্য শিক্ষা বৃত্তি। বিশ্বমানের প্রশিক্ষণ: আপনার দক্ষতা উন্নত করার জন্য। কাজের নমনীয়তা: পার্ট টাইম এবং ফুল টাইম কাজের সুযোগ।"
  }
]