[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20782",
    "job_id": "20782",
    "company_name": "Shomvob Global",
    "job_title": "শাটারিং কার্পেন্টার -TRANSGUARD GROUP LLC(DIRECT CO.) – Dubai ",
    "location": "United Arab Emirates",
    "salary": "TK. 35,000-40,000",
    "experience": "6 months - 1 year",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-12",
    "date_posted": "2026-03-01",
    "industry": "Technician",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": "United Arab Emirates",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: TRANSGUARD GROUP LLC(DIRECT CO.) - Dubai is hiring for the position of Shuttering Carpenter ! Benefits: Salary: 1050+ accommodation + OT Living arrangement: Provided by the company; Food: Own Working hours: 9 hours per day Job Responsibilities: Formwork / shuttering for columns, beams, slabs, foundations, etc. Cutting and fitting plywood, wood, or steel formwork according to measurements Leveling and aligning formwork correctly before concrete pouring Properly installing support, bracing, and props for shuttering Safely removing formwork after concrete has dried (De-shuttering) Adhering to safety rules and keeping work area clean. 📌 Qualifications: (Please read carefully and apply for the job) ======================================== Age: 21 - 40 years. Candidates outside this age range will not be called for an interview. Educational Qualification: SSC or equivalent Proficiency in basic English speaking and writing is necessary. Relevant work experience is required. 📆 Delegate Interview: March, 2026 (Dhaka) Additional Information: Visa validity: 2 (two) years - non-negotiable. Passport: All candidates must bring both new and old passports to the interview. The passport must have a minimum validity of 1.5 years. Those without a passport should not apply.\n\nTRANSGUARD GROUP LLC(DIRECT CO.) – Dubai তে শাটারিং কার্পেন্টার -- পদে নিয়োগ চলছে! সুবিধাসমূহ: বেতন: ১০৫০+বাসস্থান +ওটি থাকার ব্যবস্থা: কোম্পানি দেবে; খাবার: নিজ কর্মঘণ্টা: দিনে ৯ ঘণ্টা কাজের দায়িত্ব: কলাম, বিম, স্ল্যাব, ফাউন্ডেশন ইত্যাদির জন্য ফর্মওয়ার্ক / শাটারিং তৈরি করা মাপ অনুযায়ী প্লাইউড, কাঠ বা স্টিল ফর্ম কাটিং ও ফিটিং কংক্রিট ঢালাইয়ের আগে ফর্মওয়ার্ক সঠিকভাবে লেভেল ও অ্যালাইন করা শাটারিংয়ের সাপোর্ট, ব্রেসিং, প্রপস সঠিকভাবে বসানো কংক্রিট শুকানোর পর ফর্মওয়ার্ক নিরাপদে খুলে ফেলা (De-shuttering) সেফটি রুল মানা ও কাজের এলাকা পরিষ্কার রাখা। 📌 যোগ্যতা: (দয়া করে ভালো করে পড়ে এরপর জবে এপ্লাই করুন) ======================================== বয়সঃ ২১ - ৪০বছর। এর বাহিরের বয়সের প্রার্থীদেরকে ইন্টারভিউতে ডাকা হবে না। শিক্ষাগত যোগ্যতাঃ SSC/সমমান বেসিক ইংরেজিতে কথা বলা ও লেখার দক্ষতা আবশ্যক। সংশ্লিষ্ট কাজে অভিজ্ঞতা থাকতে হবে। 📆 ডেলিগেট ইন্টারভিউ: মার্চ, ২০২৬ (ঢাকা) আরও প্রয়োজনীয় তথ্য সমূহঃ ভিসা চুক্তির মেয়াদঃ ২ (দুই) বছর – নবায়নযোগ্য। পাসপোর্ট: নতুন-পুরাতন সকল পাসপোর্ট ইন্টারভিউতে সাথে নিয়ে আসতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১.৫ বছর থাকতে হবে। যাদের পাসপোর্ট নেই, তারা দয়া করে এপ্লাই করবেন না।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20778",
    "job_id": "20778",
    "company_name": "Shokher Gari",
    "job_title": "গ্রাফিক্স ডিজাইনার",
    "location": "Maghbazar",
    "salary": "TK. 13,000-16,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-29",
    "date_posted": "2026-03-01",
    "industry": "Graphics/Video Editor",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Moghbazar moor,dhaka",
    "job_description": "Responsibilities: Creating necessary designs including various social media posts, banners, logos, flyers Creating creative visuals according to brand guidelines Completing design tasks in coordination with the team Delivering work within specified time Editing and updating designs as necessary\n\nRequirements: \" Priority if residing in the Moghbazar/Banglamotor area\" Age: 20-25 years (female candidate) Priority with basic or good experience in graphic design Proficiency in Adobe Photoshop and Illustrator Creative thinking and good design sense required Must have own laptop Priority if residing in the Moghbazar/Banglamotor area Must be responsible, punctual, and skilled in teamwork\n\nবিভিন্ন সোশ্যাল মিডিয়া পোস্ট, ব্যানার, লোগো, ফ্লায়ারসহ প্রয়োজনীয় ডিজাইন তৈরি করা ব্র্যান্ড গাইডলাইন অনুযায়ী সৃজনশীল ভিজ্যুয়াল তৈরি করা টিমের সাথে সমন্বয় করে ডিজাইন কাজ সম্পন্ন করা নির্ধারিত সময়ের মধ্যে কাজ ডেলিভারি করা প্রয়োজন অনুযায়ী ডিজাইনের সংশোধন ও আপডেট করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20758",
    "job_id": "20758",
    "company_name": "Azharul Jannah International Madrasah",
    "job_title": "Vice Principal / Co-ordinator",
    "location": "Savar",
    "salary": "TK. 35,000-40,000",
    "experience": "3-5 years",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-28",
    "date_posted": "2026-03-01",
    "industry": "Education/Training/Consultant",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "F-48, Bank Colony, Savar, Dhaka",
    "job_description": "Responsibilities: - Assist in planning, organising and overseeing the daily academic and administrative operations of the Madrasah.\n- Monitor class schedules, teacher attendance, lesson delivery and curriculum implementation across Arabic, English and Bangla mediums (as the Madrasah offers).\n- Evaluate and support teacher performance and professional development, aligned with the institution's standards.\n- Maintain student discipline, handle behavioural issues and cultivate a positive, value-based school culture.\n- Coordinate with parents, teachers and staff to ensure effective communication and collaboration.\n- Prepare and manage exam schedules, academic plans, student assessments and results tracking.\n- Lead and organise school events, seminars (for example parenting seminars etc) and development programmes.\n- Step in for the Principal when needed and act as the senior administrator in their absence.\n- Contribute to strategic planning for school growth, improvements, quality enhancement and facility management.\n\nRequirements: Post graduation or equivalent (Arabic/Islamic Studies/ Kamil/ Dawra Hadidth)\n\nCandidate from other disciplines must have adequate Islamic knowledge,- B.Ed./ M.Ed./ A degree from a foreign institution will be an added advantage with a minimum GPA/ CGPA of 3.0 at all levels.\n\nLeadership qualities, communication skill and presentation skill\n\nMinimum 3-10 years of teaching experience & at least 1-2 years experience in academic leadership/ administration.\n\nJob Location:\nAzharul Jannah International Madrasah\nKaizen Peace Valley, F-48, Block-A, Bank colony, Savar, Dhaka.\n\nEmail: Send your CV to: info@ajimedu.com\n\nSalary Range\nSalary: Negotiable (Depends on the applicant's background and teaching experience)\n\nOther Benefits: As per madrasah policy\n\nAssist in planning, organising and overseeing the daily academic and administrative operations of the Madrasah. Monitor class schedules, teacher attendance, lesson delivery and curriculum implementation across Arabic, English and Bangla mediums (as the Madrasah offers). Evaluate and support teacher performance and professional development, aligned with the institution’s standards. Maintain student discipline, handle behavioural issues and cultivate a positive, value-based school culture. Coordinate with parents, teachers and staff to ensure effective communication and collaboration. Prepare and manage exam schedules, academic plans, student assessments and results tracking. Lead and organise school events, seminars (for example parenting seminars etc) and development programmes. Step in for the Principal when needed and act as the senior administrator in their absence. Contribute to strategic planning for school growth, improvements, quality enhancement and facility management"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20783",
    "job_id": "20783",
    "company_name": "Dutch Bangla Bank Agent Banking - Savar",
    "job_title": "Computer Operator",
    "location": "Savar",
    "salary": "TK. 10,000-20,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-29",
    "date_posted": "2026-03-01",
    "industry": "Computer Operator/Data Entry Operator",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: The top agent of the country's leading banking institution is hiring computer operators at its Savar branch. Interested candidates please apply quickly. Daily data entry and data updating Preparing reports in MS Word, Excel, and other software Sending emails and maintaining official documents Managing office software and computer systems File storage and documentation management Completing tasks related to printing, scanning, and photocopying Providing administrative support as needed Qualifications: Educational Qualifications: SSC/HSC Minimum 1 year of experience required Proficiency in MS Office required Fast typing skills (in Bengali and English) required Must be proficient in internet and email usage Must be honest, responsible, and punctual Job Location: Savar (Dhaka) Salary: 10,000 to 20,000 BDT (based on qualifications and experience)\n\nদেশ সেরা এজেন্ট ব্যাংকিং প্রতিষ্ঠানের সাভার শাখায় কম্পিউটার অপারেটর নিয়োগ দেয়া হচ্ছে। আগ্রহী পার্থিগন দ্রুত আবেদন করুন। দৈনিক ডাটা এন্ট্রি ও ডাটা আপডেট করা MS Word, Excel ও অন্যান্য সফটওয়্যারে রিপোর্ট প্রস্তুত করা ইমেইল পাঠানো ও অফিসিয়াল ডকুমেন্ট মেইনটেইন করা অফিসের সফটওয়্যার ও কম্পিউটার সিস্টেম পরিচালনা করা ফাইল সংরক্ষণ ও ডকুমেন্টেশন ম্যানেজমেন্ট প্রিন্ট, স্ক্যান ও ফটোকপি সংক্রান্ত কাজ সম্পন্ন করা প্রয়োজন অনুযায়ী প্রশাসনিক সহায়তা প্রদান যোগ্যতাঃ শিক্ষাগত যোগ্যতাঃ এসএসসি / এইচ এস সি নুন্যতম ১ বছরের অভিজ্ঞতা থাকা আবশ্যক MS Office এ দক্ষতা থাকা আবশ্যক দ্রুত টাইপিং দক্ষতা (বাংলা ও ইংরেজি) থাকা আবশ্যক ইন্টারনেট ও ইমেইল ব্যবহারে পারদর্শী হতে হবে সৎ, দায়িত্বশীল ও সময়নিষ্ঠ হওয়া বাধ্যতামুলক জব লোকেশনঃ সাভার(ঢাকা) বেতনঃ ১০,০০০ থেকে ২০,০০০ টাকা (যোগ্যতা ও অভিজ্ঞতার ভিত্তিতে নির্ধারিত হবে)"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20781",
    "job_id": "20781",
    "company_name": "Shomvob Global",
    "job_title": "স্টিল ফিক্সার (Steel Fixer)-TRANSGUARD GROUP LLC(DIRECT CO.) – Dubai",
    "location": "United Arab Emirates",
    "salary": "TK. 35,000-40,000",
    "experience": "6 months - 1 year",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-13",
    "date_posted": "2026-03-01",
    "industry": "Construction",
    "vacancy": 100,
    "shift": "Day Shift",
    "country": "United Arab Emirates",
    "company_address": null,
    "job_description": "Responsibilities: TRANSGUARD GROUP LLC(DIRECT CO.) – Dubai is hiring for the position of Steel Fixer ! Benefits: Salary: 1050 + Accommodation + OT Living arrangement: Provided by the company; Food: Own Working hours: 9 hours per day Job Responsibilities: Prepare surfaces (sanding, scraping, cleaning, and priming). Apply paint using brush, roller, and spray machine. Apply primer, undercoat, and topcoat correctly. Work on color mixing, color matching, and texture/finishing. Adhere to safety rules and keep work area clean. 📌 Qualifications: (Please read carefully and apply after understanding) ======================================== Age: 21 - 40 years. Candidates outside this age range will not be called for an interview. Educational qualification: SSC or equivalent Proficiency in basic English speaking and writing is necessary. Relevant work experience is required. 📆 Delegate Interview: March, 2026 (Dhaka) Additional Information: Visa validity: 2 (two) years - renewable. Passport: All candidates must bring both new and old passports to the interview. The passport must have a minimum validity of 1.5 years. Those without a passport should not apply.\n\nTRANSGUARD GROUP LLC(DIRECT CO.) – Dubai তে স্টিল ফিক্সার (Steel Fixer)- পদে নিয়োগ চলছে! সুবিধাসমূহ: বেতন: ১০৫০+বাসস্থান +ওটি থাকার ব্যবস্থা: কোম্পানি দেবে; খাবার: নিজ কর্মঘণ্টা: দিনে ৯ ঘণ্টা কাজের দায়িত্ব: সারফেস প্রস্তুত করা (স্যান্ডিং, স্ক্র্যাপিং, ক্লিনিং ও প্রাইমিং)। ব্রাশ, রোলার ও স্প্রে মেশিন ব্যবহার করে রং করা। প্রাইমার, আন্ডারকোট ও টপকোট সঠিকভাবে প্রয়োগ করা। রং মিক্সিং, কালার ম্যাচিং ও টেক্সচার/ফিনিশিং কাজ করা। সেফটি রুল মানা ও কাজের এলাকা পরিষ্কার রাখা। 📌 যোগ্যতা: (দয়া করে ভালো করে পড়ে এরপর জবে এপ্লাই করুন) ======================================== বয়সঃ ২১ - ৪০বছর। এর বাহিরের বয়সের প্রার্থীদেরকে ইন্টারভিউতে ডাকা হবে না। শিক্ষাগত যোগ্যতাঃ SSC/সমমান বেসিক ইংরেজিতে কথা বলা ও লেখার দক্ষতা আবশ্যক। সংশ্লিষ্ট কাজে অভিজ্ঞতা থাকতে হবে। 📆 ডেলিগেট ইন্টারভিউ: মার্চ, ২০২৬ (ঢাকা) আরও প্রয়োজনীয় তথ্য সমূহঃ ভিসা চুক্তির মেয়াদঃ ২ (দুই) বছর – নবায়নযোগ্য। পাসপোর্ট: নতুন-পুরাতন সকল পাসপোর্ট ইন্টারভিউতে সাথে নিয়ে আসতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১.৫ বছর থাকতে হবে। যাদের পাসপোর্ট নেই, তারা দয়া করে এপ্লাই করবেন না।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20777",
    "job_id": "20777",
    "company_name": "Shokher Gari",
    "job_title": "Call Center Executive Cum Facebook Moderator",
    "location": "Maghbazar",
    "salary": "TK. 13,000-15,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-29",
    "date_posted": "2026-03-01",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ***Priority will be given to the residents of Moghbazar, Eskaton, and Banglamotor areas*** * Receiving and managing inbound and outbound calls. * Providing information related to vehicle to customers and answering their queries. * Making follow-up calls to interested customers. * Listening to customer complaints and providing solutions with patience. * Promptly replying to customer messages in the Facebook Page inbox. * Monitoring comments and replying or moderating as necessary. * Filtering out spam and inappropriate comments for removal/hiding. * Creating Facebook Engagement reports. * Understanding customer interests and demands to make proposals.\n\nRequirements: * Must be from the Moghbazar area or its surroundings.\n* Must have at least 1 year of practical experience in call center and Facebook page moderation.\n* Priority will be given to those with experience working at Genex Infosys / Digicon Technology Ltd.\n* Running students need not apply, must work in two shifts (mandatory).\n* Must work in the office - not work from home.\n* Must have a smart, polite, and humble demeanor, and avoid regionalism when speaking.\n* Must have the mentality to speak with patience and interest with customers, giving importance to the customer's statements and providing solutions beautifully.\n* Must be skilled in problem-solving.\n* Will be given 1000 taka for snacks every month.\n* There is a good incentive for earning outside of salary.\n* 4 days off per month and opportunity for overtime.\n* Working hours: 9 am to 7 pm, 12 pm to 10 pm.\n* Educational qualification: Minimum HSC.\n* Age: 22 to 27 years.\n\n***মগবাজার, ইস্কাটন ও বাংলামোটর এরিয়ার প্রর্থীদের অগ্রাধিকার দেওয়া হবে*** * ইনবাউন্ড ও আউটবাউন্ড কল রিসিভ ও পরিচালনা করা। * গ্রাহকদের গাড়ি সংক্রান্ত তথ্য প্রদান ও প্রশ্নের উত্তর দেওয়া। * আগ্রহী কাস্টমারদের ফলো-আপ কল করা। * কাস্টমারের অভিযোগ শুনে ধৈর্য সহকারে সমাধান দেওয়া। * Facebook Page-এর ইনবক্সে গ্রাহকদের মেসেজের দ্রুত রিপ্লাই প্রদান। * কমেন্ট মনিটরিং এবং প্রয়োজনে রিপ্লাই ও মডারেশন। * স্প্যাম ও আপত্তিকর কমেন্ট ফিল্টার করে রিমুভ/হাইড করা। * Facebook Engagement রিপোর্ট তৈরি। * কাস্টমারের আগ্রহ ও চাহিদা বুঝে প্রস্তাব দেওয়া।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20776",
    "job_id": "20776",
    "company_name": "Elite Nest IT",
    "job_title": "Data Entry Executive",
    "location": "Mohakhali DOHS",
    "salary": "TK. 16,000-18,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-31",
    "date_posted": "2026-03-01",
    "industry": "Computer Operator/Data Entry Operator",
    "vacancy": 5,
    "shift": "Night Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ELITE NEST IT, a leading USA-based IT company, is inviting talented, dynamic, and self-motivated candidates to fill the following position. The ideal candidates for our company are those who have a strong understanding of computer systems, are able to follow directions, and have good analytical and problem-solving skills.\n\nResponsibilities include:\n- Data research, data analysis, and data entry work using computers and various software\n- Installing software updates and fixing bugs\n- Planning and executing social media & display advertising campaigns\n- Maintaining daily work reports\n\nSalary & Benefits:\n- Basic Salary: 16,000/- BDT\n- Training Allowance: 8,000/- BDT (Joining Month – Day Basis)\n- Attendance Bonus: 1,000/- BDT (30 days full attendance)\n- Overtime Bonus: 700/- BDT per day (Weekend work, after 3 months)\n- Performance Bonus (After 3 months)\n- Festival Bonus: 2 (As per company policy)\n- Eid Bonus: 50% of basic salary (After 1 year completion)\n- Salary Review: After 1 year\n- Casual Leave: 15 days yearly (After 3 months)\n- One Eid Holiday: 5 days\n- Weekly Holiday: As per company policy\n\nRequirements: Educational Requirements: HSC / Diploma in Computer Bachelor's Degree (BSc / BBA or relevant field) preferred Basic computer knowledge is mandatory Experience Requirements: Maximum 1 year experience Freshers are encouraged to apply Experience in IT Company / BPO / Data Entry Firm will get preference Additional Requirements: Age: 18 - 32 years Good understanding of computer systems Basic knowledge of MS Office Analytical and problem-solving skills Ability to follow instructions properly\n\nELITE NEST IT a leading USA based it compnay is inviting talented, dynamic and self-motivated candidates to fill the following position. The ideal candiadates for our company are those who have a strong understanding of computer systems, are able to follow directions and have good analytical and probleme-solving skills Data research, data analysis and data entry work using computer and various software Installing software updates and fixing bugs Plan and execute social media & display advertising campaigns Maintain daily work report Salary & Benefits: Basic Salary: 16,000/- BDT Training Allowance: 8,000/- BDT (Joining Month – Day Basis) Attendance Bonus: 1,000/- BDT (30 days full attendance) Overtime Bonus: 700/- BDT per day (Weekend work, after 3 months) Performance Bonus (After 3 months) Festival Bonus: 2 (As per company policy) Eid Bonus: 50% of basic salary (After 1 year completion) Salary Review: After 1 year Casual Leave: 15 days yearly (After 3 months) One Eid Holiday: 5 days Weekly Holiday: As per company policy"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20764",
    "job_id": "20764",
    "company_name": "Azharul Jannah International Madrasah",
    "job_title": "Assistant Teacher ",
    "location": "Savar",
    "salary": "TK. 15,000-24,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-29",
    "date_posted": "2026-03-01",
    "industry": "Education/Training/Consultant",
    "vacancy": 9,
    "shift": "Day Shift",
    "country": null,
    "company_address": "F-48, Bank Colony, Savar, Dhaka",
    "job_description": "Responsibilities: Azharul Jannah International Madrasah is committed to providing excellence in conventional Arabic and English medium curriculum blended with mandatory Nurani, Nazera, Hifzul Quran programs to build future righteous leaders, In-Sha-Allah.\n\nWe are looking for Assistant Teachers for the subjects: English, Hifzul Quran, Nurani & Sports Teacher.\n\n1. English: Hon's/Master's/O-level/A-level\n2. Hifzul Quran: Hafiz & Dawra Hadith/Fazil/Kamil\n3. Nurani: Hafiz & Dawra Hadith/Fazil/Kamil\n4. Sports Teacher: Bachelor’s degree/Alim (B.P.Ed)\n\nResponsibilities:\n- Teach English to students from Playgroup to Class 5 in an engaging and age-appropriate way.\n- Prepare lesson plans, teaching materials, and simple curriculum activities.\n- Ensure students actively participate in class and enjoy learning.\n- Monitor students' progress and provide feedback to the Coordinator.\n- Record each student's performance for better support.\n- Communicate effectively with students, parents, and school staff.\n- Follow the guidance of the Head of Section, Principal, or Coordinator.\n- Manage exam duties, class activities, and parent meetings.\n- Maintain a professional attitude and confidentiality at all times.\n- Perform any other related tasks assigned by the school.\n\n\"Experienced candidates will be given preference.\"\n\nJob Location:\nAzharul Jannah International Madrasah\nKaizen Peace Valley, F-48, Block-A, Bank colony, Savar, Dhaka.\n\nSalary Range:\nSalary: Negotiation (Depends on the applicant's background and teaching experience)\n\nOther Benefits:\nAs per Madrasah policy\n\nRequirements: Applicants with experience in English Medium and Madrasah education will be given priority. Applicants with a strong command of English and Arabic are encouraged to apply. Applicants who are familiar with international qualifications such as PLSC, IGCSE O/A Levels, and IELTS will be given priority. Applicants must have knowledge about the specifications of the subject they will be teaching.\n\nAzharul Jannah International Madrasah is committed to provide excellence in conventional Arabic and English medium Curriculum blended with mandatory Nurani, Nazera, Hifzul Quran program to build future righteous leaders In-Sha-Allah. We are looking for some Assistant Teacher for the subjects: English, Hifzul Quran, Nurani & Sports teacher. English: Hon's/Master's/O-level/A-level Hifzul Quran: Hafiz & Dawra Hadith/ Fazil/ Kamil Nurani: Hafiz & Dawra Hadith/ Fazil/ Kamil Sports Teacher: Bachelor’s degree/Alim (B.P.Ed) Teach English to students from Playgroup to Class 5 in an engaging and age-appropriate way. Prepare lesson plans, teaching materials, and simple curriculum activities. Make sure students take part actively in class and enjoy learning. Check students’ progress and give feedback to the Co Ordinator. Observe and record each student’s performance for better support. Communicate well with students, parents, and school staff. Follow the guidance of the Head of section, Principal, or Coordinator. Ha"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20766",
    "job_id": "20766",
    "company_name": "EQ MUSIC STATION",
    "job_title": "Tele Sales",
    "location": "Gulshan-Banani",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-15",
    "date_posted": "2026-03-01",
    "industry": "IT/Telecommunication",
    "vacancy": 20,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Handle inbound calls, messages, and online inquiries professionally. Present and explain digital products/services clearly to potential clients. Understand customer requirements and recommend suitable solutions. Negotiate pricing and close sales deals. Maintain proper sales records using Microsoft Excel and Google Sheets. Update daily sales reports and client databases. Conduct follow-up communications to convert pending leads. Use web browsing and PC tools efficiently to gather necessary client information. Maintain professional communication standards.\n\nHandle inbound calls, messages, and online inquiries professionally Present and explain digital products/services clearly to potential clients Understand customer requirements and recommend suitable solutions Negotiate pricing and close sales deals Maintain proper sales records using Microsoft Excel and Google Sheets Update daily sales reports and client databases Conduct follow-up communications to convert pending leads Use web browsing and PC tools efficiently to gather necessary client information Maintain professional communication standards"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20784",
    "job_id": "20784",
    "company_name": "H.K. Khan Agency (Metlife)",
    "job_title": "Financial Associate ",
    "location": "Kakrail, Khilgaon, Malibagh, Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-29",
    "date_posted": "2026-03-01",
    "industry": "Call Center",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Are you hardworking, ambitious, and want to establish yourself in life through honest means?\n\nIf so, there is a golden opportunity for you to work as a Financial Associate at MetLife, a globally renowned organization with over 155 years of experience in 40+ countries worldwide, and holding a leading position in Bangladesh for over 70 years.\n\nJoin now and become a representative of MetLife, contribute to society/country, and fulfill your dreams.\n\nPosition: 'Financial Associate'\n\nJob Description: By working as a Financial Associate, you can brighten your future and contribute to a great cause. Join 'H.K. Khan Agency' at MetLife Bangladesh to fulfill your dreams.\n\nWhy become a Financial Associate at MetLife?\n\n- Quick opportunities for promotion through your hard work and skills\n- Financial Associate ----> Unit Manager ----> Branch Manager\n\nEconomic Benefits:\n\n1. Start earning quickly after joining\n2. Average annual income of 40 lakhs for the top 50 performers\n3. Average annual income of 20 lakhs for the top 100 performers, along with other bonuses\n4. Special recognition and rewards for exceptional performance\n\nOpportunities for Dream Fulfillment:\n\n1. International and domestic travel\n2. Recognition at international conferences\n3. Medical coverage for the family\n4. Provident Fund\n5. Scholarships for children's education\n\nChances for Rapid Success:\n\n1. World-class training facilities\n2. Skilled trainers\n3. Digital workspace\n4. 100% online-based programs\n5. Digital tools for sales and activity management\n\nOpportunity for Personal Business:\n\n1. Opportunity to start your own business without any investment\n2. Quick promotion based on performance, leading to opportunities as Unit Manager and later as Branch Manager\n3. Opportunity to start an agency in your own name\n4. Work flexibility based on your convenience\n\nResponsibilities: Assist millions of people in the country by providing health and financial security. Establish and maintain relationships with clients to achieve business goals.\n\nWork Flexibility: Part-time and full-time job opportunities.\n\nContact:\n'H.K. Khan Agency'\nMetLife, Bangladesh\nAddress: B I S T Bhaban, 5th Floor, Holding # 122/A, Kakrail Road, Dhaka-1000 (Near Habibullah Bahar College)\nPhone Number: 01715564488\n\n\"If you are ready to take on challenges and want to tread the path of a successful career, then apply today to join this dynamic team at DUDANT.\"\n\nRequirements: Qualifications: Masters from HSC. Age: 25 or above.\n\nআপনি কি পরিশ্রমী,আপনি কি উচ্চাকাঙ্খী এবং সৎ উপায়ে জীবনে প্রতিষ্ঠিত হতে চান ? তাহলে আপনার জন্য ১৫৫+ বছরের অভিজ্ঞা সম্পন্ন বিশ্বব্যাপি ৪০+ টির ও অধিক দেশে সমৃদ্ধ আছে  এবং বাংলাদেশে ৭০+ বছর যাবৎ Leading Position এ থাকা আমেরিকান Financial Organisation MetLife- এ একজন Financial Associate হিসেবে কাজ করার এক সুবর্ণ সুযোগ রয়েছে। আজই জয়েন করুন,এখনি মেটলাইফের প্রতিনিধি হোন,সমাজ /দেশের সেবায় অবদান রাখুন। পদের নাম: 'ফিনান্সিয়াল অ্যাসোসিয়েট' পদের  বিবরণ: ফিনান্সিয়াল অ্যাসোসিয়েট পদে আপনার ভবিষ্যৎ উজ্জ্বল করুন এ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20779",
    "job_id": "20779",
    "company_name": "Shomvob Global",
    "job_title": "TRANSGUARD GROUP LLC(DIRECT CO.) – Dubai তে এয়ারক্রাফট ক্লিনার",
    "location": "United Arab Emirates",
    "salary": "TK. 36,000-40,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-15",
    "date_posted": "2026-03-01",
    "industry": "Household",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": "United Arab Emirates",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: TRANSGUARD GROUP LLC (DIRECT CO.) - Dubai is hiring for the position of Aircraft Cleaner.\n\nJob Responsibilities:\n- Cleaning cabin (seats, tables, floors, windows, etc.)\n- Sanitizing lavatories and galleys and refilling necessary supplies\n- Collecting and disposing of trash/waste at designated locations\n- Properly arranging seat pockets, magazines, safety cards\n- Completing cleaning quickly following safety regulations\n\nBenefits:\n- Salary: 1100+ OT\n- Accommodation provided by the company\n- Working hours: 8+1 hours per day\n\nQualifications: (Please read carefully before applying)\n- Age: 21-35 years. Candidates outside this age range will not be called for an interview.\n- Candidates must have passed HSC and have good English speaking, writing, and comprehension skills.\n- Passport: All candidates must bring both new and old passports to the interview. The passport must be valid for a minimum of 1.5 years. Candidates without a passport should not apply.\n- Interview method: Candidates must be present in person for the delegate interview.\n- Personality and appearance: Candidates must be smart, attractive, and presentable.\n\nDelegate Interview: March 2026 (Dhaka)\n\nAdditional Information:\n1. Visa validity: 2 years - renewable\n2. Probation period: Up to 3 months from the date of joining the job.\n\nTRANSGUARD GROUP LLC(DIRECT CO.) – Dubai তে এয়ারক্রাফট ক্লিনার (Aircraft Cleaner) পদে নিয়োগ চলছে। কাজের দায়িত্ব: কেবিন পরিষ্কার করা (সিট, টেবিল, ফ্লোর, জানালা ইত্যাদ... ল্যাভেটরি ও গ্যালি স্যানিটাইজ করে প্রয়োজনীয় সামগ্রী রিফিল করা। ট্র্যাশ/বর্জ্য সংগ্রহ ও নির্দিষ্ট স্থানে অপসারন। সিট পকেট, ম্যাগাজিন, সেফটি কার্ড ঠিকভাবে সাজানো। নিরাপত্তা নিয়ম মেনে দ্রুত ক্লিনিং সম্পন্ন করা। সুবিধাসমূহ: বেতন: ১১০০+ওটি থাকার ব্যবস্থা: কোম্পানি দেবে কর্মঘণ্টা: দিনে ৮+১ ঘণ্টা। 📌 যোগ্যতাঃ (দয়া করে ভালো করে পড়ে এরপর জবে এপ্লাই করুন) ======================================== ✔️ বয়সঃ ২১ - ৩৫ বছর। এর বাহিরের বয়সের প্রার্থীদেরকে ইন্টারভিউতে ডাকা হবে না। ✔️ প্রার্থীকে এইচ এস সি পাশ এবং ভালো ইংরেজি বলা, লেখা ও বুঝার ক্ষমতা থাকতে হবে। ✔️ পাসপোর্ট: নতুন-পুরাতন সকল পাসপোর্ট ইন্টারভিউতে সাথে নিয়ে আসতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১.৫ বছর থাকতে হবে। যাদের পাসপোর্ট নেই, তারা দয়া করে এপ্লাই করবেন না। ✔️ ইন্টারভিউ পদ্ধতি: ডেলিগেট ইন্টারভিউতে স্ব শরীরে উপস্থিত থাকতে হবে। ✔️ ব্যক্তিত্ব ও সৌন্দর্যঃ  স্মার্ট, আকর্ষণীয় ও পরিপাটি হতে হবে । 📆 ডেলিগেট ইন্টারভিউ: মার্চ, ২০২৬ (ঢাকা) আরও প্রয়োজনীয় তথ্য সমূহঃ ১। ভিসা চুক্তির মেয়াদঃ ২ (দুই) বছর – নবায়নযোগ্য ২। প্রবেশনারী সময়কালঃ কাজে যোগদানের তারিখ থেকে ৩ মাস পর্যন্ত।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20756",
    "job_id": "20756",
    "company_name": "Alternative Recruitment Limited",
    "job_title": "Customer  Relationship Officer ",
    "location": "Uttara",
    "salary": "TK. 18,000-25,000",
    "experience": "Fresher",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-28",
    "date_posted": "2026-03-01",
    "industry": "General Management/Admin",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Position : Customer Relationship Officer Location : Uttara 12, Dhaka Vacancies : 20\n\nWe are seeking a detail-oriented and proactive Relationship Officer to provide essential support to our customer relationship operations internationally. This role is a fantastic opportunity to gain hands-on experience in a professional environment, assisting with daily tasks and special projects. What You Will Do (Key Duties) - Build and maintain strong, long-term relationships with international clients and partners.\n- Connecting students to International Opportunities for higher studies, internship, and placements.\n- Collaborating with renowned international universities for various activities related to academics, research, and student's career.\n- Facilitate effective communication between international partners and internal teams. Address and resolve any issues or conflicts that arise.\n- Lead negotiations with international partners, ensuring favorable terms and agreements.\n- Prepare and review contracts and agreements to ensure compliance and alignment with organizational goals.\n\nRequirements: What we need from you : Proficiency in spoken Hindi, English. Good writing skills in English is a plus. Strong knowledge of the Microsoft Office Suite (Word, Excel, Outlook). Highly organized, reliable, and excellent time management skills. Ability to handle confidential information professionally. Additional Requirements Age: At least 22 years Strong interpersonal and communication skills. Proven negotiation and contract management abilities. Ability to work independently and as part of a team. Excellent problem-solving skills and attention to detail. What You Get Salary: 18,000-25,000 BDT/month Evening Snack Two yearly Festival Bonuses A path to a permanent role with a salary increment after 3 months based on performance. Yearly salary increment will be 6-10% based on your performance. Real experience, real projects, real results - in a global company. Work Schedule Location: Uttara 12, Dhaka Hours: 11:00 AM – 8:00 PM Days: 6 days/week (office-based)\n\nPosition : Customer Relationship Officer Location: Uttara 12, Dhaka Vacancies: 20 We are seeking a detail-oriented and proactive Relationship Officer to provide essential support to our customer relationship operations internationally. This role is a fantastic opportunity to gain hands-on experience in a professional environment, assisting with daily tasks and special projects. What You Will Do (Key Duties) Build and maintain strong, long-term relationships with international clients and partners. Connecting students to International Opportunities for higher studies, internship, and placements Collaborating with renowned international universities for various activities related to academics, research, and student`s career. Facilitate effective communication between international partners and internal teams. Address and resolve any issues or conflicts that arise. Read negotiations with international pa"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20780",
    "job_id": "20780",
    "company_name": "Shomvob Global",
    "job_title": "TRANSGUARD GROUP LLC(DIRECT CO.) – Dubai তে ম্যাসন ",
    "location": "United Arab Emirates",
    "salary": "TK. 38,000-45,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-03-01",
    "industry": "Construction",
    "vacancy": 100,
    "shift": "Day Shift",
    "country": "United Arab Emirates",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: TRANSGUARD GROUP LLC(DIRECT CO.) - Dubai is hiring for the position of Mason . Job Responsibilities: Working with blocks, bricks, and tiles Leveling and plastering Working according to drawings Maintaining site cleanliness Preparing concrete mixtures Ensuring quality of work Benefits: Salary: 1150+OT Accommodation: Provided by the company Working Hours: 8+1 hours per day 📌 Qualifications: (Please read the details carefully before applying for the job) Age: 21 - 40 years. Candidates outside this age range will not be called for an interview. Educational Qualification: SSC or equivalent Proficiency in speaking and writing English clearly and fluently is necessary. Relevant work experience of 1-2 years in the related field is required. 📆 Delegate Interview: March, 2026 (Dhaka) Additional Information: Visa Validity: 2 (two) years - renewable Passport: All candidates must bring both new and old passports to the interview. The passport must have a minimum validity of 1.5 years. Candidates without passports should not apply.\n\nTRANSGUARD GROUP LLC(DIRECT CO.) – Dubai তে ম্যাসন পদে নিয়োগ চলছে। কাজের দায়িত্ব: ব্লক, ইট, টাইলস বসানোর কাজ লেভেলিং, প্লাস্টারিং ড্রয়িং অনুযায়ী কাজ করা সাইট পরিস্কার রাখা কংক্রিট মিশ্রণ প্রস্তুত করা কাজের মান বজায় রাখা সুবিধাসমূহ: বেতন: ১১৫০+ওটি থাকার ব্যবস্থা: কোম্পানি দেবে কর্মঘণ্টা: দিনে ৮+১ ঘণ্টা। 📌 যোগ্যতাঃ (দয়া করে বিস্তারিত ভালো করে পড়ে এরপর জবে এপ্লাই করুন) বয়সঃ ২১ - ৪০বছর। এর বাহিরের বয়সের প্রার্থীদেরকে ইন্টারভিউতে ডাকা হবে না। শিক্ষাগত যোগ্যতাঃ SSC/সমমান ইংরেজিতে পরিষ্কার ও সাবলীলভাবে কথা বলা ও লেখার দক্ষতা আবশ্যক। সংশ্লিষ্ট কাজে ১-২ বছর বাস্তব অভিজ্ঞতা আবশ্যক। 📆 ডেলিগেট ইন্টারভিউ: মার্চ, ২০২৬ (ঢাকা) আরও প্রয়োজনীয় তথ্য সমূহঃ ভিসা চুক্তির মেয়াদঃ ২ (দুই) বছর – নবায়নযোগ্য পাসপোর্ট : নতুন-পুরাতন সকল পাসপোর্ট ইন্টারভিউতে সাথে নিয়ে আসতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১.৫ বছর থাকতে হবে। যাদের পাসপোর্ট নেই, তারা দয়া করে এপ্লাই করবেন না।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20789",
    "job_id": "20789",
    "company_name": "Luxurious Architects",
    "job_title": "Interior Designer / Architect",
    "location": "Kawran Bazar",
    "salary": "TK. 25,000-35,000",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-04-01",
    "date_posted": "2026-03-01",
    "industry": "Engineer",
    "vacancy": 2,
    "shift": "Other",
    "country": null,
    "company_address": "Banglamotor, Dhaka",
    "job_description": "Responsibilities: Job Context\n* We are looking to hire an Interior Designer / Architect\n* An Architect who will solve our interior design-related problems with excellent skills.\nJob Responsibilities\n* To coordinate with clients about design and drawings.\n* Should have a creative idea of modern interior design\n* Expert in 2D floor plan & 3D Design\n* Costing & Quotation making.\nEmployment Status\nFull-time\nWorkplace\n* Work at the office\nEducational Requirements\n* Bachelor of Science (B.Arch.) in Architecture or Diploma in Interior design from a reputed university or Institute.\n* Skills Required: 2D, 3D design, AutoCAD, 3Ds-max, V Ray Render\nExperience Requirements\n* At least 2 years\nJob Location\nBanglamotor, Dhaka\n\nSalary\n* 25k-35k, Depending on the Quality of Rendering & Creativity.\nCompensation & Other Benefits\n* Festival Bonus: 2 (50% of the salary) after one year of successful service.\n* Yearly salary review based on the best performance.\nPlease send your CV to Luxuriousarchitects4@gmail.com\n\nJob Context * We are looking for hiring An Interior Designer / Architect * Architect who will solve our interior design related problem with excellent skills. Job Responsibilities * To coordinate with clients about design and drawings. * Should have creative Idea of modern interior design * Expert in 2D floor plan & 3D Design himself * Costing & Quotation making. Employment Status Full-time Workplace * Work at office Educational Requirements * Bachelor of Science (B.Arch.) in Architecture or Diploma In Interior design of reputed university or Institute. * Skills Required: 2D, 3D design, AutoCAD, 3Ds-max, V Ray Render Experience Requirements * At least 2 year(s) Job Location Banglamotor,Dhaka Salary * 25k-35k, Depend on Quality of Rendering & Creativity. Compensation & Other Benefits * Festival Bonus: 2 (50% of the salary) after one year successful service. * Yearly salary review in basis of best performance. Please send your Cv to Luxuriousarchitects4@gmail.com"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20786",
    "job_id": "20786",
    "company_name": "HN INTERNATIONAL",
    "job_title": "Customer Relations & Digital Marketing",
    "location": "Gulshan-Banani, Bashundhara R/A, Badda, Baridhara, Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-04-01",
    "date_posted": "2026-03-01",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House-1/B, Road-2/1, Block-J, Baridhara, Dhaka-1212.",
    "job_description": "Responsibilities: We are a leading manpower recruitment agency looking for a dynamic, energetic, and self-motivated Female Executive to join our team. If you have excellent communication skills and a knack for digital marketing, we want to hear from you!\n\nKey responsibilities and deliverables:\n\n- Manage end-to-end customer interactions across channels: handle inbound and outbound calls, social media messages, and direct inquiries; follow up promptly to convert leads and resolve issues.\n- Develop, implement and maintain a content calendar for social platforms (Facebook, Instagram, TikTok, LinkedIn), including post concepts, captions, visuals, and publishing schedule.\n- Execute community management: respond to comments, moderate conversations, escalate complaints, and maintain a positive brand voice online.\n- Support digital campaign setup and monitoring: assist with organic campaigns, coordinate with paid advertising teams, prepare ad copy suggestions, and track basic campaign metrics.\n- Maintain accurate records in CRM or lead-tracking tools: log conversations, update lead status, set reminders, and produce basic follow-up reports.\n- Collaborate with internal teams (sales, recruitment, creative) to align messaging, share feedback from customers, and refine lead nurturing strategies.\n- Contribute to performance improvement by suggesting A/B tests for posts/ads, refining targeting, and documenting what content formats drive the best engagement.\n\nRequired technical skills:\n\n- Social media management: hands-on experience publishing posts, scheduling content, and monitoring engagement across major platforms (examples: Facebook Business Suite, Creator Studio, Instagram tools).\n- Content creation basics: ability to write clear, audience-appropriate captions and produce simple visual assets (examples: Canva, basic image editing); knowledge of post format best practices for engagement.\n- Analytics and reporting: familiarity with basic metrics (reach, impressions, engagement rate, click-through, conversion indicators) and ability to compile simple weekly performance summaries using spreadsheets or dashboards.\n- CRM and lead management: experience with lead logging, follow-up workflows, and simple segmentation (examples: HubSpot, Zoho, Google Sheets-based trackers).\n- Digital communication tools: comfortable using email, chat platforms, video calls, and phone systems; ability to maintain professional written and verbal records of interactions.\n- Basic technical literacy: comfortable learning new SaaS tools, troubleshooting common issues (login, permissions, media upload), and following step-by-step platform guides.\n- Lead response time and follow-up completion rate.\n- Engagement metrics for social content (likes, comments, shares, saves) and follower growth trends.\n- Conversion or qualification rate from social and tele-outreach to next-stage action (appointment, application, demo).\n- Accuracy and completeness of CRM records and timely reporting of weekly a"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20787",
    "job_id": "20787",
    "company_name": "BYSL Global Technology Group",
    "job_title": "Office Support Assistant",
    "location": "Dhaka",
    "salary": "TK. 12,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-04-01",
    "date_posted": "2026-03-01",
    "industry": "General Management/Admin",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 💼 Responsibilities: Performing daily administrative tasks in the office Maintaining files, documents, and records Receiving phone calls and providing necessary information Assisting with other office tasks ⏰ Working Hours: 10 hours per day Overtime facility available 💰 Salary: 12,000 Taka 🎓 Qualifications: Minimum SSC pass Prior knowledge about office work is preferred Good if experienced in computer operation\n\n💼 দায়িত্বসমূহ: অফিসের দৈনন্দিন প্রশাসনিক কাজ সম্পাদন ফাইল, ডকুমেন্ট ও রেকর্ড সংরক্ষণ ফোন কল রিসিভ ও প্রয়োজনীয় তথ্য প্রদান অফিসের অন্যান্য সহায়ক কাজ করা ⏰ কর্মঘণ্টা: প্রতিদিন ১০ ঘণ্টা ওভারটাইম সুবিধা রয়েছে 💰 বেতন: ১২,০০০ টাকা 🎓 যোগ্যতা: ন্যূনতম এসএসসি অফিসের কাজ সম্পর্কে প্রাথমিক ধারণা থাকলে অগ্রাধিকার কম্পিউটার চালনায় অভিজ্ঞতা থাকলে ভালো"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20788",
    "job_id": "20788",
    "company_name": "BYSL Global Technology Group",
    "job_title": "Driver",
    "location": "Dhaka",
    "salary": "TK. 20,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-04-01",
    "date_posted": "2026-03-01",
    "industry": "Transportation",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 🔹 Salary and Benefits: Salary: 20,000 BDT + Overtime (Total estimated 30,000-35,000 BDT) Lunch fully subsidized Snacks and breakfast provided ✅ Qualifications and Requirements: Educational Qualification: SSC or equivalent / above Experience: Experienced driver preferred Age: Mid-range (appropriate working age) Special Qualifications (mandatory): Must have a valid driving license Must be capable of driving all types of vehicles Must be responsible and punctual\n\n🔹 বেতন ও সুবিধা: বেতন: ২০,০০০ টাকা + ওভারটাইম (মোট আনুমানিক ৩০,০০০–৩৫,০০০ টাকা) লাঞ্চ সম্পূর্ণ সাবসিডাইজড স্ন্যাকস ও ব্রেকফাস্ট সুবিধা ✅ যোগ্যতা ও প্রয়োজনীয়তা: শিক্ষাগত যোগ্যতা: SSC বা সমমান / তার উপরে অভিজ্ঞতা: অভিজ্ঞ ড্রাইভার অগ্রাধিকারযোগ্য বয়স: মিড রেঞ্জ (উপযুক্ত কর্মক্ষম বয়স) বিশেষ যোগ্যতা (অবশ্যই প্রয়োজন): বৈধ ড্রাইভিং লাইসেন্স থাকতে হবে সব ধরনের গাড়ি চালাতে সক্ষম হতে হবে দায়িত্বশীল ও সময়ানুবর্তী হতে হবে"
  }
]