[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20475",
    "job_id": "20475",
    "company_name": "Alpha iTech",
    "job_title": "Management Trainee Officer (MTO)",
    "location": "Dhanmondi",
    "salary": "TK. 15,000-20,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "7 hours per day",
    "deadline": "2026-03-15",
    "date_posted": "2026-02-17",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Salek Garden, House # 42/A, Zigatola, Dhaka 1209, Bangladesh.",
    "job_description": "Responsibilities: - Assist in daily operational and administrative tasks\n- Support team activities and project execution\n- Maintain reports and documentation as required\n- Coordinate with different departments when necessary\n- Perform assigned tasks within deadlines\n\nBenefits:\n- Dinner and snacks provided\n- Opportunity for permanent employment after successful completion of 3-month probation\n- Salary increment after confirmation\n\n**Probation Period: 3 Months**\n\nWorking Hours:\n- Physical Office: 5:00 PM – 10:00 PM\n- Home Office: 2 hours (after returning home)\n- Weekly Off: Saturday & Sunday\n\nRequirements: - Good communication skills\n- Basic computer knowledge (MS Office, email, etc.)\n- Responsible, punctual, and willing to learn\n- Ability to work both independently and in a team\n\nEducational Requirement:\n- Honours completed (Bachelor's degree)\n  **Only freshers are eligible to apply**\n  **Must have good English communication skill**\n\nEnsure high standards of service quality and customer satisfaction. Manage and maintain strong relationships with key customers and vendors. Drive growth in priority categories across designated channels. Support market development initiatives for emerging categories. Encourage and implement innovation within the marketplace. Contribute to improving distribution efficiency, productivity, and overall performance. Perform analytical tasks and prepare reports as required. Complete assigned responsibilities within deadlines while maintaining accuracy. Working Hours: Physical Office: 5:00 PM – 10:00 PM Home Office: 2 hours (after returning home) Weekly Off: Saturday & Sunday This position is strictly for the Night Shift Analyst role. Benefits: Dinner and snacks provided Opportunity for permanent employment after successful completion of the 3-month probation period Salary increment after confirmation **Probation Period: 3 Months**"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20476",
    "job_id": "20476",
    "company_name": "Nahian Technology BD",
    "job_title": "Call Center Executive",
    "location": "Uttara",
    "salary": "TK. 12,000-15,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Call Center",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House No: 26, Road No: 13m Uttara, Dhaka",
    "job_description": "Responsibilities: - Handle inbound and outbound calls professionally.\n- Provide accurate information regarding products, services, and policies.\n- Respond to customer inquiries, concerns, and complaints with a service-oriented attitude.\n- Promote company products/services when appropriate.\n- Maintain strong product knowledge to offer the best solutions to customers.\n- Achieve assigned call targets, sales goals, or service objectives.\n- Log all call information accurately in the system.\n- Maintain customer databases and update information when necessary.\n- Identify customer needs and escalate complex issues to the relevant department.\n- Follow up on unresolved issues to ensure customer satisfaction.\n- Work closely with supervisors and team members to achieve team KPIs.\n- Continuously participate in training sessions to improve skills.\n\nHandle inbound and outbound calls professionally. Provide accurate information regarding products, services, and policies. Respond to customer inquiries, concerns, and complaints with a service-oriented attitude. Promote company products/services when appropriate. Maintain strong product knowledge to offer the best solutions to customers. Achieve assigned call targets, sales goals, or service objectives. Log all call information accurately in the system. Maintain customer databases and update information when necessary. Identify customer needs and escalate complex issues to the relevant department. Follow up on unresolved issues to ensure customer satisfaction. Work closely with supervisors and team members to achieve team KPIs. Continuously participate in training sessions to improve skills."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20461",
    "job_id": "20461",
    "company_name": "Dhaka Poly-Pack Industries Ltd",
    "job_title": "ড্রাইভার",
    "location": "Notun Bajar",
    "salary": "TK. 17,000-20,000",
    "experience": "1-3 years",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-15",
    "date_posted": "2026-02-17",
    "industry": "Transportation",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Hashem Ali Khan Tower, KA-64, Progati Sarani, Shahjadpur, Gulshan, Dhaka",
    "job_description": "Responsibilities: Drive the company-designated vehicle safely and responsibly Ensure transportation for office or family members as needed Maintain regular cleanliness and hygiene of the vehicle Take care of vehicle documents and maintenance matters Perform additional responsibilities as required ***Facility: Accommodation and food arrangements are available***\n\nRequirements: Minimum Eighth/SSC pass Must have a valid driving license Must have a good understanding of Dhaka city roads At least 1-2 years of driving experience preferred Must be punctual, responsible, and have good conduct\n\nকোম্পানির নির্ধারিত গাড়ি নিরাপদ ও সতর্কতার সাথে চালানো অফিস বা পরিবারের সদস্যদের প্রয়োজন অনুযায়ী যাতায়াত নিশ্চিত করা গাড়ির নিয়মিত পরিষ্কার-পরিচ্ছন্নতা বজায় রাখা গাড়ির কাগজপত্র ও রক্ষণাবেক্ষণের বিষয়গুলো খেয়াল রাখা প্রয়োজন অনুযায়ী অতিরিক্ত দায়িত্ব পালন করা ***সুবিধা: থাকা ও খাওয়ার ব্যবস্থা রয়েছে***"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20462",
    "job_id": "20462",
    "company_name": "Kanchpur Furniture",
    "job_title": "📢 জরুরী নিয়োগ — Online Sales Executive (Remote)",
    "location": "Narayanganj",
    "salary": "TK. 8,000-13,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Beside Chandmahal Cinema Hall, Near Kanchpur Busstand, Sonargaon, Narayanganj.",
    "job_description": "Responsibilities: 📢 Urgent Job Opening - Online Sales Executive (Remote)\n\nCompany: Kanchpur Furniture\nJob Type: Remote / Work from Home\nNumber of Positions: 5\n\n⏰ Working Hours (Shift Based)\n🌅 Morning Shift (6:00 AM - 2:00 PM)\n🌙 Evening Shift (2:00 PM - 10:00 PM)\n\nResponsibilities:\n- Confirming website orders\n- Responding to WhatsApp and Facebook Messenger\n- Handling customer inquiries\n- Sending product information\n- Taking lead notes\n- Entering orders into software\n- Providing information to delivery team\n\n🎯 Candidate Qualifications:\n- Must be able to speak in clear language\n- Must know how to operate smartphones and computers\n- Must be proficient in Bengali and English typing\n- Prior experience in online sales/moderation is a plus\n\n🎓 Benefits:\n- Digital marketing training\n- Commission system\n- Long-term job opportunities\n- Women and freshers are encouraged to apply\n\n📩 Application Process:\nSend CV via WhatsApp or Email:\n📱 WhatsApp/Call: 01797587312\n📧 Email: kanchpurfurniture@gmail.com\n\n📢 জরুরী নিয়োগ — Online Sales Executive (Remote) প্রতিষ্ঠান: Kanchpur Furniture কাজের ধরন: রিমোট / বাসা থেকে কাজ পদসংখ্যা: ৫ জন ⏰ কাজের সময় (Shift Based) 🌅 Morning Shift (৬:০০ AM – ২:০০ PM) 🌙 Evening Shift (২:০০ PM – ১০:০০ PM) দায়িত্বসমূহ:- Website অর্ডার কনফার্ম করা WhatsApp ও Facebook Messenger রিপ্লাই দেওয়া কাস্টমার ইনবক্স হ্যান্ডেল করা প্রোডাক্ট ইনফরমেশন পাঠানো লিড নোট করে রাখা সফটওয়্যারে অর্ডার এন্ট্রি ডেলিভারি টিমকে ইনফরমেশন পাঠানো 🎯 প্রার্থী যোগ্যতা শুদ্ধ ভাষায় কথা বলতে পারতে হবে স্মার্টফোন ও কম্পিউটার চালাতে জানতে হবে বাংলা ও ইংরেজি টাইপিং জানা থাকতে হবে অনলাইন সেলস/মডারেশন অভিজ্ঞতা থাকলে অগ্রাধিকার 🎓 সুযোগ সুবিধা ডিজিটাল মার্কেটিং ট্রেনিং কমিশন সিস্টেম দীর্ঘমেয়াদী কাজের সুযোগ নারী ও ফ্রেশারদের আবেদন স্বাগতম 📩 আবেদন প্রক্রিয়া WhatsApp বা Email এ CV পাঠান:- 📱 WhatsApp/Call: 01797587312 📧 Email: kanchpurfurniture@gmail.com"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20471",
    "job_id": "20471",
    "company_name": "MN Enterprise",
    "job_title": "ক্লিনার",
    "location": "Uttara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Household",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House: 57, Road No: 7, Uttara, Dhaka",
    "job_description": "Responsibilities: Bathroom cleaning and disinfection: Regularly clean the toilet, basin, and floor of the bathroom to keep it free from germs and ensure a healthy environment. Maintaining cleanliness and orderly environment: Regularly clean the floor, windows, and all surfaces in the designated area to maintain a clean and healthy environment. Waste disposal: Collect daily waste and dispose of it in designated areas. Providing broom and mop: Provide a broom and mop for cleaning, and polish if necessary. Maintenance of cleaning equipment: Properly maintain and supervise the equipment used for cleaning and sanitation. Keeping necessary supplies stocked: Ensure toilet paper, soap, etc., are always fully stocked. Follow the instructions of the supervisor.\n\nবাথরুম পরিষ্কার ও জীবাণুমুক্তকরণ: বাথরুমের টয়লেট, বেসিন ও মেঝে নিয়মিতভাবে পরিষ্কার করে জীবাণুমুক্ত রাখা এবং স্বাস্থ্যসম্মত পরিবেশ নিশ্চিত করা। পরিচ্ছন্নতা ও সুশৃঙ্খল পরিবেশ বজায় রাখা: নির্ধারিত এলাকায় নিয়মিতভাবে মেঝে, জানালা, আসবাবপত্রসহ সকল স্থানের ধুলো-ময়লা পরিষ্কার করে পরিচ্ছন্ন ও স্বাস্থ্যসম্মত পরিবেশ নিশ্চিত করা। আবর্জনা সরানো: প্রতিদিনের আবর্জনা সংগ্রহ করে নির্দিষ্ট স্থানে ফেলা। মেঝে মোছা ও ঝাড়ু দেওয়া: মেঝে ঝাড়ু দেওয়া ও মোছা, প্রয়োজনে পলিশ করা। পরিচ্ছন্নতার সরঞ্জাম রক্ষণাবেক্ষণ: পরিষ্কার-পরিচ্ছন্নতার জন্য ব্যবহৃত সরঞ্জামগুলো যথাযথভাবে সংরক্ষণ ও রক্ষণাবেক্ষণ করা। প্রয়োজনীয় সামগ্রী পূর্ণ রাখা: টয়লেট পেপার, সাবান ইত্যাদি পুনরায় পূর্ণ রাখা। সুপারভাইজারের নির্দেশনা অনুযায়ী কাজ করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20474",
    "job_id": "20474",
    "company_name": "Lion Industrious Security Service Ltd. Dhaka",
    "job_title": "সহকারী সুপারভাইজার",
    "location": "Dhaka, Jatrabari",
    "salary": "TK. 16,500-18,500",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Security/Support Service",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kajla Bridge, Demra Road, Jatrabari, Jatrabari, Bangladesh",
    "job_description": "Responsibilities: Registered and licensed organizations will hire a number of assistant supervisors and guards for the security and surveillance of domestic and foreign Chinese and Indian projects, mills, industries, factories, houses, showrooms, banks, and ATM booths.\n\nRequirements: No need for experience or guarantee here. Other facilities: Free accommodation. Bonus is given by the 10th of each month. Adequate overtime benefits available. Free medical treatment, two festival bonuses per year. Attendance bonus equivalent to one day's attendance. Salary will increase in the first 6 months and annually thereafter. Those who are willing to work can contact the office directly or via WhatsApp. Contact: 01329666015 Yatrabari Kajla Bridge.\n\nরেজিস্ট্রিকৃত ও লাইসেন্স প্রাপ্ত প্রতিষ্ঠান এর অধীনে দেশি বিদেশি চাইনা ও ইন্ডিয়ান প্রজেক্টে, মিল, শিল্প, কারখানা, হাউস, শোরুম, ব্যাংক এটিএম বুথ এর নিরাপত্তা বাস্তবায়ন ও দেখাশোনা করার জন্য বেশ কিছু সংখ্যক সহকারী সুপারভাইজার গার্ড নিয়োগ করা হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20479",
    "job_id": "20479",
    "company_name": "Integrated Marketing Service Ltd (IMS) ( Narayanganj)",
    "job_title": "Executive / Sr. Executive ( SME & Corporate Sales)",
    "location": "Narayanganj, Munshiganj",
    "salary": "TK. 24,000-28,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 100,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Bella Vita(1st Floor), Beside SP Office, Chanmari, Adarsha Chasara, Narayanganj",
    "job_description": "Responsibilities: Join Robi and gain new experiences in your career! Department: SME & Corporate Sales Location: Narayanganj, Siddhirganj, Munshiganj Responsibilities: Maintain good relationships with existing and new accounts. Develop and implement strategic plans to increase SME sales coverage. Identify new clients and be proactive in acquiring new business. Manage relationships with corporate clients and ensure service delivery according to their needs. Prepare necessary documentation for bulk activations and other processes. Contribute to business development and strategic initiatives. Qualifications: Graduate in any discipline. Candidates with their own motorbike will be given preference. Benefits: Salary: ৳24,000 - ৳28,000 Bike allowance Provident fund Mobile bill Eid bonus Health insurance Gift/vouchers/monthly rewards Contact: Robi Mobile: +8801844637906 Placement Office Address: Bela Vita (1st floor), adjacent to SP Office Chanmari, Adarsh Chashara, Narayanganj\n\nRobi-তে যোগ দিন এবং আপনার ক্যারিয়ারে নতুন অভিজ্ঞতা অর্জন করুন! ডিপার্টমেন্ট: SME & Corporate Sales কর্মস্থল: নারায়ণগঞ্জ, সিদ্ধিরগঞ্জ , মুন্সিগঞ্জ দায়িত্বসমূহ: বিদ্যমান এবং নতুন অ্যাকাউন্টের সঙ্গে সুসম্পর্ক বজায় রাখা। SME সেলস কভারেজ বাড়ানোর জন্য কৌশলগত পরিকল্পনা গ্রহণ ও বাস্তবায়ন করা। নতুন ক্লায়েন্ট সুযোগ খুঁজে বের করা এবং নতুন ব্যবসা অর্জনে উদ্যোগী হওয়া। কর্পোরেট ক্লায়েন্টদের সঙ্গে সম্পর্ক ব্যবস্থাপনা এবং তাদের প্রয়োজন অনুযায়ী সেবা নিশ্চিত করা। বাল্ক অ্যাক্টিভেশন ও অন্যান্য প্রসেসের জন্য প্রয়োজনীয় ডকুমেন্টেশন প্রস্তুত করা। ব্যবসা উন্নয়ন ও কৌশলগত উদ্যোগে অবদান রাখা। যোগ্যতা: যেকোনো বিষয়ে স্নাতক পাশ। নিজের মোটরবাইক থাকা প্রার্থীদের অগ্রাধিকার দেওয়া হবে। সুবিধাসমূহ: বেতন: ৳২৪,০০০ – ৳২৮,০০০ বাইক এলাউন্স প্রভিডেন্ট ফান্ড মোবাইল বিল ঈদ বোনাস হেলথ ইন্স্যুরেন্স গিফট/ভাউচার/মাসিক রিওয়ার্ডস যোগাযোগ: Robi মোবাইল: +8801844637906 Placement Office ঠিকানা: বেলা ভিটা (১ম তলা), এসপি অফিস চাঁনমারী সংলগ্ন, আদর্শ চাষাড়া, নারায়ণগঞ্জ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20478",
    "job_id": "20478",
    "company_name": "ASA INTERNATIONAL",
    "job_title": "SIEM Engineer – SOC Tooling & Detection Enablement",
    "location": "Shyamoli",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "5-10 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "IT/Telecommunication",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Job profile\nThe SIEM Engineer owns the design, implementation, and health of the SOC monitoring platform(s), ensuring reliable log collection, normalization, alerting, dashboards, and retention across ASA entities. The role partners with SOC analysts to enable effective detections and supports continuous tuning to improve fidelity and coverage.\n\nResponsibilities\n- SIEM Platform Operations: Install/configure and maintain SIEM components (e.g., Wazuh manager/indexer/dashboards), ensure availability, performance, and secure configuration.\n- Log Source Onboarding: Onboard and maintain telemetry from endpoints/servers, identity providers, email systems, firewalls/VPNs, network devices, and critical applications; validate log completeness and parsing.\n- Detection Engineering Support: Create, tune, and maintain detection rules/use cases; optimize for reduced false positives and improved detection of high-risk scenarios.\n- Dashboards & Reporting: Build operational and executive dashboards; enable scheduled reporting for SOC KPIs and risk insights.\n- Data Management: Manage retention, indexing, storage capacity planning, and data integrity; ensure time synchronization and consistent log formats.\n- Automation & Integrations: Integrate SIEM with ticketing/case management, EDR, and other tools to support workflow automation and enrichment (where available).\n- Documentation & Standards: Maintain documentation for architecture, log source inventory, parsing, rule sets, and operating procedures; support audit evidence requests.\n- Continuous Improvement: Identify telemetry gaps, propose improvements, and support rollout of monitoring standards across countries.\n\nCore competencies\n- Strong engineering discipline and troubleshooting capability.\n- Ability to translate detection requirements into technical configurations.\n- Good stakeholder collaboration: works effectively with analysts and IT teams to onboard logs and resolve issues.\n- Documentation discipline and attention to detail.\n\nCompensation & Benefits:\n- Competitive and attractive salary package will be offered to deserving candidates based on experience and skill set.\n- Festival Bonus\n- Provident Fund & Gratuity\n- Life & Health Insurance (IPD & OPD)\n- Annual Health Check-up\n- Baisakhi Allowance\n- Vehicle Loan Scheme / Vehicle Maintenance Allowance\n\nRequirements: Required knowledge and Technical Skills\n\n- Hands-on SIEM administration and engineering.\n- Log collection agents, syslog, Windows Event Forwarding concepts, and parsing/normalization.\n- Linux administration, scripting (Python/Bash), and basic network troubleshooting.\n- Understanding of common security telemetry sources (EDR, IAM/M365, firewalls, proxies, DNS) and how to use them for detection.\n- Secure hardening practices for SIEM infrastructure and supporting components.\n\nEducation and Experience:\n\n- Bachelor’s degree in Cyber Security/ Engineering/IT/Information Security or similar.\n- 4–8 years’ experience in SIEM/monitoring eng"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20460",
    "job_id": "20460",
    "company_name": "ASA INTERNATIONAL",
    "job_title": "Lead Information Security",
    "location": "Mirpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "5-10 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "IT/Telecommunication",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "ASA Tower Shyamoli",
    "job_description": "Responsibilities: Responsibilities\n▸ SOC Operations & Governance: Establish and run SOC processes (24/7 or 8x5 + on-call), shift handovers, case management standards, and escalation paths.\n▸ Incident Response Management: Lead and coordinate incident response activities across entities; run incident bridges, ensure evidence capture, and drive root-cause analysis and post-incident reviews.\n▸ Stakeholder Management: Interface with local IT teams, Risk/Compliance, and senior management; provide clear updates during incidents and routine operational reporting.\nCareer at ASA International\nCareer at ASA International Dhaka, Bangladesh\n▸ Detection & Monitoring Oversight: Ensure high reliability alerting by overseeing SIEM content, use-case coverage (e.g., privileged access abuse, malware, suspicious logins, data exfiltration), and noise reduction.\n▸ Platform Ownership (oversight): Ensure SOC tooling health and coverage (SIEM, EDR/XDR, email security, identity logs, network/security devices), including onboarding of critical log sources and maintaining documentation.\n▸ Threat & Vulnerability Alignment: Work with Vulnerability Management and relevant teams to ensure detection and response is aligned to critical vulnerabilities, emerging threats, and risk priorities.\n▸ Quality Assurance: Review investigation quality, closure codes, and adherence to SOPs/playbooks; coach analysts and enforce consistent standards.\n▸ Metrics & Continuous Improvement: Own SOC KPIs (MTTA/MTTR, alert-to-incident ratio, false positive rate, coverage), drive improvements, and support audit/regulator evidence requests.\n▸ People Leadership: Train and mentor L1/L2 analysts; manage performance goals, shift rotas, and professional development.\n\nCore competencies\n▸ Security Skills: Firewall Configuration, Policy Creating, Access Control List (ACL), VPN, SSL VPN, IPSEC VPN, URL filtering, Application Control, Web Application firewall operation, Privilege Access Management (PAM), SIEM, Two factor authentication, (2FA), VAPT tools, Load Balancing, Bandwidth Control, SSL Certificate report and log monitoring, regular configuration Backup and restore. Centralized Antivirus Operation, report, Control, Group Management. Web SSL certificate deployment etc.\n▸ System Deployment Knowledge: Installing and configuring Windows Server, Operation, Log/Event Check, Monitoring, data backup, OS update etc. Managing Clustered System, Guest VM monitoring. Good understanding of Virtualization, System Design, Plan, MPIO, ISCSI etc.\n▸ Network-System Design: Making Network Diagram, Creating and Making IP Plan, Product Selection for network, server and consumer products.\n▸ Networking Skills: Layer 2 and Layer 3 Switch configuration, Skills on SSH, VLAN, Inter VLAN Routing, Spanning Tree, Routing Protocol (static and dynamic), Device Hardening, GRE Tunnel, IPSec VPN, Interfaces, Device Configuration backup and restore etc.\n▸ Licensing and Subscription: Windows OS (Server and PC) licensing, Microsoft Office Licensi"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20473",
    "job_id": "20473",
    "company_name": "Fara IT Limited",
    "job_title": "ক্লায়েন্ট রিলেশনশিপ ম্যানেজমেন্ট (পার্ট-টাইম)",
    "location": "Mirpur",
    "salary": "TK. 6,000-8,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Company Name: FARA IT Limited Office Location: Mirpur-10, Shah Ali Market, Dhaka Job Type: Part-time (Work from Office) Salary: 6,000 Taka + Commission Requirement: Must have the mentality to work for at least 1 year Educational Qualifications: Minimum HSC pass Honors students will get preference Working Hours: 10 AM - 3 PM or 3 PM - 8 PM Responsibilities: Providing client support after software installation Immediate support for inbound calls Ensuring after-sales support as needed Following up with clients through outbound calls Managing CRM and keeping it regularly updated Managing monthly renewals of installed software Actively maintaining existing clients and collecting referral clients Required Skills: Good communication skills Ability to handle clients Basic knowledge of computers Experience working in Microsoft Word and Excel Responsibility and interest in teamwork Preference will be given to those with their own laptop\n\nকোম্পানির নাম: FARA IT Limited অফিস লোকেশন: মিরপুর-১০, শাহ আলী মার্কেট, ঢাকা চাকরির ধরন: পার্ট-টাইম (Work from Office) বেতন: ৬,০০০ টাকা + কমিশন শর্ত: কমপক্ষে ১ বছর কাজ করার মানসিকতা থাকতে হবে শিক্ষাগত যোগ্যতা: সর্বনিম্ন এইচএসসি পাশ অনার্সে অধ্যয়নরত প্রার্থীরা অগ্রাধিকার পাবেন দায়িত্ব পালনের সময়: সকাল ১০টা – দুপুর ৩টা অথবা বিকাল ৩টা – রাত ৮টা দায়িত্বসমূহ: সফটওয়্যার ইনস্টলেশনের পর ক্লায়েন্ট সাপোর্ট প্রদান ইনবাউন্ড কল রিসিভ করে তাৎক্ষণিক সাপোর্ট দেওয়া প্রয়োজন অনুযায়ী আফটার সাপোর্ট নিশ্চিত করা আউটবাউন্ড কলের মাধ্যমে ক্লায়েন্ট ফলোআপ করা CRM পরিচালনা ও নিয়মিত আপডেট রাখা ইনস্টলকৃত সফটওয়্যারের মাসিক রিনিউয়াল ম্যানেজ করা সক্রিয় ক্লায়েন্ট মেইনটেইন ও রেফারেল ক্লায়েন্ট সংগ্রহ করা প্রয়োজনীয় যোগ্যতা: ভালো যোগাযোগ দক্ষতা ক্লায়েন্ট হ্যান্ডেল করার সক্ষমতা কম্পিউটার সম্পর্কে প্রাথমিক জ্ঞান Microsoft Word ও Excel-এ কাজের অভিজ্ঞতা দায়িত্বশীল ও টিমওয়ার্কে আগ্রহী নিজস্ব ল্যাপটপ থাকলে অগ্রাধিকার দেওয়া হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20469",
    "job_id": "20469",
    "company_name": "Agritech International Trading",
    "job_title": "সেলস ও মার্কেটিং ম্যানেজার",
    "location": "Naogaon, Bogra, Rajshahi, Sirajganj",
    "salary": "TK. 20,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Our rapidly growing Agri-Tech International Trading company is inviting applications from qualified, hardworking, and result-oriented individuals for the position of Sales and Marketing Manager to expand our sales operations. Achieving sales targets in the designated area and ensuring their implementation Maintaining good relationships with existing dealers and distributors and managing the network Expanding and managing the network of new dealers and distributors Monitoring market analysis and activities of competitors Preparing and submitting monthly and quarterly sales reports Performing other responsibilities assigned by management Salary and Benefits: Salary: 20,000 BDT Salary negotiation for experienced candidates TA/DA Festival allowance\n\nRequirements: A bachelor's/master's degree in Agriculture, Marketing, Business Administration, or related field Minimum 2 years of experience in the agro-feed seed/fertilizer/pesticide/animal feed sector Prior experience in area sales management will be preferred Educational qualifications are flexible for experienced candidates\n\nআমাদের দ্রুত বর্ধনশীল এগ্রীটেক ইন্টারন্যাশনাল ট্রেডিং কোম্পানির বিক্রয় কার্যক্রম সম্প্রসারণের লক্ষ্যে যোগ্য, পরিশ্রমী ও ফলাফলমুখী সেলস ও মার্কেটিং ম্যানেজার পদে চাকরি প্রার্থীদের কাছ থেকে আবেদন আহ্বান করা যাচ্ছে। নির্ধারিত এলাকায় বিক্রয় লক্ষ্যমাত্রা অর্জন ও বাস্তবায়ন করা পুরাতন ডিলার ও ডিস্ট্রিবিউটর দের সুসম্পর্ক রাখা ও নেটওয়ার্ক পরিচালনা করা নতুন ডিলার ও ডিস্ট্রিবিউটর নেটওয়ার্ক সম্প্রসারন ও পরিচালনা করা বাজার বিশ্লেষণ ও প্রতিযোগী প্রতিষ্ঠানের কার্যক্রম পর্যবেক্ষণ করা মাসিক ও ত্রৈমাসিক বিক্রয় রিপোর্ট প্রস্তুত ও দাখিল করা ম্যানেজম্যান্টের অর্পিত অন্যান্য দায়িত্ব পালন করা বেতন ও সুযোগ-সুবিধাঃ বেতনঃ ২০,০০০ টাকা অধিক অভিজ্ঞদের জন্য বেতন আলোচনা সাপেক্ষে টিএ/ডিএ উৎসব ভাতা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20466",
    "job_id": "20466",
    "company_name": "SUNMAR SECURITY SERVICES LIMITED",
    "job_title": "Marketing Officer",
    "location": "Dhaka, Nikunjo",
    "salary": "TK. 15,000-20,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 📢 Job Announcement 🏢 Company: SUNMAR SECURITY SERVICES LIMITED 👨‍💼 Position: Marketing Officer 👥 Number of Positions: 20 📍 Location: Dhaka (may require occasional travel outside office) 🎓 Qualifications: ⭐ Preference will be given to candidates with experience in marketing or sales-related work ⭐ Must have good communication skills and a confident attitude 📌 Responsibilities: ⭐ Communicate and negotiate with new clients and corporate entities ⭐ Manage company's security service promotion and sales activities ⭐ Achieve specified sales targets ⭐ Conduct field visits and prepare reports 💰 Salary and Benefits: ⭐ Salary negotiable based on discussion ⭐ Opportunity for advancement based on performance\n\n📢 নিয়োগ বিজ্ঞপ্তি 🏢 প্রতিষ্ঠান: SUNMAR SECURITY SERVICES LIMITED 👨‍💼 পদবী: Marketing Officer 👥 পদসংখ্যা: ২০ জন 📍 কর্মস্থল: ঢাকা (প্রয়োজনে বাইরে অফিস সফর করতে হবে) 🎓 যোগ্যতা: ⭐ মার্কেটিং বা বিক্রয় সংক্রান্ত কাজে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে ⭐ ভালো যোগাযোগ দক্ষতা ও আত্মপ্রত্যয়ী মনোভাব থাকতে হবে 📌 দায়িত্বসমূহ: ⭐ নতুন ক্লায়েন্ট ও কর্পোরেট প্রতিষ্ঠানগুলোর সঙ্গে যোগাযোগ ও চুক্তি সম্পাদন ⭐ কোম্পানির সিকিউরিটি সার্ভিস প্রচার ও বিক্রয় কার্যক্রম পরিচালনা ⭐ নির্ধারিত বিক্রয় লক্ষ্যমাত্রা অর্জন ⭐ মাঠপর্যায়ে মার্কেট ভিজিট ও রিপোর্ট প্রস্তুত করা 💰 বেতন ও সুযোগ-সুবিধা: ⭐ বেতন আলোচনা সাপেক্ষ ⭐ কর্মদক্ষতার ভিত্তিতে ইনসেনটিভ ও পদোন্নতির সুযোগ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20477",
    "job_id": "20477",
    "company_name": "Fara IT Limited",
    "job_title": "ক্লায়েন্ট রিলেশনশিপ ম্যানেজমেন্ট (পার্ট-টাইম)",
    "location": "Mirpur",
    "salary": "TK. 6,000-8,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "5 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": "Suite # 1205, Level – 11 Shah Ali Plaza, Mirpur – 10, Dhaka.",
    "job_description": "Responsibilities: Company Name: FARA IT Limited Office Location: Mirpur-10, Shah Ali Market, Dhaka Job Type: Part-time (Work from Office) Salary: 6,000 Taka + Commission Requirement: Must have the mentality to work for at least 1 year Educational Qualifications: Minimum HSC pass Honors students will get preference Working Hours: 10 am - 3 pm or 3 pm - 8 pm Responsibilities: Providing client support after software installation Immediate support for inbound calls Ensuring after-sales support as needed Following up with clients through outbound calls Managing CRM and keeping it regularly updated Managing monthly renewals of installed software Actively maintaining existing clients and collecting referral clients Required Qualifications: Good communication skills Ability to handle clients Basic knowledge of computers Experience working in Microsoft Word and Excel Responsible and interested in teamwork Preference will be given if you have your own laptop\n\nকোম্পানির নাম: FARA IT Limited অফিস লোকেশন: মিরপুর-১০, শাহ আলী মার্কেট, ঢাকা চাকরির ধরন: পার্ট-টাইম (Work from Office) বেতন: ৬,০০০ টাকা + কমিশন শর্ত: কমপক্ষে ১ বছর কাজ করার মানসিকতা থাকতে হবে শিক্ষাগত যোগ্যতা: সর্বনিম্ন এইচএসসি পাশ অনার্সে অধ্যয়নরত প্রার্থীরা অগ্রাধিকার পাবেন দায়িত্ব পালনের সময়: সকাল ১০টা – দুপুর ৩টা অথবা বিকাল ৩টা – রাত ৮টা দায়িত্বসমূহ: সফটওয়্যার ইনস্টলেশনের পর ক্লায়েন্ট সাপোর্ট প্রদান ইনবাউন্ড কল রিসিভ করে তাৎক্ষণিক সাপোর্ট দেওয়া প্রয়োজন অনুযায়ী আফটার সাপোর্ট নিশ্চিত করা আউটবাউন্ড কলের মাধ্যমে ক্লায়েন্ট ফলোআপ করা CRM পরিচালনা ও নিয়মিত আপডেট রাখা ইনস্টলকৃত সফটওয়্যারের মাসিক রিনিউয়াল ম্যানেজ করা সক্রিয় ক্লায়েন্ট মেইনটেইন ও রেফারেল ক্লায়েন্ট সংগ্রহ করা প্রয়োজনীয় যোগ্যতা: ভালো যোগাযোগ দক্ষতা ক্লায়েন্ট হ্যান্ডেল করার সক্ষমতা কম্পিউটার সম্পর্কে প্রাথমিক জ্ঞান Microsoft Word ও Excel-এ কাজের অভিজ্ঞতা দায়িত্বশীল ও টিমওয়ার্কে আগ্রহী নিজস্ব ল্যাপটপ থাকলে অগ্রাধিকার দেওয়া হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19040",
    "job_id": "19040",
    "company_name": "RISE X LIMITED",
    "job_title": "Accounts Executive",
    "location": "Mohakhali DOHS",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Accounts/Finance/Audit",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Core Responsibilities\n- Handle day-to-day accounting (cash, bank, petty cash, journals)\n- Prepare event-wise budgets and track actual vs planned cost\n- Manage vendor bills, advances, and final settlements\n- Issue client invoices and follow up for payments (this is critical)\n- Maintain receivables & payables reports\n\nEvent-Specific Duties\n- Control event-wise expense tracking (fabrication, manpower, logistics, F&B, artists, etc.)\n- Verify vendor quotations, PO, and bills before payment\n- Ensure on-site cash disbursement is documented properly\n- Close accounts event-by-event after execution\n\nFinancial Control & Compliance\n- Maintain VAT, Tax, TDS records\n- Assist in monthly closing & audit support\n- Ensure company policies are followed in spending\n- Maintain proper bill files & digital records\n\nCoordination & Reporting\n- Coordinate with Project Managers & Operations team\n- Prepare profit/loss reports per event\n- Submit management financial reports\n- Support decision-making with cost insights\n\nTools & Skills Expected\n- Strong in Excel / Google Sheets\n- Knowledge of Tally / accounting software\n- Good understanding of event costing\n- Detail-oriented, deadline-driven mindset\n\nRequirements: Requirements\n- Bachelor’s degree in Accounting / Finance / Business Administration\n- 2–4 years experience in accounts (event/agency experience = big plus)\n- Strong knowledge of basic accounting principles\n- Hands-on experience with Tally / accounting software\n- Excellent command over MS Excel / Google Sheets\n- Ability to manage event-wise costing & expense tracking\n- Knowledge of VAT, Tax & compliance (practical, not textbook)\n- Experience handling vendor bills, payments & client invoicing\n- Strong attention to detail and accuracy\n- Ability to work under tight deadlines & pressure (events don’t wait)\n- Good communication & coordination skills\n- Honest, organized, and responsible mindset\n\nOptional (Adds Extra Value)\n- Experience in event management / advertising agency\n- Knowledge of petty cash & on-site cash handling\n- Understanding of budget control & P/L reporting\n\nNo need to overpromise. You want someone who can control money when chaos is happening on-ground. That’s the real game.\n\nCore Responsibilities Handle day-to-day accounting (cash, bank, petty cash, journals) Prepare event-wise budgets and track actual vs planned cost Manage vendor bills, advances, and final settlements Issue client invoices and follow up for payments (this is critical) Maintain receivables & payables reports Event-Specific Duties Control event-wise expense tracking (fabrication, manpower, logistics, F&B, artists, etc.) Verify vendor quotations, PO, and bills before payment Ensure on-site cash disbursement is documented properly Close accounts event-by-event after execution Financial Control & Compliance Maintain VAT, Tax, TDS records Assist in monthly closing & audit support Ensure company policies are followed in spending Maintain proper bill files & digital records Coo"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20467",
    "job_id": "20467",
    "company_name": "SUNMAR SECURITY SERVICES LIMITED",
    "job_title": "Security Guard",
    "location": "Anywhere in Dhaka Division",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Security/Support Service",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Nikunja-01, Khilkhet DHAKA 1229",
    "job_description": "Responsibilities: Job Advertisement Company Name: SUNMAR SECURITY SERVICES LIMITED Position: Security Guard Number of Positions: Multiple Location: Dhaka (Site-based) Job Type: Full-time Duty Hours: 8-12 hours (Shift-based) Salary: Negotiable / Based on Experience Job Responsibilities: ⭐ Ensure security of assigned area ⭐ Control entry and exit points ⭐ Provide regular patrols ⭐ Inform authorities about suspicious activities ⭐ Stay alert and responsible while on duty Qualifications: ⭐ Minimum 8th/SSC pass ⭐ Priority given to experience in security work ⭐ Physically fit and hardworking ⭐ Must be honest, respectful, and responsible\n\nনিয়োগ বিজ্ঞপ্তি প্রতিষ্ঠানের নাম: SUNMAR SECURITY SERVICES LIMITED পদের নাম: Security Guard পদসংখ্যা: একাধিক কর্মস্থল: ঢাকা (সাইট ভিত্তিক) চাকরির ধরন: ফুল-টাইম ডিউটি টাইম: ৮–১২ ঘণ্টা (শিফট ভিত্তিক) বেতন: আলোচনা সাপেক্ষে / অভিজ্ঞতা অনুযায়ী কাজের দায়িত্বসমূহ: ⭐ দায়িত্বপ্রাপ্ত স্থানের নিরাপত্তা নিশ্চিত করা ⭐ প্রবেশ ও বাহির নিয়ন্ত্রণ করা ⭐ নিয়মিত টহল প্রদান ⭐ সন্দেহজনক কার্যকলাপ সম্পর্কে কর্তৃপক্ষকে অবহিত করা ⭐ কর্তব্যরত অবস্থায় সতর্ক ও দায়িত্বশীল থাকা যোগ্যতা: ⭐ ন্যূনতম অষ্টম/এসএসসি পাস ⭐ নিরাপত্তা কাজে অভিজ্ঞতা থাকলে অগ্রাধিকার ⭐ শারীরিকভাবে সুস্থ ও কর্মক্ষম ⭐ সৎ, ভদ্র ও দায়িত্বশীল হতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20465",
    "job_id": "20465",
    "company_name": "A MACHINERY",
    "job_title": "Sales Executive",
    "location": "Old Dhaka",
    "salary": "TK. 10,000-12,000",
    "experience": "6 months - 1 year",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "86 NAZIMUDDIN ROAD DHAKA",
    "job_description": "Responsibilities: Welcome customers and assist them in understanding their needs. Provide detailed information about products and give correct answers to customer questions. Assist customers to increase product sales. Maintain good relationships with customers and earn their trust. Ensure cleanliness and decoration of the shop. Ensure stock inspection and product supply. Perform tasks according to the manager's instructions. Qualifications HSC/SSC Experience in sales and customer service will be considered. Ability to communicate effectively. Must have a team-oriented mindset. Must be enthusiastic about maintaining customer service standards. Must be honest and loyal. Salary and Benefits Attractive salary package. Social security benefits. Opportunities for career development. Training facilities.\n\nRequirements: Qualifications HSC/SSC Experience in sales and customer service will be considered. Ability to communicate freely. Must have a mindset to work collaboratively. Must be enthusiastic about maintaining service quality for customers. Must be honest and loyal.\n\nগ্রাহকদের স্বাগত জানানো এবং তাদের প্রয়োজনীয়তা বুঝতে সহায়তা করা। পণ্য সম্পর্কে বিস্তারিত তথ্য প্রদান করা এবং গ্রাহকদের প্রশ্নের সঠিক উত্তর দেওয়া। গ্রাহকদের সহায়তা করে পণ্য বিক্রয় বৃদ্ধি করা। গ্রাহকদের সাথে সুসম্পর্ক বজায় রাখা এবং তাদের আস্থা অর্জন করা। দোকানের পরিচ্ছন্নতা ও সাজসজ্জা নিশ্চিত করা। স্টক পরিদর্শন এবং পণ্য সরবরাহ নিশ্চিত করা। ম্যানেজারের নির্দেশনা অনুযায়ী কাজ সম্পাদন করা। যোগ্যতা এইচএসসি/এসএসসি বিক্রয় ও গ্রাহক সেবার ক্ষেত্রে অভিজ্ঞতা থাকলে বিবেচনা করা হবে। স্বাচ্ছন্দ্যে কথা বলতে পারা। দলগতভাবে কাজ করার মানসিকতা থাকতে হবে। গ্রাহক সেবার মান বজায় রাখার প্রতি আগ্রহী হতে হবে। সৎ ও নিষ্ঠাবান হতে হবে। বেতন ও সুবিধা আকর্ষণীয় বেতন প্যাকেজ। সামাজিক নিরাপত্তা সুবিধা। ক্যারিয়ার উন্নয়নের সুযোগ। প্রশিক্ষণের ব্যবস্থা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20468",
    "job_id": "20468",
    "company_name": "Miniso Bangladesh Ltd.",
    "job_title": "সেলস অ্যাসোসিয়েট / স্টোর টিম মেম্বার",
    "location": "Uttara, Anywhere in Dhaka Division, Banasree, Banani, Mohammadpur",
    "salary": "TK. 10,000",
    "experience": "No Experience Required",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 150,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Nikunja-2, Lotus Kamal Tower 1. Dhaka",
    "job_description": "Responsibilities: Assist in the overall department management and achieve sales targets through regular monitoring, improved customer service, and team motivation. Main Responsibilities Daily Responsibilities Motivate the department team to achieve sales targets. Ensure proper product display, merchandising, and shelf management. Monitor store inventory, product requisition, and customer service, and provide feedback to the store in-charge. Participate in store meetings, identify areas for improvement, and plan for sales and operational quality enhancement. Weekly Responsibilities Plan and implement merchandising, product display, and customer service flow to increase sales. Provide weekly feedback to the area manager following store management guidelines. Coordinate with the store in-charge to ensure product availability according to the designated time. Maintain shelf maintenance according to the display plan and ensure improved customer service. Monthly Responsibilities Participate in HR training programs and encourage team participation. Ensure compliance with company SOP and stock/inventory management policies. Assist management in staff replacement/recruitment as needed. Maintain cleanliness, security, and healthy environment in the store. Assist in stock verification, variance analysis, and expense control. Initiate team development and performance improvement. Annual Responsibilities Follow the Annual Business Plan (ABP) as directed by the area in-charge/manager. Ensure achievement of sales KPI and HR KPI as per company objectives.\n\nRequirements: Minimum Qualifications and Skills Educational Qualification: Minimum SSC Skills: Good verbal communication skills Customer service attitude Proactive and hardworking mentality Experience: No prior experience required (training will be provided) General Responsibilities and Terms Must follow company objectives, policies, and SOPs. May need to take on additional responsibilities and collaborate with other departments when necessary. Must be adaptable to changes in any unit/branch as per management decisions. Must maintain professional conduct and uphold the company's image at all times. Permanent employees must provide a 60-day notice before resigning. Behavioral Expectations Maintain a professional image and attitude in line with the company's values. Show respect to colleagues and customers. Uphold the company's reputation both inside and outside working hours. Duty and Benefits Working Hours: 9 hours (1 day off per week) Festival bonus Sales incentives Confirmation benefit after 6 months Annual increment and promotion opportunities Monthly team dinner In-house training facilities\n\nস্টোর ইনচার্জকে সার্বিক ডিপার্টমেন্ট পরিচালনায় সহায়তা করা এবং নিয়মিত মনিটরিং, উন্নত কাস্টমার সার্ভিস ও টিম মোটিভেশনের মাধ্যমে বিক্রয় লক্ষ্যমাত্রা অর্জনে ভূমিকা রাখা। মূল দায়িত্বসমূহ দৈনিক দায়িত্ব ডিপার্টমেন্ট টিমকে বিক্রয় লক্ষ্যমাত্রা অর্জনে উৎসাহিত করা। পণ্যের সঠিক ডিসপ্লে, মার্চেন্ডাইজিং ও শেলফ ব্যবস্থাপনা নিশ্চিত কর"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20480",
    "job_id": "20480",
    "company_name": "RESPONSE Limited",
    "job_title": "এন্টারপ্রাইজ সেলস অফিসার (ESO)",
    "location": "All over Bangladesh",
    "salary": "TK. 10,000-25,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-17",
    "date_posted": "2026-02-17",
    "industry": "Sales/Marketing",
    "vacancy": 100,
    "shift": "Other",
    "country": null,
    "company_address": "2nd & 3rd Floor, House: 289 Road: 19/B, Dhaka 1206",
    "job_description": "Responsibilities: Job Title: Enterprise Sales Officer (ESO)\nCompany: Response Limited\nVacancy: Undefined\nLocation: Dhaka\nResponsibilities:\n* Achieve designated monthly and annual sales targets\n* Conduct field visits and collect orders\n* Maintain communication with Corporate Account Managers\n* Develop sales plans for SIM, devices, and ICT products\n* Ensure documentation and follow-up\nQualifications:\n* HSC or Bachelor's degree\n* Strong communication skills\n* Ability to work with a focus on results and self-motivation\n* Willingness to travel as required\nSalary and Benefits:\nFixed Salary: 10,000 - 14,000 BDT\nMonthly Incentive: 12,000 - 25,000+ BDT\nFestival bonus, insurance benefits\nEmail: eso@responsebd.com\n\nচাকরির শিরোনাম: এন্টারপ্রাইজ সেলস অফিসার (ESO) কোম্পানি: Response Limited পদসংখ্যা: অনির্দিষ্ট কর্মস্থল: ঢাকা দায়িত্ব: * নির্ধারিত মাসিক ও বার্ষিক সেলস টার্গেট পূরণ করা * ক্ষেত্র পরিদর্শন এবং অর্ডার সংগ্রহ করা * কর্পোরেট অ্যাকাউন্ট ম্যানেজারের সঙ্গে যোগাযোগ বজায় রাখা * SIM, ডিভাইস ও ICT প্রোডাক্টের সেলস পরিকল্পনা বাস্তবায়ন করা * ডকুমেন্টেশন ও ফলো-আপ নিশ্চিত করা যোগ্যতা: * HSC বা স্নাতক ডিগ্রি * শক্তিশালী যোগাযোগ দক্ষতা * ফলাফল গুরুত্ব দিয়ে কাজ করে এবং নিজে থেকেই উৎসাহী * প্রয়োজন অনুযায়ী যেকোনো জায়গায় যেতে পারে বেতন ও সুবিধা: স্থায়ী বেতন: ১০,০০০ – ১৪,০০০ টাকা মাসিক ইনসেনটিভ: ১২,০০০ – ২৫,০০০+ টাকা উৎসব বোনাস, বীমা সুবিধা email: eso@responsebd.com"
  }
]