[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19563",
    "job_id": "19563",
    "company_name": "Dhooli Training Institute",
    "job_title": " সরকারি খরচে শিখুন 'প্রফেশনাল ব্যাক অফিস সার্ভিস'! (PBS-Level 3)",
    "location": "Shantinagar",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "",
    "deadline": "2026-02-13",
    "date_posted": "2026-02-08",
    "industry": "Call Center",
    "vacancy": 30,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Under the BACCO and ASSET Project , Dhooli has introduced a complete professional back office service training at government expense to enhance your career in the digital age. 📋 Course Name: Professional Back Office Service (PBS – Occupation Level-3) 🛠 What will you learn? (Core Competencies) In this course, you will learn the most demanding skills in the current market: ✅ Professional Presentation & Business Communication ✅ Essential IT & Digital Workplace Skills ✅ Customer Service Excellence & Soft Skills ✅ Business Data Management (Spreadsheets/Excel) ✅ Business Development & Growth Strategies ✅ Clipping Path & Basic Graphic Design ✅ Digital Marketing Operations\n\nRequirements: ⏳ Time and Duration: Time: From 2:00 PM to 7:00 PM. Duration: 3 months (6 days a week). 🎁 Special Benefits of Training: 💎 Completely free training. 🎓 NSDA (Government) approved certificate upon completion of training. 💸 Monthly stipend based on attendance . 💼 Job assistance upon successful completion of the course. 🤝 Opportunity for internship. 🎓 Eligibility for Application: Educational Qualification: Minimum HSC/equivalent pass. Age: 18 to 45 years. Required Documents: Copy of NID card and 2 passport size photos. Basic computer operation knowledge is required.📍 Training Center: Dhooli 195/2/1, Shantinagar, Dhaka-1217. (Adjacent to Shantinagar Mode) 📞 Contact for more details: Mobile: +88 01971 328171 (WhatsApp available) 📢 Limited seats available! Contact now to secure your admission and build yourself as a skilled professional.\n\nআপনার ক্যারিয়ারকে ডিজিটাল যুগের উপযোগী করে গড়ে তুলতে BACCO এবং ASSET Project -এর অধীনে Dhooli নিয়ে এলো সম্পূর্ণ সরকারি খরচে প্রফেশনাল ব্যাক অফিস সার্ভিস ট্রেইনিং। 📋 কোর্সের নাম: Professional Back Office Service (PBS – Occupation Level-3) 🛠 কি কি শিখবেন? (Core Competencies) এই কোর্সে আপনি বর্তমান মার্কেটের সবচাইতে ডিমান্ডিং স্কিলগুলো শিখতে পারবেন: ✅ Professional Presentation & Business Communication ✅ Essential IT & Digital Workplace Skills ✅ Customer Service Excellence & Soft Skills ✅ Business Data Management (Spreadsheets/Excel) ✅ Business Development & Growth Strategies ✅ Clipping Path & Basic Graphic Design ✅ Digital Marketing Operations"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20356",
    "job_id": "20356",
    "company_name": "EQ MUSIC STATION",
    "job_title": "টেলিমার্কেটিং ও টেলিসেলস এক্সিকিউটিভ",
    "location": "Gulshan, Dhaka, Notun Bajar, Badda, Mohakhali",
    "salary": "TK. 8,000-12,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-08",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 20,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: We are looking for responsible, polite, and confident individuals to join our team as a Telemarketing and Telesales Executive. The responsibilities of this position include communicating with customers over the phone, providing information about products/services, and assisting in sales activities.\n\nResponsibilities:\n- Contacting potential and existing customers over the phone\n- Presenting detailed information about products and services clearly and attractively\n- Resolving customer inquiries and issues\n- Following up with interested customers to complete sales\n- Maintaining accurate records of calls and customer-related information\n- Ensuring customer satisfaction through polite and professional behavior\n- Coordinating with the team to achieve daily and monthly sales targets\n\nRequirements: Qualifications and Experience Minimum Qualification: SSC Pass Preference will be given to candidates with experience in Telesales, Telemarketing, Product Sales, or Customer Support Ability to communicate clearly, effectively, and professionally Proficiency in computer skills (MS Word, MS Excel, Email, etc.) Mindset to work responsibly and diligently Fresh candidates are also encouraged to apply (training opportunities available for qualified candidates) Work Schedule Morning 10:00 AM - Evening 9:00 PM Lunch and prayer facilities available Workplace 📍 House- 82/1, Road- 02, Block- A, Niketon, Gulshan- 1, Dhaka- 1212 What We Offer Friendly and supportive work environment Training and learning opportunities Opportunity for long-term work and career development\n\nআমরা আমাদের টিমে যোগ দেওয়ার জন্য দায়িত্বশীল, ভদ্র ও আত্মবিশ্বাসী টেলিমার্কেটিং ও টেলিসেলস এক্সিকিউটিভ নিয়োগ দিতে আগ্রহী। এই পদের দায়িত্ব হবে ফোনের মাধ্যমে গ্রাহকের সাথে যোগাযোগ করা, পণ্য/সেবার তথ্য দেওয়া এবং বিক্রয় কার্যক্রমে সহায়তা করা। দায়িত্বসমূহ সম্ভাব্য ও বিদ্যমান গ্রাহকের সাথে ফোনের মাধ্যমে যোগাযোগ করা পণ্য ও সেবার বিস্তারিত তথ্য সুন্দর ও স্পষ্টভাবে উপস্থাপন করা গ্রাহকের প্রশ্ন ও সমস্যার সমাধান করা আগ্রহী গ্রাহকদের ফলো-আপ করে বিক্রয় সম্পন্ন করা কল ও গ্রাহক সংক্রান্ত তথ্য সঠিকভাবে সংরক্ষণ করা ভদ্র ও পেশাদার আচরণের মাধ্যমে গ্রাহক সন্তুষ্টি নিশ্চিত করা নির্ধারিত দৈনিক ও মাসিক টার্গেট অর্জনে টিমের সাথে সমন্বয় করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20354",
    "job_id": "20354",
    "company_name": "MR Mobile Shop BD",
    "job_title": "শপ সেলসম্যান",
    "location": "Uttara",
    "salary": "TK. 10,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-07",
    "date_posted": "2026-02-08",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Receiving customers at the shop with respect and professionalism Showcasing products, explaining and providing advice according to customer demand Providing accurate information about the features and prices of mobile/electronic products Arranging and displaying shop products neatly Preparing daily sales reports and informing management Handling cash, preparing bills, and completing transactions properly Maintaining stock records and informing management if stock is low Ensuring cleanliness and hygiene of the shop Providing prompt resolution in case of customer complaints or issues Increasing shop sales by coordinating with the team Following company policies and taking additional responsibilities as needed\n\nদোকানে আগত ক্রেতাদের ভদ্র ও পেশাদারিত্বের সাথে রিসিভ করা ক্রেতার চাহিদা অনুযায়ী পণ্য দেখানো, ব্যাখ্যা করা ও পরামর্শ প্রদান মোবাইল/ইলেকট্রনিক পণ্যের বৈশিষ্ট্য ও দাম সম্পর্কে সঠিক তথ্য প্রদান দোকানের পণ্য সুন্দরভাবে সাজিয়ে-গুছিয়ে রাখা দৈনিক বিক্রয় রিপোর্ট প্রস্তুত করা এবং ম্যানেজমেন্টকে জানানো ক্যাশ হ্যান্ডলিং, বিল তৈরি ও যথাযথভাবে লেনদেন সম্পন্ন করা স্টকের হিসাব রাখা এবং কমে গেলে ম্যানেজমেন্টকে জানানো দোকানের পরিষ্কার-পরিচ্ছন্নতা নিশ্চিত করা গ্রাহক অভিযোগ বা সমস্যার ক্ষেত্রে দ্রুত সমাধান দেওয়া টিমের সাথে সমন্বয় করে দোকানের বিক্রয় বৃদ্ধি করা কোম্পানির নীতিমালা অনুসরণ করা এবং প্রয়োজন অনুযায়ী অতিরিক্ত দায়িত্ব পালন করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20355",
    "job_id": "20355",
    "company_name": "foodpanda",
    "job_title": "Lead Generation (Freelancer)",
    "location": "Khulna, Chittagong, Dhaka, Barisal, Rangpur",
    "salary": "TK. 12,000-20,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": null,
    "working_hours": "",
    "deadline": "2026-02-22",
    "date_posted": "2026-02-08",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: The Digital Sales team relies heavily on field-level freelancers for lead generation. To ensure the Acquisition team has a steady and sufficient lead pipeline for both Shops and Restaurants, we need your support for freelancer hiring for lead generation.\n\nWhat are our current offerings for the freelancers?\n\nTo encourage active participation, we are providing rewards for each qualified lead:\n- BDT 75 per qualified Restaurant lead\n- BDT 60 per qualified Shop lead\n- Payment disbursement: Processed by HR and released by the end of the next month\n\nQualifying Criteria:\n- Leads must be new and not available in Salesforce.\n- SKU Limit: 11 items\n- All leads must be submitted through the Google Form.\n- Leads must fall within existing delivery zones. Freelancers can verify coverage by checking the Bangladesh Delivery Map.\n\nSupport & Training:\n- The Digital Sales team is willing to conduct short training sessions for freelancers on how to identify potential leads and how to submit them properly.\n\nThe Digital Sales team relies heavily on field-level freelancers for lead generation. To ensure the Acquisition team has a steady and sufficient lead pipeline for both Shops & Restaurants , we need your support for freelancer hiring for lead generation. What are our current offering for the freelancers? To encourage active participation, we are providing rewards for each qualified lead: BDT 75 per qualified Restaurant lead BDT 60 per qualified Shop lead Payment disbursement: Processed by HR and released by end of next month Qualifying Criteria: Leads must be new and not available in Salesforce. SKU Limit: 11 items All leads must be submitted through the Google Form. Leads must fall within existing delivery zones . Freelancers can verify coverage by checking the Bangladesh Delivery Map . Support & Training: The Digital Sales team is willing to conduct short training sessions for freelancers on how to identify potential leads and how to submit them properly."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20347",
    "job_id": "20347",
    "company_name": " IFixFast",
    "job_title": "Call Centre Executive.",
    "location": "Hatirpool",
    "salary": "TK. 10,000-12,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-18",
    "date_posted": "2026-02-08",
    "industry": "Call Center",
    "vacancy": 150,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: - Call a specific number of customers every day.\n- Regularly update information in the conversation tracking sheet with the customer.\n- Provide correct and appropriate answers to customer questions.\n- Establish and maintain a positive relationship with the customer.\n- Achieve monthly sales targets.\n- Actively participate in teamwork.\n- Maintain punctuality and discipline.\n\nRequirements: Educational Qualification: Completed HSC/Honors Or ongoing Honors Additional Requirements: Minimum 15 words per minute Bangla typing speed (mandatory) Prior experience in call center or customer service preferred Proficiency in using CRM system Skill in customer handling Skill in social media-related work Skill in Google Sheets and data management Language Skills: Clear and accurate communication skills in Bengali Ability to speak professionally, politely, and clearly Compensation & Benefits: Basic Salary: 10,000 - 12,000 BDT Sales Incentive: Unlimited (Our call center agents currently receive sales incentives ranging from 20,000 to 30,000 taka) Festival Bonus: Twice a year (minimum 1 year of service required) Performance Bonus Salary Review: Yearly Working Hours: Morning 10:00 AM - Evening 7:00 PM 6 days a week\n\nপ্রতিদিন নির্দিষ্ট সংখ্যক কাস্টমারকে কল করা কাস্টমারের সাথে কথোপকথনের তথ্য ট্র্যাকিং শিটে নিয়মিত আপডেট করা কাস্টমারের প্রশ্নের সঠিক ও যথাযথ উত্তর প্রদান করা কাস্টমারের সাথে ইতিবাচক সম্পর্ক তৈরি ও বজায় রাখা মাসিক সেলস টার্গেট অর্জন করা টিমওয়ার্কে সক্রিয়ভাবে অংশগ্রহণ করা সময়ানুবর্তিতা ও শৃঙ্খলা বজায় রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20351",
    "job_id": "20351",
    "company_name": "Zanan Travel Consultancy",
    "job_title": "Executive - Call, Sales & Client Relations (Female)",
    "location": "Banani",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-08",
    "date_posted": "2026-02-08",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Job Responsibilities: - Lead Generation & Telemarketing: Making outbound calls to prospective clients daily to introduce company projects and services. Clearly communicating product details to generate interest.\n- Appointment Scheduling: Convincing potential clients over the phone and fixing scheduled appointments or meetings for the sales team.\n- VIP Client Management: Meeting VIP and Corporate clients at the office or project sites. You must present yourself as the face of the company with a well-groomed appearance.\n- Sales & Negotiation: conducting presentations, negotiating prices, and closing sales deals to achieve monthly targets.\n- Follow-up & Relationship Building: Maintaining strong relationships with existing and potential clients through regular follow-ups via phone, WhatsApp, and Email.\n- Documentation & Reporting: Drafting professional emails, maintaining client databases in MS Excel, and submitting daily work reports to the management.\n- Field Work: Willingness to visit project sites or client offices when necessary to facilitate sales.\n\nRequirements: ```html Additional Requirements Age 22 to 28 years Communication Skills: Must have fluent communication skills in both Bangla & English with a clear and confident voice. Appearance: Must be smart, good-looking, and well-groomed/presentable (essential for interacting with high-profile clients). Attitude: Must be energetic, target-oriented, and hardworking. Flexibility: Must have the mentality to work extra hours occasionally outside of standard office time if required by the business or for urgent client meetings. Tech Skills: Proficiency in MS Office (Word, Excel), Email drafting, and WhatsApp communication is required. ```\n\nJob Responsibilities: Lead Generation & Telemarketing: Making outbound calls to prospective clients daily to introduce company projects and services. Clearly communicating product details to generate interest. Appointment Scheduling: Convincing potential clients over the phone and fixing scheduled appointments or meetings for the sales team. VIP Client Management: Meeting VIP and Corporate clients at the office or project sites. You must present yourself as the face of the company with a well-groomed appearance. Sales & Negotiation: conducting presentations, negotiating prices, and closing sales deals to achieve monthly targets. Follow-up & Relationship Building: Maintaining strong relationships with existing and potential clients through regular follow-ups via phone, WhatsApp, and Email. Documentation & Reporting: Drafting professional emails, maintaining client databases in MS Excel, and submitting daily work reports to the management. Field Work: Willingness to visit project sites or client offices when necessary to facilitate sales."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20346",
    "job_id": "20346",
    "company_name": "SHUKRAN",
    "job_title": "Security Guard",
    "location": "Badda",
    "salary": "TK. 15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-08",
    "industry": "Security/Support Service",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ```html Gate Control: Inspect every individual entering and exiting the warehouse. Do not allow unauthorized individuals inside. Document Check: Before any truck exits, make sure to verify the invoice (delivery note) and gate pass. Manual Counting / Tally: Count each package or carton manually while loading or unloading the truck. Weight Monitoring: Ensure to weigh each truck on the scale during entry and exit. Lock & Key: Securely lock all warehouse doors and shutters at the end of work and keep the key safe. Perimeter Patrol: Regularly patrol the perimeter fence and warehouse area to check for any suspicious activities. Fire Safety: Enforce a strict \"No Smoking\" policy inside the warehouse to prevent fire incidents. Labor Supervision: Supervise workers to ensure no goods are being hidden or stolen during busy loading times. Night Vigilance: Stay awake and alert during the night shift using torchlight and whistle. Reporting: Immediately inform the manager if any goods are lost, damaged, or if any issues occur. Benefits: Overtime ```\n\nগেট নিয়ন্ত্রণ (Gate Control): গুদামে প্রবেশ ও বের হওয়া প্রত্যেক ব্যক্তিকে পরীক্ষা করুন। অননুমোদিত কাউকে ভেতরে ঢুকতে দেবেন না। ডকুমেন্ট যাচাই (Document Check): কোনো ট্রাক বের হওয়ার আগে অবশ্যই চালান (ডেলিভারি নোট) ও গেট পাস যাচাই করুন। হাতে গণনা (Manual Counting / Tally): ট্রাকে মাল তোলা বা নামানোর সময় প্রতিটি বস্তা বা কার্টন নিজে হাতে গুনে নিন। ওজন পর্যবেক্ষণ (Weight Monitoring): প্রতিটি ট্রাক প্রবেশ ও বের হওয়ার সময় ওজন মাপার স্কেলে তুলতে হবে তা নিশ্চিত করুন। তালা ও চাবি (Lock & Key): কাজ শেষে সব গুদামের দরজা ও শাটার ভালোভাবে তালাবদ্ধ করুন এবং চাবি নিরাপদে রাখুন। পরিধি টহল (Perimeter Patrol): সীমানা প্রাচীর ও গুদাম এলাকার চারপাশে নিয়মিত হাঁটাহাঁটি করে সন্দেহজনক কোনো কার্যকলাপ আছে কি না দেখুন। অগ্নি নিরাপত্তা (Fire Safety): অগ্নিকাণ্ড প্রতিরোধে গুদামের ভেতরে “ধূমপান নিষেধ” নিয়ম কঠোরভাবে কার্যকর করুন। শ্রমিক তদারকি (Labor Supervision): ব্যস্ত লোডিং সময়ে কোনো পণ্য লুকানো বা চুরি হচ্ছে কি না তা নিশ্চিত করতে শ্রমিকদের নজরদারি করুন। রাত্রিকালীন সতর্কতা (Night Vigilance): রাতের শিফটে টর্চ ও বাঁশি ব্যবহার করে জেগে ও সতর্ক থাকুন। রিপোর্টিং (Reporting): কোনো পণ্য হারিয়ে গেলে, ক্ষতিগ্রস্ত হলে বা কোনো সমস্যা ঘটলে সঙ্গে সঙ্গে ম্যানেজারকে জানান। Benefits: Overtime"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20345",
    "job_id": "20345",
    "company_name": "Sundarban Courier Service (Pvt.) Ltd.",
    "job_title": "লোডার",
    "location": "All over Bangladesh",
    "salary": "TK. 11,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-08",
    "industry": "Warehouse",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Job Description for Laborers 1. Delivery Truck Loading and Unloading • Load products from warehouse onto delivery truck • Safely unload products from truck 2. Product Handling at Delivery Points • Unload products at designated delivery points • Properly load returned products onto truck if any 3. Warehouse Operation Support • Assist in arranging products inside the warehouse and in relocation • Provide support to storekeeper/supervisor as needed 4. Assistance in Product Repacking • Assist in repacking damaged or open products • Ensure quality and safety of products during repacking\n\nলেবারদের কাজের তালিকা (Job Description) ১. ডেলিভারি গাড়ী লোড ও আনলোড করা •    গুদাম থেকে ডেলিভারি গাড়ীতে পণ্য লোড করা •    গাড়ী থেকে নিরাপদভাবে পণ্য আনলোড করা ২. ডেলিভারি পয়েন্টে পণ্য হ্যান্ডলিং •    নির্ধারিত ডেলিভারি পয়েন্টে পণ্য আনলোড করা •    রিটার্ন পণ্য থাকলে সেগুলো সঠিকভাবে গাড়ীতে লোড করা ৩. ওয়্যারহাউজ অপারেশন সাপোর্ট •    ওয়্যারহাউজের ভেতরে পণ্য সাজানো ও স্থানান্তরে সহায়তা করা •    প্রয়োজন অনুযায়ী স্টোর কিপার/সুপারভাইজারকে সহায়তা করা ৪. মাল রিপ্যাকিং এ সহায়তা করা •    ক্ষতিগ্রস্ত বা খোলা পণ্য পুনরায় প্যাকিং করতে সহায়তা করা •    রিপ্যাকিংয়ের সময় পণ্যের গুণগত মান ও নিরাপত্তা বজায় রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20348",
    "job_id": "20348",
    "company_name": "MY Outsourcing Ltd.",
    "job_title": "Call Center Nutritionist",
    "location": "Banani",
    "salary": "TK. 12,000-13,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-08",
    "industry": "Call Center",
    "vacancy": 50,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Providing confirmation and food-related advice to customers over the phone Maintaining customer information and call records Follow up as needed Completing tasks according to the organization's rules\n\nRequirements: 🔹 Salary: 12,000 - 13,000 Taka 🔹 Type of Duty: Roaster based 🔹 Working Days: 6 days per week 🔹 Gender: Female only 🔹 Educational Qualification: Must have a major in Food and Nutrition.\n\nগ্রাহকদের ফোনের মাধ্যমে পুষ্টি ও খাদ্য বিষয়ক পরামর্শ প্রদান কাস্টমারের তথ্য ও কল রেকর্ড সংরক্ষণ করা প্রয়োজন অনুযায়ী ফলোআপ করা প্রতিষ্ঠানের নিয়ম অনুযায়ী কাজ সম্পন্ন করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20331",
    "job_id": "20331",
    "company_name": "Integrated Marketing Service Ltd (IMS) ( Mirpur)",
    "job_title": "Business Development Manager (BDM)",
    "location": "Kallyanpur, Mirpur, Mirpur DOHS, Mohammadpur, Shyamoli",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-07",
    "date_posted": "2026-02-08",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ROBI/Axentec - SME Business (Operation Division) - Third Party Payroll\nB2B Sales/ SME Sales / Corporate Sales\n(Field Sales Oriented Job)\nLocation: Mirpur, Mohammadpur\nSalary: 28,000 BDT (Fixed 12,000 BDT + 4000 For Conveyance Allowance + 12000 BDT KPI Bonus/Incentives)\n\nROBI/Axentec - SME Business (Operation Division) - Third Party Payroll B2B Sales/ SME Sales / Corporate Sales (Field Sales Oriented Job) Location: Mirpur, Mohammadpur Salary: 28,000 BDT (Fixed 12,000 BDT + 4000 For Conveyance Allowance + 12000 BDT KPI Bonus/Incentives)"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20344",
    "job_id": "20344",
    "company_name": "Rahat IT Solutions",
    "job_title": "Software Engineer (Full-Stack)",
    "location": "Banani",
    "salary": "TK. 30,000-35,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-08",
    "date_posted": "2026-02-08",
    "industry": "IT/Telecommunication",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "New airport road Banani, k-69, Dhaka",
    "job_description": "Responsibilities: Experience Requirements:\n- 1-2 years of experience in web development.\n\nRequired Skills:\n- Expertise in Java Spring framework (both MVC and Spring boot).\n- Knowledge on RDBMS (postgresql will be plus).\n- Expertise in AngularJS and ReactJs.\n- Experience in developing high quality ReactJS web apps. Solid understanding of concepts like ReactJS life-cycle, hooks etc.\n- Experience with writing reusable React components and know how to layout with CSS.\n- Experience with state management libraries (preferably Redux). Familiarity with Ducks pattern.\n- Experience of using development tools like nvm, npm/yarn, webpack, Babel.\n- Experience of working with Git on projects with medium to large periphery.\n- Experience with NodeJS and Typescript is a plus.\n- Experience with linting libraries like ESLint is a plus.\n- Experience with unit testing libraries like Jest, enzyme is a plus.\n- Experience with CSS preprocessors like Sass is a plus.\n- Knowledge on hibernate, JPA and mybatis.\n- Working on open-source software will be a plus (OpenMRS, DHIS2, openSRP, OpenElis, OpenLMIS).\n- Basic knowledge on JavaScript and related libraries.\n- Good knowledge on version control.\n- Good knowledge on OOP.\n\nJob Responsibilities:\n- Review requirements, specifications and technical design documents to provide timely and meaningful feedback.\n- Estimate, prioritize, plan and coordinate development activities.\n- Design and implement scalable and maintainable code following best practices and coding standards.\n- Design, develop and execute development tasks.\n- Explore new technologies.\n- To contribute to both backend (Java) and frontend (ReactJs, Angular).\n- Optimize applications for performance, scalability, and security.\n- Conduct code reviews, provide constructive feedback and mentor junior team members.\n\nRequirements: Bachelor of Science (BSc) in Computer Science & Engineering Bachelor's degree in Computer Science and Engineering or a related field from a reputable university.\n\nExperience Requirements: 1-2 years of experience in web development. Required Skills: Expertise in Java Spring framework (both MVC and Spring boot). Knowledge on RDBMS (postgresql will be plus). Expertise in AngularJS and ReactJs. Experience in developing high quality ReactJS web apps. Solid understanding of concepts like ReactJS life-cycle, hooks etc. Experience with writing reusable React components and know how to layout with CSS. Experience with state management libraries (preferably Redux). Familiarity with Ducks pattern. Experience of using development tools like nvm, npm/yarn, webpack, Babel. Experience of working with Git on projects with medium to large periphery. Experience with NodeJS and Typescript is a plus. Experience with linting libraries like ESLint is a plus. Experience with unit testing libraries like Jest, enzyme is a plus. Experience with CSS preprocessors like Sass is a plus. Knowledge on hibernate, JPA and mybatis. Working on open-source software will be a plus (Ope"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20343",
    "job_id": "20343",
    "company_name": "Metlife (Sher Agency Rehana Unit)",
    "job_title": "Financial Associate",
    "location": "Kamalapur, Badda, Maghbazar, Malibagh, Shantinagar",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-08",
    "date_posted": "2026-02-08",
    "industry": "Call Center",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "L.R Bhabon(2nd floor) 1/2 Outer Circular Road,Malibagh, Dhaka-1217",
    "job_description": "Responsibilities: Job Title: 'Financial Associate' Job Description: In the position of Financial Associate, you can brighten your future and contribute to great work by working at MetLife Bangladesh to fulfill your dreams. Why join MetLife as a Financial Associate? Opportunity for rapid career advancement by applying your own hard work and skills Financial Associate   ---->    Unit Manager    ----->    Branch Manager Financial Benefits: 1. Quick start to earnings after joining 2. Average annual income of 40 lakh taka per person among top 50 performers 3. Average annual income of 20 lakh taka per person among top 100 performers along with other bonuses 4. Special recognition and rewards for exceptional performance. Opportunities for Fulfilling Dreams: 1. International and domestic travel 2. Recognition at international conferences 3. Medical coverage for family 4. Provident fund 5. Scholarships for children Potential for Quick Success: 1. World-class training facilities 2. Skilled trainers 3. Digital workspace 4. 100% online-based programs 5. Digital tools for sales and activity management Opportunity for Own Business: 1. Opportunity to start your own business without any investment 2. Rapid career advancement based on performance leading to opportunities as Unit Manager and later Branch Manager 3. Opportunity to start an agency in your own name 4. Work flexibility based on your convenience Responsibility: To assist in providing health and financial protection to millions of people in the country. Establish and monitor relationships with clients to achieve business goals. Work Flexibility: Opportunity for part-time and full-time work. Contact: 'Sher Agency' Rehana Sultana Unit Manager MetLife, Bangladesh Address: L.R Building, 1/2 Outer Circular Road (Ground Floor above Sonali Bank), Malibagh, Dhaka-1217. Phone Number: 01774108450 'If you are ready to take on challenges and want to embark on a successful career path, then apply today to join this dynamic team at DUDANT.'\n\nRequirements: Qualification: HSC - Masters. Age: Over 24.\n\nপদের নাম: 'ফিনান্সিয়াল অ্যাসোসিয়েট' পদের  বিবরণ: ফিনান্সিয়াল অ্যাসোসিয়েট পদে আপনার ভবিষ্যৎ উজ্জ্বল করুন এবং মহান কাজে যোগ দিন, মেটলাইফ বাংলাদেশ এ কাজ করে আপনার স্বপ্ন পূরণ করুন। কেন হবেন মেটলাইফ-এর ফিনান্সিয়াল অ্যাসোসিয়েট? নিজের পরিশ্রম এবং দক্ষতা কাজে লাগিয়ে দ্রুত পদোন্নতির সুযোগ ফিনান্সিয়াল অ্যাসোসিয়েট   ---->    ইউনিট ম্যানেজার    ----->    ব্রাঞ্চ ম্যানেজার আর্থিক স্বচ্ছলতা অর্জন: ১. যোগদানের পর দ্রুত আয় শুরু ২. সেরা ৫০ পারফর্মারদের জনপ্রতি বার্ষিক গড় আয় ৪০ লক্ষ টাকা ৩. সেরা ১০০ জনের বার্ষিক গড় আয় ২০ লক্ষ টাকা এবং সাথে অন্যান্য বোনাস ৪. বিশেষ অর্জনে স্বীকৃতিস্বরূপ বিশেষ সম্মাননা। স্বপ্নপূরণের সুযোগ: ১. আন্তর্জাতিক ভ্রমন ও অভ্যন্তরীন ভ্রমন ২. আন্তর্জাতিক সম্মেলনে সম্মাননা ৩. পরিবারের জন্য মেডিকেল কাভারেজ ৪. প্রভিডেন্ট ফান্ড ৫. সন্তানের জন্য শিক্ষা বৃত্তি দ্রুত সাফল্যের সম্ভাবনা: ১. বিশ্বমানের প্রশিক্ষণ ব্যবস্থা ২. দক্ষ প্রশিক্ষক ৩. ডিজিটাল ওয়ার্কস্পেস ৪. ১০০% অনলাইন ভিত্তিক কার্যক্রম ৫. সেলস এব"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20352",
    "job_id": "20352",
    "company_name": "Zanan Travel Consultancy",
    "job_title": "Graphics Designer & Video Editor",
    "location": "Banani",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-08",
    "date_posted": "2026-02-08",
    "industry": "Graphics/Video Editor",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No: 04, House: 121, Blo: E, Bannai",
    "job_description": "Responsibilities: Design social media posts, banners, posters, and marketing materials Edit promotional videos, reels, and YouTube content Create motion graphics and basic animations Maintain brand consistency across all visual content Collaborate with marketing and content teams\n\nRequirements: - Proficiency in Adobe Photoshop, Illustrator, Premiere Pro, and After Effects\n- Strong creativity and attention to detail\n- Ability to meet deadlines and handle multiple projects\n- Minimum 6 months to 1 year of experience preferred (Freshers with strong portfolios are welcome)\n\nDesign social media posts, banners, posters, and marketing materials Edit promotional videos, reels, and YouTube content Create motion graphics and basic animations Maintain brand consistency across all visual content Collaborate with marketing and content teams"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20342",
    "job_id": "20342",
    "company_name": "Rahat IT Solutions",
    "job_title": "Wordpress Designer & Developer",
    "location": "Banani",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-08",
    "date_posted": "2026-02-08",
    "industry": "IT/Telecommunication",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "New airport road Banani, k-69, Dhaka",
    "job_description": "Responsibilities: Experience with CMS platforms like WordPress or custom-built systems for E-commerce. Strong problem-solving abilities for diagnosing and resolving design, functionality, and performance issues. Advanced knowledge of Elementor and WordPress. Practical experience with responsive design, site optimization, and technical SEO. Experience with site backup, staging workflows, and web hosting environments. Advanced expertise in Elementor for crafting custom page layouts, sections, pop-ups, and reusable templates. Primarily specialized in Elementor, with working knowledge of other WordPress theme builders. Highly skilled in the WoodMart WordPress theme, including advanced customization, performance optimization, and feature integration.\n\nRequirements: Design, build, and maintain company websites and landing pages. Ensure mobile responsiveness, speed optimization, and SEO. Fix bugs, update features, and perform regular site maintenance. Work closely with design and marketing teams. Implement web analytics and tracking tools. Working experience in E-commerce sites.\n\nExperience with CMS platforms like WordPress or custom-built systems for E-commerce. Strong problem-solving abilities for diagnosing and resolving design, functionality, and performance issues. Advanced knowledge of Elementor and WordPress Practical experience with responsive design, site optimization, and technical SEO. Experience with site backup, staging workflows, and web hosting environments. Advanced expertise in Elementor for crafting custom page layouts, sections, pop-ups, and reusable templates. Primarily specialized in Elementor, with working knowledge of other WordPress theme builders. Highly skilled in the WoodMart WordPress theme, including advanced customization, performance optimization, and feature integration."
  }
]