[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20400",
    "job_id": "20400",
    "company_name": "MY Outsourcing Ltd.",
    "job_title": "Call Center Agent",
    "location": "Gulshan-Banani, Banani",
    "salary": "TK. 12,000-14,000",
    "experience": "No Experience Required",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-13",
    "date_posted": "2026-02-13",
    "industry": "Call Center",
    "vacancy": 90,
    "shift": "Other",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: - Excellent Communication Skills: Engage with customers using appropriate accent and clear communication.\n- Responsibility and Target Achievement: Demonstrate a strong sense of responsibility and consistently meet daily targets.\n- Analytical Skills: Utilize analytical skills to contribute to team development and problem-solving.\n- Service-Oriented Competencies: Develop and apply competencies required for a service-oriented and results-focused environment.\n- Flexible Working Hours: Be prepared to work on a roster basis if required only.\n\nRequirements: - Must be a fresh graduate from any recognized institution\n- Good English communication skills (preferred)\n- Smart, confident, and quick learner\n- Positive attitude and willingness to grow\n- Basic computer skills (MS Office, Email, etc.)\n\n**Salary & Benefits:**\n- Monthly Salary: BDT 12,000 – 14,000\n- Career growth opportunities\n- Training and professional development\n- Friendly working environment\n\nExcellent Communication Skills: Engage with customers using appropriate accent and clear communication. Responsibility and Target Achievement: Demonstrate a strong sense of responsibility and consistently meet daily targets. Analytical Skills: Utilize analytical skills to contribute to team development and problem-solving. Service-Oriented Competencies: Develop and apply competencies required for a service-oriented and results-focused environment. Flexible Working Hours: Be prepared to work on a roster basis if required only."
  }
]