[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20076",
    "job_id": "20076",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Gazipur, Tongi, Tangail, Narsingdi, Savar",
    "salary": "TK. 11,200-18,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Type of work:\n1. Sell team-wise at designated areas.\n2. Clearly present information about services to pedestrians and potential customers.\n3. Assist in selecting appropriate packages according to customer demands.\n4. Inform customers about pre-sales and after-sales services.\n5. Explain terms and conditions at the time of each sale and transfer membership cards.\n\nRequirements: Position Location (a specific area): Dhaka Outer: Savar, Manikganj, Narayanganj, Gazipur, Mymensingh Qualifications: HSC or Bachelor's degree, 6 months of sales experience (freshers applicable) Age: 19+ After confirmation Salary and Benefits: - Basic: 11,200 - 12,000 Taka - Allowance and Commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nকাজের ধরন: 1. নির্দিষ্ট এরিয়ায় বুথে দলগতভাবে সেলস। 2. পথচারী ও সম্ভাব্য কাস্টমারদের কাছে গিয়ে সার্ভিস সম্পর্কে স্পষ্টভাবে তথ্য উপস্থাপন করা। 3. কাস্টমারদের চাহিদা অনুযায়ী উপযুক্ত প্যাকেজ বেছে নিতে সহায়তা করা। 4. কাস্টমারকে বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী সেবা সম্পর্কে অবহিত করা। 5. প্রতিটি বিক্রয়ের সময় শর্তাবলী বুঝিয়ে মেম্বারশিপ কার্ড হস্তান্তর করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20077",
    "job_id": "20077",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Anywhere in Dhaka Division, Dhanmondi, Old Dhaka, Mohammadpur, Jatrabari",
    "salary": "TK. 11,500-18,100",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Type of work: 1. Sell team-wise at designated area booths. 2. Clearly present information about services to pedestrians and potential customers. 3. Assist in selecting appropriate packages according to customer demands. 4. Inform customers about pre-sales and after-sales services. 5. Explain terms and conditions at each sale and transfer membership cards.\n\nRequirements: Workplace location (a specific area): Dhaka North: Mohakhali, Mirpur, Dhanmondi, Gulshan, Tejgaon, Badda, Hatirjheel, Basundhara, Farmgate, Shamoli, Kalyanpur Dhaka South: Jatrabari, Mugda, Sutrapur, Puran Dhaka, Azimpur, Gulistan, Paltan, Motijheel, Sadarghat, Khilgaon, Narayanganj Dhaka Outer: Savar, Manikganj, Narshingdi, Gazipur, Mymensingh Qualifications: HSC or Bachelor's degree, 6 months of sales experience (freshers applicable) Age: 19+ After confirmation Salary and benefits: - Basic: 11,500 - 12,000 Taka - Allowance and commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nকাজের ধরন: 1. নির্দিষ্ট এরিয়ায় বুথে দলগতভাবে সেলস। 2. পথচারী ও সম্ভাব্য কাস্টমারদের কাছে গিয়ে সার্ভিস সম্পর্কে স্পষ্টভাবে তথ্য উপস্থাপন করা। 3. কাস্টমারদের চাহিদা অনুযায়ী উপযুক্ত প্যাকেজ বেছে নিতে সহায়তা করা। 4. কাস্টমারকে বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী সেবা সম্পর্কে অবহিত করা। 5. প্রতিটি বিক্রয়ের সময় শর্তাবলী বুঝিয়ে মেম্বারশিপ কার্ড হস্তান্তর করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20075",
    "job_id": "20075",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Anywhere in Dhaka Division, Dhanmondi, Old Dhaka, Mohammadpur, Jatrabari",
    "salary": "TK. 11,500-18,100",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Job Type: 1. Team sales in designated area booth. 2. Present service information clearly to pedestrians and potential customers. 3. Assist in selecting appropriate packages according to customer demands. 4. Inform customers about pre-sales and after-sales services. 5. Explain terms and conditions at each sale and transfer membership cards.\n\nRequirements: Position workplace (a specific area):  \nDhaka North: Mohakhali, Mirpur, Dhanmondi, Gulshan, Tejgaon, Badda, Hatirjheel, Basundhara, Farmgate, Shyamoli, Kalyanpur  \nDhaka South: Jatrabari, Mugda, Sutrapur, Puran Dhaka, Azimpur, Gulistan, Paltan, Motijheel, Sadarghat, Khilgaon, Narayanganj  \nDhaka Outer: Savar, Manikganj, Narayanganj, Gazipur, Mymensingh  \n\nQualifications: HSC or Bachelor's degree, 6 months of sales experience (freshers applicable)  \nAge: 19+  \n\nAfter confirmation  \nSalary and benefits:  \n- Basic: 11,500 - 12,000 BDT  \n- Allowance and commission: 2,600 + 3,000-25,000 BDT  \n- 2 Eid bonuses, increment  \n- Health benefits, telemedicine, life insurance\n\nকাজের ধরন: 1. নির্দিষ্ট এরিয়ায় বুথে দলগতভাবে সেলস। 2. পথচারী ও সম্ভাব্য কাস্টমারদের কাছে গিয়ে সার্ভিস সম্পর্কে স্পষ্টভাবে তথ্য উপস্থাপন করা। 3. কাস্টমারদের চাহিদা অনুযায়ী উপযুক্ত প্যাকেজ বেছে নিতে সহায়তা করা। 4. কাস্টমারকে বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী সেবা সম্পর্কে অবহিত করা। 5. প্রতিটি বিক্রয়ের সময় শর্তাবলী বুঝিয়ে মেম্বারশিপ কার্ড হস্তান্তর করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20073",
    "job_id": "20073",
    "company_name": "HealthOS Limited",
    "job_title": "Telepurchaser (Morning)",
    "location": "Dhaka, Mohammadpur",
    "salary": "TK. 6,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Part Time",
    "working_hours": "5 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Call Center",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: We are looking for motivated and dependable Tele-Purchasers to join our team. This is a part-time position, perfect for individuals seeking experience in purchasing, sales operations, or supplier communication.\n\nKey Responsibilities:\n\n- Develop and maintain an accurate system for tracking and monitoring purchase orders.\n- Communicate with suppliers over the phone to place orders, request quotations, and follow up on deliveries.\n- Conduct basic market research to compare prices, evaluate product quality, and expand the vendor network.\n- Build and maintain strong relationships with reliable suppliers and service providers.\n- Collaborate with team members to plan and refine future purchasing strategies.\n- Assist in preparing product specifications and participate in supplier negotiations to secure the best terms.\n- Ensure all documentation and records are organized, updated, and accessible.\n\nOffice Time:\n07:00 AM - 12:00 PM\n\nWe are seeking motivated and reliable Tele-Purchasers to join our team. This is a part-time position , ideal for individuals looking to gain experience in purchasing, sales operations, or supplier communication. Key Responsibilities Develop and maintain an accurate system for tracking and monitoring purchase orders. Communicate with suppliers over the phone to place orders, request quotations, and follow up on deliveries. Conduct basic market research to compare prices, evaluate product quality, and expand the vendor network. Build and maintain strong relationships with reliable suppliers and service providers. Collaborate with team members to plan and refine future purchasing strategies. Assist in preparing product specifications and participate in supplier negotiations to secure the best terms. Ensure all documentation and records are organized, updated, and accessible. Office Time: 07:00 AM - 12:00 PM"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20111",
    "job_id": "20111",
    "company_name": "RSM IT Connectivity",
    "job_title": "লাইন ম্যান",
    "location": "Uttara",
    "salary": "TK. 10,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-27",
    "industry": "Technician",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot: 22, Road No: 5, Uttara, Dhaka",
    "job_description": "Responsibilities: Internet line needs to be connected and set up Understanding about internet cable is necessary Cable fixing and changing is required Need to know how to set up internet connection Need to know about router, modem, and other networking devices Bill collection is required\n\nইন্টারনেট লাইন টানা ও সেটাপ করতে হবে ইন্টারনেট ক্যাবল সম্পর্কে ধারনা থাকা প্রয়োজনীয় ক্যাবল ফিক্সিং ও পরিবর্তন করতে হবে ইন্টারনেট কানেকশন সেটাপ জানতে হবে রাউটার ও অনু এবং অন্যান্য নেটওয়ার্কিং ডিভাইস সম্পর্কে জানতে হবে বিল কালেকশন করতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20072",
    "job_id": "20072",
    "company_name": "H.K. Khan Agency (Metlife)",
    "job_title": "Financial Associate ",
    "location": "Kakrail, Khilgaon, Malibagh, Rampura",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Call Center",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "B I S T Bhaban,5th Floor, Holding # 122/A, Kakrail Road, Dhaka-1000(Near Habibullah Bahar College)",
    "job_description": "Responsibilities: Are you hardworking, ambitious, and want to establish yourself in life through honest means?\n\nIf so, there is a golden opportunity for you to work as a Financial Associate at MetLife, a leading American financial organization in Bangladesh for over 70 years.\n\nJoin now and become a representative of MetLife, contribute to society/country, and fulfill your dreams.\n\nPosition: 'Financial Associate'\n\nJob Description: As a Financial Associate, you can brighten your future and contribute to a great cause by working at 'H.K. Khan Agency' with MetLife in Bangladesh.\n\nWhy become a Financial Associate at MetLife?\n\n- Opportunity for rapid career advancement through your hard work and skills\n- Financial Associate ----> Unit Manager ----> Branch Manager\n\nFinancial Benefits:\n\n1. Quick start to earnings after joining\n2. Annual average income of 40 lakhs for the top 50 performers\n3. Annual average income of 20 lakhs for the top 100 performers, along with other bonuses\n4. Special recognition and rewards for exceptional performance\n\nOpportunities for Dream Fulfillment:\n\n1. International and domestic travel\n2. Recognition at international conferences\n3. Medical coverage for family\n4. Provident fund\n5. Scholarships for children's education\n\nChances of Quick Success:\n\n1. World-class training facilities\n2. Skilled trainers\n3. Digital workspace\n4. 100% online-based programs\n5. Digital tools for sales and activity management\n\nOpportunity for Personal Business:\n\n1. Opportunity to start your own business without any investment\n2. Rapid promotion based on performance to become a Unit Manager and later a Branch Manager\n3. Opportunity to start an agency in your name\n4. Work flexibility according to your convenience\n\nResponsibilities: Assist millions of people in the country by providing health and financial security, establish and maintain relationships with clients to achieve business goals.\n\nWork Flexibility: Part-time and full-time job opportunities.\n\nContact:\n'H.K. Khan Agency'\nMetLife, Bangladesh\n\nAddress: B I S T Bhaban, 5th Floor, Holding # 122/A, Kakrail Road, Dhaka-1000 (Near Habibullah Bahar College)\n\nPhone Number: 01715564488\n\n\"If you are ready to take on challenges and want to tread the path of a successful career, then apply today to join this dynamic team at DUDANT.\"\n\nRequirements: Qualification: Masters from HSC. Age: 25 or above.\n\nআপনি কি পরিশ্রমী,আপনি কি উচ্চাকাঙ্খী এবং সৎ উপায়ে জীবনে প্রতিষ্ঠিত হতে চান ? তাহলে আপনার জন্য ১৫৫+ বছরের অভিজ্ঞা সম্পন্ন বিশ্বব্যাপি ৪০+ টির ও অধিক দেশে সমৃদ্ধ আছে  এবং বাংলাদেশে ৭০+ বছর যাবৎ Leading Position এ থাকা আমেরিকান Financial Organisation MetLife- এ একজন Financial Associate হিসেবে কাজ করার এক সুবর্ণ সুযোগ রয়েছে। আজই জয়েন করুন,এখনি মেটলাইফের প্রতিনিধি হোন,সমাজ /দেশের সেবায় অবদান রাখুন। পদের নাম: 'ফিনান্সিয়াল অ্যাসোসিয়েট' পদের  বিবরণ: ফিনান্সিয়াল অ্যাসোসিয়েট পদে আপনার ভবিষ্যৎ উজ্জ্বল করুন এবং মহান কাজে যোগ দিন, 'H.K. Khan Agency' মেটলাইফ বাংলাদেশ এ কাজ করে আপনার স্বপ্ন পূরণ করুন। কেন হবেন মেটলাইফ-এর ফিনান"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20113",
    "job_id": "20113",
    "company_name": "Zamin Cars",
    "job_title": "Jr Executive, Accounts",
    "location": "Uttara",
    "salary": "TK. 15,000-18,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-27",
    "industry": "Accounts/Finance/Audit",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No: 7, Uttara, Dhaka",
    "job_description": "Responsibilities: Experience in Tally software will get preference.\nExcellent communication and collaboration skills.\nProficiency in MS Excel, Word & PowerPoint.\nGood written & verbal communication in both Bengali & English.\nAbility to solve problems with good negotiation skills.\nProactive, flexible & self-driven.\nComputer knowledge is a must (Basic IT skills).\nMaintain day to day accounts and financial records.\nPrepare vouchers, invoices, bills and bank reconciliation statements.\nInput daily invoices in Tally software.\nMaintain petty cash.\nDeposit and withdraw cheques and vouchers at the bank as required.\nHandle cash and bank transactions efficiently.\n\nExperience in Tally software will get preference. Excellent communication and collaboration skills. Proficiency in MS Excel, Word & PowerPoint. Good written & verbal communication in both Bengali & English Ability to solve problems with good negotiation skills Proactive, flexible & self-driven Computer knowledge is a must (Basic IT skills) Maintain day to day accounts and financial records. Prepare vouchers, invoices, bills and bank reconciliation statements. Input daily invoices in Tally software Maintain petty cash Deposit and withdraw cheques and vouchers at the bank as required Handle cash and bank transactions efficiently."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20117",
    "job_id": "20117",
    "company_name": "Brishti Enterprise",
    "job_title": "টেলিভিশন টেকনিশিয়ান",
    "location": "Uttara",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-27",
    "industry": "Technician",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Road No: 12, Uttara, Dhaka",
    "job_description": "Responsibilities: Television repair must be done Must have an idea about different companies and models of televisions Must know the differences in television models and remotes Must provide after-sales service Must work with honesty and dedication\n\nটেলিভিশন রিপেয়্যার করতে হবে টেলিভিশনের বিভিন্ন কোম্পানী, মডেল সম্পর্কে ধারনা থাকতে হবে টেলিভিশন মডেল, রিমোটের ভিন্নতা জানতে হবে বিক্রয়ের পরবর্তী সেবা প্রদান করতে হবে সততা ও নিষ্ঠার সাথে কাজ করতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20095",
    "job_id": "20095",
    "company_name": "Shourav Fashion",
    "job_title": "Peon",
    "location": "Uttara",
    "salary": "TK. 8,000-10,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "General Management/Admin",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 22, Road No: 6, Uttara, Dhaka",
    "job_description": "Responsibilities: Keep the cleanliness and hygiene maintained inside the shop Assist in handling, decorating, and rearranging merchandise in the shop Provide assistance to customers as per their needs Assist in opening and closing the shop Perform minor official tasks outside, as needed (such as document delivery, paying bills, etc.) Complete other tasks as directed by the Store Incharge/Manager Ensure availability of drinking water, tea, or other light refreshments Keep the shop environment clean and presentable at all times\n\nদোকানের ভেতরে পরিষ্কার-পরিচ্ছন্নতা বজায় রাখা দোকানের মালামাল বহন, সাজানো এবং স্থানান্তরে সহায়তা করা ক্রেতাদের প্রয়োজন অনুযায়ী সহায়তা প্রদান দোকানের খোলা–বন্ধের কাজে সহায়তা করা প্রয়োজন অনুযায়ী বাইরে ছোটখাটো অফিসিয়াল কাজ (যেমন ডকুমেন্ট ডেলিভারি, ব্যাংক/বিল দেয়া ইত্যাদি) করা স্টোর ইনচার্জ/ম্যানেজারের নির্দেশনা অনুযায়ী অন্যান্য কাজ সম্পন্ন করা পানীয় পানি, চা বা প্রয়োজনীয় হালকা সার্ভিস নিশ্চিত করা দোকানের পরিবেশ সবসময় পরিচ্ছন্ন ও উপস্থাপনযোগ্য রাখা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20091",
    "job_id": "20091",
    "company_name": "HealthOS Limited",
    "job_title": "সহকারী লজিস্টিক অফিসার (Morning-shift)",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-10,500",
    "experience": "6 months - 1 year",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Supply Chain/Procurement",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Before applying, be sure to carefully read the following:\n\nOur main goal at HealthOS company is to deliver our products to our esteemed customers with great care.\n\nJob Description:\n\n1. Understand the products correctly according to the correct invoice from the supervisor.\n2. After understanding the product correctly, arrange the product in the designated place.\n3. After the product is ordered, pack the correct product by checking the invoice.\n\nWork Hours:\nMorning Shift: From 6 am to 4 pm.\n\nEducational Qualification: Minimum from JSC to SSC, primarily the ability to understand the product names for packaging is the main focus.\n\nRequirements: The location of the workplace is the fourth floor of the Prime Bank building, just ahead of Adabar Police Station, Baiytul Aman Tower.\n\nআবেদন করার পূর্বে অবশ্যই সম্পূর্ণ পরে দেখবেন, আমাদের HealthOS কোম্পানি এর মূল লক্ষই হচ্ছে আমাদের প্রোডাক্ট সমূহ খুবই যত্নের সাথে আমাদের সম্মানিত গ্রাহকের নিকট পৌঁছে দেওয়া। কাজের বিবরণ, সুপারভাইজার থেকে সঠিক ইনভয়েস অনুযায়ী প্রোডাক্ট বুঝে নেওয়া পণ্য সঠিকভাবে বুঝে পাওয়ার পর নির্ধারিত স্থানে প্রোডাক্ট কে সাজিয়ে রাখতে হবে পণ্য অর্ডার হওয়ার পরে ইন ভয়েস দেখে সঠিক পণ্য প্যাকেজিং করতে হবে কাজের সময় : Morning Shift: সকাল ৬টা থেকে দুপুর ৪টা পর্যন্ত । শিক্ষাগত যোগ্যতা সর্বনিম্ন জেএসসি থেকে এসএসসি পর্যন্ত,মূলত প্রোডাক্টের নাম বুঝে প্যাকেজিং করতে পারাটাই মূল লক্ষ্য।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20086",
    "job_id": "20086",
    "company_name": "Shomvob Global",
    "job_title": "টিম মেম্বার - KFC & PIZZA HUT",
    "location": "Saudi Arabia",
    "salary": "TK. 35,000-40,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-27",
    "industry": "Restaurant staff",
    "vacancy": 100,
    "shift": "Day Shift",
    "country": "Saudi Arabia",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: KFC & PIZZA HUT - Saudi Arabia is hiring team members! 🔹 Salary: 1100 Riyal + Duty Meal + Accommodation + OT 🔹 Working Hours: 9 hours per day, 6 days per week; (1 day off) 🔹 Regular Incentives, Bonus, and Overtime benefits 🔹 Other Benefits: Iqama, Transportation, and Medical facilities provided by the company. 📌 Qualifications: (Please read carefully before applying) ======================================== ✔ Age: 21 - 29 years. Candidates outside this age range will not be called for an interview. ✔ English: Proficiency in speaking and writing English is essential. ✔ Passport: All candidates must bring both new and old passports for the interview. The passport must be valid for a minimum of 1.5 years. Candidates without a passport should not apply. ✔ Height: Minimum 5 feet 3 inches or taller. ✔ Physical Condition and Hygiene: Candidates with visible dental issues, pimples, or skin problems will not be considered. Candidates with tattoos on their body will also be disqualified. ✔ Minimum Educational Qualification: Minimum SSC or equivalent pass (certificate required). ✔ Interview Method: No online interviews. Candidates must be present in person for the interview. ✔ Dress Code: Candidates must wear formal attire - white shirt, black pants, and black shoes for the interview. ✔ Clean Shave: Candidates must have a clean shave. Those unwilling to shave should not apply. ✔ Personality and Appearance: Candidates must be smart, attractive, and presentable. ✔ Previous Experience: Candidates who are blacklisted in KSA (Saudi Arabia) will not be eligible for this recruitment. 📆 Pre-selection Interview: December, 2025 📆 Delegate Interview: December, 2025 (Dhaka) Candidates must wear formal attire - white shirt, black pants, black shoes, and have a clean shave for the interview. Additional Information: 1. Visa Validity: 2 years - non-renewable 2. Job Location: Any branch of KFC & PIZZA HUT in Saudi Arabia, i.e., anywhere. 3. Probation Period: 3 months from the date of joining. Note: After obtaining the visa, the visa processing and flight costs must be borne by the traveler.\n\nকেএফসি এবং পিৎজা হাট - সৌদি আরব (KFC & PIZZA HUT – Saudi Arabia) এ টিম মেম্বার নিয়োগ চলছে! 🔹 বেতন: ১১০০রিয়াল+ডিউটি মিল+বাসস্থান+ওটি 🔹 কর্মঘণ্টা: দিনে ৯ ঘণ্টা, সপ্তাহে ৬ দিন; (১ দিন ছুটি) 🔹 নিয়মিত ইনসেন্টিভ, বোনাস এবং ওভারটাইম এর সুবিধা 🔹 অন্যান্য সুবিধাঃ ইকামা, পরিবহন ও চিকিৎসা কোম্পানি বহন করবে। 📌 যোগ্যতাঃ (দয়া করে ভালো করে পড়ে এরপর জবে এপ্লাই করুন) ======================================== ✔ বয়সঃ ২১ - ২৯ বছর। এর বাহিরের বয়সের প্রার্থীদেরকে ইন্টারভিউতে ডাকা হবে না। ✔ ইংরেজিঃ ইংরেজিতে পরিষ্কার ও সাবলীলভাবে কথা বলা ও লেখার দক্ষতা আবশ্যক। ✔ পাসপোর্ট: নতুন-পুরাতন সকল পাসপোর্ট ইন্টারভিউতে সাথে নিয়ে আসতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১.৫ বছর থাকতে হবে। যাদের পাসপোর্ট নেই, তারা দয়া করে এপ্লাই করবেন না। ✔ উচ্চতাঃ ৫ ফুট ৩ ইঞ্চি বা তার বেশি। ✔ শারীরিক অবস্থা ও পরিচ্ছন্নতা: দৃশ্যমান দাঁতের সমস্যা থাকলে আবেদন গ্রহণযোগ্য নয়। মুখে পিম্পল বা ত্বকের সমস্যা থাকলে অযোগ্য বিবেচিত হবেন।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20084",
    "job_id": "20084",
    "company_name": "Akidah Electro Mart",
    "job_title": "Salesman (Showroom)",
    "location": "Uttara",
    "salary": "TK. 10,000-15,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 67, Road No: 10 Uttara, Dhaka",
    "job_description": "Responsibilities: Akidah Electro Mart is seeking dynamic, customer-oriented, and driven Showroom Salesmen who can confidently engage with customers, understand their requirements, and promote a diverse range of electronic home appliances such as TVs, air conditioners, fans, lights, refrigerators, washing machines, microwave ovens, and other electronics.\n\nThe ideal candidate should possess excellent communication skills, product knowledge, and the ability to convert potential customers into actual buyers while delivering exceptional customer service.\n\nResponsibilities include:\n- Greeting and assisting customers professionally in the showroom.\n- Identifying customer needs and suggesting suitable electronic products.\n- Demonstrating product features, advantages, and usage.\n- Maintaining comprehensive knowledge of all showroom products.\n- Meeting monthly sales targets set by management.\n- Ensuring products are displayed neatly and attractively.\n- Regularly inspecting and maintaining product cleanliness and functionality for demonstrations.\n- Managing stock information and updating inventory records.\n- Handling customer inquiries, complaints, and post-sales support with courtesy.\n\nAkidah Electro Mart is looking for energetic, customer-friendly, and motivated Showroom Salesmen who can confidently handle customers, understand their needs, and promote a wide range of electronic home appliances, including TV, AC, Fan, Light, Refrigerator, Washing Machine, Microwave Oven, and other electronics. The candidate should have strong communication skills, product knowledge, and the ability to convert visitors into buyers while ensuring excellent customer service. Welcome and approach customers professionally inside the showroom. Understand customer needs and recommend appropriate electronics products. Demonstrate product features, benefits, and usage. Maintain in-depth knowledge of all showroom products (TV, AC, Fan, Light, Washing Machine, Oven, etc.). Achieve monthly sales targets assigned by the management. Ensure products are displayed neatly and attractively. Regularly check and keep products clean, functional, and ready for demonstration. Maintain proper stock information and update inventory records. Handle customer inquiries, complaints, and after-sales support courteously."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20074",
    "job_id": "20074",
    "company_name": "MetLife Jahir Rayhan Agency( Ananta Kumer Sarker)",
    "job_title": "Financial associate",
    "location": "Uttara, Khilkhet, Gazipur, Gulshan-Banani, Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-27",
    "industry": "Sales/Marketing",
    "vacancy": 18,
    "shift": "Day Shift",
    "country": null,
    "company_address": "A.H Tower , House#56 Road#2 Sec:#03 Uttara, Dhaka-1230 And Monju Tower, Gazipur Chowrasta",
    "job_description": "Responsibilities: Test\n\nRequirements: Test\n\nকেন হবেন মেটলাইফ-এর ফিনান্সিয়াল অ্যাসোসিয়েট ? আর্থিক স্বচ্ছলতা অর্জন ১. যোগদানের পর দ্রুত আয় শুরু 2. সেরা ৫০ পারফর্মা রদের জনপ্রতি বার্ষিক গড় আয় ৪০ লক্ষ টাকা 3. সেরা ১০০ জনের বার্ষিক গড় আয় ২০ লক্ষ টাকা এবং সাথে অন্যান্য বোনাস 4. বিশেষ অর্জনে স্বীকৃতিস্বরূপ বিশেষ সম্মাননা। স্বপ্নপূরণের সুযোগ ১. আন্তর্জাতিক ভ্রমন ও অভ্যন্তরীন ভ্রমন 2. আন্তর্জাতিক সম্মেলনে সম্মাননা 3. পরিবারের জন্য মেডিকেল কাভারেজ 4. প্রভিডেন্ট ফান্ড 5. সন্তানের জন্য শিক্ষা বৃত্তি দ্রুত সাফল্যের সম্ভাবনা ১. বিশ্বমানের প্রশিক্ষণ ব্যবস্থা 2. দক্ষ প্রশিক্ষক 3. ডিজিটাল ওয়ার্কস্পেস 4. ১০০% অনলাইন ভিত্তিক কার্যক্রম 5. সেলস এবং অ্যাক্টিভিটি ম্যানেজমেন্টের ডিজিটাল টুলস নিজস্ব ব্যবসার সুযোগ ১. কোনো বিনিয়োগ ছাড়াই নিজের ব্যাবসার সুযোগ 2. পারফরম্যান্সের ভিত্তিতে দ্রুত পদোন্নতি এবং ইউনিট ম্যানেজার ও পরে ব্রাঞ্চ ম্যানেজার হওয়ার সুযোগ 3. নিজের নামে এজেন্সি চালু করার সুযোগ 4. নিজের সুবিধাজনক সময় অনুযায়ী কাজের স্বাধীনতা Office Addres: MetLife Jahir Rayhan Agecy Flat#03/B,House #1/A,(3rd Floor)Road #02,Sector,#03, Azampur,Uttara, Dhaka -1230 Contract No: 01918-906925 ; Ananta Sarker"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20087",
    "job_id": "20087",
    "company_name": "HealthOS Limited",
    "job_title": "Delivery & Operations Trainer",
    "location": "Dhaka, Mohammadpur",
    "salary": "TK. 15,000-20,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Education/Training/Consultant",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HealthOS Ltd, Khan ABC Tradeplex, Road-02, Dhanmondi, Dhaka, 1205, Dhaka, Bangladesh",
    "job_description": "Responsibilities: We are looking for a Delivery & Operations Trainer who will collaborate directly with the Operations team to train delivery staff on app usage, operational procedures, and sales generation. This position also involves working closely with internal teams like Returns and Distribution to ensure a seamless end-to-end delivery and service experience for pharmacy partners.\n\nKey Responsibilities:\n\n- Provide training to delivery staff on the Healthos mobile application, covering order management, delivery confirmation, returns, and issue reporting.\n- Educate delivery personnel on the entire operational workflow from order collection to delivery, returns, and distribution handover.\n- Coordinate effectively with Returns, Distribution, and Operations teams to ensure smooth process execution and clear communication.\n- Train and mentor delivery staff on professional communication and building relationships with pharmacy owners.\n- Empower delivery staff to drive sales, promote repeat orders, and onboard pharmacies to place orders through the app.\n- Conduct onboarding and refresher training sessions for delivery personnel.\n- Monitor field performance, identify areas for improvement, and provide feedback to enhance efficiency and sales performance.\n- Assist Operations in enhancing service quality and minimizing delivery or process-related issues.\n\nWe are seeking a Delivery & Operations Trainer who will work directly with the Operations team to train delivery personnel on app usage, operational processes, and sales generation. This role also requires close coordination with internal teams such as Returns and Distribution to ensure a smooth end-to-end delivery and service experience for pharmacy partners. Key Responsibilities Train delivery personnel on the Healthos mobile application, including order handling, delivery confirmation, returns, and issue reporting. Educate delivery staff on the complete operational workflow from order pickup, delivery, returns, and distribution handover. Coordinate closely with Returns, Distribution, and Operations teams to ensure smooth process execution and clear communication. Train and guide delivery personnel on professional communication and relationship-building with pharmacy owners. Enable delivery staff to generate sales, encourage repeat orders, and onboard pharmacies to place orders through the app. Conduct onboarding and refresher training sessions for delivery personnel. Monitor field performance, identify gaps, and provide feedback to improve efficiency and sales output. Support Operations in improving service quality and reducing delivery or process-related issues."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20079",
    "job_id": "20079",
    "company_name": "Minister Hi-Tech Park Electronics Ltd.",
    "job_title": "Sales Officer",
    "location": "Anywhere in Khulna Division, Anywhere in Chittagong Division, Anywhere in Barisal Division, Anywhere in Mymensingh Division, Anywhere in Sylhet Division",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Sales/Marketing",
    "vacancy": 60,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House-47, Road-35/A, Gulshan-2, Dhaka",
    "job_description": "Responsibilities: One of the country's largest electronics companies, Minister-Maywan Group, is hiring a large number of people for the position of Sales Officer in their sales and marketing department.\n\n- Ensure effective numerical distribution in designated areas and recruit new sub-dealers.\n- Identify and explore new market opportunities for the company's products.\n- Regularly provide products to dealers and sub-dealers and ensure timely collection of payments.\n- Maintain product visibility and conduct promotional activities in designated areas.\n- Maintain regular communication and strong relationships with dealers and other business partners.\n- Fulfill responsibilities with a proactive attitude and commitment in accordance with the company's directions.\n- Submit reports to supervisors on time and take proactive steps to solve problems.\n\nSalary and Benefits:\n- Attractive salary, TA and DA, festival allowance\n- Commission, incentive bonus\n- Other benefits as per company policy\n- Opportunity for promotion based on annual salary review and performance.\n\nRequirements: Age 20 to 28 years ✅ Must be 5 feet 4 inches tall. ✅ Must have an interest in selling electronics products. ✅ Must maintain physical and mental health. ✅ Must have the mentality to work in any district. ✅ No prior experience is required. ✅ Must have own motorcycle, separate allowance for motorcycle.\n\nদেশের অন্যতম বৃহৎ ইলেকট্রনিক্স কোম্পানি মিনিস্টার-মাইওয়ান গ্রুপ তাদের বিক্রয় ও মার্কেটিং বিভাগে সেলস অফিসার পদে বিপুল সংখ্যক জনবল নিয়োগ করা হচ্ছে। নির্ধারিত এলাকায় কার্যকর সংখ্যাগত বিতরণ নিশ্চিত করা এবং নতুন সাব-ডিলারদের নিয়োগ করা। কোম্পানির পণ্যের জন্য নতুন বাজার সুযোগ চিহ্নিত ও অন্বেষণ করা। ডিলার ও সাব-ডিলারদের কাছ থেকে নিয়মিত পণ্য প্রদান করা এবং সময়মতোটাকা সংগ্রহ নিশ্চিত করা। পণ্যের দৃশ্যমানতা বজায় রাখা এবং নির্ধারিত এলাকায় প্রোমোশনাল কার্যক্রম সম্পাদন করা। ডিলার ও অন্যান্য ব্যবসায়িক অংশীদারদের সাথে নিয়মিত যোগাযোগ ও দৃঢ় সম্পর্ক বজায় রাখা। কোম্পানির নির্দেশনা অনুযায়ী ইতিবাচক মনোভাব ও নিষ্ঠার সাথে দায়িত্ব পালন করা। সময়মতো সুপারভাইজারকে প্রতিবেদন দাখিল করা এবং সমস্যা সমাধানে উদ্যোগী পদক্ষেপ গ্রহণ করা। বেতন ও সুবিধা: ✅ আকর্ষণীয় বেতন, টিএ ও ডিএ, উৎসব ভাতা ✅ কমিশন , ইনসেনটিভ বোনাস ✅ কোম্পানির নিয়ম অনুযায়ী অন্যান্য সুবিধা ✅ বার্ষিক বেতন পর্যালোচনা ও কর্মক্ষমতা অনুযায়ী পদন্নতির সুযোগ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20082",
    "job_id": "20082",
    "company_name": "Chaldal Ltd",
    "job_title": "ডেলিভারি ম্যান (বাইকার)",
    "location": "Dhanmondi, Notun Bajar, Banani, Mirpur DOHS, Jatrabari",
    "salary": "TK. 10,846-14,446",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Deliveryman",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: In the areas of Jatrabari, Hazaribagh, Dhalibari (Vatara), Fakirbadi, and Bonani (Chairman Bari), there are vacancies.\n\nSalary:\nCompany biker: 10,846 - 18,446 BDT (Driving license required)\nFuel cost: 210 BDT\n\nDelivery Bonus:\nFor each delivery from 18 to 24, a bonus of 10 BDT is given.\nAfter 24, a bonus of 15 BDT is given for all deliveries.\n\nFacilities Available:\nEvery 3 days off, 8 days off per month.\nShifts at 7 am, 9 am, and 10:45 am. 12-hour duty.\n\nOther Facilities:\nSalary increment after six months.\nFestival allowance given twice a year.\n14 days sick leave per year after six months.\n11 days festival leave per year after six months.\n12 days leave for the wage earner per year after six months.\n10 days casual leave per year after six months.\n\nRequired Documents:\n5 copies of passport-sized photos.\n1 copy of national identity card.\n1 copy of bio-data (CV).\nPhoto copy of a nominee's national identity card.\nValid driving license (only for the biker post).\nCitizenship certificate (only if birth registration is submitted).\n1 copy of nominee's photo.\nContact: 01401153402 (Whatsapp)\n\nRequirements: Terms and Conditions: It is mandatory to have a valid driving license for the company bike post. Age must be at least 21 years as per the NID card.\n\nযাত্রাবাড়ী, হাজারীবাগ, ঢালীবাড়ি(ভাটারা), ফকিরবাড়ি, বনানী (চেয়ারম্যান বাড়ি) এই এরিয়াগুলোতে ভ্যাকেন্সি আছে. বেতন: কোম্পানি বাইকারঃ ১০,৮৪৬ - ১8,৪৪৬ টাকা । (ড্রাইভিং লাইসেন্স আবশ্যক) ফুয়েল কোস্ট ২১০ টাকা ডেলিভারি বোনাসঃ ১৮ থেকে ২৪ টা পর্যন্ত প্রতিটি ডেলিভারির এর জন্য ১০ টাকা করে বোনাস দেওয়া হয়। ২৪ এর পর সকল ডেলিভারি এর জন্য ১৫ টাকা করে বোনাস দেওয়া হয়। যে সকল সুবিধা পাওয়া যাবেঃ ৩ দিন পর পর ১ দিন, মাসে ৮ দিন ছুটি। সকাল ৭টা , ৯টা এবং ১০:৪৫ থেকে শিফট। ১২ ঘন্টা ডিউটি । অন্যান্য সুবিধা সমুহঃ ছয় মাস পর বেতন বৃদ্ধি পাবে। বছরে দুইবার উৎসব ভাতা দেয়া হয়। ছয় মাস পর থেকে বছরে ১৪ দিন অসুস্থতা জনিত ছুটি দেয়া হয়। ছয় মাস পর থেকে বছরে ১১ দিন উৎসব ছুটি দেয়া হয়। ছয় মাস পর থেকে বছরে ১২ দিন বেতনভোগী ছুটি দেয়া হয়। ছয় মাস পর থেকে বছরে ১০ দিন নৈমিত্তিক ছুটি দেয়া হয় প্রয়োজনীয় ডকুমেন্ট সমুহঃ ৫ কপি পাসপোর্ট সাইজের ছবি। নিজস্ব জাতীয় পরিচয় পত্রের এক কপি ফটোকপি। ১ কপি বায়োডাটা (CV)। একজন নমিনি এর জাতীয় পরিচয়পত্রের ফটোকপি। বৈধ ড্রাইভিং লাইসেন্স (শুধুমাত্র বাইকার পোস্টের জন্য)। নাগরিক সনদ (শুধুমাত্র জন্ম নিবন্ধন সাবমিট করলে)। ১  কপি নমিনির ছবি। যোগাযোগঃ 01401153402 (Whatsapp)"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20071",
    "job_id": "20071",
    "company_name": "Metlife Jahir Rayhan Agency",
    "job_title": "Financial Associates ",
    "location": "Uttara, Tongi",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-23",
    "date_posted": "2026-01-26",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Flat. 3B, Lift 3, House 1/A, Road 02, Sector 03, Uttara, Dhaka",
    "job_description": "Responsibilities: Test\n\nRequirements: Test\n\nকেন হবেন মেটলাইফ-এর ফিনান্সিয়াল অ্যাসোসিয়েট ? আর্থিক স্বচ্ছলতা অর্জন ১. যোগদানের পর দ্রুত আয় শুরু 2. সেরা ৫০ পারফর্মা রদের জনপ্রতি বার্ষিক গড় আয় ৪০ লক্ষ টাকা 3. সেরা ১০০ জনের বার্ষিক গড় আয় ২০ লক্ষ টাকা এবং সাথে অন্যান্য বোনাস 4. বিশেষ অর্জনে স্বীকৃতিস্বরূপ বিশেষ সম্মাননা। স্বপ্নপূরণের সুযোগ ১. আন্তর্জাতিক ভ্রমন ও অভ্যন্তরীন ভ্রমন 2. আন্তর্জাতিক সম্মেলনে সম্মাননা 3. পরিবারের জন্য মেডিকেল কাভারেজ 4. প্রভিডেন্ট ফান্ড 5. সন্তানের জন্য শিক্ষা বৃত্তি দ্রুত সাফল্যের সম্ভাবনা ১. বিশ্বমানের প্রশিক্ষণ ব্যবস্থা 2. দক্ষ প্রশিক্ষক 3. ডিজিটাল ওয়ার্কস্পেস 4. ১০০% অনলাইন ভিত্তিক কার্যক্রম 5. সেলস এবং অ্যাক্টিভিটি ম্যানেজমেন্টের ডিজিটাল টুলস নিজস্ব ব্যবসার সুযোগ ১. কোনো বিনিয়োগ ছাড়াই নিজের ব্যাবসার সুযোগ 2. পারফরম্যান্সের ভিত্তিতে দ্রুত পদোন্নতি এবং ইউনিট ম্যানেজার ও পরে ব্রাঞ্চ ম্যানেজার হওয়ার সুযোগ 3. নিজের নামে এজেন্সি চালু করার সুযোগ 4. নিজের সুবিধাজনক সময় অনুযায়ী কাজের স্বাধীনতা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20454",
    "job_id": "20454",
    "company_name": "POSITIVE BAZAR ",
    "job_title": "আউটলেট ম্যানেজার (তেজগাঁও )",
    "location": "Tejgaon",
    "salary": "TK. 15,000-20,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-23",
    "date_posted": "2026-02-16",
    "industry": "Management Staff",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Positivebazar is a socially responsible brand of ours, aiming to improve people's quality of life and create employment opportunities through the safe and nutritious supply of products. We are hiring a skilled, responsible, and leadership-oriented Outlet Manager for our Tejgaon outlet.\n\nResponsibilities and duties:\n- Overseeing the complete administrative and operational responsibilities of the outlet\n- Taking full responsibility for stock, cash, staff, and customer management\n- Ensuring customer satisfaction\n- Achieving daily, weekly, and monthly sales targets\n- Preparing and submitting accurate and timely reports\n- Maintaining discipline, cleanliness, and brand image of the outlet\n- Providing training and monitoring performance of team members\n- Reporting any irregularities or damages to the head office promptly\n\nMonthly accounts and reporting obligations:\n- Submitting the following information in written and soft copy format to the head office's account department between the 30th-31st of each month:\n   - Sales Report\n   - Cash Report\n   - Bank Statement Summary\n   - Card Payment Report\n   - bKash/Nagad Payment Report\n   - Return & Exchange Details\n   - All necessary attachment documents (Invoice, Voucher, etc.)\n\nImportant instructions:\n- No errors are acceptable in sales amounts, return, or exchange entries.\n\nRequired skills:\n- Strong leadership qualities\n- Honest and responsible mindset\n- Problem-solving skills\n- Communication skills (customer and team handling)\n- Ability to handle pressure\n\nBenefits:\n- Competitive salary\n- Performance bonus\n- Career growth opportunities\n- Training and development facilities\n\nWe welcome a responsible, honest, and leadership-oriented manager to join our team.\nPositivebazar - Safe Food, Better Life\n\nRequirements: 🎓 Educational Qualifications HSC / Bachelor's (Management / Accounting preferred) Basic computer knowledge (Excel, POS/ERP Software, Google sheet) Reason: Must understand accounting, stock, and reporting, and effectively manage customers and team. 🧑‍💼 Experience (Priority) 1-3 years of experience in retail/outlet management Prior experience in natural food/grocery/e-commerce sector is advantageous Real experience in achieving sales targets and leading a team\n\nPositivebazar আমাদের একটি সামাজিকভাবে দায়বদ্ধ ব্র্যান্ড, যার লক্ষ্য নিরাপদ ও পুষ্টিকর পণ্য সরবরাহের মাধ্যমে মানুষের জীবনমান উন্নত করা এবং কর্মসংস্থান সৃষ্টি করা। তেজগাঁও আউটলেটের জন্য একজন দক্ষ, দায়িত্বশীল ও নেতৃত্বগুণসম্পন্ন Outlet Manager নিয়োগ দেওয়া হবে। 1️⃣ দায়িত্ব ও কর্তব্য আউটলেটের পূর্ণ প্রশাসনিক ও অপারেশনাল দায়িত্ব পালন স্টক, ক্যাশ, স্টাফ ও কাস্টমার ম্যানেজমেন্টের সম্পূর্ণ দায়িত্ব গ্রহণ গ্রাহক সন্তুষ্টি নিশ্চিতকরণ দৈনিক, সাপ্তাহিক ও মাসিক সেলস টার্গেট অর্জন সঠিক ও সময়মতো রিপোর্ট প্রস্তুত ও জমা প্রদান আউটলেটের শৃঙ্খলা, পরিচ্ছন্নতা ও ব্র্যান্ড ইমেজ বজায় রাখা টিম মেম্বারদের ট্রেনিং ও পারফরম্যান্স মনিটরিং যেকোনো অনিয়ম বা ক্ষতি দ্রুত হেড অফিসকে অবহিত করা 2️⃣ মাসিক হিসাব ও রিপোর্টিং বাধ্যবাধকতা প্রতি মাসের ৩০–৩১ তারি"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20249",
    "job_id": "20249",
    "company_name": "Gadget Basket BD",
    "job_title": "Marketing Executive",
    "location": "Sirajganj",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-23",
    "date_posted": "2026-02-18",
    "industry": "Sales/Marketing",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 🔹 Duties & Responsibilities\n1. Plan and execute marketing strategies to promote Gadget Basket BD products.\n2. Create and manage product marketing campaigns on Facebook, Instagram, and other social media platforms.\n3. Write engaging product captions, offers, and promotional content.\n4. Communicate with customers through comments and inbox to generate sales leads.\n5. Analyze marketing performance (reach, engagement, inquiries) and suggest improvements.\n6. Coordinate with the page admin regarding offers, pricing, and stock availability.\n7. Maintain brand image and ensure professional communication with customers.\n8. Run and optimize paid ads (Facebook/Instagram) if required.\n9. Research competitors and market trends to improve product promotion.\n10. Report daily/weekly marketing activities and results.\n\n🔹 Key Focus (Important to Mention)\n- Product marketing & promotion\n- Increasing real followers and engagement\n- Generating inbox queries and sales\n- Brand awareness for Gadget Basket BD\n\n🔹 Skills You Can Mention (Optional)\n- Basic knowledge of Facebook & Instagram marketing\n- Content writing skills (English/Bangla)\n- Experience in mobile accessories marketing (preferred)\n- Basic understanding of Facebook Ads (bonus)\n\nRequirements: 🔹 Educational & Experience\n- Minimum HSC / Bachelor's degree (preferred but not mandatory).\n- Experience in social media marketing or online product promotion is preferred.\n- Freshers with strong marketing skills are also encouraged to apply.\n\n🔹 Skills & Knowledge\n- Good knowledge of Facebook & Instagram marketing.\n- Ability to create attractive product captions and promotional content.\n- Basic understanding of Facebook Ads Manager (boost post / ads run).\n- Knowledge of mobile accessories market will be an advantage.\n- Basic photo/video editing skills (Canva or similar tools) will be a plus.\n\n🔹 Communication & Personality\n- Good communication skills in Bangla and basic English.\n- Ability to communicate professionally with customers via inbox and comments.\n- Self-motivated, responsible, and target-oriented.\n- Ability to work independently and meet deadlines.\n\n🔹 Technical Requirements (Optional)\n- Must have a smartphone and stable internet connection.\n- Own Facebook account with basic business page handling experience.\n\n🔹 Duties & Responsibilities Plan and execute marketing strategies to promote Gadget Basket BD products. Create and manage product marketing campaigns on Facebook, Instagram, and other social media platforms. Write engaging product captions, offers, and promotional content. Communicate with customers through comments and inbox to generate sales leads. Analyze marketing performance (reach, engagement, inquiries) and suggest improvements. Coordinate with the page admin regarding offers, pricing, and stock availability. Maintain brand image and ensure professional communication with customers. Run and optimize paid ads (Facebook/Instagram) if required. Research competitors and market trends to im"
  }
]