[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20560",
    "job_id": "20560",
    "company_name": "Proyojon Jonoseba Ltd.",
    "job_title": "এরিয়া সেলস ম্যানেজার (ASM)",
    "location": "Anywhere in Rajshahi Division",
    "salary": "TK. 40,000-50,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-21",
    "date_posted": "2026-02-21",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Necessity Service Limited (An approved institution by the People's Republic of Bangladesh Government) As part of the programs aimed at eradicating hunger, poverty, and unemployment in Bangladesh, Necessity Service Limited is recruiting personnel in various districts of Rajshahi Division. Qualified candidates are invited to apply for the ongoing operational and monitoring activities of the institution. Position: Area Sales Manager (ASM) Location: Respective police stations of each district in Rajshahi Division Job Type: Full-time Educational Qualifications Minimum HSC/ Honors or equivalent Preference will be given to experienced candidates in sales and management-related work Responsibilities and Duties Conducting and monitoring activities in the designated area Team management and monitoring Customer coordination and service assurance Achieving specified targets Salary and Benefits Monthly salary: 40,000 - 50,000 BDT Incentives and target bonuses Promotion opportunities Opportunity to work in your own area Application Process For more information or to apply, contact: 📞 01712610037 (GM - Naogaon District) 📞 01805000534 (DPD) 📞 01952000042 (Office Admin) Necessity Service Limited Your service, by your side.\n\nপ্রয়োজন জনসেবা লিমিটেড (গণপ্রজাতন্ত্রী বাংলাদেশ সরকার কর্তৃক অনুমোদিত প্রতিষ্ঠান) ক্ষুধা, দারিদ্র্য ও বেকারমুক্ত বাংলাদেশ গড়ার লক্ষ্যে পরিচালিত কার্যক্রমের অংশ হিসেবে প্রয়োজন জনসেবা লিমিটেড রাজশাহী ডিভিশনের বিভিন্ন জেলায় জনবল নিয়োগ দিচ্ছে। প্রতিষ্ঠানের চলমান কার্যক্রম পরিচালনা ও মনিটরিংয়ের জন্য যোগ্য প্রার্থীদের নিকট থেকে আবেদন আহ্বান করা হচ্ছে। পদের নাম: এরিয়া সেলস ম্যানেজার (ASM) কর্মস্থল: রাজশাহী ডিভিশনের প্রতিটি জেলার নিজ নিজ থানা চাকরির ধরন: ফুল-টাইম শিক্ষাগত যোগ্যতা ন্যূনতম এইচএসসি / অনার্স বা সমমান বিক্রয় ও ব্যবস্থাপনা সংক্রান্ত কাজে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে দায়িত্ব ও কর্তব্য নির্ধারিত এলাকায় কার্যক্রম পরিচালনা ও তদারকি টিম ম্যানেজমেন্ট ও মনিটরিং গ্রাহক সমন্বয় ও সেবা নিশ্চিতকরণ নির্ধারিত টার্গেট অর্জন বেতন ও সুযোগ-সুবিধা মাসিক বেতন: ৪০,০০০ – ৫০,০০০ টাকা ইনসেনটিভ ও টার্গেট বোনাস পদোন্নতির সুযোগ নিজ এলাকায় কাজ করার সুযোগ আবেদন প্রক্রিয়া বিস্তারিত জানতে বা আবেদন করতে যোগাযোগ করুন: 📞 ০১৮০৫০০০৫৩৪ (ডিপিডি) 📞 ০১৯৫২০০০০৪২ (অফিস অ্যাডমিন) কর্পোরেট অফিস নামাজগর, বগুড়া সদর, বগুরা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20563",
    "job_id": "20563",
    "company_name": "Proyojon Jonoseba Ltd.",
    "job_title": "এরিয়া সেলস ম্যানেজার (ASM)",
    "location": "Anywhere in Rangpur Division",
    "salary": "TK. 40,000-50,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-21",
    "date_posted": "2026-02-21",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Dhaka office : House -30 , Road 02, Banani, Dhaka",
    "job_description": "Responsibilities: Necessity Janaseba Limited (An institution approved by the Government of the People's Republic of Bangladesh) As part of the program aimed at eradicating hunger, poverty, and unemployment in Bangladesh, Necessity Janaseba Limited is recruiting personnel in various districts of Rangpur Division. Qualified and enthusiastic candidates are invited to apply for the management and monitoring of the institution's activities. Position: Area Sales Manager (ASM) Location: Each district of Rangpur Division's respective police stations Job Type: Full-time Educational Qualifications Minimum HSC/ Bachelor's degree or equivalent Preference will be given to candidates with experience in sales and management-related work Responsibilities Manage and supervise activities in the designated area Team coordination and monitoring Ensure customer service Achieve specified targets Salary and Benefits Monthly salary: 40,000 - 50,000 BDT Incentives and target bonuses Promotion opportunities Opportunity to work in your own area Application Process For more information or to apply, contact: 📞 01805000538 (PD) 📞 01952000042 (Office Admin) Necessity Janaseba Limited With you, by your side in your service.\n\nপ্রয়োজন জনসেবা লিমিটেড (গণপ্রজাতন্ত্রী বাংলাদেশ সরকার কর্তৃক অনুমোদিত প্রতিষ্ঠান) ক্ষুধা, দারিদ্র্য ও বেকারমুক্ত বাংলাদেশ গড়ার লক্ষ্যে পরিচালিত কার্যক্রমের অংশ হিসেবে প্রয়োজন জনসেবা লিমিটেড রংপুর ডিভিশনের বিভিন্ন জেলায় জনবল নিয়োগ দিচ্ছে। প্রতিষ্ঠানের কার্যক্রম পরিচালনা ও মনিটরিংয়ের জন্য যোগ্য ও আগ্রহী প্রার্থীদের নিকট থেকে আবেদন আহ্বান করা হচ্ছে। পদের নাম: এরিয়া সেলস ম্যানেজার (ASM) কর্মস্থল: রংপুর ডিভিশনের প্রতিটি জেলার নিজ নিজ থানা চাকরির ধরন: ফুল-টাইম শিক্ষাগত যোগ্যতা ন্যূনতম এইচএসসি / অনার্স বা সমমান বিক্রয় ও ব্যবস্থাপনা সংক্রান্ত কাজে অভিজ্ঞ প্রার্থীদের অগ্রাধিকার দেওয়া হবে দায়িত্ব ও কর্তব্য নির্ধারিত এলাকায় কার্যক্রম পরিচালনা ও তদারকি টিম সমন্বয় ও মনিটরিং গ্রাহক সেবা নিশ্চিতকরণ নির্ধারিত টার্গেট অর্জন বেতন ও সুযোগ-সুবিধা মাসিক বেতন: ৪০,০০০ – ৫০,০০০ টাকা ইনসেনটিভ ও টার্গেট বোনাস পদোন্নতির সুযোগ নিজ এলাকায় কাজ করার সুযোগ আবেদন প্রক্রিয়া বিস্তারিত জানতে বা আবেদন করতে যোগাযোগ করুন: 📞 ০১৮০৫০০০৫৩৮ (পিডি) 📞 ০১৯৫২০০০০৪২ (অফিস অ্যাডমিন) প্রয়োজন জনসেবা লিমিটেড আপনার সেবায়, আপনার পাশে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20561",
    "job_id": "20561",
    "company_name": "Proyojon Jonoseba Ltd.",
    "job_title": "টেরিটরি সেলস ম্যানেজার (TSM)",
    "location": "Naogaon",
    "salary": "TK. 25,000-30,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-21",
    "date_posted": "2026-02-21",
    "industry": "Sales/Marketing",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Dhaka office : House -30 , Road 02, Banani, Dhaka",
    "job_description": "Responsibilities: Organization Name: Prayojon Jonoseba Limited Approval: Approved by the Government of the People's Republic of Bangladesh As part of the program aimed at creating a hunger-free, poverty-free, and unemployment-free Bangladesh, personnel will be recruited for the position of Territory Sales Manager (TSM) in every union under all police stations in Naogaon district. The organization is currently implementing a supply program at 50% reduced prices for monthly markets (rice, lentils, oil, soap, flour, sugar, salt) until the next 5 (five) years. Responsible and hardworking individuals are invited to manage and monitor this program effectively. Job Description Position: Territory Sales Manager (TSM) Location: Candidate's own union (Naogaon district) Educational Qualification: Minimum SSC/HSC Candidate Qualifications and Attributes Must be honest, responsible, and hardworking Should be enthusiastic about community service Must have good communication skills Should have a mindset to work at the grassroots level Salary and Benefits Monthly salary: 25,000 - 30,000 Taka Incentives and target bonuses Promotion opportunities Application Process Interested candidates are requested to contact promptly. Contact Numbers: 01712610037 (GM - Naogaon district) 01805000534 (DPD) 01952000042 (Office Admin) Corporate Office Namajgar, Bogura Sadar, Bogura.\n\nপ্রতিষ্ঠানের নাম: প্রয়োজন জনসেবা লিমিটেড অনুমোদন: গণপ্রজাতন্ত্রী বাংলাদেশ সরকার কর্তৃক অনুমোদিত ক্ষুধা, দারিদ্র্যমুক্ত ও বেকারমুক্ত বাংলাদেশ গড়ার লক্ষ্যে পরিচালিত কার্যক্রমের অংশ হিসেবে নওগাঁ জেলার সকল থানার অন্তর্গত প্রতিটি ইউনিয়নে টেরিটরি সেলস ম্যানেজার (TSM) পদে জনবল নিয়োগ দেওয়া হবে। প্রতিষ্ঠানটি নিয়মিত মাসিক বাজার (চাল, ডাল, তেল, সাবান, আটা, চিনি, লবণ) ৫০% কম মূল্যে আগামী ৫ (পাঁচ) বছর পণ্য কেনার সুযোগ , উক্ত কার্যক্রম পরিচালনা ও মনিটরিং করার জন্য নওগাঁ জেলার সকল থানা সমূহের  নিজ নিজ ' ইউনিয়ন' ভিত্তিক - টি.এস.এম (টেরিটরি সেলস ম্যানেজার) পদে নিয়োগ দেওয়া হবে।। পদের বিবরণ পদের নাম: টেরিটরি সেলস ম্যানেজার (TSM) কর্মস্থল: প্রার্থীর নিজ ইউনিয়ন (নওগাঁ জেলা) শিক্ষাগত যোগ্যতা: ন্যূনতম এসএসসি/এইচএসসি প্রার্থীর যোগ্যতা ও গুণাবলি সৎ, দায়িত্বশীল ও পরিশ্রমী হতে হবে জনসেবামূলক কাজে আগ্রহী হতে হবে যোগাযোগ দক্ষতা থাকতে হবে মাঠপর্যায়ে কাজ করার মানসিকতা থাকতে হবে বেতন ও সুযোগ-সুবিধা মাসিক বেতন: ২৫,০০০ – ৩০,০০০ টাকা ইনসেনটিভ ও টার্গেট বোনাস পদোন্নতির সুযোগ আবেদন প্রক্রিয়া আগ্রহী প্রার্থীদের দ্রুত যোগাযোগ করার জন্য অনুরোধ করা যাচ্ছে। যোগাযোগ নম্বর: 01712610037 (জি.এম – নওগাঁ জেলা) 01805000534 (ডিপিডি) 01952000042 (অফিস এডমিন) কর্পোরেট অফিস নামাজগর, বগুড়া সদর, বগুড়া।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20515",
    "job_id": "20515",
    "company_name": "Layaana",
    "job_title": "Tele Sales & Customer Service Executive",
    "location": "Aftabnagar",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-18",
    "date_posted": "2026-02-21",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Handle inbound and outbound customer communications via phone calls, Messenger, and other digital platforms. Respond to customer inquiries promptly and professionally to ensure high customer satisfaction. Guide potential customers and persuade them to place orders through effective communication. Process and confirm orders accurately in the system. Resolve customer complaints and provide appropriate solutions in a timely manner. Maintain proper follow-up with interested and existing customers. Keep records of customer interactions, orders, and feedback. Coordinate with the operations and delivery team to ensure smooth order fulfillment. Meet daily and monthly sales and service targets set by the management. Maintain a polite, positive, and brand-aligned communication style at all times.\n\nRequirements: Minimum HSC or equivalent; graduate candidates will get preference\n\nStrong communication skills in Bangla (spoken and written); basic English is a plus\n\nBasic computer knowledge and typing skills are mandatory\n\nAbility to handle customer calls and messages confidently\n\nWillingness to work in flexible shifts\n\nPrior experience in tele sales or customer service will be preferred\n\nGood to Have (Preferred Skills)\n\nGood presentation and persuasion skills\n\nStrong problem-solving ability\n\nPositive attitude and customer-first mindset\n\nAbility to work under pressure and meet sales targets\n\nExperience with Facebook Page, Messenger, or e-commerce platforms\n\nTeamwork and coordination skills\n\nFast learner with adaptability to new tools and processes\n\nHandle inbound and outbound customer communications via phone calls, Messenger, and other digital platforms. Respond to customer inquiries and professionally to ensure high customer satisfaction. Guide potential customers and influence them to place orders through effective communication. Process and confirm orders accurately in the system. Resolve customer complaints and provide appropriate solutions in a timely manner. Maintain proper follow-up with interested and existing customers. Keep records of customer interactions, orders, and feedback. Coordinate with the operations and delivery team to ensure smooth order fulfillment. Meet daily and monthly sales and service targets set by the management. Maintain a polite, positive, and brand-aligned communication style at all times."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20562",
    "job_id": "20562",
    "company_name": "Rokomari.com",
    "job_title": "Telesales Associate",
    "location": "Arambag, Motijheel",
    "salary": "TK. 11,000-12,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-08",
    "date_posted": "2026-02-21",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "2/1/E, Eden Center, Dhaka 1000",
    "job_description": "Responsibilities: ```html Prohori - Vehicle Tracking Service (Partner of Rokomari.com) Job Circular | Tele Sales Associate Prohori Website Link: https://prohori.com/ Job Responsibilities: Explain Prohori's functionality to potential customers over the phone. Answer various questions of potential customers about Prohori. Keep each conversation with the customer in a specific sheet or CRM software. Must communicate with a certain number of potential customers every month. ```\n\nRequirements: Description of the Position\nNumber of Positions: 10 (Female only)\nJob Type: Full-time (Contractual/Permanent)\nWorkplace: Office Work\nLocation: Motijheel, Dhaka\nDuty Time: 09:00 AM to 06:00 PM\n\nEducational Qualifications: At least HSC.\n\nExperience: Minimum 0-1 year. Freshers are encouraged to apply.\n\nAdditional Requirements for the Job:\n1. Must have experience in operating desktop/laptop.\n2. Must have a smartphone. SIM card and balance will be provided from the office.\n3. Must be active online during work hours.\n4. Must be proactive, hardworking, punctual, and cooperative.\n\nOther Opportunities and Benefits:\n1. Attractive sales commission.\n2. Opportunity for permanent position and salary increment based on performance.\n3. Opportunity for performance-based yearly salary increment.\n4. Festival bonus twice a year.\n5. Lunch arrangement at noon.\n6. Free snacks and unlimited tea.\n7. Prayer room and office library.\n8. Free medical facilities at the office.\n9. Medical leave, mandatory leave, and weekly holidays.\n10. Career growth opportunities.\n11. Discount on medical tests at reputable hospitals.\n12. Special discounts on company products or services.\n\nProhori - Vehicle Tracking Service (রকমারি.কম - এর একটি সহযোগী প্রতিষ্ঠান) নিয়োগ বিজ্ঞপ্তি | টেলি সেলস এসোসিয়েট প্রহরী ওয়েবসাইট লিংকঃ https://prohori.com/ চাকরির দায়িত্বসমূহঃ ফোন কলের মাধ্যমে প্রহরীর কার্যকারিতা সম্পর্কে পটেনশিয়াল কাস্টমারদের বোঝানো। প্রহরী সম্পর্কে পটেনশিয়াল কাস্টমারদের বিভিন্ন প্রশ্নের উত্তর দেয়া। কাস্টমারের সাথে হওয়া প্রতিটি কনভারসেশন নির্দিষ্ট শীটে বা সিআরএম সফটওয়্যারে আপডেট রাখা। প্রতিমাসে নির্দিষ্ট সংখ্যক পটেনশিয়াল কাস্টমারদের সাথে অবশ্যই কথা বলা।"
  }
]