[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20248",
    "job_id": "20248",
    "company_name": "Dreamliner Students & Skilled Migration consultancy",
    "job_title": "Senior Executive Consultant",
    "location": "Chittagong",
    "salary": "TK. 15,000-20,000",
    "experience": "3-5 years",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "7 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-02-01",
    "industry": "Law/ Legal",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "1st Floor (Flat #A-1), House #70, Road #20, Sector #11, Uttara, Dhaka-1230",
    "job_description": "Responsibilities: We Are Hiring – Senior Executive Consultant\n\n📍 Location: Rose Valley, Flat # A-1, House # 11, Road # 04, North Khulshi, Chattogram – 4202\n💰 Salary: Will increase based on skills, experience & eligibility\n🕒 Working Hours: 11:00 AM – 6:00 PM\n\nRequirements:\n- Must be a graduate (Master’s degree preferred)\n- 3-5 years of proven experience in marketing or education/migration consultancy\n- Strong client handling skills\n- Ability to meet monthly targets (mandatory)\n- Ability to submit daily work reports\n- Updated knowledge of emigration laws\n\nKey Responsibilities:\n- Consult with clients and provide tailored migration/education solutions\n- Maintain strong client relationships and ensure client satisfaction\n- Achieve monthly marketing and conversion targets\n- Submit daily activity reports to management\n- Generate innovative marketing ideas (both traditional and digital)\n- Provide guidance to junior consultants\n- Lead, motivate, and manage the team to achieve targets\n- Take overall responsibility for team performance\n\nDesired Qualities:\n- Target-driven and highly responsible\n- Strong leadership and team management skills\n- Excellent interpersonal and communication skills\n- Friendly, talkative, and client-focused personality\n- Sociable and outgoing attitude\n- Creative thinker with strong marketing sense\n- Ability to adapt quickly to client needs\n\n👉 Send your CV to:\n📧 rakib.dssmc@gmail.com\n\nWe Are Hiring – Senior Executive Consultant 📍 Location: Rose Valley, Flat # A-1, House # 11, Road # 04, North Khulshi, Chattogram – 4202 💰 Salary: Will increase based on skills, experience & eligibility 🕒 Working Hours: 11:00 AM – 6:00 PM Requirements: Must be a graduate (Master’s degree preferred) 3–5 years of proven experience in marketing or education/migration consultancy Strong client handling skills Ability to meet monthly targets (mandatory) Ability to submit daily work reports Updated knowledge of emigration laws Key Responsibilities: Consult with clients and provide tailored migration/education solutions Maintain strong client relationships and ensure client satisfaction Achieve monthly marketing and conversion targets Submit daily activity reports to management Generate innovative marketing ideas (both traditional and digital) Provide guidance to junior consultants Lead, motivate, and manage the team to achieve targets Take overall responsibility for team performance Desired Qualities: Target-driven and highly responsible Strong leadership and team management skills Excellent interpersonal and communication skills Friendly, talkative, and client-focused personality Sociable and outgoing attitude Creative thinker with strong marketing sense Ability to adapt quickly to client needs 👉 Send your CV to: 📧 rakib.dssmc@gmail.com"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19638",
    "job_id": "19638",
    "company_name": "Birds Eye Fashion ",
    "job_title": "Online Executive",
    "location": "Shahbagh",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-08",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Shahbagh , Dhaka 1000",
    "job_description": "Responsibilities: ```html Job Context Work 6 days a week Weekly holiday on Tuesday Work hours will be according to market rules. Job Type Full-time Benefits Salary Review: Yearly Festival Bonus: 2 (Yearly) Other benefits will be provided according to company rules. Job Responsibilities Must work on Bengali and English typing. Need to work on product upload and editing on the website. Must communicate with clients patiently. Should have experience in Photoshop work. Experience in photo editing, online posting, and selling is required. Need to work on product upload and editing on the website. Educational Requirements HSC/ Bachelor's degree or equivalent. Educational qualifications are flexible for experienced candidates. Experience Minimum 2 years Experience required in the following areas for applicants: Customer Service Additional Requirements Age 18 to 35 years Minimum 2 years of experience in polo, t-shirt, shirt, and panjabi. Must be proficient in computer operation/data entry software. Biodata, passport size photo, and photocopy of voter ID card should be sent to the following address: Contact must be made at the following numbers: Boards Eye Fashion (Wholesale and Retailer Nationwide), 2nd Floor, Shahbag, Dhaka-1000 01720996666 Visiting hours - Morning (9am-12pm) and Evening (7pm-8pm) Friday - 10am-5pm Note: Closed on Tuesdays ```\n\nজব কনটেক্সট কাজ সপ্তাহে ৬ দিন মঙ্গলবার সাপ্তাহিক ছুটি কাজের সময় মার্কেটের নিয়ম অনুসারে হবে। চাকরির ধরন ফুল টাইম সুযোগ-সুবিধাসমূহ Salary Review: Yearly Festival Bonus: 2 (Yearly) কোম্পানীর নিয়ম অনুসারে অন্যান্য সুবিধাদি দেওয়া হবে চাকরির দায়িত্বসমূহ বাংলা ও ইংরেজি টাইপ এর কাজ করতে হবে। ওয়েবসাইটে প্রোডাক্ট আপলোড ও এডিটিং এর কাজ করতে হবে। ক্লায়েন্টের সাথে ধৈর্যের সাথে কথা বলতে হবে। ·         Photoshop কাজ এর অভিজ্ঞতা থাকতে হবে । ·         ছবি  ওঠানো এডিট ও অনলাইনে পোস্ট ও সেলের এর অভিজ্ঞতা  থাকতে হবে। ·         ওয়েবসাইটে প্রোডাক্ট আপলোড ও এডিটিং এর কাজ করতে হবে। শিক্ষাগত যোগ্যতা এইচ,এস,সি/ স্নাতক সমমান । অভিজ্ঞতাদের জন্য শিক্ষাগত যোগ্যতা শিথিলযোগ্য অভিজ্ঞতা সর্বনিম্ন ২ বছর আবেদনকারীদের নিম্নলিখিত ক্ষেত্রে অভিজ্ঞতা থাকতে হবে: Customer Service চাকরির আরো প্রয়োজনীয় বিষয়সমূহ বয়স ১৮ থেকে ৩৫ বছর পোলো , টি-শার্ট , শার্ট ও  পাঞ্জাবির উপর ২ বছরের চাকরির অভিজ্ঞতা থাকতে হবে কম্পিউটার চালনায়/ সফটওয়্যার এ ডাটা এন্ট্রি কাজে পারদর্শি হতে হবে। বায়োডাটা পাসপোর্ট সাইজের ছবি  ভোটার আইডি কার্ডের ফটোকপি সহ নিম্ন ঠিকানায় যোগাযোগ করতে বলা হল – অবশ্যই নিম্নোক্ত নাম্বার এ যোগাযোগ করে আসতে হবে  - বার্ডস আই ফ্যাশন(সারাদেশে পাইকারি ও খুচরা বিক্রেতা )  , আজিজ সুপার মার্কেট ২য় তলা , শাহবাগ , ঢাকা -১০০০ ০১৭২০৯৯৬৬৬৬ দেখা করার সময় – সকাল (9am-12pm) ও সন্ধ্যা (7pm-8pm) শুক্রবার – সকা১০টা - বিকাল ৫টা- ৮টা বিশেষ দ্রষ্টব্য – মঙ্গলবার বন্ধ থাকবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19686",
    "job_id": "19686",
    "company_name": "RS 3D wallpaper & Floor",
    "job_title": "Female Model",
    "location": "Dhaka",
    "salary": "TK. 12,000-15,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-11",
    "industry": "Media/Advertisement/Event Mgt.",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Ka-57/4 kuril chowrastha vatara, dhaka 1229",
    "job_description": "Responsibilities: Urgently needed for the job of shooting 3D Wallpaper videos 👉 2 female models needed. 💰 Salary: From 12,000 taka to 15,000 taka (depending on work and experience) 🎥 Type of work: Shooting promotional videos of 3D Wallpaper Short-term project Professional and safe work environment 📍 Office address: K-39/2, 3rd floor Kuril, opposite Jamuna Future Park 📞 Contact (WhatsApp): 📲 01772-132818 👉 Interested candidates, please contact via WhatsApp.\n\n3D Wallpaper এর ভিডিও শুটের কাজের জন্য জরুরি ভিত্তিতে 👉 ২ জন ফিমেল মডেল প্রয়োজন। 💰 বেতন: ১২,০০০ টাকা থেকে ১৫,০০০ টাকা (কাজ ও অভিজ্ঞতা অনুযায়ী) 🎥 কাজের ধরন: 3D Wallpaper এর প্রোমোশনাল ভিডিও শুট স্বল্প সময়ের প্রজেক্ট প্রফেশনাল ও সেফ ওয়ার্ক এনভায়রনমেন্ট 📍 অফিস ঠিকানা: ক-৩৯/২, ৩য় তলা কুড়িল, যমুনা ফিউচার পার্কের অপজিট পাশে 📞 যোগাযোগ (WhatsApp): 📲 01772-132818 👉 আগ্রহীরা WhatsApp এ যোগাযোগ করুন।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19683",
    "job_id": "19683",
    "company_name": "Chaldal Ltd",
    "job_title": "RIDER",
    "location": "Gulshan, Banani, Mohakhali, Mohakhali DOHS",
    "salary": "TK. 13,222-16,822",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-11",
    "industry": "Deliveryman",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: There are vacancies in Mahakhali, Banani, Mahakhali DOHS, Chairmanbari, and Karail areas. Benefits: ✅ Daily wage: 601 BDT, one day off after every 3 days, 22 days duty per month. ✅ Monthly attendance bonus: 3,600 BDT ✅ Fuel expenses will be covered by the company ✅ Mobile bill: 200 BDT 📦 Responsibilities: Medicine delivery from warehouse to warehouse ⏳ Limited seats - Apply now! Contact today to join: 01990544217\n\nRequirements: Terms and Conditions: 🛵 Own bike and updated documents must be available.\n\nমহাখালী,বনানী, মহাখালী ডিওএইচএস, চেয়ারম্যানবাড়ি, কারাইল এই এরিয়াগুলোতে ভ্যাকেন্সি আছে. সুবিধা: ✅ দৈনিক বেতন: ৬০১ টাকা, ৩ দিন পর পর ১দিন ছুটি.,মাসে ২২ দিন ডিউটি. ✅ মাসিক উপস্থিতি বোনাস: ৩,৬০০ টাকা ✅ ফুয়েল খরচ কোম্পানি বহন করবে ✅ মোবাইল বিল: ২০০ টাকা 📦 দায়িত্ব: ওয়্যারহাউস থেকে ওয়্যারহাউসে ওষুধ ডেলিভারি ⏳ সিট সীমিত – আজই আবেদন করুন! যোগদান করতে আজই আজ ই যোগাযোগ করুন: 01990544217"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19697",
    "job_id": "19697",
    "company_name": "Attention Security Service Ltd.",
    "job_title": "সহকারী সুপারভাইজার",
    "location": "Dhaka, Narsingdi, Narayanganj, Jatrabari",
    "salary": "TK. 15,000-17,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-11",
    "industry": "Security/Support Service",
    "vacancy": 8,
    "shift": "Day Shift",
    "country": null,
    "company_address": "78/4-C (First floor), Kazla Bridge, Jatrabari, Dhaka.",
    "job_description": "Responsibilities: Under the supervision of registered and licensed institutions, several assistant supervisors will be hired to ensure the security and monitoring of domestic and foreign Chinese and Indian projects, mills, industries, factories, houses, showrooms, and bank ATM booths.\n\nRequirements: No security or experience required here. Other benefits: Free accommodation. Bonus salary given by the 10th of each month. Adequate overtime facilities available. Free medical treatment, bonus for 2 festivals per year. Attendance bonus equal to one day's attendance. Salary will increase in the first 6 months and annually thereafter. Those interested in working should contact the office directly or via WhatsApp. Contact: 01765227664 Yatrabari Kajla Bridge.\n\nরেজিস্ট্রিকৃত ও লাইসেন্স প্রাপ্ত প্রতিষ্ঠান এর অধীনে দেশি বিদেশি চাইনা ও ইন্ডিয়ান প্রজেক্টে, মিল, শিল্প, কারখানা, হাউস, শোরুম, ব্যাংক এটিএম বুথ এর নিরাপত্তা বাস্তবায়ন ও দেখাশোনা করার জন্য বেশ কিছু সহকারী সুপারভাইজার নিয়োগ করা হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19685",
    "job_id": "19685",
    "company_name": "Biyerkhoj Marriage Media",
    "job_title": "Customer Care Service Officer (Female)",
    "location": "Mohakhali DOHS",
    "salary": "TK. 12,000-24,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-11",
    "industry": "Call Center",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "DOHS Mohakhali",
    "job_description": "Responsibilities: About the job Details\nPost Name: Customer Care Service Executive (Female)\nOnly Experienced People Apply Please, Minimum 2-3 Years Customer Care Service Executive, Telemarketing Executive. Only apply if you have worked as a Customer Care Service Executive or Telemarketing Executive. Candidates who have worked in marriage media will receive extra priority and better offers. Thank You\nEducational Qualification: Minimum HSC, BA, BSC, BBA, MBA, BDS, CSE, EEE, ETE, ETCE, BBA. Complete\nExperience:\n* Educational qualification is relaxable in case of experienced candidates\n* Preference will be given to candidates working in call center\n* Must have basic computer knowledge. MS Word, Email Send, Email Check. WhatsApp use on Computer\nJob Description:\n1) On-call customer support, sending documents via WhatsApp\n2) Receiving calls from clients and providing information\nOpportunities:\n2) Monthly mobile bill (as per company rules)\n3) Annual salary increase (as per company rules)\n4) Provision of commission for additional work\n5) Arrangement of midday lunch in the office (Meal System)\n6) Training and Promotion\nCandidate Qualification and Documents:\n- One copy of resume (biodata)\n- One copy of recent full-size photograph (taken on mobile)\n- Photocopy of school certificate\n- Photocopy of national identity card\nSalary: 12 to 24k Negotiable. Discussion based on qualifications\nOffice: DOHS Mohakhali, Customer Care Service Officer, Dhaka Telesales, Customer Care Service Executive, Marketing Executive, Office Executive, Call Center\n\nRequirements: About the job Details\nPost Name: Customer Care Service Executive (Female)\nOnly Experienced People Apply Please, Minimum 2-3 Years Customer Care Service Executive, Telemarketing Executive. Only those who have worked in Marriage media will be given extra priority and a good salary offer. Thank You\nEducational Qualification: Minimum HSC, BA, BSC, CSE, EEE, ETE, ETCE, BBA. Complete\n\nSalary: 12 to 24k Negotiable. Discussion on salary is possible.\n\nOffice: DOHS Mohakhali, Dhaka. Telesales, Customer Care Service Executive, Marketing Executive, Office Executive, Call Center\n\nAbout the job Details Post Name: Cusomer Care Service Executive (Female) Only Exprience Peaople Apply Please,  Minimum 2-3  Years Cusomer Care Service Executive, Telemarketing Executive Hisebe job korchen Sudhumatro tarai apply korun , Marriage media te job korchen emon candidate hole tader jonno extra priority and valo beton offfer kora hobe , Thank You Educational Qualification: Minimum ,HSC BA,BSC,BBA , MBA, BDS, CSE , EEE , ETE, ETCE,BBA. Complete Experience: * Educational qualification is relaxable in case of experienced candidates * Preference will be given to candidates working in call center * Must have basic computer knowledge. MS Word, Email Send, Email Check. WhatsApp USE in Computer Job Description :- 1) On call customer support. , Whatsapp a documents pathano 2) Receiving calls from clients and giving information Opportunities: 2) Month"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19696",
    "job_id": "19696",
    "company_name": "Attention Security Service Ltd.",
    "job_title": "সিকিউরিটি গার্ড",
    "location": "Dhaka, Jatrabari",
    "salary": "TK. 15,500-16,500",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-11",
    "industry": "Security/Support Service",
    "vacancy": 8,
    "shift": "Day Shift",
    "country": null,
    "company_address": "78/4-C (First floor), Kazla Bridge, Jatrabari, Dhaka.",
    "job_description": "Responsibilities: Security guards will be hired to ensure the security and surveillance of domestic and foreign Chinese and Indian projects, mills, factories, warehouses, houses, showrooms, and bank ATM booths under the registered and licensed institutions.\n\nRequirements: No security or experience required here. Other benefits: Free accommodation. Bonus salary given by the 10th of each month. Adequate overtime benefits available. Free medical treatment, bonus for 2 festivals per year. Attendance bonus equal to one day's attendance. Salary will increase in the first 6 months and annually thereafter. Those interested in working should contact the office directly or via WhatsApp. Contact: 01765227664 Location: Kajla Bridge, Jatrabari.\n\nরেজিস্ট্রিকৃত ও লাইসেন্স প্রাপ্ত প্রতিষ্ঠান এর অধীনে দেশি বিদেশি চাইনা ও ইন্ডিয়ান প্রজেক্টে, মিল, শিল্প, কারখানা, হাউস, শোরুম, ব্যাংক এটিএম বুথ এর নিরাপত্তা বাস্তবায়ন ও দেখাশোনা করার জন্য বেশ কিছু সিকিউরিটি গার্ড নিয়োগ করা হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19640",
    "job_id": "19640",
    "company_name": "Falaq Food",
    "job_title": "Telesales Executive/Call Center Agent ",
    "location": "Dhaka, Mohammadpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-08",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Bosila Future Town. Mohammadpur. Dhaka-1207",
    "job_description": "Responsibilities: Business: Falaq Food is a food supplier company in Bangladesh. Falaq Food is working to ensure that safe food reaches every home at a fair price. Ensuring the best quality at a low price is the main challenge of Falaq Food. Falaq Food is on the path of honey, nuts, natural oils, chia seeds, and food grains. You can also get any product from Falaq Food from our official Facebook page (Facebook: Falaq Food). Or you can order any product by calling our Hotline Number: +8809613821489 directly. Website: https://falaqfood.com Responsibilities & Context Contacting new and existing customers via SIP/CRM Providing product and service information to engage potential customers. Closing sales and maintaining sales-related records. Answering customer queries and resolving any issues they may have. Preparing daily work reports and sharing them with the supervisor.\n\nRequirements: Education: HSC or a Bachelor's degree. Experience: At least 1 year The applicants should have experience in the following business area(s): Telecommunication, Call Center Freshers are also encouraged to apply. Additional Requirements: Age 20 to 30 years Freshers are also encouraged to apply. Skills & Expertise: Negotiation, Persuasion Skills, Reporting and Documentation, Sales target, Customer Service, Telecommunication Products & Services Compensation & Other Benefits: · Fully Fixed Salary and Commission Based Salary Performance bonus Lunch Facilities: Fully Subsidized Workplace: Work at office Working hour: 9 hours (1 hour for Lunch & Prayer) Employment Status: Full Time Gender: Only Male Job Location: Dhaka (Mohammadpur) Company Information: Falaq Food Bosila Mohammadpur Dhaka-1207 Website: https://falaqfood.com Read Before Apply Easy Location : First Come to Mohammadpur, Bosila 40 Feet, take a rickshaw to go to Future Town, Road No 4, House No 13, E Block (Khalpar).\n\nBusiness: Falaq Food is a food supplier company in Bangladesh. Falaq Food is working to ensure that safe food reaches every home at a fair price. Ensuring the best quality at a low price is the main challenge of Falaq Food. Falaq Food is on the path of honey, nuts, natural oils, chia seeds and food grains. You can also get any product of Falaq Food from our official Facebook page (Facebook: Falaq Food). Or you can order any product by calling our Hotline Number: +8809613821489 directly. Website: https://falaqfood.com Responsibilities & Context Contacting new and existing customers via SIP/CRM Providing product and service information to engage potential customers. Closing sales and maintaining sales-related records. Answering customer queries and resolving any issues they may have. Preparing daily work reports and sharing them with the supervisor."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19641",
    "job_id": "19641",
    "company_name": "Lead Consultancy ",
    "job_title": "Female Receptionist",
    "location": "Shyamoli",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-12",
    "industry": "General Management/Admin",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "23 shamoly tower complex, lift-2, mirpur road dhaka120",
    "job_description": "Responsibilities: 📢 Job Advertisement *Company Name: Lead Consultancy *Position: Female Receptionist *Number of Positions: 03 **Qualifications and Requirements: Only female candidates Height should be at least 5.5 feet or above Must be smart, good-looking, and presentable Good communication skills required Must have the mentality to handle office reception and customer interactions Preference will be given if basic computer knowledge is available *Job Type: Full-time *Salary: Negotiable *Application Procedure: Interested candidates should send their recent photo along with CV .\n\n📢 নিয়োগ বিজ্ঞপ্তি *প্রতিষ্ঠানের নাম: Lead Consultancy *পদের নাম: Female Receptionist *পদের সংখ্যা: ০৩ জন **যোগ্যতা ও শর্তাবলি: শুধুমাত্র নারী প্রার্থী উচ্চতা ৫ ফুট বা তার বেশি স্মার্ট, গুড লুকিং ও প্রেজেন্টেবল হতে হবে যোগাযোগ দক্ষতা ভালো হতে হবে অফিস রিসেপশন ও কাস্টমার হ্যান্ডেল করার মানসিকতা থাকতে হবে কম্পিউটারের বেসিক জ্ঞান থাকলে অগ্রাধিকার দেওয়া হবে *চাকরির ধরন: ফুল-টাইম *বেতন: আলোচনা সাপেক্ষ *আবেদনের নিয়ম: আগ্রহী প্রার্থীরা তাদের সাম্প্রতিক ছবি সহ CV পাঠান।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19680",
    "job_id": "19680",
    "company_name": "Lion Industrious Security Service Ltd. Dhaka",
    "job_title": "সহকারী সুপারভাইজার",
    "location": "Dhaka, Jatrabari",
    "salary": "TK. 15,000-17,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "12 hours per day",
    "deadline": "2026-02-08",
    "date_posted": "2026-01-11",
    "industry": "Security/Support Service",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Kajla Bridge, Demra Road, Jatrabari, Jatrabari, Bangladesh",
    "job_description": "Responsibilities: Registered and licensed organizations will hire a significant number of assistant supervisors to ensure the security and surveillance of domestic and foreign Chinese and Indian projects, mills, factories, warehouses, houses, showrooms, banks, and ATM booths.\n\nRequirements: No need for security or experience here. Other facilities: Free accommodation. Bonus salary is given by the 10th of each month. Adequate overtime benefits are available. Free medical treatment, two festival bonuses per year. Attendance bonus is equivalent to one day's attendance. Salary will increase in the first 6 months and annually thereafter. Those who are willing to work can contact the office directly or via WhatsApp. Contact: 01329666015 Yatrabari Kajla Bridge.\n\nরেজিস্ট্রিকৃত ও লাইসেন্স প্রাপ্ত প্রতিষ্ঠান এর অধীনে দেশি বিদেশি চাইনা ও ইন্ডিয়ান প্রজেক্টে, মিল, শিল্প, কারখানা, হাউস, শোরুম, ব্যাংক এটিএম বুথ এর নিরাপত্তা বাস্তবায়ন ও দেখাশোনা করার জন্য বেশ কিছু সংখ্যক সহকারী সুপারভাইজার গার্ড নিয়োগ করা হবে।"
  }
]