[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20392",
    "job_id": "20392",
    "company_name": "Dina Intelligence Private Ltd ",
    "job_title": "হাউজ সিকিউরিটি গার্ড",
    "location": "Dhaka",
    "salary": "TK. 14,500-16,500",
    "experience": "Fresher",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-11",
    "industry": "Security/Support Service",
    "vacancy": 20,
    "shift": "Other",
    "country": null,
    "company_address": "House-02, Block-E, Main Road, Eastern Housing, Rupnagar, Mirpur, Dhaka-1216",
    "job_description": "Responsibilities: Job Announcement: House Security Guard Urgent recruitment will be conducted for the position of House Security Guard in various areas of Dhaka. Interested candidates are requested to apply from nearby locations. Location: Dhaka Salary: 14,500 - 16,500 Taka Eligibility: Candidates from all districts can apply Benefits: Free accommodation Food arrangements (at own expense) Eid bonus Attendance bonus Location: Various areas within Dhaka Office Address: Mirpur, Section 11, Pallabi Second Part Uniform Conditions: A one-time payment of 2,500 Taka must be made for receiving the company's designated 2 sets of uniforms, which will be refundable upon leaving the job. Contact: Mobile: 01762910379 (Documents can be sent via WhatsApp)\n\nনিয়োগ বিজ্ঞপ্তি: হাউজ সিকিউরিটি গার্ড ঢাকার বিভিন্ন এলাকায় হাউজ সিকিউরিটি গার্ড পদে জরুরি ভিত্তিতে জনবল নিয়োগ দেওয়া হবে। আগ্রহী প্রার্থীদের নিকট থেকে আবেদন আহ্বান করা হচ্ছে। কর্মস্থল: ঢাকা বেতন: ১৪,৫০০ – ১৬,৫০০ টাকা আবেদনযোগ্যতা: সকল জেলার প্রার্থীরা আবেদন করতে পারবেন সুযোগ-সুবিধা: থাকা ফ্রি খাওয়ার সুব্যবস্থা (নিজ খরচে) ঈদ বোনাস হাজিরা বোনাস লোকেশন: ঢাকার ভিতরে বিভিন্ন এরিয়া অফিস ঠিকানা: মিরপুর সাড়ে ১১, পল্লবী দ্বিতীয় পর্ব ইউনিফর্ম সংক্রান্ত শর্তাবলী: কোম্পানির নির্ধারিত ২ সেট ইউনিফর্ম গ্রহণের জন্য এককালীন ২,৫০০ টাকা প্রদান করতে হবে, যা চাকরি ছেড়ে দিলে ফেরতযোগ্য। যোগাযোগ: মোবাইল: 01762910379 (হোয়াটসঅ্যাপে প্রয়োজনীয় কাগজপত্র পাঠানো যাবে)"
  }
]