[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20382",
    "job_id": "20382",
    "company_name": "Fixin Technical Training Institute",
    "job_title": "Video Editor",
    "location": "Savar",
    "salary": "TK. 20,000-30,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-18",
    "date_posted": "2026-02-10",
    "industry": "Graphics/Video Editor",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "4th floor-Soiyod Plaza, Bus stand, Savar, Dhaka-1340",
    "job_description": "Responsibilities: - Training, promotional, and institutional video editing and post-production completed.\n- Video optimized for various digital platforms including Facebook, YouTube, and TikTok.\n- Professional editing of short-form (Reels/Shorts) and long-form videos.\n- Video color correction, basic color grading, and enhancement of visual quality.\n- Ensuring audio synchronization, noise reduction, and sound clarity.\n- Incorporating simple motion graphics, title, subtitle, and lower-third design.\n- Working in coordination with the content team and instructor.\n- Ensuring regular video delivery according to specified deadlines.\n- Maintaining video file management, version control, and data backup.\n- Following the organization's branding guidelines and content standards.\n\nRequirements: - Strong visual sense and attention to detail\n- Good presentation and storytelling skills\n- Effective problem-solving and creative thinking ability\n- Ability to understand training content and translate it into engaging video format\n- Good communication skills and team coordination ability\n- Time management skills with the ability to meet deadlines\n- Willingness to receive feedback and revise content accordingly\n- Basic understanding of branding and digital content standards\n- Ability to work independently with minimal supervision\n- Positive attitude, professionalism, and responsibility toward work\n\nTraining, promotional ও institutional ভিডিওর editing ও post-production সম্পন্ন করা Facebook, YouTube, TikTok সহ বিভিন্ন digital platform এর জন্য ভিডিও optimized করা Short-form (Reels/Shorts) ও long-form ভিডিও professional ভাবে edit করা Video color correction, basic color grading ও visual quality উন্নত করা Audio synchronization, noise reduction ও sound clarity নিশ্চিত করা Simple motion graphics, title, subtitle ও lower-third design ও সংযোজন Content team ও instructor এর সাথে সমন্বয় করে কাজ করা নির্ধারিত deadline অনুযায়ী নিয়মিত ভিডিও ডেলিভারি নিশ্চিত করা Video file management, version control ও data backup বজায় রাখা প্রতিষ্ঠানের branding guideline ও content standard অনুসরণ করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20384",
    "job_id": "20384",
    "company_name": "NextWave Solutions",
    "job_title": "কাস্টমার কেয়ার এক্সিকিউটিভ (Female)",
    "location": "Mohammadpur",
    "salary": "TK. 10,000-15,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Mohammadpur,Dhaka",
    "job_description": "Responsibilities: Job Responsibilities: Confirm website orders Manage courier operations Communicate with new and existing customers to increase sales Explain product features and benefits to customers Work towards achieving sales targets Collect customer feedback and report it to management Build good relationships with customers and resolve any issues\n\nRequirements: Requirements: At least HSC / Bachelor's degree or equivalent. 1-2 years of work experience - customer care or e-commerce. Both freshers and experienced candidates can apply (experience will be preferred). Must have interest in customer handling and sales. Excellent communication skills and self-confidence are required. If experienced in online sales, special benefits will be provided. Ability to work in a team and under pressure is necessary. Must be capable of learning quickly. Benefits: Career growth and training opportunities. Friendly work environment. Additional benefits. NextWave Solutions Address: Mohammadpur, Dhaka Phone: 01911-055285 (WhatsApp)\n\nদায়িত্বসমূহ (Job Responsibilities): Website অর্ডার কনফার্ম করা Courier পরিচালনা করা নতুন ও পুরাতন গ্রাহকদের সাথে যোগাযোগ করা এবং বিক্রয় বৃদ্ধি করা। পণ্যের বৈশিষ্ট্য এবং উপকারিতা সম্পর্কে গ্রাহকদের বোঝানো। বিক্রয় লক্ষ্যমাত্রা (Sales Target) পূরণে কাজ করা। গ্রাহকদের ফিডব্যাক নেওয়া এবং তা ব্যবস্থাপনায় রিপোর্ট করা। কাস্টমারদের সাথে ভালো সম্পর্ক তৈরি করা এবং সমস্যার সমাধান করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20386",
    "job_id": "20386",
    "company_name": "Green Tiger Electric Vehicle Limited",
    "job_title": "Junior Sales Executive",
    "location": "Bangshal",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "104/2, Kazi Alauddin Road, Dhaka-1100, Bangladesh.",
    "job_description": "Responsibilities: Job Description\n\nJob Title: Junior Sales Executive\nLocation: Green Tiger Electric Vehicle Limited\nJob Type: Full-Time\n\nJob Summary:\nGreen Tiger Electric Vehicle Limited is seeking a motivated and detail-oriented Junior Sales Executive to support sales growth, manage customer relationships, handle customer service activities, and ensure smooth order processing and payment coordination.\n\nKey Responsibilities:\n- Identify and acquire new customers through field visits, phone calls, and online platforms.\n- Manage and follow up on online and offline leads to convert them into sales.\n- Present and demonstrate product features, pricing, and benefits to customers.\n- Maintain regular communication with existing customers and ensure repeat business.\n- Handle customer inquiries, complaints, and service issues professionally and promptly.\n- Process customer orders, prepare necessary documentation, and coordinate delivery schedules.\n- Collect payments, confirm transactions, prepare invoices, and submit payment details to the accounts department.\n- Maintain accurate records of customer information, sales activities, transactions, and complaints.\n- Coordinate with internal departments such as production, accounts, service, and logistics for smooth operations.\n- Monitor market trends, competitor activities, and customer feedback to support sales strategies.\n- Prepare and submit daily, weekly, and monthly sales and customer service reports.\n- Support promotional activities, campaigns, and product launches when required.\n- Assist in after-sales service follow-up to ensure customer satisfaction and retention.\n\nQualifications and Skills:\n- Bachelor’s degree in Business Administration, Marketing, or a related field (preferred).\n- Proficiency in MS Word and Excel is required.\n- Proficient typing skills in both Bengali and English are required.\n- Prior experience in sales or customer support is mandatory.\n- Strong communication, negotiation, and customer handling skills.\n- Ability to multitask and manage time effectively.\n- Familiarity with CRM software and digital tools will be an advantage.\n\nKey Attributes:\n- Strong sense of responsibility and professionalism.\n- Excellent customer service mindset with a positive attitude.\n- Ability to work under pressure and meet deadlines.\n- Proactive, self-motivated, and target-oriented.\n- Strong communication and interpersonal skills.\n- Good time management and multitasking ability.\n- Attention to detail and commitment to quality work.\n- Willingness to learn, adapt, and grow within the organization.\n\nSalary:\nNegotiable (Based on experience and qualifications)\n\nBenefits & Compensation:\n- Performance-based Incentives\n- Subsidized Lunch Facility\n- Monthly Mobile Bill Allowance\n- Two Eid Bonuses per year\n- Annual Salary Increment\n\nCareer Growth & Development:\n- Clear career progression path\n- Training and skill development opportunities\n- Performance-based promotions\n\nApply with CV at: recruitment@greentiger.com.bd\n\nJ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20388",
    "job_id": "20388",
    "company_name": "Talent Pro",
    "job_title": " Call Centre Agent",
    "location": "Banani",
    "salary": "TK. 15,000-20,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "109,Masjid Road Bannai Dohs",
    "job_description": "Responsibilities: The Call Centre Agent is responsible for handling inbound and outbound calls, responding to customer inquiries, providing product or service information, and ensuring customer satisfaction through effective communication and problem-solving. The role requires professionalism, patience, and efficiency in managing a high volume of interactions.\n\nKey Responsibilities:\n- Handle inbound and outbound calls in a professional and courteous manner.\n- Respond to customer inquiries, complaints, and requests promptly and accurately.\n- Provide detailed information about products, services, or company policies.\n- Maintain accurate records of customer interactions in the CRM system.\n- Follow communication scripts and standard operating procedures (SOPs).\n- Escalate complex issues to the supervisor or relevant department when necessary.\n- Meet or exceed daily, weekly, and monthly performance targets (e.g., call volume, response time, customer satisfaction).\n- Participate in training sessions to enhance product knowledge and communication skills.\n- Maintain confidentiality and handle sensitive information responsibly.\n- Contribute to a positive team environment and support colleagues as needed.\n\n109 Masjid Road, Old DOHS, Banani, Dhaka-1230\nEmployment Type: Full-time (9:00 am-6:00 pm)\n\nRequirements: - Bachelor's degree preferred.\n- Previous experience in a call center or customer service role is an advantage.\n- Excellent verbal communication and listening skills.\n- Fluency in [English/Bangla/other relevant languages].\n- Strong problem-solving and multitasking abilities.\n- Basic computer literacy (MS Office, CRM systems, email communication).\n- Ability to work under pressure and handle difficult customers calmly.\n- Willingness to work in shifts, including weekends or evenings, if required.\n- Customer focus and empathy.\n- Team collaboration.\n- Active listening.\n- Time management.\n- Attention to detail.\n- Positive attitude and adaptability.\n- Average handling time (AHT).\n- Customer satisfaction score (CSAT).\n- First call resolution (FCR).\n- Call quality score.\n- Attendance and punctuality.\n\nThe Call Centre Agent is responsible for handling inbound and outbound calls, responding to customer inquiries, providing product or service information, and ensuring customer satisfaction through effective communication and problem-solving. The role requires professionalism, patience, and efficiency in managing a high volume of interactions. Key Responsibilities: • Handle inbound and outbound calls in a professional and courteous manner. • Respond to customer inquiries, complaints, and requests promptly and accurately. • Provide detailed information about products, services, or company policies. • Maintain accurate records of customer interactions in the CRM system. • Follow communication scripts and standard operating procedures (SOPs). • Escalate complex issues to the supervisor or relevant department when necessary. • Meet or exceed daily, weekly, and monthl"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20387",
    "job_id": "20387",
    "company_name": "Sirajganj Dairy",
    "job_title": "সেলস এন্ড মার্কেটিং এক্সিকিউটিভ (ক্যাম্পেইন)",
    "location": "Dhaka",
    "salary": "TK. 16,000-21,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Sales/Marketing",
    "vacancy": 15,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: ```html Campaign Marketing: Company conducts direct marketing and branding activities at various important points in Dhaka city using campaign pickup vans. Product Promotion and Sales: Presenting products of Sirajganj Dairy (milk, ghee, mustard oil, etc.) attractively to customers and increasing sales. Customer Relationship Management: Creating new customers and maintaining long-term relationships with existing customers. Target Achievement: Effectively achieving daily and monthly sales targets. Market Survey: Regularly reviewing the market and collecting information about the prices and quality of competitors' products. Networking: Maintaining regular communication with distributors, wholesalers, and retailers and strengthening the supply chain. Promotional Activities: Actively participating in all promotional and marketing activities of the company. Salary Review: Half yearly Salary & Benefits: Salary: 9,000 BDT + Incentive (Monthly) Sales Incentive Policy: No incentive applicable for sales up to 60 liters daily. (Example: 60 liters x 0 BDT = 0 BDT) If daily sales exceed 60 liters, incentive will be provided at a rate of 4 BDT per liter above the total liters sold. For example: 61 liters sold → 61 x 4 = 244 BDT, 100 liters sold → 100 x 4 = 400 BDT. This will be calculated on a daily basis and considered as additional income to the salary. Increment: Special increments will be available based on sales performance and achieving specified sales targets. Other benefits: Festival bonus and other benefits as per company policy Earning 18,000 - 21,000+ BDT per month is possible by selling 80-100 liters on average. More sales = more income ```\n\nক্যাম্পেইন মার্কেটিং: কোম্পানির ক্যাম্পেইন পিকআপ ভ্যান ব্যবহার করে ঢাকা শহরের বিভিন্ন গুরুত্বপূর্ণ পয়েন্টে সরাসরি মার্কেটিং ও ব্র্যান্ডিং কার্যক্রম পরিচালনা করা। পণ্য প্রচার ও বিক্রয়: সিরাজগঞ্জ ডেইরি-এর পণ্যসমূহ (দুধ, ঘি, সরিষার তেল ইত্যাদি) গ্রাহকদের কাছে আকর্ষণীয়ভাবে উপস্থাপন করা এবং বিক্রয় বৃদ্ধি করা। গ্রাহক ব্যবস্থাপনা: নতুন গ্রাহক তৈরি করা এবং বিদ্যমান গ্রাহকদের সাথে দীর্ঘমেয়াদী সুসম্পর্ক বজায় রাখা। টার্গেট অর্জন: নির্ধারিত দৈনিক ও মাসিক সেলস টার্গেট অর্জনে কার্যকর ভূমিকা পালন করা। মার্কেট সার্ভে: নিয়মিত বাজার সমীক্ষা করা এবং প্রতিযোগী প্রতিষ্ঠানের পণ্যের মূল্য ও গুণগত মান সম্পর্কে তথ্য সংগ্রহ করা। নেটওয়ার্কিং: ডিস্ট্রিবিউটর, হোলসেলার ও রিটেইলারদের সাথে নিয়মিত যোগাযোগ রক্ষা করা এবং সাপ্লাই চেইন শক্তিশালী করা। প্রমোশনাল কার্যক্রম: কোম্পানির সকল প্রমোশনাল ও মার্কেটিং কার্যক্রমে সক্রিয়ভাবে অংশগ্রহণ করা। Salary Review: Half yearly Salary & Benefits (বেতন ও সুযোগ-সুবিধা): বেতন: ৯,০০০ টাকা + ইনসেনটিভ (মাসিক) Sales Incentive Policy (বিক্রয় বোনাস): দৈনিক ৬০ লিটার পর্যন্ত বিক্রয়ের জন্য কোনো ইনসেনটিভ প্রযোজ্য হবে না। (উদাহরণ: ৬০ লিটার × ০ টাকা = ০ টাকা) দৈনিক বিক্রয় ৬০ লিটারের বেশি হলে, বিক্রিত মোট লিটারের উপর প্রতি লিটার ৪ টাকা হারে ইনসেনটিভ প্রদান করা হবে। উদাহরণ: ৬১ লিটার বিক্রয় → ৬১ × ৪ = ২৪৪ টাকা, ১০০ লিটার বিক্রয় → ১০০ × ৪ = ৪০০ টাকা ইনসেনটিভ দৈনিক ভিত্তিতে হিসাব করা হবে এবং এটি বেতনের অতিরিক্"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=16790",
    "job_id": "16790",
    "company_name": "Navana Group",
    "job_title": "Security Guard",
    "location": "Anywhere in Dhaka Division",
    "salary": "TK. 11,000-12,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-21",
    "date_posted": "2026-02-10",
    "industry": "Security/Support Service",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 1. Ensure the security of the institution's building, assets, and personnel.\n2. Control designated entry and exit points.\n3. Monitor and maintain records of visitors and vehicles.\n4. Provide regular patrols and inform authorities of suspicious activities.\n5. Provide necessary assistance in emergency situations.\n6. Adhere to the institution's security policies and guidelines appropriately.\n\nRequirements: 1. Minimum pass in eighth/tenth grade (according to the institution's policy).\n2. Priority will be given to those with previous experience in security work.\n3. Must be physically fit and capable of fulfilling responsibilities.\n4. Must have integrity, discipline, and a responsible attitude.\n5. Must be capable of behaving politely and professionally with visitors and colleagues.\n6. Must have the mentality to work in shift duties.\n7. Must be capable of making quick decisions in emergency situations and informing the authorities.\n\n১। প্রতিষ্ঠানের ভবন, সম্পদ ও ব্যক্তিবর্গের নিরাপত্তা নিশ্চিত করা। ২। নির্ধারিত প্রবেশ ও বহির্গমন নিয়ন্ত্রণ করা। ৩। ভিজিটর ও যানবাহন তদারকি এবং রেজিস্টার সংরক্ষণ করা। ৪। নিয়মিত টহল প্রদান করা এবং সন্দেহজনক কার্যক্রম কর্তৃপক্ষকে জানানো। ৫। জরুরি পরিস্থিতিতে প্রয়োজনীয় সহায়তা প্রদান করা। ৬। প্রতিষ্ঠানের নিরাপত্তা নীতিমালা ও নির্দেশনা যথাযথভাবে অনুসরণ করা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20305",
    "job_id": "20305",
    "company_name": "inDrive",
    "job_title": "Field Executive (Acquisitions)",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-10",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 🛠 Job Responsibilities • Register Car and Moto Drivers • Install driver app and complete KYC • Collect necessary documents • Complete registrations as per set targets • Explain inDrive to drivers in detail ⸻ ✅ Qualifications • Minimum SSC pass • Must know how to use a smartphone • Interested in communicating with people • Must have the mentality to work in the field • Prior experience in sales/field/telemarketing is a plus\n\n🛠 কাজের দায়িত্ব • Car ও Moto Driver রেজিস্ট্রেশন করা • ড্রাইভারদের অ্যাপ ইনস্টল ও KYC সম্পন্ন করানো • প্রয়োজনীয় ডকুমেন্ট সংগ্রহ • নির্ধারিত টার্গেট অনুযায়ী রেজিস্ট্রেশন সম্পন্ন করা • ড্রাইভারদের inDrive সম্পর্কে বিস্তারিত বুঝিয়ে বলা ⸻ ✅ যোগ্যতা • ন্যূনতম SSC পাস • স্মার্টফোন ব্যবহার জানতে হবে • মানুষের সাথে কথা বলতে আগ্রহী • ফিল্ডে কাজ করার মানসিকতা থাকতে হবে • সেলস/ফিল্ড/টেলিমার্কেটিং অভিজ্ঞতা থাকলে অগ্রাধিকার"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20391",
    "job_id": "20391",
    "company_name": "Shomvob Global",
    "job_title": "মালয়েশিয়াতে জেনারেল ইলেকট্রিশিয়ান (Electrician ) - সারাওয়াক এ কার ওয়ার্কশপ",
    "location": "Saudi Arabia",
    "salary": "TK. 75,000-80,000",
    "experience": "3-5 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-26",
    "date_posted": "2026-02-10",
    "industry": "Technician",
    "vacancy": 8,
    "shift": "Other",
    "country": "Saudi Arabia",
    "company_address": null,
    "job_description": "Responsibilities: Sarawak , Malaysia Brief Introduction Sarawak is a large and developed state located in the eastern region of Malaysia (on the island of Borneo). The automobile and workshop sector is rapidly growing here, leading to a high demand for skilled car mechanics and technicians. Additionally, Sarawak plays a significant role in Malaysia's agricultural sector. Malaysia is a safe and legal destination for foreign workers, offering regular wages, a good working environment, and reasonable living expenses for foreign workers. Due to the separate regional administration of Sarawak, Bangladeshi workers can legally work in Sarawak, Malaysia. Field : Car workshop and service center Position : Electrician Number of Positions : 8 Job Responsibilities: · Regular and major maintenance service of cars · Inspection of engine, gearbox, and transmission systems · Repair or replace undercarriage parts as necessary · Perform overhaul work on engines and transmissions · Identify and solve performance issues of cars · Ensure car performance by test driving at the end of the job Requirements: Age : 20-45 years Candidates must submit a video demonstrating their own work skills Passport must be valid for at least 1 year Benefits: Salary : RM 2,500 · Accommodation : Free · Food : At own expense · Work Location : Sarawak, Malaysia Delegate Interview: February, 2026\n\nসারাওয়াক , মালয়েশিয়া সম্পর্কে সংক্ষিপ্ত পরিচিতি সারাওয়াক মালয়েশিয়ার পূর্বাঞ্চলে (বোর্নিও দ্বীপে) অবস্থিত একটি বড় ও উন্নয়নশীল রাজ্য। এখানে অটোমোবাইল ও ওয়ার্কশপ সেক্টর দ্রুত বৃদ্ধি পাচ্ছে , ফলে দক্ষ গাড়ি মেকানিক ও টেকনিশিয়ানের চাহিদা বেশি। এছাড়াও মালয়েশিয়ার কৃষিখাতে সারাওয়াক এর ভূমিকা ব্যাপক। মালয়েশিয়া একটি নিরাপদ ও বৈধ বিদেশি কর্মসংস্থানের গন্তব্য , যেখানে নিয়মিত বেতন, ভালো কাজের পরিবেশ এবং বিদেশি কর্মীদের জন্য সহনীয় জীবনযাত্রার খরচ রয়েছে। সারাওয়াক এর আঞ্চলিক প্রশাসন আলাদা হওয়ায় বর্তমানে সারাওয়াক, মালয়েশিয়াতে বাংলাদেশিরা কাজ নিয়ে বৈধভাবে যেতে পারছে। খাত : কার ওয়ার্কশপ ও সার্ভিস সেন্টার পদঃ ইলেকট্রিশিয়ান (Electrician ) পদসংখ্যা : ৮ জন কাজের দায়িত্ব : ·         গাড়ির নিয়মিত ও বড় ধরনের মেইনটেন্যান্স সার্ভিস করা ·         ইঞ্জিন, গিয়ারবক্স ও ট্রান্সমিশন সিস্টেম পরীক্ষা করা ·         আন্ডারকারেজ পার্টস খুলে প্রয়োজন অনুযায়ী রিপেয়ার বা রিপ্লেস করা ·         ইঞ্জিন ও ট্রান্সমিশনের ওভারহল কাজ সম্পাদন করা ·         গাড়ির পারফরম্যান্স সমস্যা শনাক্ত ও সমাধান করা ·         কাজ শেষে টেস্ট ড্রাইভ করে গাড়ির পারফরম্যান্স নিশ্চিত করা আবশ্যকঃ বয়স : ২০–৪৫ বছর প্রার্থীকে অবশ্যই নিজ কাজের স্কিল দেখানো একটি ভিডিও জমা দিতে হবে পাসপোর্ট এর মেয়াদ নূন্যতম ১ বছর হতে হবে। সুবিধাসমূহঃ বেতন : RM 2,500 · থাকা : ফ্রি · খাবার : নিজ খরচে · কাজের স্থান : সারাওয়াক, মালয়েশিয়া ডেলিগেট ইন্টারভিউঃ ফেব্রুয়ারি, ২০২৬সাল"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20381",
    "job_id": "20381",
    "company_name": "R.F. Fashion ",
    "job_title": "শোরুম সিকিউরিটি সুপারভাইজার",
    "location": "Anywhere in Dhaka Division",
    "salary": "TK. 19,500-22,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Security/Support Service",
    "vacancy": 12,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: 🖊️Job Description: 1- Provide guidance to those working inside the warehouse. 2- Maintain inventory records. 3- Monitor CCTV and supervise security personnel. 🔜 Benefits: Free accommodation, provision of meals, one day off per week, three days off per month, two Eid bonuses. We will call selected candidates for verification. You can start working with just your joining letter if all documents are in order. Accommodation and meals are mandatory for the first month at the company mess. All candidates who are called must come prepared with a photocopy of their documents and 3000 taka for one month's food expenses for joining preparation. 🖊️ Selected candidates will be informed directly via SMS or WhatsApp. 🔜 Requirements for Joining: 1. Educational certificates, certificates, or mark sheets. 2. Photocopy of birth certificate or national ID card. 3. Two passport-sized photos. We do not take any financial transactions or take any money as a guarantee for a job in our company. 🔜 Interested candidates must be mentally prepared to work at any location mentioned: Uttara, Mirpur, Jatrabari, Gazipur, Dhaka. Salaries are paid between the 5th and 7th of each month. 🔜 Interview location: Gazipur Chowrasta, New Chakbazar area. Contact directly and send CV on WhatsApp: 01340 846801\n\nRequirements: Qualification: JSC/SSC. Duty: 10 hours. Salary: 19,500/22,000 taka. Age: 18 to 50 years old.\n\nNo experience required. Teaching is our responsibility.\n\nCandidates who are called must come with necessary documents, a set of clothes, and 3,000 taka for food expenses for one month for joining preparation.\n\nSelected candidates will be informed directly via SMS or WhatsApp.\n\nContact directly and send CV on WhatsApp: 01348 46801.\n\n🖊️কাজের বিবরনঃ ১- শোরমের ভিতরে যারা কাজ করে তাদের দিকনির্দেশনা দেওয়া। ২-মালামালের হিসাব রাখা। ৩- সিসিটিভি মনিটরিং করা এবং নিরাপত্তা কর্মীদের  পরিচালনা করা। ‎ 🔜 সুবিধাঃ থাকা ফ্রি,খাবারের সুব্যবস্থা রয়েছে, সাপ্তাহিক ছুটি একদিন,মাসিক ছুটি তিন দিন, দুই  ঈদ বোনাস। আমরা যাচাই-বাছাই করে লোক ডাকবো। কাগজ পত্র ঠিক থাকলে আসা মাত্র জয়েন দিয়ে কাজ শুরু করতে পারবেন থাকা-খাওয়া কোম্পানির মেসে প্রথম মাস  বাধ্যতামূলক। যে সকল প্রার্থীকে ডাকা হবে কাগজপত্র জামাকাপড় এবং এক মাসের ৩ হাজার টাকা খাবার খরচ নিয়ে একবারে চলে আসবেন জয়নিং এর প্রিপারেশন নিয়ে। ‎🖊️ বাছাইকৃত প্রার্থীদের কে সরাসরি  নাম্বারে এসএমএস দিয়ে জানিয়ে দেওয়া হবে অথবা হোয়াটসঅ্যাপে এসএমএস দেওয়া হবে। ‎ ‎🔜 জয়েন্টের জন্য যা যা লাগবেঃ ‎১. শিক্ষাগত যোগ্যতার সনদপত্র।সার্টিফিকেট অথবা মার্কশিট। ‎২.জন্ম নিবন্ধন  অথবা ন্যাশনাল আইডি কার্ডের ফটোকপি। ‎৩.দুই কপি পাসপোর্ট সাইজের ছবি। ‎ ‎আমাদের কোম্পানিতে জবের জন্য আমরা কোনো আর্থিক লেনদেন করিনা জামানত বাবদ কোনো টাকা নেওয়া হয়না। ‎ ‎🔜আগ্রহী প্রার্থীগণ উল্লেখিত স্থানে যে কোনো জায়গায় কাজ করার মন মানসিকতা থাকতে হবেঃ উত্তরা, মিরপুর, যাত্রাবাড়ী , গাজীপুর ঢাকা। ‎ ‎প্রতি মাসের ০৫থেকে ৭তারিখের মাঝে বেতন প্রদান করা হয়। ‎🔜 ইন্টারভিউ এর ঠিকানা গাজীপুর চৌরাস্তা নিউ চকবাজার সংলগ্ন। সরাসরি যোগাযোগ করুন ও হোয়াটসএপে সিভি পাঠানঃ 01340-846801 ‎"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20383",
    "job_id": "20383",
    "company_name": "TickMart",
    "job_title": "কল সেন্টার এজেন্ট",
    "location": "Banasree, Rampura",
    "salary": "TK. 8,000-10,000",
    "experience": "No Experience Required",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-03-10",
    "date_posted": "2026-02-10",
    "industry": "Call Center",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Communicate with customers via phone calls and Facebook messages to sell products. After confirming the sale, enter customer's name, address, and product details into the system. Provide answers to customer queries and assist in resolving their issues. Assist in order processing and tracking. Adhere to company policies and procedures.\n\nRequirements: Proficiency in computer and internet usage. Excellent communication skills in Bengali. Ability to speak clearly and concisely. Active listening skills. Patient and adaptable personality. Experience in call centers, tele-sales, or e-commerce is preferred. Benefits: Attractive salary (8,000 - 10,000 taka). 6 days a week, work hours from 9 am to 8 pm. Performance bonus and incentives. Bi-annual festival bonus. Annual salary increment. Snacks, tea, and coffee. Training and support from experienced colleagues. We are awaiting your application!\n\nফোন কল এবং ফেসবুক মেসেজের মাধ্যমে গ্রাহকদের সাথে যোগাযোগ করে পণ্য বিক্রি করা। বিক্রয় নিশ্চিত করার পরে গ্রাহকের নাম, ঠিকানা এবং পণ্যের বিবরণ সহ ডেটা এন্ট্রি করা। গ্রাহকদের প্রশ্নের উত্তর দেওয়া এবং তাদের সমস্যা সমাধানে সহায়তা করা। অর্ডার প্রক্রিয়াকরণ এবং ট্র্যাকিংয়ে সহায়তা করা। কোম্পানির নীতিমালা এবং প্রক্রিয়া মেনে চলা।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20390",
    "job_id": "20390",
    "company_name": "Kazi Bazar",
    "job_title": "Call Center Executive",
    "location": "Mirpur",
    "salary": "TK. 12,000-15,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "",
    "deadline": "2026-02-28",
    "date_posted": "2026-02-10",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Organization Name: Kazi Bazar Salary Payment Policy: Regular salary is paid on the 1st of every month by the company. Facebook Page: https://www.facebook.com/kazibazar24 Experienced, responsible, and communicative candidates are invited to apply for the Call Center team at Kazi Bazar. Job Description Job Title: Call Center Executive Job Type: Full-time Duty Time: 10:00 AM to 8:00 PM Responsibilities Receive incoming calls from customers and provide necessary information Handle order taking, processing, and regular follow-ups Contact interested customers for order confirmation Maintain respectful, courteous, and professional behavior with customers Handle other customer support-related responsibilities as needed Qualifications Minimum HSC or equivalent pass Proficiency in speaking Bengali language Proficient in using computers and smartphones Minimum 6 months to 1 year of experience in call center/customer service/tele sales is required Salary and Benefits Salary: 12,000 - 15,000 BDT (based on experience) Performance bonus Friendly and professional work environment Workplace Near Diamond World (Meriment Community Center Road), Mirpur-11, Dhaka. Application and Contact Interested candidates can apply through the Shomvob App . Candidates willing to give an immediate interview can contact for detailed information and job role ( Call Center Executive ) mentioning on WhatsApp . Please refrain from direct calls. WhatsApp / Contact Number: 01921100700\n\nপ্রতিষ্ঠানের নাম: কাজী বাজার (Kazi Bazar) বেতন প্রদান নীতি: কোম্পানির পক্ষ থেকে প্রতি মাসের ১ তারিখে নিয়মিত বেতন পরিশোধ করা হয়। Facebook Page: https://www.facebook.com/kazibazar24 কাজী বাজার-এর কল সেন্টার টিমে যোগ দিতে অভিজ্ঞ, দায়িত্বশীল ও যোগাযোগ দক্ষ প্রার্থীদের নিকট থেকে আবেদন আহ্বান করা যাচ্ছে। পদের বিবরণ পদের নাম: Call Center Executive চাকরির ধরন: ফুল-টাইম ডিউটি টাইম: সকাল ১০:০০ টা থেকে রাত ৮:০০ টা দায়িত্বসমূহ গ্রাহকের ইনকামিং কল রিসিভ করা এবং প্রয়োজনীয় তথ্য প্রদান অর্ডার গ্রহণ, প্রসেসিং ও নিয়মিত ফলো-আপ করা আগ্রহী গ্রাহকদের নিকট অর্ডার কনফার্মেশন নিশ্চিত করার জন্য যোগাযোগ করা গ্রাহকের সঙ্গে ভদ্র, সৌজন্যপূর্ণ ও পেশাদার আচরণ বজায় রাখা প্রয়োজনে গ্রাহক সাপোর্ট সংক্রান্ত অন্যান্য দায়িত্ব পালন যোগ্যতা ন্যূনতম এইচএসসি বা সমমান পাস বাংলা ভাষায় সাবলীলভাবে কথা বলার দক্ষতা কম্পিউটার ও স্মার্টফোন ব্যবহারে অভ্যস্ত কল সেন্টার / কাস্টমার সার্ভিস / টেলি সেলস–এ ন্যূনতম ৬ মাস থেকে ১ বছরের অভিজ্ঞতা আবশ্যক বেতন ও সুযোগ-সুবিধা বেতন: ১২,০০০ – ১৫,০০০ টাকা (অভিজ্ঞতার ভিত্তিতে) পারফরম্যান্স বোনাস বন্ধুত্বপূর্ণ ও পেশাদার কর্মপরিবেশ কর্মস্থল ডায়মন্ড ওয়ার্ল্ডের পাশের গলি (মেরিমেন্ট কমিউনিটি সেন্টারের গলি), মিরপুর–১১, ঢাকা। আবেদন ও যোগাযোগ আগ্রহী প্রার্থীরা Shomvob App-এর মাধ্যমে আবেদন করতে পারবেন। যারা ইমিডিয়েট ইন্টারভিউ দিতে আগ্রহী , তারা WhatsApp- এ বিস্তারিত তথ্য এবং জব রোল (Call Center Executive ) উল্লেখ করে যোগাযোগ করতে পারেন। সরাসরি কল না করার জন্য অনুরোধ করা হলো। WhatsApp / যোগাযোগ নম্বর: 01921100700"
  }
]